{
  "info": {
    "authors": [
      "Tomoyoshi Matsukawa"
    ],
    "book": "Human Language Technology Conference",
    "id": "acl-H93-1049",
    "title": "Hypothesizing Word Association from Untagged Text",
    "url": "https://aclweb.org/anthology/H93-1049",
    "year": 1993
  },
  "references": [
    "acl-H91-1037",
    "acl-H93-1045",
    "acl-J90-1003",
    "acl-J92-4003",
    "acl-P90-1032",
    "acl-P90-1034",
    "acl-P91-1027",
    "acl-P92-1053",
    "acl-W91-0219"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "This paper reports a new method for suggesting word associations, based on a greedy algorithm that employs Chi-square statistics on joint frequencies of pairs of word groups compared against chance co-occurrence.",
        "The benefits of this new approach are: 1) we can consider even low frequency words and word pairs, and 2) word groups and word associations can be automatically generated.",
        "The method provided 87% accuracy in hypothesizing word associations for unobserved combinations of words in Japanese text."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "Using mutual information for measuring word association has become popular since [Church and Hanks, 1990] defined word association ratio as mutual information between two words.",
        "Word association ratios are a promising tool for lexicography, but there seem to be at least two limitations to the method: 1) much data with low frequency words or word pairs cannot be used and 2) generalization of word usage still depends totally on lexicographers.",
        "In this paper, we propose an alternative (or extended) method for suggesting word associations using Chi-square statistics, which can be viewed as an approximation to mutual information.",
        "Rather than considering significance of joint frequencies of word pairs as [Church and Hanks, 1990] did, our algorithm uses joint frequencies of pairs of word groups instead.",
        "The algorithm employs a hill-climbing search for a pair of word groups that occur significantly frequently.",
        "The benefits of this new approach are: 1) that we can consider even low frequency words and word pairs, and 2) that word groups or word associations can be automatically generated, namely automatic hypothesis of word associations, which can later be reviewed by a lexicographer.",
        "3) word associations can be used in parsing and understanding natural language, as well as in natural language generation [Smadja and McKeown, 1990].",
        "Our method proved to be 87% accurate in hypothesizing word associations for unobserved combinations of words in Japanese text, where accuracy was tested by human verification of a random sample of hypothesized word pairs.",
        "We extracted 14,407 observations of word co-occurrences, involving 3,195 nouns and 4,365 verb/argument pairs.",
        "Out of this we hypothesized 7,050 word associations.",
        "The corpus size was 280,000 words.",
        "We would like to apply the same approach to English."
      ]
    },
    {
      "heading": "2. RELATED WORK",
      "text": [
        "Some previous work (e.g., [Weischedel, et al., 1990]) found verb-argument associations from bracketed text, such as that in TREEBANK; however, this paper, and related work has hypothesized word associations from untagged text.",
        "[Hindle 1990] confirmed that word association ratios can be used for measuring similarity between nouns.",
        "For example, \"ship\", \"plane\", \"bus\", etc., were automatically ranked as similar to \"boat\".",
        "[Resnik 1992] reported a word association ratio for identifying noun classes from a preexisting hierarchy as selectional constraints on the object of a verb.",
        "[Brown et.al.",
        "1992] proves that, under the assumption of a bi-gram class model, the perplexity of a corpus is minimized when the average mutual information between word classes is maximized.",
        "Based on that fact, they cluster words via a greedy search algorithm which finds a local maximum in average mutual information.",
        "Our algorithm considers joint frequencies of pairs of word groups (as [Brown et.",
        "al.",
        "1992] does) in contrast to joint frequencies of word pairs as in [Church and Hanks, 1990] and [Hindle 1990].",
        "Here a word group means any subset of the whole set of words.",
        "For example, \"ship,\" \"plane,\" \"boat\" and \"car\" may be a word group.",
        "The algorithm will find pairs of such word groups.",
        "Another similarity to [Brown et.",
        "al.",
        "1992]'s clustering algorithm is the use of greedy search for a pair of word groups that occur significantly frequently, using an evaluation function based on mutual information between classes.",
        "On the other hand, unlike [Brown et.",
        "al.",
        "1992], we assume some automatic syntactic analysis of the corpus, namely part-of-speech analysis and at least finite-state approximations to syntactic dependencies.",
        "Moreover, the clustering is done depth first, not breadth first as [Brown et.",
        "al.",
        "1992], i.e., clusters are hypothesized one by one, not parallel."
      ]
    },
    {
      "heading": "3. OVERVIEW OF THE METHOD",
      "text": [
        "The method consists of three phases:",
        "1) Automatic part of speech tagging of text.",
        "First, texts are labeled by our probabilistic part of speech tagger (POST) which has been extended for Japanese morphological processing [Matsukawa et.",
        "al.",
        "1993].",
        "This is fully automatic; human review is not necessary under the assumption that the tagger has previously been trained on appropriate text [Meteer et.",
        "al.",
        "1991]1 2) Finite state pattern matching.",
        "Second, a finite-state pattern matcher with patterns representing possible grammatical relations, such as verb/argument pairs, nominal compounds, etc.",
        "is run over the sample text to suggest word pairs which will be considered candidates for word associations.",
        "As a result, we get a word co-occurrence matrix.",
        "Again, no human review of the pattern matching is assumed.",
        "3) Filtering/Generalization of word associations via Chi-square.",
        "Third,",
        "given the word co-occurrence matrix, the program starts from an initial pair of word groups (or a submatrix in the matrix), incrementally adding into the submatrix a word which locally gives the highest Chi-square score to the submatrix.",
        "Finally, words are removed which give a higher Chi-square score by their removal.",
        "By adding and removing words until reaching an appropriate significance level, we get a submatrix as a hypothesis of word associations between the cluster of words represented as rows in the submatrix and the cluster of words represented as columns in the submatrix.",
        "in Since in Japanese word separators such as spaces are not present, words must be segmented before we assign part of speech to words.",
        "To do this, we use JUMAN from Kyoto University to segment Japanese text into words, AMED, an example-based segmentation corrector, and a Hidden Markov Model (POST) [Matsukawa, et.",
        "al.",
        "1993].",
        "For example, POST processes an input text such as the following: –A, :Mi*IlitAJR4-7A0)A1,4RSAII., itloWS*Ma)±agli$M4-70)ANIt–it LNIA1-6,1L-C,B*-Co-zx37-13–FL0DR IVAAEZ.",
        "and produces tagged text such as: 2",
        "A 3' --/CN fJ – 1./CN /PT 0)/NCM RAleicN /CM ill-, \"CNB NSUF /KT"
      ]
    },
    {
      "heading": "5. FINITE STATE PATTERN MATCHING",
      "text": [
        "We use the following finite state patterns for extracting possible Japanese verb/argument word co-occurrences from automatically segmented and tagged Japanese text.",
        "Completely different patterns would be used for English.",
        "{1C1;41} {cmi (vB) PT I ‘SN1 SN where CN = common noun"
      ]
    },
    {
      "heading": "4 WORD SEGMENTATION AND PART OF SPEECH LABELING",
      "text": [
        "1 In our experience thus far in three domains and in both Japanese and English, while retraining POST on domain-specific data would reduce the error rate, the effect on overall performance of the system in data extraction from text has been small enough to make retraining unnecessary.",
        "The effect of domain-specific lexical entries (e.g., DRAM is a noun in microelectronics) often mitigates the need to retrain.",
        "Here, the first part (CN, PN or SN) represents a noun.",
        "Since in Japanese the head noun of a noun phrase is always at the right end of the phrase, this part should always match a head noun.",
        "The second part (CM or PT) represents a postposition which identifies an argument of a verb.",
        "The final pattern element (VB or SN) represents a verb.",
        "Sa-inflection nouns (SN) are nominalized verbs which form a verb phrase with the morpheme \"suru.\"",
        "2 CONJ = conjunction; TI' = Japanese comma; CN = common noun; TM = Topic marker; PN - proper noun; etc.",
        "Since argument structure in Japanese is marked by postpositions, i.e., case markers (i.e., \"o,\" \"ga\") and particles (e.g., \"ni,\" \"kara,\" .",
        ".",
        ".",
        "), word combinations matched with the patterns will represent associations between a noun filling a particular argument type (e.g., \"o\") and a verb.",
        "Note that topic markers (TM; i.e., \"wa\") and toritate markers (TTM; e.g.\"mo\", \"sae\", ...) are not included in the pattern since these do not uniquely identify the case of the argument.",
        "Just as in English, the arguments of a verb in Japanese may be quite distant from the verb; adverbial phrases and scrambling are two cases that may separate a verb from its argument(s).",
        "We approximate this in a finite state machine by allowing words to be skipped.",
        "In our experiment, up to four words could be skipped.",
        "As shown in Figure 1, matching an argument structure varies from distance 0 to 4.",
        "By limiting the algorithm to a maximum of four word gaps, and by not considering the ambiguous cases of topic markers and taritate markers, we have chosen to limit the cases considered in favor of high accuracy in automatically hypothesizing word associations.",
        "[Brent, 1991] similarly limited what his algorithm could learn in favor of high accuracy."
      ]
    },
    {
      "heading": "6. FILTERING AND GENERALIZATION VIA CHI-SQUARE",
      "text": [
        "Word combinations found via the finite state patterns include a noun, postposition, and a verb.",
        "A two dimensional matrix (a word co-occurrence matrix) is formed, where the columns are nouns, and the rows are pairs of a verb plus postposition.",
        "The cells of the matrix are the frequency of the noun (column element) co-occurring in the given case with that verb (row element).",
        "Starting from a submatrix, the algorithm successively adds to the submatrix the word with the largest Chi-square score among all words outside the submatrix.",
        "Words are added until a local maximum is reached.",
        "Finally, the appropriateness of the submatrix as a hypothesis of word associations is checked with heuristic criteria based on the sizes of the row and the column of the submatrix.",
        "Currently, we use the following criteria for appropriateness of a submatrix:",
        "For any submatrix found, the co-occurrence observations for the clustered words are removed from the word co-occurrence matrix and treated as a single column of clustered nouns and a single row of clustered verb plus case pairs.",
        "Currently, we use the following values for the parameters: C1=2, C2=10, and C3=10.",
        "Table 1. shows an example of clustering starting from the initial submatrix shown in Figure 2.",
        "The words in Figure 2 were manually selected as words meaning \"organization.\" In Table 1, the first (leftmost) column indicates the word which was added to the submatrix at each step.",
        "The second column gives an English gloss of the word.",
        "The third column reports f(x,Y), the frequency of the co-occurrences between the word and the words that co-occur with it.",
        "For example, the first line of the table shows that the word (establish/-acc) co-occurred with the \"organization\" words 26 times.",
        "The rightmost column specifies I(X,Y), the scaled mutual information between the rows and columns of the submatrix.",
        "As the clustering proceeds, I(X,Y) gets larger.",
        "A tt(company), *41(head quarter), VIRI(organization), sirg ( co o rp oration),tt(both companies), *V.(school), th(the company), 7 II( chi 1 d company), ifiti(bank), WV TN (department store), oft lg(agency), V,' (co o p. ), 4± (business company), tli:1 (city bank), .1-N(stand), ta fr (trust bank), t) (branch), (credit association), *TN(head store), k*(university), -4±(each company), 1' (department store), ,Rtg(agriculture cooperative), – (maker), a(book store), 7 1/ t:IR (TV station), 7 1:7 3\"7 '3/ 5 ;/(agency), A – --(supermarket), a AA Ii(joint-stock corporation), R(doctor's office), )u (all stores)"
      ]
    },
    {
      "heading": "7. EVALUATION",
      "text": [
        "Using 280,000 words of Japanese source text from the TIPSTER joint ventures domain, we tried several variations of the initial submatrices (word groups) from which the search in step three of the method starts: a) complete bipartite subgraphs, b) pre-classified noun groups and c) significantly frequent word pairs.",
        "Based on the results of the experiments, we concluded that alternative (b) gives both the most accurate word associations and the highest coverage of word associations.",
        "This technique is practical because classification of nouns is generally much simpler than that of verbs.",
        "We don't propose any automatic algorithm to accomplish noun classification, but instead note that we were able to manually classify nouns in less than ten categories at about 500 words/hour.",
        "That productivity was achieved using our new tool for manual word classification, which is partially inspired by EDR's way of classifying their semantic lexical data [Matsukawa and Yokota, 1991].",
        "Based on a corpus of 280,000 words in the TIPSTER joint ventures domain, the most frequently occurring Japanese nouns, proper nouns, and verbs were automatically identified.",
        "Then, a student classified the frequently occurring nouns into one of the twelve categories in (1) below, and each frequently occurring proper noun into one of the four categories in (2) below, using a menu-based tool, we were able to categorize 3,195 lexical entries in 12 person-hours.",
        "These categories were then used as input to the word co-occurrence algorithm.",
        "Using the 280,000 word joint venture corpus, we collected 14,407 word co-occurrences, involving 3,195 nouns and 4,365 verb/argument pairs, by the finite state pattern given in Section 5.",
        "16 submatrices were clustered, grouping 810 observed word co-occurrences and 6,240 unobserved (or hypothesized) word co-occurrences.",
        "We evaluated the accuracy of the system by manual review of a random sample of 500 hypothesized word co-occurrences.",
        "Of these, 435, or 87% were judged reasonable.",
        "This ratio is fine compared with a random sample of 500 arbitrary word co-occurrences between the 3,195 nouns and the 4,365 verb/argument pairs, of which only 153 (44%) were judged reasonable.",
        "Table 2 below shows some examples judged reasonable; questionable examples are marked by \"?\"; unreasonable hypotheses are marked with an asterisk.",
        "With a small corpus (280,000 words) such as ours, considering small frequency co-occurrences is critical.",
        "Looking at Table 3 below, if we had to ignore co-occurrences with frequency less than five (as [Church and Hanks 1990] did), there would be very little data.",
        "With our method, as long as the frequency of co-occurrence of the word being considered with the set is greater than two, the statistic is stable."
      ]
    },
    {
      "heading": "8. CONCLUSION",
      "text": [
        "Our method achieved fully automatic hypothesis of word associations, starting from untagged text and generalizing to unobserved word associations.",
        "As a result of human review 87% of the hypotheses were judged to be reasonable.",
        "Because the technique considers low frequency cases, most of the data was used in making generalizations.",
        "It remains to be determined how well this method will work for English, but with appropriate finite state patterns, similar results may be achieved."
      ]
    },
    {
      "heading": "ACKNOWLEDGMENTS",
      "text": [
        "The author wishes to thank Madeleine Bates, Ralph Weischedel and Sean Boisen for significant contributions to this paper."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    },
    {
      "heading": "APPENDIX: JUSTIFICATION OF CHI SQUARE",
      "text": [
        "where X Y= columns and rows of a word co-occurrence matrix X, Y = subsets of X Y, respectively (i.e. word classes at the columns and the rows) This can be justified as follows.",
        "According to [Hoel 19711, the likelihood ratio LAMBDA for a test of the hypothesis: p(i) = po(i) (i = 1, 2, .",
        ".",
        "k), where p(i) is the probability of case i and po(i) is a hypothesized probability of it, when observations are independent of each other, is given as:",
        "where n(i) is the number of observations of case i, and e(i) is its expectation, i.e., e(i) = n p(i), where n is the total number of observations.",
        "The distribution is chi-square when n is large.",
        "If we assume two word classes, ci and cj, occur independently, then the expected value of the probability of their co-occurrence will be, e(ci, ci) = n p(ci) p(cj) (2) where p(ci) and p(cj) are estimations of the probability of occurrence of ci and cj.",
        "The maximum likelihood estimate of p(ci) and p(cj) is f(ci)/n and f(cj)/n, where f(cj) and f(cj) are the number of observations of words classified in ci and cj.",
        "The maximum likelihood estimate of p(ci, cj), the probability of the co-occurrences of words in ci and cj, is f(ci, cj)/n, where f(ci, cj) is the number of observations of the co-occurrences.",
        "Then the number of the co-occurrences n(ci, cj) (which is the same as f(ci, cj) ) can be represented as, n(ci, ci) = n ci) (3) Therefore, given k classes, c 1 , c2, ck, substituting (2) and (3) into (1).",
        "If n is large, this will have a chi-square distribution; therefore, we can estimate how unlikely our assumption of independence among word classes is.",
        "Since formula (4) gives a scaled average mutual information among the word classes, searching for a partition of words that provides maximum average mutual information among word classes is equivalent to seeking classes where independence among word classes is minimally likely.",
        "The algorithm reported in this paper searches for pairs of word classes which provide a local maximum I(X, Y), a term in the summation of formula (0).",
        "p(ci)"
      ]
    }
  ]
}
