{
  "info": {
    "authors": [
      "Herbert H. Clark"
    ],
    "book": "Theoretical Issues in Natural Language Processing",
    "id": "acl-T75-2034",
    "title": "Bridging",
    "url": "https://aclweb.org/anthology/T75-2034",
    "year": 1975
  },
  "references": [],
  "sections": [
    {
      "text": [
        "BRIDGING Herbert H. Clark Stanford University Nixon, not long before he was deposed, was quoted as saying at a news conference, \"I am not a crook.\" We all saw immediately that Nixon shouldn't have said what he said.",
        "He wanted to assure everyone that he was an honest man, but the wording he used was to deny that he was a crook.",
        "Why should he deny that?",
        "He must have believed that his audience was entertaining the possibility that he was a crook, and he was trying to disabuse them of this belief.",
        "But in so doing, he was tacitly acknowledging that people were entertaining this possibility, and this was something he had never acknowledged before in public.",
        "Here, then, was a public admission that he was in trouble, and this signaled a change in his public posture.",
        "My inferences about Nixon's utterance stopped about there, but I am sure that the knowledgeable White House press corps went on drawing further inferences.",
        "' In any event we all took this utterance a long way.",
        "This is an example Dar excellence of a basic problem for theories of understanding natural language: How do listeners draw inferences from what they hear, what direction do they take their inferences, and when do they stop?",
        "In this particular example, at least most listeners began, tacitly, 'drawing the same line of inferences, but at a certain point, the lines diverged and went on to many different stopping points.",
        "But is this description general?",
        "Could listeners go on drawing inferences AA infinitum?",
        "And ultimately, is drawing inferences as a part of comprehension a describable process, one with specifiable constraints?",
        "In this brief paper I would like to discuss a certain class of inferences in comprehension that may provide some general lessons about the problem of drawing inferences.",
        "The inferences I will discuss are ones the speaker intends the listener to draw as an integral part of the message, and so they are a rather special type.",
        "Following Grice's (1967) terminology, I will refer to them as implicatures, since they have all the characteristics of other implicatures.",
        "I will draw three lessons about these implicatures.",
        "One: Implicatures of this kind originate in an implicit contract, of quite a specific sort, that the speaker and listener have agreed upon about the way they are to converse with each other.",
        "Two: These implicatures, though conveyed by language and a necessary part of the intended message, draw on one s knowledge of natural objects and events that goes beyond one's knowledge of language itself.",
        "Three: These implicatures are not indeterminate in length, but have a well-defined stopping rule."
      ]
    },
    {
      "heading": "Given-New Contraot",
      "text": [
        "The implicatures I am concerned with are a consequence of a speaker-listener agreement Susan Haviland and I have called the Given-New Contract (Clark and Haviland, 1974, in press; Haviland and Clark, 1974).",
        "English assertions draw a distinction between two kinds of information they convey, a distinction carried by the syntax and intonation alone.",
        "The first kind of information has been called Given information, since it is conventionally required to convey information the listener already knows; and the second kind has been called New information, since it is conventionally required to convey information that the listener doesn't yet know but that the speaker would like to get across.",
        "The point is, the Given-New distinction is a syntactic one, identifiable for sentences in isolation, and yet it serves a pragmatic function, that of conveying two types of information as far as the listener is concerned.",
        "For this distinction to be useful as a communcative device, therefore, the speaker and listener must agree to use it in the conventional way.",
        "The speaker must agree to try to construct his utterances so that the Given information contains information he believes the listener already knows and so that the New information contains information he believes the listener doesn't yet know.",
        "The listener, for his part, agrees to interpret each utterance on the assumption that the speaker is trying to do this.",
        "Consider the sentence It was Mary who left.",
        "Syntactically, it is Given that someone left, that is, X left, and it is New that that someone was Mary, that is, X = Marv.",
        "To deal with this sentence, the listener is assumed to use the following strategy.",
        "(1) He identifies the Given and the New.",
        "(2) He realizes he is expected to know already about a unique event of someone leaving, and so he searches back in memory for just such an event.",
        "When he finds it, say Ell left (\"some entity labeled E31 left\"), he calls this the Antecedent.",
        "(3) Since the listener assumes that X left was meant to refer to the Antecedent Eal left, he then replaces X in X = Mary by Ell to form the new proposition 01 = Marv.",
        "This he places in memory as what the speaker meant to assert in his utterance.",
        "In the simplest case, the strategy just given will work without problems.",
        "Consider sequence 1: 1.",
        "John saw someone leave the party early.",
        "It was Mary who left.",
        "To simplify things, imagine that the listener hearing the second sentence has in episodic memory only the information conveyed by the first.",
        "In applying his strategy to the second sentence, the listener will search for an Antecedent for X left, find an event of someone leaving in memory from the first sentence, and then integrate the New information into memory as he should.",
        "In the more typical case, however, the istener will fail at Step 2 of the strategy -- he won't find such an Antecedent directly in memory.",
        "When this happens, he is forced",
        "construct an Antecedent, by a series of nferences, from something he already knows.",
        ")nsider sequence 2: 2.",
        "In the group there was one person Lssing.",
        "It was Mary who left.",
        "In this ?quence the first sentence doesn't mention lyone's leaving, so there is no direct ltecedent for the Given information X left the second sentence.",
        "The listener must ierefore bridge the gap from what he knows the intended Antecedent.",
        "He might note let it would follow that one person in the •oup would be missing if that person had ?ft.",
        "It must be that the speaker was ?ferring to that person by the Given (formation X left and that the listener was apposed to figure this out by drawing this Iference.",
        "In short, the listener assumes le speaker meant to convey two things: (1) le implicature The one person was missing ?cause that person, left, and (2) the latter Lause contains the intended Antecedent of le Given information in the second sentence left.",
        "In its most general form, then, the Lven-New Contract goes something like this: Given-New Contract: The speaker agrees to try to construct the Given and New information of each utterance in context (a) so that the listener is able to compute from memory the unique Antecedent that was intended for the Given information, and (b).",
        "so that he will not already have the New information attached to the Antecedent.",
        "le listener in turn knows, then, that the beaker expects him to have the knowledge ld mental wherewithal to compute the ntended Antecedent in that context, and so Dr him it becomes a matter of solving a -'oblem.",
        "What bridge can he construct (1) '1st the speaker could plausibly have xpected him to be able to construct and (2) nat the speaker could plausibly have ntended?",
        "The first part makes the listener ssess principally what facts he knows and he second what implicatures he could Lausibly draw.",
        "Bridging -- the construction of these nplicatures -- is an obligatory part of the rocess of comprehension.",
        "The listener skes it as a necessary part of nderstanding an utterance in context that e be able to identify the intended eferents (in memory) for all referring xpressions.",
        "All referring expressions are iven information, and so the listener feels t necessary to succeed in applying the trategy outlined above, since it identifies he intended referents.",
        "In most instances, he success of this strategy requires the istener to bridge, to construct certain mplicatures, and so he takes these nplicatures too as a necessary part of omprehension.",
        "In short, he considers mplicatures to be intrinsic to the intended essage, since without them the utterance ould not refer."
      ]
    },
    {
      "heading": "Varieties of Implicature",
      "text": [
        "Bridging from previous knowledge to the intended Antecedent can take many forms.",
        "I will here give a brief taxonomy of bridges I have found in naturally occurring discourse.",
        "As before I will illustrate the bridges with two sentence sequences in which the first constitutes the entire episodic knowledge available for bridging to the second.",
        "What I say here, however, is meant to apply just as much to episodic information derived from non-linguistic sources; the two-sentence sequences are just an expositional gimmick.",
        "One more caveat.",
        "As with any taxonomy, this one is hardly complete.",
        "Indeed, it cannot be until one has a theory to account for the taxonomy itself.",
        "Direct reference.",
        "Given information often makes direct reference to an object, event, or state just mentioned.",
        "These always force an implicature of some sort, even though it may be trivially simple.",
        "This class of bridging is well known:",
        "Identity: 1.",
        "I met a man yesterday.",
        "The man told me a story.",
        "2.",
        "I ran two miles the other day.",
        "The run did me good.",
        "3.",
        "Her house was large.",
        "The size surprised me.",
        "Pronominalization: 4.",
        "I met a man yesterday.",
        "He told me a story.",
        "5.",
        "I ran two miles the other day.",
        "It did me good.",
        "6.",
        "Her house was large.",
        "That surprised me.",
        "Epithets: 7.",
        "I met a man yesterday.",
        "The bastard stole all my money.",
        "8.",
        "I ran two miles the other day.",
        "The whole stupid business bored me.",
        "9.",
        "Her house was large.",
        "The immensity made me jealous.",
        "The implicature for these direct references is straightforward.",
        "For the identity in 1, the implicature is approximately this: 1'.",
        "The Antecedent for the man is the entity referred to by \"a man\".",
        "This implicature, though obvious, must be drawn for the second sentence in 1 to be complete; conceivably, man could have referred to some other object, and so the listener is making a leap -- perhaps only a millimeter leap -- in drawing this implicature.",
        "The same implicatures arise in 2 and 3.",
        "As for the pronominalization in 4, the principle is the same, but the pronoun (hg) uses only a subset of the properties that characterize the previously mentioned man.",
        "Indeed, there is a continuum of pronominalization, as for the noun phrase an elderly gentleman: Ihgt elderly gentleman, the elderly man, the gentleman, Ing man, Ina oldster, ram adult, Lb& person, and hg.",
        "The",
        "\"pronouns\" here range from full to sparse specification, but otherwise work like 1 and 1'.",
        "The epithets, on the other hand, add information about the referent, as in the implicature for 7: 7'.",
        "The antecedent for thq bastard is the entity referred to by \"a man\"; that entity is also a bastard.",
        "Epithets are surprisingly restricted in productivity, for not just anything will do, Replace the bastard in 7 by the rancher, or even by the robber, and the bridging doesn't go through; the rancher and robber seem ,to refer to someone other than the man.",
        "One can also make direct reference to one or more members of a set, as in these examples: Set membership: 10.",
        "I met two people yesteday.",
        "The woman told me a story.",
        "11.",
        "I met two doctors yesterday.",
        "The tall one told me a story.",
        "12.",
        "I swung three times.",
        "The first swing missed by a mile.",
        "Here the Given informaion has an Antecedent that must be picked out uniquely from a previously mentioned set, and to pick it out, one must draw an implicature with several parts.",
        "For 10, the implicature is approximately this: 10'.",
        "One of the entities referred to by \"two people\" is a woman and the other is not; this woman is the Antecedent of Inn man.",
        "The listener of 10 infers that the other person is not a woman since that is the only way the speaker could have picked out \"the woman\" uniquely.",
        "There are similar implicatures for 11 and 12.",
        "Indirect reference ny association.",
        "Given information often has as its Antecedent some piece of information not directly mentioned, but closely associated with the object, event, or situation mentioned (see Chafe, 1972).",
        "These \"associated\" pieces of information vary in their predictability from the object, event, or situation mentioned -- from absolutely necessary to quite unnecessary -- although I will list only three levels: Necessary carts: 13.",
        "I looked into the room.",
        "The ceiling was very high.",
        "14.",
        "I hit a home run.",
        "The swing had been a good one.",
        "15.",
        "I looked into the room.",
        "The size was overwhelming.",
        "In 13, since all rooms have ceilings, and only one ceiling each, the ceiling can be definite with the following implicature: 13'.",
        "The room mentioned has a ceiling; that ceiling is the Antecedent of Inn ceiling.",
        "Next consider associated parts that are only probable: Probable parts: 16.",
        "I walked into the room.",
        "The windows looked out to the bay.",
        "17.",
        "I went shopping yesterday.",
        "The walk did me good.",
        "18.",
        "I left at 8 p.m.",
        "The darkness made me jumpy.",
        "There is no guarantee that the room has windows, that going shopping means walking, or that it is dark at 8 p.m., but these are all probable or at least reasonable.",
        "The implicature of 16 is simply this: 16'.",
        "The room mentioned has windows; they are the Antecedent for the windows, There are, however, associated parts that one would normally not think of and are only induced by the need for an Antecedent: Inducible parts: 19.",
        "I walked into the room.",
        "The chandeliers sparkled brightly.",
        "20.",
        "I went shopping yesterday.",
        "The climb did me good.",
        "21.",
        "I left at 8 p.m.",
        "The haste was necessary given the circumstances.",
        "Here we come to infer that the room had chandeliers, that going shopping included some climbing, and that the departure at 8 p.m. was hasty, but these were certainly not necessary parts of these objects, events, or states.",
        "For 19, the implicature would be this: 19'.",
        "The room mentioned had chandeliers; they are the Antecedent for the chandeliers.",
        "Here, then is a clear case in which the search for an Antecedent induced the proposition that a particular part must be present.",
        "In normal comprehension, after reading walked into the room, we wouldn't spontaneously think of a chandelier in the room.",
        "The first part of 19' clearly only arises because of the second sentence in 19.",
        "On the other hand, notice that 19' is an implicature of precisely the same form as 16'.",
        "It is just that the first half of the implicature in 19' cannot be assumed either automatically or even probably.",
        "Indirect reference ni characterization.",
        "Often the Given information characterizes a role that something implicitly plays in an event or circumstance mentioned before, and these have a tremendous variety.",
        "First there are the necessary roles: Necessary roles: 20.",
        "John was murdered yesterday.",
        "The murderer got away.",
        "21.",
        "I went shopping yesterday.",
        "The time I started was 3 p.m. 22.",
        "I trucked the goods to New York.",
        "The truck was full.",
        "The implicature for these is uncomplicated, as illustrated for 20: 20°.",
        "Some one person performed John's murder; that person is the Antecedent for the murderer.",
        "he first sentence in 20 does not claim that here was only one murderer, but the second entence forces this implicature.",
        "imilarly, the verb trucked in 22 doesn't ay there is only one truck, but the second entence, as part of its implicature, forces his to be the case.",
        "Then come the strictly optional roles: ptional roles: 23.",
        "John died yesterday.",
        "The murderer got away.",
        "24.",
        "John was murdered yesterday.",
        "The knife lay nearby.",
        "25.",
        "John went walking at noon.",
        "The park was beautiful.",
        "n 23, the implicature is something like his: 23'.",
        "Some one person caused John to die; that one person is the Antecedent of the murderer.",
        "n 24, the implicature is that John was tabbed to death with a knife, the nstrument referred to by the, knife, and in 5 the implicature is that where John went alking was in a park, the place referred to y the bark.",
        "These two categories -- necessary and ptional roles -- cover a lot of ground.",
        "ost noun phrases, for example, are haracterizing, in that they contain as part t their specification how they relate to ther events.",
        "I have given unadorned noun thrases here, but of course they can become uite elaborate.",
        "The murderer could have sen the persori Kila murdered John; Ita :nife, which is implicitly defined as a ool, could have been the knife with which _t was done; and so on.",
        "English contains a snge of cleft and pseudo-cleft sentences hat often fill just this purpose, as in The mg that murdered John Kat away, and It was hat, man who murdered 191a.",
        "Adjectives can srry out this characterizing funcion too, Ls in The guilty party got away.",
        "What these Ajectives (e.g. guilty), relative clauses e.g. that murdered John), and derived louns (e.g. the murderer) do is pick out ,he role the intended Antecedent plays in ,he previously named events.",
        "It is not easy to separate \"parts\" from 'roles\" in every instance.",
        "For example, the :nife in 24 is conceived of not as a part of .he action of murdering, as, say, \"stabbing\" could be, but rather as a role in the fiction, as an instrument.",
        "I have considered .he word knife to have implicit within it :he notion that it is an instrument, so it Ls a characterizing noun, like murderer, not Simply a name of a non-functional class like ma.",
        "Ultimately, however, this distinction nay be impossible to maintain.",
        "Reasons, causes.",
        "consequences.",
        "and ;toncurrences.",
        "The Antecedent to the Given Lnformation of a sentence is often an event Ind not an object, and then it plays iifferent types of rols with respect to previous events.",
        "Instead of being agents, Dbjects, or instruments characterized with respect to previously mentioned events, this class of Antecedents gives reasons for, causes of, consequents to, or concurrences of previously mentioned events or states.",
        "The first class are reasons: Reasons: 26.",
        "John fell, what he wanted to do was scare Mary.",
        "27.",
        "John came to the party.",
        "The one he expected to meet was Mary.",
        "28.",
        "John had a suit on.",
        "It was Jane he hoped to impress.",
        "In each case the Antecedent of the Given information in the second sentence is contained in a reason for the first event.",
        "So the implicature for 26 is something like this: 26'.",
        "John fell for the reason that he wanted to do something; that something is the Antecedent to what wanted to Ag.",
        "Reasons always answer the question \"what for?\" and the Antecedents in 26 through 28 all make use of this kind of reason to bridge from the first sentence's event or state.",
        "Unlike reasons, causes answer the question \"How come?\" Causes:",
        "29.",
        "John fell.",
        "What he did was trip on a rock.",
        "30.",
        "John came to the party.",
        "The one who invited him was Mary.",
        "31.",
        "John had a suit on.",
        "It was Jane who told him to wear it.",
        "The implicature in 29 goes something like this: 29'.",
        "John fell because he did something; that something is the Antecedent for what ha Aid.",
        "This type of implicature works for 30 and 31 as well.",
        "In each case we infer a causal relation between the event presupposed by the Given information of the second sentence and the event mentioned in the first sentence.",
        "Then there are consequences: Conseauences• 32.",
        "John fell.",
        "What he did was break his arm.",
        "33.. John came to the party early.",
        "The one he saw first was Mary.",
        "34.",
        "John met Sally.",
        "What he did was tell her about Bill.",
        "The approximate implicature for 32 is as follows: 32.",
        "John did something because he fell; that something is the Antecedent to what hft All.",
        "The sequences in 33 and 34 have similar implicatures, ones that also depend on the Antecedent's being taken as the consequence of the event mentioned in the first",
        "For 33 the implicature is approximately this (see Lakoff, 1971): 33'.",
        "All Republicans are slightly daft; therefore, John is slightly daft, which is the Antecedent to the Given information someone other than Mary is slightly daft.",
        "In all three of these sequences, the listener is expected to draw the implicature that being in one state, or doing one event, necessarily entails the concurrence of another state, or event.",
        "These are four general ways, then, in which the listener can bridge from an event or state mentioned in the first sentence to an Antecedent in the second.",
        "These bridging relations turn out to be very common!",
        "especially in narratives.",
        "The most common, perhaps, is the consequence, which pops up between one sentence and the next every time.",
        "chronological order is conveyed.",
        "The Given information of the second sentence is taken as a consequence to the event mentioned in the first.",
        "Determinacy la bridging In principle, bridges need.",
        "not be deteminate.",
        "One could, if one had the time and inclination, build an infinitely long bridge, or sequence of assumptions, to link one event to the Antecedent of the next.",
        "In 35, for example, we assumed that every time Alex goes to a party he gets drunk.",
        "But we could have assumed instead that every time he goes to a party he meets women, and .1'11 women speak in high voices, and high voices always remind him of his mother, and thinking about hhs mother always makes him angry, and whenever he gets angry, he gets drunk, It takes very little imagination to add span after span to a bridge of this type.",
        "Yet in a natural discourse, bridges are always determinate.",
        "Indeed, I suggest that they have a stopping rule that goes something like this: Build the shortest possible bridge that is consistent with the Given-New Contract.",
        "The listener assumes, based on this contract, that the speaker intended him to be able to compute a unique bridge from his previous knowledge to the intended antecedent of the present Given information.",
        "If the speaker was certain that the listener could do this, he must have intended the listener to take the shortest possible bridge consistent with previous knowledge, for that would make the bridge unique, as required.",
        "So in 35 the listener assumes the speaker intended him to infer no more than that every time Alex goes to a party he gets drunk, for this implicature makes the fewest assumptions yet is consistent with previous knowledge of parties, dringking, and even Alex.",
        "In short, the listener takes as the intended implicature the one that requires the fewest assumptions, yet whose assmptions are all plausible given the listener's knowledge of the speaker, the situation, and facts about the world.",
        "The implicatures I have discussed here differ from the inferences we drew from Nixon's \"I am not a crook\" in one important way.",
        "The implicatures I• took up were intended by the speaker to be constructed by the listener, whereas the inferences from Nixon's blunder were not.",
        "With the implicatures, as with every other intended meaning, the speaker had a unique bridge in mind, and so the listener had something unique to try to figure out.",
        "But for Nixon's bobble, after the first unique and legitimate inference -- denials presuppose that the audience does or could believe what is being denied -- the inferences were completely unauthorized by the speaker.",
        "So bridging is determinate with a definite stopping rule, whereas Unauthorized inferences typically are not.",
        "This brings us, finally, to the issue of forward vs. backward inferences.",
        "When we hear the phrase the room in 19, we may begin imagining all sorts of things about this room, some necessary, but many others optional.",
        "All but the necessary inferences here, of course, are unauthorized.",
        "These \"forward\" inferences differ radically from the \"backward\" inferences forced by the phrase t chandelier in 19, for the speaker intended the listener to infer that the room had a chandelier.",
        "Both types of inferences occur, I'm sure, but only the latter type are fully determinate.",
        "I suggest that we might do well to study the determinate inferences first, for'they may well give us a clue as to what sorts of unauthorized inferences would be likely to be drawn for the typical utterance."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
