{
  "info": {
    "authors": [
      "Will Radford",
      "Ben Hachey",
      "James R. Curran",
      "Maria Milosavljevic"
    ],
    "book": "Proceedings of the NAACL HLT 2010 Workshop on Computational Linguistics in a World of Social Media",
    "id": "acl-W10-0515",
    "title": "Tracking Information Flow between Primary and Secondary News Sources",
    "url": "https://aclweb.org/anthology/W10-0515",
    "year": 2010
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Will Radford ^ Ben Hachey * James R. Curran ^ Maria Milosavljevic",
        "NSW 2006, Australia NSW 2000, Australia NSW 2109, Australia",
        "{wradford,james}@it.usyd.edu.au bhachey@cmcrc.com mariam@ics.mq.edu.au",
        "Tracking information flow (iflow) is crucial to understanding the evolution of news stories.",
        "We present analysis and experiments for iflow between company announcements and newswire.",
        "Error analysis shows that many fps are annotation errors and many fns are due to coarse-grained document-level modelling.",
        "Experiments show that document meta-data features (e.g., category, length, timing) improve f-scores relative to upper bound by 23%."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Tracking IFLOW between primary and secondary news sources provides insight into the contribution of participants and the role of sources.",
        "In finance, being alert and responsive to the nature of incoming information (e.g., novelty, price sensitivity) is central to successful trading (Zaheer and Zaheer, 1997).",
        "Traders need tools that flag price-sensitive information in a high-volume news feed.",
        "IFLOW is central to market surveillance, where unusual market activity (e.g., abnormal changes in trading price or volume) is linked to explanations in the information ecosystem (Milosavljevic et al., 2009).",
        "In Australia, the Australian Securities Exchange (ASX) is the official syndicator of information that might affect a company's share price.",
        "Subsequently, a variety of secondary sources (e.g., news media, blogs, forums) repackage this information.",
        "We focus on the relationship between ASX company announcements and Reuters newswire, which filters and aggregates the key details from company announcements in near-real time."
      ]
    },
    {
      "heading": "2. Preliminary Results",
      "text": [
        "We define IFLOW for capital markets as a pair of documents where one repeats price-sensitive information from the other (Radford et al., 2009).",
        "Pairs of ASX announcements and Reuters NewsScope Archive (RNA) stories covering the same company and released within a week of one another are manually annotated for presence or absence of IFLOW.",
        "These are used to train MegaM (Daumé III, 2004) maximum entropy models for identifying IFLOW.",
        "Textual features include set-theoretic bags of word unigrams and bigrams over the document text and titles.",
        "Text, title and numeric token similarity scores (Metzler et al., 2005) provide a more general notion of similarity.",
        "The precision of numeric tokens is also represented.",
        "Counts of matched sentences and longest common sub-sequences capture longer units of reused text.",
        "Temporal features model the news cycle and news source responsiveness.",
        "In development experiments (ten-fold cross validation, 30,249 ASX-RNA pairs), the system identifies IFLOW pairs at 89.5% f-score (Radford et al., 2009).",
        "In evaluation experiments (held-out test set, 1,621 ASX-RNA pairs), it achieves 76.6% f-score, significantly better than a text-only baseline (62.5%) and 10% less than the human upper bound (86.4%)."
      ]
    },
    {
      "heading": "3. Error analysis",
      "text": [
        "We engaged finance students (fourth-year or higher) to examine the 20 false positive (FP) errors with the highest IFLOW probabilities and the 20 false negative (FN) errors with the lowest IFLOW probabilities.",
        "Table 1 shows the resulting reassessment of the original iflow annotation.",
        "For fps, 75% were determined to have been incorrectly annotated as absent of iflow.",
        "This is not unexpected since iflow can be based on small details (e.g., '$2.45m profit') which are easily missed by annotators.",
        "This suggests that the system's actual precision may be higher than 90.9%.",
        "Mis-annotation is less common for fns (20%).",
        "However, the proportion of digest documents (those that report on multiple events) is much higher for fns (75% compared to 30% for fps).",
        "It is likely that legitimate textual similarity is lost in the noise of the irrelevant content."
      ]
    },
    {
      "heading": "4. Document Metadata Features",
      "text": [
        "We add new features that take advantage of categorisation information in the source metadata.",
        "These include asx tags for price sensitivity, asx and rna type tags and journalist revision comments embedded in rna stories.",
        "These features model differences in iflow between document types (e.g., periodic reports are more likely to be reported than a dividend rate announcement).",
        "A feature representing the length of each asx-rna document is also included.",
        "We also add detail to the temporal features, including the day and month the announcement was released, as well as whether the announcement and story were released on the same day.",
        "The metadata features lead to significantly better f-score in development experiments (Table 2).",
        "Sub-tractive feature analysis suggests that the document type and length features are effective (p<0.05) but the detailed temporal features are not.",
        "The revision comments are borderline (p=0.051).",
        "In Table 3, the metadata features improve the f-score by 23% over Radford et al.",
        "(2009) with respect to the upper bound, but the difference is not significant.",
        "The different precision-recall balance between experiments is consistent with Section 3."
      ]
    },
    {
      "heading": "5. Discussion and Future Work",
      "text": [
        "We have developed a dataset for iflow in the context of financial text mining and demonstrated it is a",
        "Table 2: Precision (P), recall (R) and f-score (F) for development experiments (*: p<0.05, **: p<0.01).",
        "Table 3: P, R and F for evaluation experiments.",
        "feasible task using simple approaches.",
        "Future work will involve more advanced models.",
        "First, we will consider sub-document analysis, as suggested by the digest fns in the error analysis.",
        "This will also enable tools that highlight specific types of contribution (e.g., adding background context, novel analysis) within secondary sources.",
        "Furthermore, the wider iflow ecosystem includes other sources (e.g., bloggers, forum contributors) that should be analysed for leading and lagging indicators.",
        "Finally, a number of specific applications might serve as extrinsic evaluations of the iflow task.",
        "These include de-duplicating and aggregating information feeds and automatically attributing reported content to a source story.",
        "Features",
        "P(%)",
        "R (%)",
        "F (%)",
        "Text-only Baseline",
        "80.0",
        "51.3",
        "62.5",
        "Radford et al.",
        "(2009)",
        "84.5",
        "70.1",
        "76.6",
        "+ Metadata Features",
        "86.3",
        "72.6",
        "78.9",
        "Human Upper Bound",
        "88.9",
        "85.1",
        "86.4"
      ]
    }
  ]
}
