{
  "info": {
    "authors": [
      "Raquel Fernández",
      "Jonathan Ginzburg"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C02-1135",
    "title": "Non-Sentential Utterances: Grammar and Dialogue Dynamics in Corpus Annotation",
    "url": "https://aclweb.org/anthology/C02-1135",
    "year": 2002
  },
  "references": [
    "acl-J96-2004",
    "acl-P01-1031",
    "acl-W00-0302",
    "acl-W01-1616",
    "acl-W02-0222"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Dialogue is full of intuitively complete utterances that are not sentential in their outward form, most prototypically the \"short an-swers\" used to respond to queries.",
        "As is well known, processing such non-sentential utterances (NSUs) is a difficult problem on both theoretical and computational grounds.",
        "In this paper we present a corpus-based study of NSUs.",
        "We propose a comprehensive, theoretically grounded classification of NSUs in dialogue based on a sub-portion of the British National Corpus (BNC).",
        "The study suggests that the interpretation of NSUs is amenable to resolution using a relatively intricate grammar combined with an utterance dynamics approach.",
        "That is, a strategy that keeps track of a highly structured dialogue record of entities that get introduced into context as a result of utterances.",
        "Complex, domain-based reasoning is not, on the whole, very much in evidence."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Most grammars of English encode in some form a rule akin to S 4 NP VP.",
        "This involves the assumption that for an expression to constitute a complete sentence it must contain a verbal constituent.",
        "If one identifies the start symbol of a grammar with the type sentence, or at least with a subclass of sentences, then we have as a consequence that complete utterances need to be verb-containing sentences.",
        "These assumptions constitute perhaps a more or less reasonably accurate description of the grammatical situation for texts.",
        "However, as is well known, dialogue is full of intuitively complete utterances that are not sentential in the above sense, most prototypically the `short answers' used to respond to queries.",
        "Processing such fragments, non-sentential utterances (NSUs), is commonly assumed to be a difficult problem on both theoretical and computational grounds, requiring in the general case sophisticated domain-based reasoning (see, e.g. (Carberry, 1991)).",
        "In this paper we undertake a corpus-based study of NSUs, specifically the British National Corpus (BNC) (Burnard, 2000).",
        "The structure of the paper is the following: we start by informally describing the classes of NSUs encountered in the BNC.",
        "In Section 3 we discuss how our classification scheme was devised and applied to the BNC.",
        "The results of the corpus investigation are discussed in Section 4.",
        "We then sketch the theoretical framework that has underpinned this investigation a combination of KOS (Ginzburg, 1996; Ginzburg, 2002; Cooper et al., 2001), a theory of dialogue context, with the Head Driven Phrase Structure Grammar (HPSG) of (Ginzburg and Sag, 2001).",
        "Finally, we present our conclusions in Section 6: our basic claim will be that, to a large extent, the NSUs encountered in our study are amenable to resolution based on combining a fairly sophisticated grammar with an utterance dynamics strategy.",
        "That is, a strategy that keeps track of a highly structured dialogue record of entities that get introduced into context as a result of utterances.",
        "Complex, domain-based reasoning is not, on the whole, very much in evidence.",
        "2 A corpus-based taxonomy of NSUs In this section we present a corpus-based taxonomy of non-sentential utterances.",
        "It was designed after an exhaustive analysis of 10 dialogue transcripts randomly chosen from the BNC.1 The identification of the different types of phrasal utterances was performed mostly manually in order to capture the maximal number of phenomena, although the search engine 'Two of them are transcripts of completely unrestricted, free conversation (KST, KSV), three are informal interviews (K68, K69, JA2), two are more formal interviews (K6K, K65), another two are conversations in seminars (JJ7, M) and one is the transcript of a public county council meeting (J9T).",
        "SCoRE (Purver, 2001) was also used to detect specific examples.",
        "The taxonomy was then tested by annotating a 200-speaker-turn section from 30 dialogue transcripts using decision trees to guide the classification process.",
        "In the current investigation, the annotation was performed by the authors.",
        "In what follows, we informally describe and exemplify each class.",
        "Short answers.",
        "`Short answer' is a wide cover term for fragments that typically occur in the context of a response to a query.",
        "In this case, we use the term only to designate short answers which are responses to wh-questions.",
        "Answers to polar questions.",
        "Typically polar questions are queries that can be answered using words like \"yes\" and \"no\".",
        "We call this kind of answers to yes/no questions plain affirmative answer and plain rejection respectively.",
        "As the following examples show, however, a polar question can also be answered by a fragment.",
        "When a yes/no question is answered negatively, a cooperative speaker often goes on to provide an appropriate alternative, as in (2b).",
        "We call these answers help rejections.",
        "In (2a) B answers affirmatively by repeating a fragment of the query.",
        "We call this kind of positive answers repeated affirmative answers.2 Clarification Ellipsis (CE).",
        "This term includes all NSUs that concern the content or form of a previous utterance that has failed to be fully comprehended, like B's request in (3):",
        "(3) A: [..] they used to come in here for water and bunkers you see.",
        "B: Water and?",
        "[HSH, 59-60]3",
        "In this paper, we do not provide a detailed analysis of elliptical clarification requests, as given by (Purver et al., 2001).",
        "Sluicing.",
        "Sluices are bare question – denoting wh-phrases.",
        "There are two main types of sluices, distinguished mostly by whether they are used to express reprise/echo questions or not.",
        "Reprise sluices involve a signalling of an inability to adequately comprehend the preceding utterance and they will therefore be classified as instances of CE.",
        "In this class we only include sluices that merely involve a request for additional information beyond what the speaker of the previous utterance thought was required.",
        "(4) a.",
        "A: Can I have some toast please?",
        "B: Which sort?",
        "[KCH, 104-105]",
        "Check questions.",
        "Check questions are short queries like \"allright?\" and \"okay?\", which a speaker utters to ensure that the addressee is understanding what has been said.",
        "(5) A: So we get three readings.",
        "Okay?",
        "B: Right.",
        "[G3Y, 25-28]"
      ]
    },
    {
      "heading": "Acknowledgements. Acknowledgements or",
      "text": [
        "acceptances are utterances like \"okay\", \"yes\" and \"mm\" that signal that the previous utterance was understood.",
        "We classify as acknowledgements plain acknowledgements like \"okay\" and \"yes\" as well as acknowledgements performed by repeating (a part of) the utterance that is being accepted.",
        "Corrections.",
        "This class includes NSUs that correct some item present in a previous utterance.",
        "In principle, any semantically meaningful sub-utterance can be corrected.",
        "(6) A: Joan had an eight hour car journey to get ... B: Nine hours.",
        "[K6Y, 1153-1154] Fillers.",
        "The class filler includes fragments used by a speaker to fill a gap left by a previous incomplete utterance.",
        "(7) A: And another sixteen percent is the other Ne Nestle coffee [ ... ] and twenty two percent is er <pause> B: Maxwell.",
        "[G3U, 292-293]",
        "and adverbials can function as NSUs conveying a complete message.",
        "This class mainly includes modal adverbs like B's response in (8a) and factual adjectives like A's last utterance in (8b).",
        "(8) a.",
        "A: I think there'd probably somebody with expanded polystyrene ceiling that's been pulled out.",
        "B: Probably.",
        "[HVO, 390-391] (2) a. b.",
        "A: So we we have proper logs?",
        "Over there?",
        "B: It's possible.",
        "A: Brilliant!",
        "[KSV, 2991-2994] Bare modifier phrases.",
        "In this case, the NSU is not a word like in the previous category but a full phrase, usually a PP, that behaves like an adjunct modifying some previous utterance in the context.",
        "(9) A: Well, if they got, they got men and women in the same dormitory!",
        "B: With the same showers!",
        "[KST, 995-996] Fragments introduced by connectives.",
        "Finally, a NSU can consist of a discourse connective like \"and\", \"or\" and \"but\" introducing a fragment, like B's utterance in (10):",
        "(10) A: Alistair [last or full name] erm he's made himself er he has made himself coordinator.",
        "B: And section engineer.",
        "[H48, 141-142] 3 Towards a classification scheme",
        "In order to provide a means for the experimental evaluation of our taxonomy, we designed a classification scheme for NSUs in dialogue corpora based on decision trees.",
        "Although the results we present in this paper were achieved after an annotation performed by the authors, from a methodological point of view it was important to design the trees in a way that would make the annotation task doable by non-expert subjects.",
        "To verify whether non-trained subjects are capable of recognising a proposed classification (using methods like the one described in (Carletta, 1996) that involves kappa statistics) is a precondition for using these schemes in the large-scale annotation exercises which are necessary, for instance, to create automatic annotation systems or to evaluate a system performance.",
        "We are currently engaged in work in which naive annotators use the decision trees we present below to classify NSUs in a portion of the BNC dialogue corpus."
      ]
    },
    {
      "heading": "3.1 Experimental Conditions",
      "text": [
        "Our corpus-based investigation of NSUs was performed using the BNC, which is a – 100 million SGML-encoded corpus of current British English (Burnard, 2000) with a – 10 million word sub-corpus of dialogue transcripts.",
        "For this experiment we used a sub – portion of the dialogue transcripts consisting of 7542 sentences, created by excerpting a 200-speaker-turn section from 30 transcripts over all dialogue domains.",
        "We classified all NSUs found in such sub-corpus according to the classes given in Section 2."
      ]
    },
    {
      "heading": "3.2 A labelling scheme using DTs",
      "text": [
        "To guide the classification process we used decision trees (DTs).",
        "For reasons of space, here we only include the initial tree, shown in Fig. 1, which makes an initial distinction between queries, answers and the rest of NSU types.",
        "This main tree is then divided in three subtrees, one for each sub-portion of NSU classes.",
        "Each subtree contains a label Other to allow for possible alternatives not considered in the current classification and avoid incorrect annotations.",
        "Thus the binary decision trees provide a labelling scheme to annotate NSUs.",
        "That is, a procedure to assign a label to each NSU according to the taxonomy discussed in previous sections.",
        "However, given the anaphoric component of NSUs, it would be desirable to consider a complementary scheme concerned with identifying the links between phrasal utterances and their source in the conversational context.",
        "The decision procedure concerned with the anaphoric aspect of NSUs should mainly involve two tasks: (i) identifying and tagging the source that allows to resolve the content of the phrasal utterance and (ii) measuring the distance between the source and the fragment.",
        "Although the investigation and results presented here do not include this dimension, we believe that it can be smoothly added to our labelling scheme."
      ]
    },
    {
      "heading": "4 Results",
      "text": [
        "Following the classification scheme described above, we identified and classified 841 NSUs, which make up 11.15% of the total number of sentences in the searched transcripts (7542).",
        "The distribution of NSUs classified according to the classes discussed in previous sections is shown in full in Table 1.",
        "The distributions are presented as percentages of all NSUs found, together with the total number of utterances of each NSU class."
      ]
    },
    {
      "heading": "4.1 Distribution",
      "text": [
        "The results of our investigation show that the proportion of NSUs in a corpus of dialogue is highly significant.",
        "NSUs were found to make up more than 11% of sentences.",
        "The most common class can be seen to be Acknowledgements (55.17% plain acknowledgements and 4.4% repeated acknowledgements), followed by Clarification Ellipsis (8.56%) and Short Answers (7.96%)."
      ]
    },
    {
      "heading": "4.2 Coverage",
      "text": [
        "We believe that the coverage of the taxonomy we have presented is satisfactory.",
        "The NSUs not covered by the current classification only make up 0.95% (8 utterances) of all NSUs found.",
        "It has to be stressed that most of the utterances classified as Other were not entirely comprehensible utterances.",
        "In a dialogue fragment like (11), for instance, it is not possible to know what is going on due to the amount of utterances transcripted as unclear.",
        "The NSU \"Public sector\" was therefore classified as Other.",
        "(11) A: I'm not quite sure, I think most organizations have a certain amount of of sum of money if I can remember from the workshops <unclear>.",
        "B: Other than <unclear>.",
        "A: <unclear> C: Public sector.",
        "A: That's right.",
        "[G4X, 74-78] 5 Resolving NSUs: theoretical",
        "background In this section we provide a theoretical grounding for our taxonomy.",
        "We consider briefly some theoretical proposals to explain how the content of the different classes in our taxonomy is resolved.",
        "The main aim of this sketch is to indicate the basic contextual parameters which are needed for a theory of the resolution of NSUs.",
        "Our analysis is based on a theory of context in dialogue, the KOS framework (Ginzburg, 1996; Ginzburg, 2002; Cooper et al., 2001), together with the HPSG grammar presented in (Ginzburg and Sag, 2001).",
        "Very briefly, in the KOS framework each dialogue participant informational state can be schematically represented by three attributes: QUD, a partial ordered set representing the issues currently under discussion; FACTS, which represents conversationally presupposed information; and LATEST-MOVE, the (content of the) most recent conversational move.",
        "In their HPSG grammar, (Ginzburg and Sag, 2001) following the account developed in the framework of KOS assume that the CTXT attribute contains two additional features: Maximal Question Under Discussion MAX-QUD, whose value is of type question and represents the maximal question currently under discussion, and Salient Utterance SAL-UTT, which takes as its value sets of elements of type sign and represents the focal (sub)utterance or the potential parallel element in the sense of (Dal-rymple et al., 1991).",
        "SAL-UTT is computed as the (sub)utterance associated with the role bearing widest scope within MAX-QUD.",
        "Since SAL-UTT is of type sign, it enable one to encode syntactic parallelism, as well as phonological parallelism."
      ]
    },
    {
      "heading": "5.1 Short answers and sluicing",
      "text": [
        "Ginzburg & Sag offer an analysis of short answers and sluices, as well as some cases of CE; their analysis is restricted to NP and PP NSUs.",
        "In line with much recent work in HPSG and Categorial Grammar, Ginzburg & Sag do not treat ellipsis by positing a phonologically null head.",
        "Rather, they posit a phrasal type headed-fragment-phrase (hd-frag-ph) governed by the constraint in (12).",
        "The various fragments they analyse are all subtypes of hd-frag-ph or else contain such a phrase as a head daughter.",
        "Short answers and one class of CE on one hand and directed sluices on the other are analysed by means of two subtypes of hd-frag-ph, declarative-frag-clause and sluice interrogative-clause respectively.",
        "Whereas in most headed clauses the content is entirely (or primarily) derived from the head daughter, here it is constructed for the most part from the contextually salient question.",
        "As mentioned above Ginzburg & Sag's analysis accommodates NP fragments or case-marking PPs (i.e. fragments whose content is of type param).",
        "In order to deal with sluices like Where?",
        "or When?",
        "in non-reprise uses and the corresponding short answers, their analysis has thus to be extended to accommodate fragments whose content is not of type param.",
        "The following constraint describes the type bare-soamodifier-phrase.",
        "The head daughter is a modifier and the nucleus of the modified sign (i.e. the one which is the value of the feature MoD) is identified with the nucleus of the proposition in MAX-QUD.",
        "In general, this constraint applies to bare adjuncts modifying the SOA of some contextual proposition (i.e. verb or VP modifiers).",
        "More specific subtypes of bare-soa-mod-ph can be straightforward added to distinguish between sluices and short answers."
      ]
    },
    {
      "heading": "5.2 Answers to yes/no questions",
      "text": [
        "Apparently, affirmative fragment responses to polar questions require the constituent to be focused.",
        "As has often been suggested in past work, a focused constituent in a polar question creates a context which allows to provide an utterance in which only the focus is realized.",
        "In terms of KOS, this can be formulated as follows: an utterance with a certain focus-ground partition requires for its felicity the maximality in QUD of a particular question obtained by A-abstracting over the content corresponding to the focused constituent (see (Engdahl et al., 2000)).",
        "Thus, assuming that (2a) is an utterance with focal accent on the complement, it presupposes QUD-maximality of the following question: Where does the 1363 go?, i.e. (s ?",
        "Ax prop((GO, rolel:i, role2:x))).",
        "The presence of this question in QUD explicates the felicity of the phrasal answer in (2a).",
        "Given this proposal, help rejections can be accommodated entirely analogously (see also (Larsson, 1998))."
      ]
    },
    {
      "heading": "5.3 CE and corrections",
      "text": [
        "The analysis provided for CE in (Ginzburg and Cooper, 2001a; Ginzburg and Cooper, 2001b) suggests that the performance of a conversationalist who requests a clarification can be specified by a set of coercion operations on utterance representations.4 Corrections are in many ways similar to clarification requests.",
        "A coercion operation for corrections should have a form close to the following:",
        "Given an utterance which satisfies the specification in the LHS of the rule, a dialogue participant can respond with an utterance which satisfies the specification in the RHS of the rule.",
        "The ☛For more discussion see (Ginzburg and Cooper, 2001b).",
        "value of SAL-UTT corresponds to the constituent corrected in the input utterance.",
        "The category of the constituent used to make the correction is identified with the category of SAL-UTT to capture the degree of syntactic parallelism exhibited by corrections.",
        "The output of the rule ensures that the descriptive content of the correction (given in terms of the feature MSG-ARG) is a substitution instance of the proposition conveyed by the input utterance.",
        "Such substitution is obtained by substituting the index of the constituent in SAL-UTT by the index of the constituent used in the phrasal correction."
      ]
    },
    {
      "heading": "5.4 Modifiers",
      "text": [
        "Apparently, given a certain question under discussion q maximal in QUD a dialogue participant can always utter a phrasal modifier that will be resolved as an adjunct of the proposition in q.",
        "We suggest to analyse this kind of bare modifier phrases with bare-adjunct-clause (15), a subtype of bare-soa-mod-ph set in (13).",
        "Sentential modifiers like probably or usually can also function as NSUs.",
        "In these standalone uses, such adverbs take as an argument a contextual proposition, either from a declarative sentence or from a polar question in the context.",
        "This can be expressed by means of a type propositional-lexeme, which is constrained to identify the semantic argument of the adverb with the value of the feature PROP in MAX-QUD.",
        "On the other hand, adjectives like great, amazing, excellent can be analysed as fact-operators predicates that take as an argument a contextually provided fact."
      ]
    },
    {
      "heading": "5.5 Acknowledgements and check questions",
      "text": [
        "According to KOS, an acknowledgement or an acceptance of an assertion p can be analysed as involving two steps: (i) both speaker and addressee add p to their presupposed information (FACTS)6 and (ii) p?",
        "is downdated from the set of questions under discussion QUD.",
        "Similarly, check questions can be understood as checking whether p is accepted (can be added to FACTS and downdated from QUD)."
      ]
    },
    {
      "heading": "5.6 Implementation",
      "text": [
        "Some of the analyses discussed before have already received a computational implementation.",
        "SHARDS (Ginzburg et al., 2001), an implemented system which provides a procedure for computing the interpretation of clausal fragments, handles short answers, sluices, as well as plain affirmative responses to polar queries.",
        "The system, which comprises an HPSG-based grammar and a resolution procedure (see (Fernandez, 2002) for a detailed description), uses a context record stored in memory to resolve the content of phrasal utterances assigning appropriate values to the MAX-QUD and SAL-UTT features.",
        "As a result of the research described in this paper, we are in the process of implementing our existing analysis for corrections and modifiers.",
        "In addition, (Purver, 2002) describes an implementation of the different readings and forms of clarification requests within an HPSG/TrindiKit-based dialogue system which incorporates the ellipsis resolution capability of SHARDS, along with the dialogue move engine GoDiS (Larsson et al., 2000)."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "In this paper, we have proposed a comprehensive, semantically grounded taxonomy of NSUs in dialogue based on manual tagging of a random sample of the BNC.",
        "We have sketched a theoretical analysis of most of the NSU classes found in the corpus study, based on the KOS framework and the HPSG grammar presented in (Ginzburg and Sag, 2001).",
        "Perhaps the most striking result that emerges from this work concerns the nature of ellipsis resolution involved in the interpretation of NSUs.",
        "On the one hand, it is clear that this must involve a combination of syntactic and semantic information associated with a source 'More precisely, FACTS is incremented with FACT(p), that is the fact that must hold iff p is true.",
        "utterance.",
        "The basic strategy we invoke for resolution is to use utterance dynamic tools, i.e. by means of keeping track of a limited dialogue record of entities that get introduced into context as a result of utterances or that arise as a consequence of attempts to elicit clarification.",
        "And yet, our results also indicate that, with the context as given, the principles by means of which NSU content is resolved do not involve complex domain sensitive reasoning (for the suggestion that this is required see e.g. (Allen and Perrault, 1980) and (Carberry, 1991)).",
        "We do need to reiterate that our approach does not as yet offer means of determining which of a number of possible antecedents is preferred and this aspect might very well involve domain-based reasoning.",
        "Moreover, we do not of course wish to claim that such reasoning has no role to play in dialogue understanding.",
        "Nor even that there do not exist NSUs where such reasoning might need to be appealed to.",
        "We simply observe that the role of such reasoning seems relatively insignificant in the corpus we have investigated, a significant proportion of which is free, unrestricted conversation.",
        "This suggests that using an utterance dynamics approach, combined with a relatively intricate grammar can serve as a viable basis for a comprehensive NSU resolving module in a dialogue system.",
        "As discussed in Section 5.6, we have in collaboration with colleagues, begun work on prototype systems that employ such a strategy.",
        "Whether this will be viable on a larger scale is still very much of an open question."
      ]
    }
  ]
}
