{
  "info": {
    "authors": [
      "James Pustejovsky"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E89-1000",
    "title": "Current Issues in Computational Lexical Semantics",
    "url": "https://aclweb.org/anthology/E89-1000",
    "year": 1989
  },
  "references": [
    "acl-C88-2110",
    "acl-T87-1006"
  ],
  "sections": [
    {
      "text": [
        "This volume contains texts of the papers presented at the Fourth Conference of the European Chapter of the Association for Computational Linguistics, reserve papers, and tutorial abstracts.",
        "Over 130 papers were submitted for the conference, and the overall standard was high: it was with regret and difficulty that the Programme Committee were able to accept only 45, even including parallel sessions and reserve papers.",
        "We are grateful to all those who submitted papers, to the Programme Committee and referees for reading them, and to all who worked hard on local arrangements.",
        "Our thanks in particular to Prof. J. C. Sager and to the secretarial staff of the Centre for Computational Linguistics, UMIST for many forms of moral and material support.",
        "Don Walker and the officials of the European Chapter, Maghi King, Beat Buchmann, and Mike Rosner, also did much to make it all possible.",
        "Lambek theorem proving and feature unification Erik-Jan van der Linden 190 A formal representation of propositions and temporal adverbials JiYrgen Kunze 197 Computational semantics of mass terms Jan Tore LOnning 205 Extended graph unification Allan Ramsay 212 A modular approach to story generation Lyn Pemberton 217 Subject erasing and pronominalization in Italian text generation Fiammetta Namer 225 An algorithm for generation in Unification Categorial Grammar Jonathan Calder, Mike Reape & Henk Zeevat 233 Interactive incremental chart parsing Mats Wirdn 241 French order without order Gabriel G. BAs & Claire Gardent 249 The syntactic regularity of English noun phrases Lita Taylor, Claire Grover & Ted Briscoe 256 - x - A descriptive framework for translating speaker's meaning: towards a dialogue translation system between Japanese and English Masako Kume, Gayle K. Sato & Kei Yoshimoto 264 Translation by structural correspondences Ronald M. Kaplan, Klaus Netter, Jdrgen Wedekind & Annie Zaenen 272 A new view on the process of translation John A. Bateman, Robert T. Kasper, Jdrg F.L.",
        "Schdtz & Erich H. Steiner 282 An approach to sentence-level anaphora in machine translation Gertjan van Noord, Joke Dorrepaal, Doug Arnold, Steven Krauwer, Louisa Sadler & Louis des Tombe 299 Empirical studies of discourse representations for natural language interfaces Nils Dahlback & Arne Jdnsson 291 Situation semantics and machine translation C.J.",
        "Rupp 308 On formalisms and analysis, generation and synthesis in machine translation",
        "Discourse Bonnie Lynn Webber (U Penn) Discourse places two demands on a communicative agent: (1) the need to comprehend and produce multiple utterances, each being interpreted in the context of those preceding it, and (2) the need to treat utterances as intentional behavior.",
        "Both processes seem to be inherently computational.",
        "That is, to model changes in context and attention requires consideration of the side effects of understanding and producing utterances.",
        "Similarly, interpreting and responding to utterances as intentional behavior requires support for planning and plan inference.",
        "This tutorial explores emerging computational models and methods for both contextual and intentional aspects of discourse."
      ]
    },
    {
      "heading": "Combinatory Categorial Grammars Mark Steedman (U Penn)",
      "text": [
        "The session will discuss a generalisation of Categorial Grammar based on the inclusion of a few syntactic operations related to \"combinators\", such as functional composition.",
        "The theory implies a radical revision of accepted notions of surface structure and constituency, with interesting implications for theories of the production and comprehension of spoken and written language.",
        "The theory will be presented in the first instance as a theory of syntactic competence, with particular attention to constructions involving coordination and unbounded dependency.",
        "Attention will be paid to certain universal properties of such constructions across languages.",
        "The discussion will then be widened to consider the implications of this theory of syntax for selected problems in prosody and intonation, incremental semantic interpretation, and processing.",
        "The lexicon Bran Boguraev (Cambridge Computer Lab & IBM Yorktown Heights) Knowledge of and about words underlies all natural language processing tasks.",
        "This tutorial will focus on the complementary questions of content and format(s) of computational lexicons, after looking in some detail at the specific lexical requirements of natural language processing systems.",
        "In particular, we will study some recent developments in theories of grammar and lexical semantics, and observe the implications in the way they handle lexical information for the organization of computational lexicons.",
        "We will trace, through a number of illustrative examples, issues like formalization of lexical information, flexibility and extendability of lexicon formats, scaling up prototype lexical systems, and acquisition of lexical knowledge, and observe how these interrelate during the process of designing lexical components for realistic natural language processing systems."
      ]
    },
    {
      "heading": "Current Issues in Computational Lexical Semantics",
      "text": [
        "James Pustejovsky Brandeis University Waltham, MA.",
        "USA"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "In this talk I would like to address some issues of major importance in lexical semantics.",
        "In particular, I will discuss four topics relating to current research in the field: methodology, descriptive coverage, adequacy of the representation, and the computational usefulness of representations.",
        "In addressing these issues, I will discuss what I think are some of the central problems facing the lexical semantics community, and suggest ways of best approaching these issues.",
        "Finally, I outline a theory of lexical semantics embodying a richer notion of compositionality, termed cocomposition, which aims to spread the semantic load more evenly throughout the lexicon."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "I believe we have reached an interesting turning point in research, where linguistic studies can be informed by computational tools for lexicology as well as an appreciation of the computational complexity of large lexical databases.",
        "Likewise, computational research can profit from an awareness of the grammatical and syntactic distinctions of lexical items; natural language processing systems must account for these differences in their lexicons and grammars.",
        "The wedding of these disciplines is so important, in fact, that I believe it will soon be impossible to carry out serious computational research in our field without the help of electronic dictionaries and computational lexicographic resources [Walker, 1986].",
        "Positioned at the center of this synthesis is the study of word meaning, lexical semantics, which is currently witnessing a minor revival.",
        "Given this, I would like to turn to a few issues that I feel the lexical semantics community should address.",
        "In particular, I will pose the following four questions:",
        "1.",
        "Has recent work in lexical semantics been methodologically any sounder than the previous work in the field?",
        "2.",
        "Do theories being developed today have any broader coverage than the earlier descriptive work?",
        "3.",
        "Do current theories provide any new insights into the representation of knowledge for the global structure of the lexicon?",
        "4.",
        "Finally, has recent work provided the computational community with useful resources for parsing, generation, and translation research?",
        "Before answering these questions, I would like to establish two points that will figure prominently in our critique of the field.",
        "The first is that, without an appreciation of the syntactic structure of a language, the study of lexical semantics is bound to fail.",
        "There is no way in which meaning can be completely divorced from the structure that carries it.",
        "This is more a methodological point than anything else, since grammatical distinctions are a useful metric in evaluating competing semantic theories.",
        "The second point is that the meanings of words should somehow reflect the deeper, conceptual structures in the system and the domain it operates in.",
        "This is tantamount to stating that the semantics of natural language should be the image of (nonlinguistic) conceptual organizing principles (whatever their structure).",
        "Some of the major points I would like to make here are the following.",
        "First, a clear notion of semantic well-formedness will be necessary in order to characterize a theory of possible word meaning.",
        "This may entail idealizing the notion of lexical meaning away from other semantic influences.",
        "For instance, this might suggest that discourse and pragmatic factors should be handled differently or separately from the semantic contributions of lexical items in composition (contra [Hobbs, 1987].",
        "Although this is not a necessary assumption and may in fact be wrong, it may help narrow our focus on what is important for lexical semantic descriptions.",
        "Secondly, lexical semantics must look for representations that are richer than thematic role descriptions [Fillmore, 1968].",
        "As argued in [Levin and Rappaport, 1986], named roles are useful, at best, for establishing fairly general mapping strategies to the syntactic structures in language.",
        "The distinctions possible with \"theta\" roles are much too coarse-grained to provide a useful semantic interpretation of a sentence.",
        "What is needed, therefore, is a principled method of lexical decomposition.",
        "This presupposes, if it is to work at all, (1) a rich, recursive theory of semantic composition, (2) the notion of semantic well-formedness mentioned above, and (3) an appeal to levels of interpretation in the semantics [Scha, 1983].",
        "Thirdly, and related to the point above, the lexicon is not just verbs.",
        "Recent work has done much to clarify the nature of verb classes and the syntactic constructions that each allows [Levin, 1985].",
        "Yet it is not clear whether we are any closer to understanding the underlying nature of verb meaning, why the classes develop as they do, and what consequences these distinctions have for the rest of the lexicon and grammar.",
        "The curious thing is that there has been little attention paid to the other lexical categories (but see [Fass, 1988].",
        "That is, we have little insight into the semantic nature of adjectival predication, and even less into the semantics of nominals.",
        "Not until all major categories have been studied can we hope to arrive at a balanced understanding of the lexicon and the methods of composition."
      ]
    },
    {
      "heading": "2. Methods in Lexical Semantics",
      "text": [
        "Given what I have said, let us examine the questions presented above in more detail.",
        "Because of space, I will have little to say concerning question (4) in this short note.",
        "First, let us turn to the issue of methodology.",
        "How can we determine the soundness of our method?",
        "Are new techniques available now that have not been adequately explored?",
        "Very briefly, we can summarize the most essential techniques assumed by the field, in some way, as follows (see, for example [Cruse, 1986]):",
        "1.",
        "On the basis of categorial distinctions, establish the fundamental differences between the grammatical classes; the typicial semantic behavior of a word of category X.",
        "2.",
        "Find distinctions between elements of a word class on the basis of collocation and cooccurrence tests.",
        "For example, \"dog\" and \"rock\" partition into different classes due to certain features.",
        "3.",
        "Test for distinctions of a grammatical nature on the basis of diathesis; i.e. alternations that are realized in the syntax.",
        "For example, break vs. cut in (i) and (ii) below [Hale and Keyser, 1986].",
        "(i) a.",
        "The glass broke.",
        "b. John broke the glass.",
        "(ii) a.",
        "*The bread cut.",
        "b. John cut the bread.",
        "This results in ever-finer distinctions in the semantic and syntactic behavior of verbs.",
        "4.",
        "Test for entailments in the word senses of a word, in different grammatical contexts.",
        "The same lexical item may carry different entailments in different contexts.",
        "For example, \"forget\" in (i): (i) a. John forgot that he locked the door.",
        "b. John forgot to lock the door.",
        "Sentence (a) has a factive interpretation of \"forget\" that (b) does not carry.",
        "5.",
        "Test for the ambiguity of a word.",
        "Distinguish between ambiguity and polysemy, (cf. [Hirst, 1987], [Foss, 1988]) and from the accidental nature and the logical nature of ambiguity.",
        "For example, the ambiguity between the two senses of \"bank\" in (i) and the polysemy in (ii).",
        "(i) a. the bank of the river b. the richest bank in the city (ii) a.",
        "The bank raised its interest rates yesterday.",
        "b.",
        "The store in next to the bank.",
        "6.",
        "Establish what the compositional nature of a lexical item is when applied to other words.",
        "For example, \"alleged\" vs. \"tall\" in the example below.",
        "(i) a. the alleged suspect b. the tall suspect",
        "While \"tall\" is a simple intersective modifier in (b) we must be aware of the intensional behavior of adjectives such as \"alleged\" in (a).",
        "This just briefly characterizes some of the techniques that have been useful for arriving at pre-theoretic notions of word meaning.",
        "What has changed over the years are not so much the methods themselves as the descriptive details provided by each test.",
        "One thing that has changed, however, and this is significant is the way computational lexicography has provided stronger techniques and even new tools for lexical semantics research: for sense discrimination tasks [Atkins 1987]; for constructing concept taxonomies [Amsler 1985, Atkins, Klavans and Boguraev, forthcoming]; for establishing semantic relatedness among word senses [Wilks et al., 1988]; as well as for testing new ideas about semantic representations [Boguraev and Pustejovsky, forthcoming].",
        "3.",
        "Descriptive Adequacy of Existing Representations",
        "Turning now to the question of how current theories compare with the coverage of lexical semantic data, there are two generalizations that should be made.",
        "First, the taxonomic descriptions that have been made of verb classes are far superior to the classifications available twenty years ago (see [Levin, 1985] for review).",
        "Using mainly the descriptive vocabulary of [Talmy, 1975, 1985] and [Jackendoff, 1983], fine and subtle distinctions are drawn that were impossible to capture in the earlier primitives-approach of [Schank, 1972, 1975] or the frame semantics of [Fillmore, 1968].",
        "There are two problems with the current work, however.",
        "Unlike the theories of [Wilks, 1975] and [Quilfian, 1968], there is no general coherent view on what the entire lexicon will look like when semantic structures for other major categories are studied.",
        "Furthermore, it is not clear whether this work embodies a real theory of knowledge representation.",
        "We can, however, view this research as the first step towards constructing a theory of lexical semantics which is integrated into a linguistic theory, as well as interpreted in a knowledge representation system."
      ]
    },
    {
      "heading": "4. Explanatory Adequacy of Existing Representations",
      "text": [
        "Finally, let us turn to the question of whether current theories have changed the way we look at representation and lexicon design.",
        "The question here is whether the representations assumed by current theories are adequate to account for the richness of natural language semantics.",
        "It should be pointed out here that a theory of lexical meaning will affect the general design of our semantic theory in several ways.",
        "If we view the goal of a semantic theory as being able to recursively assign meanings to expressions, (accounting for phenomena such as synonymy, antonymy, polysemy, metonymy, etc.",
        "), then our view of compositionality depends ultimately on what the basic lexical categories of the language denote.",
        "Conventional wisdom on this point paints a picture of words behaving as either active functors or passive arguments [Montague, 1974].",
        "But if we change the way which categories can denote, then the form of compositionality itself changes.",
        "Therefore, if done well, lexical semantics forces us to reevaluate the very nature of semantic composition in language (see, for example [Keenan and Faltz, 1985]).",
        "In what ways could lexical semantics affect the larger methods of composition in semantics?",
        "I mentioned above that most of the careful representation work has been done on verb classes.",
        "In fact, the semantic weight in both lexical and compositional terms usually falls on the verb.",
        "This has obvious consequences for how to treat lexical ambiguity.",
        "For example, consider the verb \"bake\" in the two sentences below.",
        "(1) a. John baked the potato.",
        "b. John baked the cake.",
        "[Atkins, Kegl, and Levin, 1988] demonstrate that verbs such as \"bake\" are ambiguous, with both a \"change-of-state\" sense (la) and a \"create\" sense (lb).",
        "A similar ambiguity exists with verbs that allow the resulative construction, shown in (2) and (3), and discussed in [Dowty, 1979], [Jackendoff, 1983], and [Levin and Rapoport, 1988].",
        "(2) a. Mary hammered the metal.",
        "b. Mary hammered the metal flat.",
        "(3) a. John wiped the table.",
        "b. John wiped the table clean.",
        "On many views, the verbs in (2) and (3) are ambiguous, related by either a lexical transformation [Levin and Rapoport, 1988], or a meaning postulate [Dowty, 1979].",
        "In fact, given strict requirements on the way that a verb can project its lexical information, the verb \"run\" in (4) will also have two lexical entries, depending on the syntactic environment it selects [Talmy, 1985], [Levin and Rappaport, 1989].",
        "(4) a. Mary ran yesterday.",
        "b. Mary ran to the store yesterday.",
        "These two verbs differ in their semantic representations, where the \"run\" in (4b) means \"go-to-bymeans-of-running\", while in (4a) it means simply \"move-by-running\".",
        "The methodology described above for distinguishing word senses is also assumed by those working in more formal frameworks.",
        "For example, [Dowty, 1985] proposes multiple entries for control and raising verbs, and establishes their semantic equivalence with the use of meaning postulates.",
        "That is, the verbs in (5) and (6) are lexically distinct but semantically related by rules.",
        "(5) a.",
        "It seems that John likes Mary.",
        "b. John seems to like Mary.",
        "(6) a. Mary prefers that she come.",
        "b. Mary prefers to come.",
        "Given the conventional notions of function application and compositionality, there is little choice but to treat all of the above cases as polysemous verbs.",
        "Yet, something about the systematicity of such ambiguity suggests that a more general, simpler explanation should be possible.",
        "By relaxing the conditions on how the meaning of a complex expression is derived from its parts, we can, in fact, arrive at a very straightforward explanation for cases of \"logical polysemy.\" The basic idea is this.",
        "Rather than treating the expressions that behave as arguments to a function as simple, passive objects, imagine that they are as active in the semantics as the verb itself.",
        "The product of function application would be sensitive to both the function and its active argument.",
        "Something like this is suggested in [Keenan and Faltz, 1985], as the \"Meaning-Form Correlation Principle.\" What I have in mind can best be illustrated by returning to the examples in (1).",
        "Rather than having two word senses for a verb such as \"bake,\" suppose there is simply one, a \"change-of-state.\" Now, assume that \"bake\" can be lexically specified as a Process verb [Pustejovsky, 1988].",
        "It is a general property of Processes, that they can shift their \"aspectual type\" to become a telic event.",
        "For example, \"push the wagon\" can shift from a Process to a Transition (\"push the wagon to Mary\") by general principles of event composition (cf. [Pustejovsky, 1988]).",
        "Assume further, that our semantic theory makes a logical distinction between \"potatoes\" and \"cakes\" in terms of natural versus artifactual objects.",
        "Any artifact can be identified with the state of being that object, along with the purpose of the object, and other information.",
        "Most importantly, however, an artifact has a kind of stative interpretation as part of its meaning.",
        "Notice that the two senses for \"bake\" in (1) are the result of compositionality in a richer sense.",
        "For observe that the \"create\" sense arises by the same principle of event composition mentioned above.",
        "Namely, that there is a baking process, and it results in a cake.",
        "This is the \"create\" sense, and it is present just in those cases where an artifactual stative is already encoded in the argument (see [Pustejovsky, 1989] for details).",
        "In fact, similar principles seem to be operating in the examples mentioned in (2) through (4); namely, systematic ambiguity is the result of principles of semantic composition, rather than lexical ambiguity.",
        "I will call this particular kind of case \"cocompositionality.\" In explaining the behavior of the systematic ambiguity above, I made reference to properties of the Noun Phrase that are not typical semantic properties for nouns in linguistics, e.g. artifact, natural kind.",
        "In [Pustejovsky, 1989] and [Pustejovsky and Anick, 1988], I suggest that there is a system of relations that characterizes the semantics of nominals, very much like the argument structure of a verb.",
        "I call this the \"Qualia Structure\", adopting a term from [Goodman, 1951].",
        "Essentially, the qualia structure of a noun determines its meaning as much as the list of arguments determines a verb's meaning.",
        "The elements that make up a qualia structure include notions such as \"container,\" \"space,\" \"surface,\" \"figure,\" \"artifact,\" and so on.",
        "When we combine the qualia structure of a NP with the argument structure of a verb, we begin to see a richer notion of compositionality emerging, one that looks very much like object-oriented approaches to programming [Ingria and Pustejovsky, 1988].",
        "As an example, consider the two senses of \"window\" and \"door\" in (7) and (8) below:",
        "(7) a. John crawled through the window.",
        "b.",
        "The window is closed.",
        "(8) a. Mary painted the door.",
        "b. Mary walked through the door.",
        "Each noun appears to have two senses: an object denotation, and a portal denotation.",
        "We can characterize the meaning of such \"Double Figure Ground\" nominals as a three place relation, roughly something like N(Figure,Invert-Figure,Ground), where Figure refers to the artifact itself, Invert-Figure refers to the portal, and Ground is a reference constant.",
        "The foregrounding or backgrounding of a nominal's qualia is very similar to argument structure-changing operations for verbs.",
        "That is, in (8a) \"paint\" applies to the Figure interpretation of \"the door,\" while in (8b), \"through\" will apply to the Invert-Figure interpretation of the same NP.",
        "The ambiguity with such nouns is a logical one, one that is intimately linked to the semantic representation of the object itself.",
        "The qualia structure is a way of capturing this fact.",
        "Having discussed the notion of logical polysemy, let us conclude our brief discussion of lexical semantics with the issue of metonymy.",
        "Metonymy, where a subpart or related part of an object \"stands\" for the object itself, also poses a problem for standard denotational theories of semantics.",
        "For example, how can we account for the reference shifts such as those shown in (9)?",
        "(9) a. Thatcher vetoed the channel tunnel.",
        "b. Mary enjoyed the book.",
        "I suggest that these are cases of semantic \"type coercion\", where the verb has coerced the meaning of a term phrase into a different semantic type.",
        "In the case of (9a), it is obvious that what is vetoed is some proposal relating to the object.",
        "In (9b), the book is enjoyed only by virtue of some event or process that involves the book, performed by Mary.",
        "It might furthermore be reasonable to assume that the qualia structure of \"book\" specifies what the artifact is used for; i.e. reading.",
        "Such coercion results in a word sense for the NP that I will call \"logical metonymy.\" Roughly, logical metonymy is where a logical argument of a semantic type (selected by a function) denotes the semantic type itself.",
        "For details see [Pustejovsky, 1989].",
        "Another interesting example involves the possible subjects of causative verbs.",
        "These are also cases of logical metonymy.",
        "Consider the sentences in (10) and (11).",
        "(10) a.",
        "The pictures of himself frightened John.",
        "b.",
        "A cup of coffee in the morning woke John up.",
        "(11) a. John killed Mary.",
        "b.",
        "The gun killed Mary.",
        "c. John's stupidity killed Mary.",
        "d. The war killed Mary.",
        "e. John's pulling the trigger killed Mary.",
        "The sentences in (10) illustrate the various syntactic consequences of metonymy and coercion involving experiencer verbs, while those in (11) show the different \"metonymic extensions\" possible from the causing event in a killing.",
        "The generalization here is that when a verb selects an event as one of its arguments, type coercion to an event will permit a limited range of logical metonymy."
      ]
    },
    {
      "heading": "S. Conclusion",
      "text": [
        "In this paper I have tried to cover what I believe are currently some of the most interesting issues in lexical semantics.",
        "I have also tried to outline an approach to meaning where the semantic load is spread more evenly throughout the lexicon.",
        "This entails a semantic description of noun classes, termed a \"theory of Qualia,\" as well as the rules of composition that allow this information to be incorporated into the semantic interpretation of larger expressions.",
        "Although much of what I have presented is incomplete and somewhat programmatic, I firmly believe this approach can help clarify the nature of word meaning and compositionality in natural language."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "I would like to thank Dan Fass for lengthy discussion on many of the issues mentioned here.",
        "I would also like to thank Branimir Boguraev and Robert Ingria for useful comments.",
        "Any errors, of course, are my own."
      ]
    }
  ]
}
