{
  "info": {
    "authors": [
      "Selja Seppälä",
      "Lucie Barque",
      "Alexis Nasr"
    ],
    "book": "SemEval",
    "id": "acl-S12-1024",
    "title": "Extracting a Semantic Lexicon of French Adjectives from a Large Lexicographic Dictionary",
    "url": "https://aclweb.org/anthology/S12-1024",
    "year": 2012
  },
  "references": [
    "acl-A00-2006",
    "acl-C94-2202",
    "acl-C96-2142",
    "acl-P06-2072",
    "acl-P11-4015"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present a rule-based method to automatically create a large-coverage semantic lexicon of French adjectives by extracting paradigmatic relations from lexicographic definitions.",
        "Formalized adjectival resources are, indeed, scarce for French and they mostly focus on morphological and syntactic information.",
        "Our objective is, therefore, to contribute enriching the available set of resources by taking advantage of reliable lexicographic data and formalizing it with the well-established lexical functions formalism.",
        "The resulting semantic lexicon of French adjectives can be used in NLP tasks such as word sense disambiguation or machine translation.",
        "After presenting related work, we describe the extraction method and the formalization procedure of the data.",
        "Our method is then quantitatively and qualitatively evaluated.",
        "We discuss the results of the evaluation and conclude on some perspectives."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Formalized semantic resources are highly valuable in areas such as NLP, linguistic analysis or language acquisition.",
        "However, creating such resources from scratch is time-consuming and generally yields limited-size lexicons.",
        "Existing lexicographic dictionaries do have a large coverage and present a reliable content.",
        "They lack nevertheless the sufficient formalization.",
        "In this paper, we present a rule-based method to automatically create a large-coverage semantic lexicon of French adjectives by extracting paradigmatic relations from lexicographic definitions using lexico-syntactic patterns.",
        "Formalized adjectival resources are, indeed, scarce for French and they mostly focus on morphological and syntactic information.",
        "Our goal is, therefore, to contribute enriching the available set of resources by taking advantage of reliable lexicographic data and formalizing it with the well-established lexical functions formalism of the Meaning-Text theory (Mel?c?uk, 1996).",
        "The resulting semantic lexicon of French adjectives can be used in NLP tasks such as word sense disambiguation or machine translation1.",
        "In section 2, we present related work.",
        "In section 3, we expose the method used to build the lexicon, i.e. the extraction method and the formalization procedure of the data, and outline the main results.",
        "Finally, in section 4, we present a quantitative evaluation of our method and a qualitative evaluation of our data, and discuss their results.",
        "We conclude on some perspectives for future work."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "It is well established that there are different types of adjectives distinguished by properties, such as gradation and markedness, and by their semantic and syntactic behaviors (antonymy, selectional preferences) (Fellbaum et al., 1993; Raskin and Nirenburg, 1996).",
        "WordNet, for example, distinguishes different types of adjectives according to their semantic and syntactic behaviors: descriptive, reference-modifying, color and relational adjectives (Fellbaum et al., 1993).",
        "However, it mainly accounts for the first and the last types of adjectives.",
        "Descrip",
        "tive adjectives are organized in adjectival synsets that are mostly related through antonymy (heavy?",
        "light); synsets of relational adjectives are linked to a related noun by a pointer (fraternal?brother).",
        "Fellbaum et al. (1993:36) acknowledge the existence of more diverse relations to nominal synsets, but, to our knowledge, these are not accounted for in WordNet.",
        "This limitation is also present in the open access French version of the Princeton WordNet, WOLF (Sagot and Fis?er, 2012).",
        "This limitation has led projects extending WordNet to other languages, like EuroWordNet, ItalWordNet or WordNet.PT, to add a few more relations to account for this diversity (Alonge et al., 2000; Marrafa and Mendes, 2006; Vossen, 2002).",
        "The number of new relations is however limited.",
        "As can be seen, WordNet-type approaches focus on relating adjectival synsets using a few semantic relations, mostly antonymy and plain related to relations.",
        "Our goal is to achieve a finer, and thus richer, semantic characterization of the relations holding between French adjectives and other words from all syntactic categories using the formalism of lexical functions.",
        "We assume that the type of the adjective is reflected in the structure of its lexicographic definition.",
        "Thus, to extract semantically relevant information from adjectival definitions, we propose to create different types of rules accounting for this diversity of defining structures.",
        "Formalized French lexicons contain rather limited adjectival data.",
        "One can cite the morphological lexicon that links French denominal adjectives to the nouns they are derived from (Strnadova` and Sagot, 2011) or the syntactic characterization of French adjectives based on an automatic extraction of subcategorization frames proposed in Kups?c?",
        "(2008).",
        "Our method is meant to complete this set of resources with an adjectival lexicon that is not limited to certain types of adjectives (like descriptive or denominal) nor to morphologically related adjectives, and which provides semantic information."
      ]
    },
    {
      "heading": "3 Method and Results",
      "text": [
        "The method we use to extract formalized semantic information from unformalized lexicographic definitions follows two steps : extracting relations between defined adjectives and elements of their definitions using lexico-syntactic rules (section 3.1) and mapping these relations to regular relations that can be expressed in terms of lexical functions (section 3.2)."
      ]
    },
    {
      "heading": "3.1 Extracting Paradigmatic Relations from Lexicographic Definitions",
      "text": [
        "The dictionary used in this project is the Tre?sor de la langue franc?aise informatise?2 (TLFi).",
        "It is the electronic version of a 100,000 word lexicographic dictionary of 19th and 20th century French, the Tre?sor de la langue franc?aise (Dendien and Pierrel, 2003).",
        "The TLFi contains a total of 13,513 adjectival entries, among which 6,425 entries correspond to mere adjectives and 7,088 to adjectives and other parts of speech (generally nouns)3.",
        "Each of these entries includes one or more definitions, which add up to 44,410 definitions, among which 32,475 are estimated to be adjectival.",
        "This approximation is obtained after filtering out 11,935 non-adjectival definitions from the mixed entries using a lexico-syntactic definition parsing program aimed at detecting nominal definitions.",
        "The remaining definitions are mostly adjectival, with exceptions due to more complex definition structures that are not accounted for by the filtering method.",
        "Table 1 sums up the main figures.",
        "To extract semantically relevant information from adjectival definitions, we use a lexico-syntactic adjectival definition parsing program which uses lexico-syntactic rules that are linearly matched to syntactically annotated adjectival definitions4.",
        "The extraction method consists of the following steps:",
        "that each word is related to a part of speech tag (POS).",
        "(1) RETENU = Qui fait preuve de mode?ration.",
        "(restrained = Who shows moderation.)",
        "Qui/prorel fait/v preuve/nc de/prep mode?ration/nc ./poncts 2.",
        "Second, running the adjectival definition pars",
        "ing program to obtain a triplet composed of the defined adjective (<adj>), a relation (<rel>) and an argument (<arg>), i.e. a word or group of words that is linked by the extracted relation to the defined adjective.",
        "(2) <adj>retenu</adj> <rel>fait preuve de</rel> <arg>mode?ration</arg> A lexico-syntactic rule extracts from a definition the <rel> and <arg> elements.",
        "As can be seen in figure 1, each lexico-syntactic rule is composed of a left-hand side (LHS) containing either a lexical unit (lex), such as qui, or a POS tag (cat) like v (verb), both of which can be optional (op=\"y\"), and a right-hand side (RHS) specifying which elements of the LHS are to be extracted as semantically relevant: a relation (REL) and/or an argument (ARG)5.",
        "In figure 1, the denominal rule 2.2 identifies adjectival definitions corresponding to the lexico-syntactic pattern stated by the LHS of the rule, such as that of the adjective RETENU in example 2 above6.",
        "The LHS contains nine elements, where the first two correspond to lexical items and the remaining ones to POS tags.",
        "Five elements are marked as optional, since a definition may for example start by the formula Qui est (Which/Who is) followed by some verb, or it may directly begin with a verb.",
        "This verb has to be followed by a noun (nc) and a preposition (prep), which may be followed by a determinant and/or an adjective, but which has to be followed by a noun, etc.",
        "The RHS of the rule states that the relation to be extracted corresponds to elements 3, 4 and 5 of",
        "The relation extraction program reads the dictionary definition from the beginning of the sentence checking whether it contains the elements specified in the LHS of the rule.",
        "In case the rule matches the lexico-syntactic elements composing the definition, it outputs the lexical elements of the definition corresponding to the lexical or syntactic information specified in the RHS of the rule in the form REL(ARG)=ADJ, where ADJ stands for the adjective of the dictionary entry.",
        "For instance, applying the rule from figure 1 to the definition of the adjective RETENU returns the relation fait preuve de and the argument mode?ration (example 2).",
        "A total of 109 lexico-syntactic rules have been designed.",
        "These rules cover 76.1 % of the adjectival definitions (24,716/32,475 definitions).",
        "The rules can broadly be grouped into four categories corresponding to different adjectival definition structures.",
        "This categorization is done according to the type of defining information matched by the rules:",
        "1.",
        "The adjective is defined by one or more synonyms.",
        "?",
        "REL = synonymy; ARG = adjective (3) DIAGONAL = Transversal, oblique.",
        "(diago",
        "2.",
        "The adjective is defined by another adjective modified by an adverb.",
        "?",
        "REL = adverb; ARG = adjective (4) KILOME?TRIQUE = Qui est tre`s long, qui n?en finit pas.",
        "(kilometric = Which is very long, never-ending.)",
        "?",
        "tre`s(long) = KILOME?TRIQUE (very(long) = kilometric) 3.",
        "The adjective is defined by a relation to a property of the thing denoted by the modified noun.",
        "The argument of this complex REL consists of a noun phrase (NP), a verbal phrase (VP) or an adjective (ADJ).",
        "?",
        "REL = relation + property; ARG = NP/VP/ADJ (5) AGRE?GATIF = Qui a la faculte?",
        "d?agre?ger.",
        "(aggregative = Which has the power to aggregate.)",
        "?",
        "a la faculte?",
        "de(agre?ger) = AGRE?GATIF (has power to(aggregate) = aggregative) VERSICOLORE = Dont la couleur est changeante.",
        "(versicolor = Which color is changing.)",
        "?",
        "dont la couleur est(changeante) = VERSICOLORE (which color is(changing) = versicolor) 4.",
        "The adjective is defined by a relation having as argument a noun phrase, a verbal phrase or an adjective.",
        "?",
        "REL = relation; ARG = NP/VP/ADJ (6) ACADE?MIQUE = Qui manque d?originalite?, de force; conventionnel.",
        "(academic = Which lacks originality, strength; conven",
        "qui ne peut e?tre de?compose?",
        "en ses e?le?ments distinctifs.",
        "(unanalyzable = Which cannot be analyzed, which cannot be decompozed in its distinctive elements.)",
        "The rules extract a total of 5,284 different relation types in the form (REL, ARG), where REL is a lexicalized expression and ARG a phrasal type, as illustrated in example (7).",
        "(capable de, VPinf) (capable of, VPinf ) (constitue?",
        "de, NP) (constituted by, NP) (couvert de, NP) (covered with, NP) (fonde?",
        "sur, NP) (founded on, NP) (peu, ADJ) (not very, ADJ) (propre a`, NP) (particular to, NP) (propre a`, VPinf) (capable of, VPinf ) (relatif a`, NP) (relating to, NP) One can note that the lexicalized relation is sometimes followed by different phrasal types, as can be seen for propre a` in example (7).",
        "In those cases, each (REL, ARG) pair is considered as a distinct relation type."
      ]
    },
    {
      "heading": "3.2 Formalizing Paradigmatic Relations with Lexical Functions",
      "text": [
        "Lexical functions (LF) are a formal tool designed to describe all types of genuine lexical relations (paradigmatic and syntactic ones) between lexical units of any language (Mel?c?uk, 1996).",
        "Some of the standard lexical functions that often return adjectival values are briefly presented below: ?",
        "A0 ?",
        "This paradigmatic lexical function returns the adjective that semantically corresponds to the argu",
        "?",
        "A1/A2 ?",
        "These paradigmatic lexical functions return the adjectives that typically characterize, respectively, the first and second argument of the predicate given as argument to the functions.",
        "This predicate can be nominal, adjectival or verbal.",
        "For example, given that the nominal predicate DE?CEPTION (disappointment) has two arguments, the person that is disappointed and the reason of the disappointment, function A1 applied to DE?CEPTION returns the adjective DE?C?U (disappointed), while function A2 returns DE?CEVANT (disappointing).",
        "?",
        "Able1/Able2 ?",
        "Closely related to A1 and A2, these functions return the adjective that means that the first (Able1) or the second (Able2) argument of the predicate P ?might P or is likely to P?",
        "(whereas",
        "the predicate.",
        "This intensificator can modify the argument, as in heavy rain (Magn expresses then a syntagmatic relation), or can be another adjective that intensifies the meaning of the argument (Magn expresses then a paradigmatic relation).",
        "E.g.",
        "?",
        "AntiA1 ?",
        "This complex lexical function returns the adjective that means that the first argument of the predicate P ?is not P (anymore)?.",
        "E.g. An",
        "We use this formalism to describe the paradigmatic relations between adjectives and the arguments extracted in the previous step.",
        "These relations are formulated in a non-systematic way in the TLFi's definitions.",
        "Definitions in traditional dictionaries are written in natural language and, thus, are not formal enough to be used as such, for example, in NLP tasks.",
        "In order to formalize the lexicon, a mapping is done between lexical functions describing paradigmatic relations and the different ways of expressing these relations in the TLFi's definitions (see relation types in example 7), as illustrated in table 2.",
        "This REL-LF mapping covers 67.3 % of the extracted relations (16,646/24,716 extracted relations).",
        "Table 3 shows the complete list of lexical functions used in our lexicon and their distribution: the three lexical functions A0, A1 and QSyn represent around 90 % of the relations."
      ]
    },
    {
      "heading": "4 Evaluation",
      "text": [
        "The method and the data have been evaluated in two ways.",
        "The method has first been evaluated by comparing our data to an external resource, the Dic-tionnaire de combinatoire8 (DiCo), a French lex",
        "icographic dictionary describing words with their paradigmatic and syntagmatic relations expressed in the LF formalism.",
        "In this first evaluation, we determine the performance of the method by quantifying the number of reference elements from the DiCo that can be extracted from the TLFi with our rules (section 4.1).",
        "Since relations involving adjectives are scarce in the DiCo, our data has then been qualitatively evaluated by an expert familiar with the formalism of lexical functions9 (section 4.2).",
        "The expert evaluates the relevance of the argument and the adequacy of the proposed lexical function to describe the relation between the defined adjective and the argument."
      ]
    },
    {
      "heading": "4.1 Comparison With the DiCo Data",
      "text": [
        "The first evaluation procedure is meant to measure the performance of the extraction program against an existing resource.",
        "The reference is constituted by selecting 240 triplets in the form LF(ARG)=ADJ from the DiCo.",
        "An automatic evaluation script compares these reference triplets with the hypothesized triplets extracted from the TLFi.",
        "The system catego",
        "rizes the reference triplets in one of three large categories explained below: ?Impossible?, ?Yes?",
        "and ?No?, the latter ones indicating whether the method allows to extract the reference triplets from the TLFi or not.",
        "In the ?No?",
        "cases, the evaluation system subcategorizes the reference triplet according to a possible explanation of the failure of the extraction method.",
        "1.",
        "IMPOSSIBLE (42.9 %, 103/240 triplets) Cases where the reference triplets cannot be used as an evaluation reference because either the adjective of the reference is absent from the TLFi dictionary (5 %, 12/240 triplets, example 8) or the reference argument is absent from the definition(s) of the corresponding adjective in the TLFi (37.9 %, 91/240 triplets, example 9).",
        "The adjective philanthrope (philanthropic) does not have an entry in the TLFi.",
        "In this example, the argument richesse (wealth) does not exist in any of the 15 definitions of riche (rich) in the TLFi.",
        "2.",
        "YES (20.4 %, 49/240 triplets) (a) Total matches: these cases correspond to the intersection of the two resources, i.e. cases where the triplets are identical on both sides (16.3 %, 39/240 triplets).",
        "tives and LFs are identical on both sides and where the reference argument is included in the hypothesis argument (4.2 %,",
        "the TLFi but absent from the set of hypothesis adjectives.",
        "These cases can be explained by the fact that the extraction rules did not match a definition in the TLFi or by the fact that no LF has been mapped to the lexical relation that was extracted from the TLFi definitions (13.8 %,",
        "(b) Cases where the adjective and the argu",
        "ment of the reference and of the hypothesis are identical or where the arguments match partially, but the LFs are different (11.3 %, 27/240 triplets, example 13).",
        "This divergence might indicate an erroneous mapping between the extracted lexicalized relation and the LF.",
        "It could also be explained by the possibility of describing the same pair of ADJ-ARG with two different LFs.",
        "(c) Cases where the extraction rule outputs",
        "an ill-formed hypothesis argument resulting from some problem in the extraction rule (example 14), or where the hypothesis triplet is not erroneous as such but corresponds to a new triplet-variant for a particular adjective (example 15) (11.7 %,",
        "28/240 triplets).",
        "(14) DiCo-reference A0(sucre) = sucrier (A0(sugar) = sugar (nominal adjective))",
        "production, a` la fabrication du sucre.",
        "(sugar (adj.)",
        "= Related to the production, the manufacture of sugar.)",
        "In example 14, the TLFi definition for sucrier contains the reference argument sucre, but the extraction rule did not match the right string, resulting in an ill-formed hypothesis argument.",
        "In example 15, the hypothesis argument extracted by the rule is well-formed but does not correspond to the reference argument.",
        "The hypothesis triplet can thus be considered as a new variant for the adjective enthousiaste (enthusiastic).",
        "The most significant results of the first evaluation are synthesized in table 4.",
        "Note that the reference does not cover every relation type that has been taken into account in our lexicon: among the 15 relation types listed in table 3 above, only ten are present in the DiCo resource and six illustrated in",
        "If the reference triplets marked ?Impossible?",
        "(Imp.)",
        "are excluded, this evaluation shows that the simple rule-based system proposed to extract semantically relevant information from lexicographic definitions of adjectives covers 35.8 % of the 137 reference triplets that can be used for the evaluation.",
        "The analysis of the 88 ?No?",
        "cases shows that most of the problems are due to insufficient rule-coverage and/or REL-LF mapping (37.5 %, 33/88).",
        "This figure could be reduced by further analyzing the definitions that are not accounted for by the rules in order to add more rules, and by mapping more lexicalized relations to LFs.",
        "The latter solution might, however, prove difficult due to the high frequency of reduced-or single-occurrence relations extracted.",
        "30.7 % (27/88) of the ?No?",
        "cases correspond to a difference in LFs and 31.8 % (28/88) to either ill-formed arguments or to new variant-triplets.",
        "A manual check of the 53 hypothesis triplets extracted for the 28 adjectives of the latter types of cases shows that in only 12 cases the hypothesis arguments are ill-formed (corresponding to 6/28 reference triplets); the rest corresponds to, a priori, acceptable arguments, i.e. to new triplet variants (41/53 cases), although a few of them are technically speaking ill-formed.",
        "Therefore, most of the remaining 55.7 % (49/88) ?No?",
        "cases should be qualitatively evaluated.",
        "These mitigated quantitative results have to be put in perspective.",
        "The first evaluation was meant to test the performance of the extraction rules against data from an existing resource, but, as the figures show, the vast majority of the reference triplets cannot be tested.",
        "This quantitative evaluation thus highlights the difficulty of using existing resources for this kind of task (particularly when such resources are scarce).",
        "Moreover, it proves insufficient to measure the actual performance of the rules.",
        "Two types of cases are indeed unaccounted for: first, there might be many correct hypothesis triplets that are not in the reference, since there is a huge discrepancy in the number of triplets between the reference and the hypotheses; second, the hypothesis triplets that don't match to the reference might still be correct.",
        "Therefore, other qualitative evaluation methods have to be used."
      ]
    },
    {
      "heading": "4.2 Evaluation by an LF Expert",
      "text": [
        "An expert of the LF formalism has evaluated the quality of 150 triplets taken from the 16,646 LF(ARG)=ADJ triplets of the lexicon.",
        "First, he evaluated the argument (0 for a wrong argument, 1 for a valid argument) and, when he judged that the argument was correct, he evaluated the LF: 2 for a good",
        "LF, 1 for a partially satisfying LF and 0 for an invalid LF.",
        "To sum up, four configurations are possible: ?",
        "Case 1 ?",
        "ARG:0 E.g. A2(converti-converted) = AGATISE?-agatized The expert considers that the argument is invalid.",
        "Indeed, AGATISE?",
        "means converted into an agate but the program extracted converted as an argument instead of agate.",
        "?",
        "Case 2 ?",
        "ARG:1 LF:0 E.g. Able1(admiration) = ADMIRABLE The expert considers that the argument is valid but the LF is not the right one: the adjective ADMIRABLE characterizes the second argument of admiration and not the first one.",
        "The correct LF should therefore be Able2.",
        "The expert considers that the argument is valid but the LF is incomplete: it is true that the adjective AHURI qualifies the first argument of confusion but, more precisely, it conveys information on the manifestation of the emotion.",
        "So a more precise LF should be A1-Manif.",
        "The expert considers that the argument and the LF are valid since AFFOLE?",
        "indeed means very upset.",
        "Table 5 shows the results of the qualitative evaluation of lexical functions.",
        "Cases 3 and 4 are considered to be accurate.",
        "Case 1 Case 2 Case 3 Case 4 Total Accuracy",
        "When confronted to cases 2 and 3, the expert was invited to give the correct LF.",
        "This information will be processed in order to improve the matching between relations extracted from the TLFi and appropriate lexical functions."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "In this article, we presented a rule-based method to automatically extract paradigmatic relations from lexicographic definitions of adjectives using lexico-syntactic patterns.",
        "This method was completed with a manual mapping of the most frequently extracted lexicalized relations (which are quite heterogenous) to formal lexical functions.",
        "Our goal is to automatically create a formalized semantic lexicon of French adjectives that would be complementary to the few existing adjectival resources that can be used, for instance, in NLP tasks.",
        "The adjectival lexicon, in which each adjective is related by a lexical function to an NP/VP/adjectival/adverbial argument, was quantitatively and qualitatively evaluated.",
        "The first evaluation, entirely automatic, was aimed at testing the performance of the method.",
        "It yielded rather inconclusive results mainly due to the scarcity of the external data available for the task.",
        "A thorough analysis of the different types of ?errors?",
        "showed that the number of ?technical problems?",
        "can be reduced by refining the extraction rules, by adding more of them, and by completing the mapping of extracted relations to LFs.",
        "It also highlighted the necessity to evaluate the method qualitatively.",
        "The second evaluation was, thus, aimed at rating the acceptability of the extracted relations.",
        "It was realized by an expert of the lexical functions formalism and gave good results, with a precision of around 70 %.",
        "The automatically created adjectival lexicon presented in this paper can be easily extended by a straightforward inversion of the LF(ARG)=ADJ triplets.",
        "The resulting triplets would either complete existing lexical entries if integrated into a similarly encoded nominal and verbal lexicon, or constitute new entries in the adjectival lexicon, thus extending the syntactic categories represented in the lexicon.",
        "The LF formalism could also be used to further enrich adjectival entries by making automatic inferences between adjective-argument pairs and their respective synonyms.",
        "E.g. infer A0(kitty)=feline from A0(cat)=feline and syn(cat)=kitty.",
        "Finally, mapping LFs with the existing relations in WordNet could allow to integrate this adjectival lexicon to the French WOLF."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This work has been funded by the French Agence Nationale pour la Recherche, through the project EDYLEX (ANR-08-CORD-009)."
      ]
    }
  ]
}
