{
  "info": {
    "authors": [
      "Ashwin Ittoo",
      "Gosse Bouma"
    ],
    "book": "ACL",
    "id": "acl-P10-1135",
    "title": "On Learning Subtypes of the Part-Whole Relation: Do Not Mix Your Seeds",
    "url": "https://aclweb.org/anthology/P10-1135",
    "year": 2010
  },
  "references": [
    "acl-C92-2082",
    "acl-H93-1061",
    "acl-J06-1005",
    "acl-J90-1003",
    "acl-J93-1003",
    "acl-N03-1011",
    "acl-P03-1054",
    "acl-P06-1015",
    "acl-P09-1045",
    "acl-P99-1008",
    "acl-W09-1301"
  ],
  "sections": [
    {
      "text": [
        "On Learning Subtypes of the Part-Whole Relation: Do Not Mix your",
        "Seeds",
        "Ashwin Ittoo Gosse Bouma",
        "Groningen, The Netherlands Groningen, The Netherlands",
        "r.a.ittoo@rug.nl g.bouma@rug.nl",
        "An important relation in information extraction is the part-whole relation.",
        "Ontological studies mention several types of this relation.",
        "In this paper, we show that the traditional practice of initializing minimally-supervised algorithms with a single set that mixes seeds of different types fails to capture the wide variety of part-whole patterns and tuples.",
        "The results obtained with mixed seeds ultimately converge to one of the part-whole relation types.",
        "We also demonstrate that all the different types of part-whole relations can still be discovered, regardless of the type characterized by the initializing seeds.",
        "We performed our experiments with a state-of-the-art information extraction algorithm."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "A fundamental semantic relation in many disciplines such as linguistics, cognitive science, and conceptual modelling is the part-whole relation, which exists between parts and the wholes they compise (Winston et al., 1987; Gerstl and Pribbenow, 1995).",
        "Different types of part-whole relations, classified in various taxonomies, are mentioned in literature (Winston et al., 1987; Odell, 1994; Gerstl and Pribbenow, 1995; Keet and Artale, 2008).",
        "The taxonomy of Keet and Artale (2008), for instance, distinguishes part-whole relations based on their transitivity, and on the semantic classes of entities they sub-categorize.",
        "Part-whole relations are also crucial for many information extraction (ie) tasks (Girju et al., 2006).",
        "Annotated corpora and semantic dictionaries used in ie, such as the ace corpus and WordNet (Fellbaum, 1998), include examples of part-whole relations.",
        "Also, previous relation extraction work, such as Berland and Charniak (1999) and Girju et al.",
        "(2006), have specifically targeted the discovery of part-whole relations from text.",
        "Furthermore, part-whole relations are de-facto benchmarks for evaluating the performance of general relation extraction systems (Pantel and Pennacchiotti, 2006;",
        "Beamer et al., 2008; Pyysalo et al., 2009).",
        "However, these relation extraction efforts have overlooked the ontological distinctions between the different types of part-whole relations.",
        "They assume the existence of a single relation, subsuming the different part-whole relation types.",
        "In this paper, we show that enforcing the ontological distinctions between the different types of part-whole relations enable information extraction systems to capture a wider variety of both generic and specialised part-whole lexico-syntactic patterns and tuples.",
        "Specifically, we address 3 major questions.",
        "1.",
        "Is information extraction (ie) harder when learning the individual types of part-whole relations?",
        "That is, we determine whether the performance of state-of-the-art ie systems in learning the individual part-whole relation types increases (due to more coherency in the relations' linguistic realizations) or drops (due to fewer examples), compared to the traditional practice of considering a single part-whole relation.",
        "2.",
        "Are the patterns and tuples discovered when focusing on a specific part-whole relation type confined to that particular type?",
        "That is, we investgate whether ie systems discover examples representative of the different types by targetting one particular part-whole relation type.",
        "3.",
        "Are more distinct examples discovered when ie systems learn the individual part-whole relation types?",
        "That is, we determine whether a wider variety of unique patterns and tuples are extracted when ie systems target the different types of part-whole relations instead of considering a single part-whole relation that subsumes all the different types.",
        "To answer these questions, we bootstrapped a minimally-supervised relation extraction algorithm, based on Espresso (Pantel and Pennac-chiotti, 2006), with different seed-sets for the various types of part-whole relations, and analyzed the harvested tuples and patterns."
      ]
    },
    {
      "heading": "2. Previous Work",
      "text": [
        "Investigations on the part-whole relations span across many disciplines, such as conceptual modeling (Artale et al., 1996; Keet, 2006; Keet and Artale, 2008), which focus on the ontological aspects, and linguistics and cognitive sciences, which focus on natural language semantics.",
        "Several linguistically-motivated taxonomies (Odell, 1994; Gerstl and Pribbenow, 1995), based on the work of Winston et al.",
        "(1987), have been proposed to clarify the semantics of the different part-whole relations types across these various disciplines.",
        "Keet and Artale (2008) developed a formal taxonomy, distinguishing transitive mereological part-whole relations from intransitive meronymic ones.",
        "Meronymic relations identified are: 1) member-of, between a physical object (or role) and an aggregation, e.g. player-team, 2) constituted-of, between a physical object and an amount of matter e.g. clay-statue, 3) sub-quantity-of, between amounts of matter or units, e.g. oxygen-water or m-km, and 4)participates-in, between an entity and a process e.g. enzyme-reaction.",
        "Mereologi-cal relations are: 1)involved-in, between a phase and a process, e.g. chewing-eating, 2) located-in, between an entity and its 2-dimensional region, e.g. city-region, 3)contained-in, between an entity and its 3-dimensional region, e.g.tool-trunk, and 4)structural part-of, between integrals and their (functional) components, e.g. engine-car.",
        "This taxonomy further discriminates between part-whole relation types by enforcing semantical selectional restrictions, in the form of dolce ontology (Gangemi et al., 2002) classes, on their entities.",
        "In nlp, information extraction (ie) techniques, for discovering part-whole relations from text have also been developed.",
        "Berland and Charniak (1999) use manually-crafted patterns, similar to Hearst (1992), and on initial \"seeds\" denoting \"whole\" objects (e.g. building) to harvest possible \"part\" objects (e.g. room) from the North Americal News Corpus (NANC) of 1 million words.",
        "They rank their results with measures like log-likelihood (Dunning, 1993), and report a maximum accuracy of 70% over their top-20 results.",
        "In the supervised approaches in Girju et al.",
        "(2003) and Girju et al.",
        "(2006), lexical patterns expressing part-whole relations between WordNet concept pairs are manually extracted from 20,000 sentences of the L.A Times and SemCor corpora (Miller et al., 1993), and used to generate a training corpus, with manually-annotated positive and negative examples of part-whole relations.",
        "Classification rules, induced over the training data, achieve a precision of 80.95% and recall of 75.91% in predicting whether an unseen pattern encode a part-whole relation.",
        "Van Hage et al.",
        "(2006) acquire 503 part-whole pairs from dedicated thesauri (e.g. agrovoc) to learn 91 reliable part-whole patterns.",
        "They substituted the patterns' \"part\" arguments with known entities to formulate web-search queries.",
        "Corresponding \"whole\" entities were then discovered from documents in the query results with a precision of 74%.",
        "The part-whole relation is also a benchmark to evaluate the performance of general information extraction systems.",
        "The Espresso algorithm (Pantel and Pennacchiotti, 2006) achieves a precision of 80% in learning part-whole relations from the Acquaint (TREC-9) corpus of nearly 6M words.",
        "Despite the reasonable performance of the above ie systems in discovering part-whole relations, they overlook the ontological distinctions between the different relation types.",
        "For example, Girju et al.",
        "(2003) and Girju et al.",
        "(2006) assume a single part-whole relation, encompassing all the different types mentioned in the taxonomy of Winston et al.",
        "(1987).",
        "Similarly, the minimally-supervised Espresso algorithm (Pantel and Pennacchiotti, 2006) is initialized with a single set that mixes seeds of heterogeneous types, such as leader-panel and oxygen-water, which respectively correspond to the member-ofand sub-quantity-ofrelations in the taxonomy of Keet and Artale (2008).",
        "http://aims.fao.org/website/ AGROVOC-Thesaurus/sub"
      ]
    },
    {
      "heading": "3. Methodology",
      "text": [
        "Our aim is to compare the relations harvested when a minimally-supervised ie algorithm is initialized with separate sets of seeds for each type of part-whole relation, and when it is initialized following the traditional practice of a single set that mixes seeds of the different types.",
        "To distinguish between types of part-whole relations, we commit to the taxonomy of Keet and Artale ( 008) (Keet's taxonomy), which uses sound ontological formalisms to unambiguously discrimate the relation types.",
        "Also, this taxonomy classifies the various part-whole relations introduced in literature, including ontologically-motivated mereological relations and linguistically-motivated meronymic ones.",
        "We adopt a 3-step approach to address our questions from section 1."
      ]
    },
    {
      "heading": "1.. Define prototypical seeds (part-whole tuples) as follows:",
      "text": [
        "• (Separate) sets of seeds for each type of part-whole relation in Keet's taxonomy.",
        "• A single set that mixes seeds denoting all the different part-whole relations types.",
        "2.",
        "Part-whole relations extraction from a corpus by initializing a minimally-supervised ie algorithm with the seed-sets",
        "3.",
        "Evaluation of the harvested relations to determine performance gain/loss, types of part-whole relations extracted, and distinct and unique patterns and tuples discovered.",
        "The corpora and ie algorithm we used, and the seed-sets construction are described below.",
        "Results are presented in the next section.",
        "We used the English and Dutch Wikipedia texts since their broad-coverage and size ensures that they include sufficient lexical realizations of the different types of part-whole relations.",
        "Wikipedia has also been targeted by recent ie efforts (Nguyen et al., 2007; Wu and Weld, 2007).",
        "However, while they exploited the structured features (e.g. in-foboxes), we only consider the unstructured texts.",
        "The English corpus size is approximately 470M words (~ 80% of the August 2007 dump), while for Dutch, we use the full text collection (February 2008 dump) of approximately 110M words.",
        "We parsed the English and Dutch corpora respectively with the Stanford (Klein and Manning, 2003) and the Alpino (van Noord, 2006) parsers, and formalized the relations between terms (entities) as dependency paths.",
        "A dependency path is the shortest path of lexico-syntactic elements, i.e. shortest lexico-syntactic pattern, connecting entities (proper and common nouns) in their parse-trees.",
        "Such a formalization has been successfully employed in previous ie tasks (see Stevenson and Greenwood (2009) for an overview).",
        "Compared to traditional surface-pattern representations, used by Pantel and Pennacchiotti (2006), dependency paths abstract from surface texts to capture long range dependencies between terms.",
        "They also alleviate the manual authoring of large numbers of surface patterns.",
        "In our formalization, we substitute entities in the dependency paths with generic placeholders part and whole.",
        "Below, we show two dependency paths (1-b) and (2-b), respectively derived from English and Dutch Wikipedia sentences (1-a) and (2-a), and denoting the relations between sample-song, and alkaloïde-plant.",
        "(1) a.",
        "The song \"Mao Tse Tung Said\" by Alabama 3 contains samples of a speech by Jim Jones b. whole+nsubj – contains – dobj+part",
        "(2) a. Alle delen van de planten bevatten al-kaloiden en zijn daarmee giftig (All parts of the plants contain alkaloids and therefore are poisonous)",
        "b. whole+obj1+van+mod+deel+su – bevat – obj1+part",
        "In our experiments, we only consider those entity pairs (tuples), patterns, and co-occuring pairs-patterns with a minimum frequency of 10 in the English corpus, and 5 in the Dutch corpus.",
        "Statistics on the number of tuples and patterns preserved after applying the frequency cut-off are given in",
        "Table 1.",
        "As ie algorithm for extracting part-whole relations from our texts, we relied on Espresso, a minimally-supervised algorithm, as described by Pantel and Pennacchiotti (2006).",
        "They show",
        "http://nlp.stanford.edu/software/ lex-parser.shtml",
        "that the algorithm achieves state-of-the-art performance when initialized with relatively small seed-sets over the Acquaint corpus (~ 6M words).",
        "Recall is improved with web search queries as additional source of information.",
        "Espresso extracts surface patterns connecting the seeds (tuples) in a corpus.",
        "The reliability of a pattern p, r(p), given a set of input tuples I, is computed using ( ), as its average strength of association with each tuple,i, weighted by each tuple's reliability, r1(i).",
        "In this equation, pmi(i,p) is the pointwise mutual information score (Church and Hanks, 1990) between a pattern, p (e.g. consist-of), and a tuple, i (e.g. engine-car), and maxpmi is the maximum PMI score between all patterns and tuples.",
        "The reliability of the initializing seeds is set to 1.",
        "The top-k most reliable patterns are selected to find new tuples.",
        "The reliability of each tuple i, rt(i) is computed according to (4), where P is the set of harvested patterns.",
        "The top-m most reliable tuples are used to infer new patterns.",
        "The recursive discovery of patterns from tuples and vice-versa is repeated until a threshold number of patterns and/or tuples have been extracted.",
        "In our implementation, we maintain the core of the original Espresso algorithm, which pertains to estimating the reliability of patterns and tuples.",
        "Pantel and Pennacchiotti (2006) mention that their method is independent of the way patterns are formulated.",
        "Thus, instead ofrelying on surface patterns, we use dependency paths (as described above).",
        "Another difference is that while Pantel and Pennacchiotti (2006) complement their small corpus with documents retrieved from the web, we only rely on patterns extracted from our (much larger) corpora.",
        "Finally, we did not apply the discounting factor suggested in Pantel and Pennac-chiotti (2006) to correct for the fact that PMI overestimates the importance of low-frequency events.",
        "Instead, as explained above, we applied a general frequency cut-off.",
        "Initially,we selected seeds from WordNet (Fellbaum, 1998) (for English) and EuroWordNet (Vossen, 1998) (for Dutch) to initialize the IE algorithm.",
        "However, we found that these pairs, such as acinos-mother ofthyme or radarscherm-radarapparatuur (radar screen - radar equipment, hardly co-occured with reasonable frequency in Wikipedia sentences, hindering pattern extraction.",
        "We therefore adopted the following strategy.",
        "We searched our corpora for archetypal patterns, e.g. contain , which characterize all the different types of part-whole relations.",
        "The tuples sub-categorized by these patterns in the English texts were automatically typed to appropriate DOLCE ontology classes, corresponding to those employed by Keet and Artale for constraining the entity pairs participating in different types of part-whole relations.",
        "The types of part-whole relations instantiated by the tuples could then be determined based on their ontological classes.",
        "Separate sets of 20 tuples, with each set corresponding to a specific relation type in the taxonomy of Keet and Artale (Keet's taxonomy), were then created.",
        "For example, the English Wikipedia tuple tl =actor-cast was used as a seed to discover member-ofpart-whole relations since both its elements were typed to the Social Object class of the dolce ontology, and according to Keet's taxonomy, they instantiate a member-ofrelation.",
        "Seeds for extracting relations from the Dutch corpus were defined in a similar way, except that we manually determined their ontological classes based on the class glossary of DOLCE.",
        "Below, we only report on the member-ofand sub-quantity-ofmeronymic relations, and on the located-in, contained-in and structural part-of mereological relations.",
        "We were unable to find sufficient seeds for the constituted-of meronymic",
        "English",
        "Dutch",
        "words",
        "470.0",
        "110.0",
        "pairs",
        "28.0",
        "28.8",
        "unique pairs",
        "6.7",
        "1.4",
        "patterns",
        "2 8.0",
        "54.0",
        "unique patterns",
        "2.0",
        "0.9",
        "Table 2: Seeds used for learning part-whole relations (contained-in, located-in, member-of, structural part-of, sub-quantity-of).",
        "relations (e.g. clay-statue).",
        "Also, we did not experiment with the participates-in and involved-in relations since their lexical realizations in our corpora are sparse, and they contain at least one verbal argument, whereas we only targeted patterns connecting nomimals.",
        "Sample seeds, their corpus frequency, and the part-whole relation type they instantiate from the English (en) and Dutch (nl) corpora are illustrated in Table 2.",
        "Besides the five specialized seed-sets of 20 prototypical tuples for the aforementioned relations, we also defined a general set of mixed seeds, which combines four seeds from each of the specialized sets."
      ]
    },
    {
      "heading": "4. Experiments and Evaluation",
      "text": [
        "We initialized our ie algorithm with the seed-sets to extract part-whole relations from our corpora.",
        "The same parameters as Pantel and Pennacchiotti (2006) were used.",
        "That is, the 10 most reliable patterns inferred from the initial seeds are bootstrapped to induce 100 part-whole tuples.",
        "In each subsequent iteration, we learn one additional pattern and 100 additional tuples.",
        "We evaluated our results after 5 iterations since the performance in later iterations was almost constant.",
        "The results are discussed next.",
        "Table 3: Precision for seed-sets representing specific types of part-whole relations (member-of, sub-quantity-of, contained-in, structural part-of and located-in), and for the general set composed of all types.",
        "Two human judges manually evaluated the tuples extracted from the English and Dutch corpora per seed-set in each iteration of our algorithm.",
        "Tuples that unambiguously instantiated part-whole relations were considered true positives.",
        "Those that did not were considered false positives.",
        "Ambiguous tuples were discarded.",
        "The precision of the tuples discovered by the different seed-sets in the last iteration of our algorithm are in Table 3.",
        "These results reveal that the precision of harvested tuples varies depending on the part-whole relation type that the initializing seeds denote.",
        "Mereological seeds (cont, struct, locat sets) outperformed their meronymic counterparts (memb, subq) in extracting relations with higher precision from the English texts.",
        "This could be attributed to their formal ontological grounding, making them less ambiguous than the linguistically-motivated meronymic relations (Keet, 2006; Keet and Artale, 2008).",
        "The precision variations were less discernible for tuples extracted from the Dutch corpus, although the best precision was still achieved with mereological located-in seeds.",
        "We also noticed that the precision of tuples extracted from both the English and Dutch corpora by the general set of mixed seeds was as high as the maximum precision obtained by the individual sets of specialized seeds over these two corpora, i.e. 0.80 (general seeds) vs. 0.82 (structural part-ofseeds) for English, and 0.71 (general seeds) vs. 0.70 (located-in seeds) for Dutch.",
        "Based on these findings, we address our first question, and conclude that 1) the type of relation instantiated by the initializing seeds affects the performance of ie algorithms, with mereological seeds being in general more fertile than their meronymic counterparts, and generating higher-precision tuples; 2) the precision achieved when initializing ie algorithms with a general set, which mixes seeds of heterogeneous part-whole relation types, is comparable to the best results obtained with individual sets of specialized seeds, denoting specific part-whole relations.",
        "An evaluation of the patterns and tuples extracted indicated considerable precision drop between successive iterations of our algorithm.",
        "This appears to be due to semantic drift (McIntosh and Curran, 2009), where highly-ambiguous patterns promote incorrect tuples , which in turn, compound the precision loss.",
        "Lg",
        "Part",
        "Whole",
        "#",
        "Type",
        "en",
        "grave",
        "church",
        "155",
        "contain",
        "nl",
        "beeld",
        "kerk",
        "120",
        "contain",
        "(statue)",
        "(church)",
        "en",
        "city",
        "region",
        "3735",
        "located",
        "nl",
        "abdij",
        "gemeente",
        "36",
        "located",
        "(abbey)",
        "(community)",
        "en",
        "actor",
        "cast",
        "432",
        "member",
        "nl",
        "club",
        "voetbaLbond",
        "178",
        "member",
        "(club)",
        "(soccer union)",
        "en",
        "engine",
        "car",
        "3509",
        "structural",
        "nl",
        "geheugen computer",
        "14",
        "structural",
        "(memory) (computer)",
        "en",
        "alcohol",
        "wine",
        "260",
        "subquant",
        "nl",
        "alcohol",
        "bier",
        "28",
        "subquant",
        "(alcohol) (beer)",
        "meronomic",
        "mereological",
        "memb subq",
        "cont struc locat",
        "gen",
        "en",
        "0.67 0.74",
        "0.70 0.82 0.75",
        "0.80",
        "nl",
        "0.68 0.60",
        "0.60 0.60 0.70",
        "0.71",
        "Initializing our algorithm with seeds of a particular type always led to the discovery of tuples characterizing other types of part-whole relations in the English corpus.",
        "This can be explained by prototypical patterns, e.g. \"include\", generated regardless of the seeds' types, and which are highy correlated with, and hence, trigger tuples denoting other part-whole relation types.",
        "An almost similar observation was made for the Dutch corpus, except that tuples instantiating the member-ofre-lation could only be learnt using initial seeds of that particular type (i.e. member-of).",
        "Upon inspecting our results, it was found that this phenomenon was due to the distinct and specific patterns, such as \"treedt toe tot\" (\"become member of\"), which linguistically realize the member-ofre-lations in the Dutch corpus.",
        "Thus, initializing our ie algorithm with seeds that instantiate relations other than member-offails to detect these unique patterns, and fails to subsequently discover part-whole tuples describing the member-ofrelations.",
        "Our findings are illustrated in Table 4, where each cell lists a tuple of a particular type (column), which was harvested from seeds of a given type (row).",
        "These results answer our second question.",
        "We address our third question by comparing the output of our algorithm to determine whether the results obtained by initializing with the individual specialized seeds were (dis)similar and/or distinct.",
        "Each result set consisted of maximally 520 tuples (including 20 initializing seeds) and 15 lexico-syntactic patterns, obtained after five iterations.",
        "Tuples extracted from the English corpus using the member-ofand contained-in seed-sets exhibited a high degree of similarity, with 465 common tuples discovered by both sets.",
        "These identical tuples were also assigned the same ranks (reliability) in the results generated by the member ofand contained-in seeds, with a Spearman rank correlation of 0.82 between their respective outputs.",
        "This convergence was also reflected in the fact that the member-of and contained-in seeds generated around 80% of common patterns.",
        "These patterns were mostly prototypical ones indicative of part-whole relations, such as whole+nsubj – include – dobj+part (\"include\") and their cognates involving passive forms and relative clauses.",
        "However, the specialized seeds also generated distinct patterns, like \"joined as\" and \"released with\" for the member-ofand contained-in seeds respectively.",
        "The most distinct tuples and patterns were harvested with the sub-quantity-of, structural part-of, and located-in seeds.",
        "Negative Spearman correlation scores were obtained when comparing the results of these three sets among themselves, and with the results of the member-ofand contained-in seeds, indicating insignificant similarity and overlap.",
        "Examining the patterns harvested by the sub-quantity-of, structural part-of, and located-in seeds revealed a high prominence of specialized and unique patterns, which specifically characterize these relations.",
        "Examples of such patterns include \"made with\", \"released with\" and \"found in\", which lexically realize the sub-quantity-of, structural part-of, and located-in relations respectively.",
        "For the Dutch corpus, the seeds that generated the most similar tuples were those corresponding to the sub-quantity-of, contained-in, and structural part-ofrelations, with 490 common tuples discovered, and a Spearman rank correlation in the range of 0.89-0.93 between their respective outputs.",
        "As expected, these seeds also led to the discovery of a substantial number of common and prototypical part-whole patterns.",
        "Examples include \"bevat\" (\"contain\"), \"omvat\" (\"comprise\"), and their variants.",
        "The most distinct results were harvested by the located-in and member-ofseeds, with negative Spearman correlation scores between the output tuples indicating hardly any overlap.",
        "We also found out that the patterns harvested by the located-in and member-ofseeds characteristically pertained to these relations.",
        "Example of such patterns include \"ligt in\" (\"lie in\"), \"is gelegen in\" (\"is located in\"), and \"treedt toe tot\" (\"become member of\"), respectively describing the located-in and member-ofrelations.",
        "Thus, we observed that 1) tuples harvested from both the English and Dutch corpora by seeds instantiating a single particular type of part-whole relation highly correlated with tuples discovered by at least one other type of seeds (member-of and contained-in for English, and sub-quantity-of, contained-in and structural part-of for Dutch); 2) some part-whole relations are manifested by a wide variety of specialized patterns (sub-quantity-of, structural part-of, and located-in for English, and located-in and member-offor Dutch).",
        "Finally, instead of a single set that mixes seeds of different types, we created five such general sets by picking four different seeds from each of the specialized sets, and used them to initialize our algorithm.",
        "When examining the results of each of the five general sets, we found out that they were unstable, and always correlated with the output of a different specialized set.",
        "Based on these findings, we believe that the traditional practice of initializing ie algorithms with general sets that mix seeds denoting different part-whole relation types leads to inherently unstable results.",
        "As we have shown, the relations extracted by combining seeds of heterogeneous types almost always converge to one specific part-whole relation type, which cannot be conclusively predicted.",
        "Furthermore, general seeds are unable to capture the specific and distinct patterns that lexically realize the individual types of part-whole relations."
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "In this paper, we have investigated the effect of ontologically-motivated distinctions in part-whole relations on ie systems that learn instances of these relations from text.",
        "We have shown that learning from specialized seeds-sets, denoting specific types of the part-whole relations, results in precision that is as high as or higher than the precision achieved with a general set that mixes seeds of different types.",
        "By comparing the outputs generated by different seed-sets, we observed that the tuples learnt with seeds denoting a specific part-whole relation type are not confined to that particular type.",
        "In most case, we are still able to discover tuples across all the different types of part-whole relations, regardless of the type instantiated by the initializing seeds.",
        "Most importantly, we demonstrated that ie algorithms initialized with general sets of mixed seeds harvest results that tend to converge towards a specific type of part-whole relation.",
        "Conversely, when starting with seeds representing a specific type, it is likely to discover tuples and patterns that are completely distinct from those found by a mixed seed-set.",
        "Our results also illustrate that the outputs of ie algorithms are heavily influenced by the initializing seeds, concurring with the findings of McIntosh and Curran (2009).",
        "We believe that our results show a drastic form of this phenomenon: given a set of mixed seeds, denoting heterogeneous relations, the harvested tuples may converge towards any of the relations instantiated by the seeds.",
        "Predicting the convergent relation is in usual cases impossible, and may depend on factors pertaining to corpus characteristics.",
        "This instability strongly suggests that seeds instantiating different types of relations should not be mixed, particularly when learning part-whole relations, which are characterized by many subtypes.",
        "Seeds should be defined such that they represent an ontologically well-defined class, for which one may hope to find a coherent set of extraction patterns.",
        "meronomic",
        "mereological",
        "Tuples^",
        "member",
        "subquant",
        "contained",
        "struct",
        "located",
        "Seedsl",
        "EN member",
        "ship-convoy",
        "alcohol-wine",
        "card-deck",
        "proton-nucleus",
        "lake-park",
        "subquant",
        "aircraft-fleet",
        "moisture-soil",
        "building-complex",
        "engine-car",
        "commune-canton",
        "contained",
        "aircraft-fleet",
        "alcohol-wine",
        "relic-church",
        "base-spacecraft",
        "campus-city",
        "structural",
        "brother-family",
        "mineral-bone",
        "library-building",
        "inlay-fingerboard",
        "hamlet-town",
        "located",
        "performer-cast",
        "alcohol-blood",
        "artifact-museum",
        "chassis-car",
        "city-shore",
        "NL member",
        "sporter-ploeg",
        "helium-atmosfeer",
        "stalagmieten-grot",
        "shirt-tenue",
        "boerderij-dorp",
        "(athlete-team) (helium-atmosphere)",
        "(stalagnites-cave)",
        "(shirt-outfit)",
        "(farm-village)",
        "subquant",
        " – ",
        "vet-kaas",
        "pijp_orgel-kerk",
        "kam-gitaar",
        "paleis-stad",
        "(fat-cheese)",
        "(pipe-organ-church)",
        "(bridge-guitar)",
        "(palace-city)",
        "contained",
        " – ",
        "tannine-wijn",
        "kamer-toren",
        "atoom-molecule",
        "paleis-stad",
        "(tannine-wine)",
        "(room-tower)",
        "(atom-molecule)",
        "(palace-city)",
        "structural",
        " – ",
        "kinine-tonic",
        "beeld-kerk",
        "wervel-ruggengraat",
        "paleis-stad",
        "(quinine-tonic)",
        "statue-church)",
        "(vertebra-backbone)",
        "(palace-city)",
        "located",
        " – ",
        " – ",
        "kunst_werk-kathedraal",
        "poort-muur",
        "metro _station-wijk",
        "(work ofart-cathedral)",
        "(gate-wall)",
        "(metro station-quarter)",
        "Acknowledgement",
        "Ashwin Ittoo is part of the project \"Merging of Incoherent Field Feedback Data into Prioritized Design Information (DataFusion)\" (http://www.",
        "iopdatafusion.org//), sponsored by the Dutch Ministry of Economic Affairs under the IOP-IPCR program.",
        "Gosse Bouma acknowledges support from the Stevin LASSY project (www.let.rug.nl/ ~vannoord/Lassy/)."
      ]
    }
  ]
}
