{
  "info": {
    "authors": [
      "Maja Popović",
      "David Vilar",
      "Eleftherios Avramidis",
      "Aljoscha Burchardt"
    ],
    "book": "Proceedings of the Sixth Workshop on Statistical Machine Translation",
    "id": "acl-W11-2109",
    "title": "Evaluation without references: IBM1 scores as evaluation metrics",
    "url": "https://aclweb.org/anthology/W11-2109",
    "year": 2011
  },
  "references": [
    "acl-E09-1087",
    "acl-J93-2003",
    "acl-P02-1040",
    "acl-W03-0413",
    "acl-W05-0909",
    "acl-W08-0309",
    "acl-W09-0401",
    "acl-W10-1703"
  ],
  "sections": [
    {
      "text": [
        "Evaluation without references: ibmI scores as evaluation metrics",
        "Maja Popovic, David Vilar, Eleftherios Avramidis, Aljoscha Burchardt",
        "German Research Center for Artificial Intelligence (DFKI) Language Technology (LT), Berlin, Germany name.surname@dfki.de",
        "Current metrics for evaluating machine translation quality have the huge drawback that they require human-quality reference translations.",
        "We propose a truly automatic evaluation metric based on ibm 1 lexicon probabilities which does not need any reference translations.",
        "Several variants of ibm1 scores are systematically explored in order to find the most promising directions.",
        "Correlations between the new metrics and human judgments are calculated on the data of the third, fourth and fifth shared tasks of the Statistical Machine Translation Workshop.",
        "Five different European languages are taken into account: English, Spanish, French, German and Czech.",
        "The results show that the ibm1 scores are competitive with the classic evaluation metrics, the most promising being ibm1 scores calculated on morphemes and pos-4grams."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Currently used evaluation metrics such as bleu (Pa-pineni et al., 2002), meteor (Banerjee and Lavie, 2005), etc.",
        "are based on the comparison between human reference translations and the automatically generated hypotheses in the target language to be evaluated.",
        "While this scenario helps in the design of machine translation systems, it has two major drawbacks.",
        "The first one is the practical criticism that using reference translations is inefficient and expensive: in real-life situations, the quality of machine translation must be evaluated without having to pay humans for producing reference translations first.",
        "The second criticism is methodological: in using reference translation, the problem of evaluating translation quality (e.g., completeness, ordering, domain fit, etc.)",
        "is transformed into a kind of paraphrase evaluation in the target language, which is a very difficult problem itself.",
        "In addition, the set of selected references always represents only a small subset of all good translations.",
        "To remedy these drawbacks, we propose a truly automatic evaluation metric which is based on the ibm1 lexicon scores (Brown et al., 1993).",
        "The inclusion of ibml scores in translation systems has shown experimentally to improve translation quality (Och et al., 2003).",
        "They also have been used for confidence estimation for machine translation (Blatz et al., 2003).",
        "To the best of our knowledge, these scores have not yet been used as an evaluation metric.",
        "We carry out a systematic comparison between several variants of ibmI scores.",
        "The Spearman's rank correlation coefficients on the document (system) level between the ibmI metrics and the human ranking are computed on the English, French, Spanish, German and Czech texts generated by various translation systems in the framework of the third (Callison-Burch et al., 2008), fourth (Callison-Burch et al., 2009) and fifth (Callison-Burch et al., 2010) shared translation tasks."
      ]
    },
    {
      "heading": "2. IBM 1 scores",
      "text": [
        "The ibmI model is a bag-of-word translation model which gives the sum of all possible alignment probabilities between the words in the source sentence and the words in the target sentence.",
        "Brown et al.",
        "(1993) defined the ibmI probability score for a translation pair fJ and e{ in the following way:",
        "where f j is the source language sentence of length J and e{ is the target language sentence of length I.",
        "As it is a conditional probability distribution, we investigated both directions as evaluation metrics.",
        "In order to avoid frequent confusions about what is the source and what the target language, we defined our scores in the following way:",
        "• source-to-hypothesis (sh) ibmI score:",
        "• hypothesis-to-source (hs) ibmI score:",
        "where sj are the words of the original source language sentence, S is the length of this sentence, hi are the words of the target language hypothesis, and H is the length of this hypothesis.",
        "In addition to the standard IBM l scores calculated on words, we also investigated:",
        "• mibmI scores - ibmI scores of word morphemes in each direction;",
        "• PniBMl scores - ibmI scores of pos n-grams in each direction.",
        "A parallel bilingual corpus for the desired language pair and a tool for training the IBM l model are required in order to obtain IBMI probabilities p(fj|ei).",
        "For the pos n-gram scores, appropriate pos taggers for each of the languages are necessary.",
        "The PoS tags cannot be only basic but must have all details (e.g. verb tenses, cases, number, gender, etc.).",
        "For the morpheme scores, a tool for splitting words into morphemes is necessary.",
        "The ibmI probabilities necessary for the IBMI scores are learnt using the wmt 2010 News Commentary bilingual corpora consisting of the Spanish-English, French-English, German-English and Czech-English parallel texts.",
        "Spanish, French, German and English pos tags were produced using the TreeTagger, and the Czech texts are tagged using the COMPOST tagger (Spoustova et al., 2009).",
        "The morphemes for all languages are obtained using the Morfessor tool (Creutz and Lagus, 2005).",
        "The tool is corpus-based and language-independent: it takes a text as input and produces a segmentation of the word forms observed in the text.",
        "The obtained results are not strictly linguistic, however they often resemble a linguistic morpheme segmentation.",
        "Once a morpheme segmentation has been learnt from some text, it can be used for segmenting new texts.",
        "In our experiments, the splitting are learnt from the training corpus used for the IBMI lexicon probabilities.",
        "The obtained segmentation is then used for splitting the corresponding source texts and hypotheses.",
        "Detailed corpus statistics are shown in Table l.",
        "Using the obtained IBM l probabilities of words, morphemes and pos n-grams, the scores described in Section 2 are calculated for the Spanish-English, French-English, German-English and Czech-English translation outputs from each translation direction.",
        "For each of the ibmI scores, the system level Spearman correlation coefficients p with the human ranking are calculated for each document.",
        "In total, 32 correlation coefficients are obtained for each score - four English outputs from the WMT 2010 task, four from the WMT 2009 and eight from the WMT 2008 task, together with sixteen outputs in other four target languages.",
        "The obtained correlation results were then summarised into the following three values:",
        "a correlation coefficient averaged over all translation outputs;",
        "Table 1 : Statistics of the corpora for training ibm 1 lexicon models.",
        "percentage of documents where the particular score has better correlation than the other ibm 1 scores; percentage of documents where the particular score has better or equal correlation than the other ibmI scores.",
        "The first step towards deciding which ibmI score to submit to the WMT 2011 evaluation task was a comparison of the average correlations i.e. mean values.",
        "These values for each of the ibm 1 scores are presented in Table 2.",
        "The left column shows average correlations of the source-hypothesis (sh) scores, and the right one of the hypothesis-source (hs) scores.",
        "Table 2: Average correlations of source-hypothesis (left column) and hypothesis-source (right column) ibmI scores.",
        "It can be seen that the morpheme, POS-3gram and POS-4gram scores have the best correlations in both directions.",
        "Apart from that, it can be observed that all the hs scores have better correlations than sh scores.",
        "Therefore, all the further experiments will deal only with the hs scores, and the subscript hs is omitted.",
        "In the next step, all the hs scores are sorted according to each of the three values described in Section 3.1, i.e. average correlation mean, rank> and rank>, and the results are shown in Table 3.",
        "The most promising scores according to each of the three values are morpheme score mibmI, pos-3gram score p3ibm1 and POS-4gram score p4ibm1.",
        "The last experiment was to combine the most promising IBM 1 scores in order to see if the correlation with human rankings can be further improved.",
        "In general, a combined ibmI score is defined as arithmetic mean of various individual IBM 1hs scores described in Section 2:",
        "COMBlBMl = ^ wk • IBMlk (4)",
        "The following combinations were investigated:",
        "combination of all pos n-gram scores; combination of all pOS n-gram scores and the morpheme score; combination of the most promising individual scores, i.e. pOS-3gram, pOS-4gram and morpheme scores;",
        "Spanish",
        "English",
        "French",
        "English",
        "German",
        "English",
        "Czech",
        "English",
        "sentences",
        "97122",
        "83967",
        "100222",
        "94693",
        "running words",
        "2661344",
        "2338495",
        "2395141",
        "2042085",
        "2475359",
        "2398780",
        "2061422",
        "2249365",
        "vocabulary:",
        "words",
        "69620",
        "53527",
        "56295",
        "50082",
        "107278",
        "54270",
        "125614",
        "52081",
        "morphemes",
        "14178",
        "13449",
        "12004",
        "12485",
        "22211",
        "13499",
        "18789",
        "12961",
        "pos tags",
        "69",
        "44",
        "33",
        "44",
        "54",
        "44",
        "611",
        "44",
        "pos-2grams",
        "2459",
        "1443",
        "826",
        "1443",
        "1611",
        "1454",
        "27835",
        "1457",
        "pos-3grams",
        "27350",
        "20474",
        "10409",
        "19838",
        "19928",
        "20769",
        "209481",
        "20522",
        "pos-4grams",
        "135166",
        "121182",
        "62177",
        "114555",
        "114314",
        "123550",
        "637337",
        "120646",
        "mean",
        "IBMlsfc",
        "IBMlfcs",
        "words",
        "0.066",
        "0.308",
        "morphemes",
        "0.227",
        "0.445",
        "pos tags",
        "0.006",
        "0.337",
        "pos-2grams",
        "0.058",
        "0.337",
        "pos-3grams",
        "0.172",
        "0.376",
        "pos-4grams",
        "0.196",
        "0.442",
        "Table 3 : ibm 1 hs scores sorted by average correlation (column 1), rank> value (column 2) and rank> value (column 3).",
        "The most promising scores are those calculated on morphemes (mibmI), pos-3grams (p3ibm1) and pos-4grams (p4ibm1).",
        "• mp4ibm1 combination of the two most promising individual scores, i.e. pOS-4gram score and morpheme score.",
        "For each of the scores, two variants were investigated, with and without (i.e. with uniform) weights wk.",
        "The weigths were choosen proportionally to the average correlation of each individual score.",
        "Table 4 contains average correlations for all combined scores, together with the weight values.",
        "Table 4: Average correlations of the investigated ibm 1 hscombinations.",
        "The weight values are choosen according to the average correlation of the particular individual ibmI score.",
        "The pOS n-gram combination alone does not yield any improvement over the best individual scores.",
        "Introduction of the morpheme score increases the average correlation, especially when only the best n-gram scores are chosen.",
        "Apart from that, introducing weights improves the average correlation for each of the combined scores.",
        "The final step in our experiments consists of ranking the weighted combined scores.",
        "The rank> and rank> values for these scores are presented in Table 5.",
        "According to the rank> values, the mp4ibm1 score clearly outperforms all other scores.",
        "This score also has the highest mean value together with the mp34ibm1 score.",
        "As for rank> values, all morpheme-POS scores have similar values significantly outperforming the p1234ibm1 score.",
        "Table 5: rank> (column 1) and rank> (column 2) values of the weighted ibm 1 hs combinations.",
        "Following all these observations, we decided to submit the mp4ibm1 score to the wmt 2011 evaluation task."
      ]
    },
    {
      "heading": "4. Conclusions and outlook",
      "text": [
        "The results presented in this article show that the ibm 1 scores have the potential to be used as replacement of current evaluation metrics based on reference translations.",
        "Especially the scores abstracting away from word surface particularities (i.e. vocabulary, domain) based on morphemes, POS-3grams and 4grams show a high average correlation of about 0.5 (the average correlation of the bleu score on the same data is 0.566).",
        "An important point for future optimisation is to investigate effects of the selection of training data for the IBMI models (and its similarity to the training data of the involved statistical translation systems).",
        "Furthermore, investigation of how to assign the weights for combining the corresponding individual scores, as well as of the possible impact of different morpheme splittings should be carried out.",
        "Other direction for future work is combination with other features (i.e. pos language models).",
        "mean",
        "rank>",
        "rank>",
        "0.445 morphemes 0.442 pos-4grams 0.376 pos-3grams",
        "60.6 pos-4grams 54.4 morphemes 50.6 pos-3grams",
        "71.3 pos-4grams 61.3 pos-3grams 56.3 morphemes",
        "0.337 pos-2grams 0.337 pos tags 0.308 words",
        "39.4 pos tags 36.3 words 35.6 pos-2grams",
        "48.1 pos tags 43.7 pos-2grams 42.5 words",
        "combined score",
        "rank>",
        "rank>",
        "P1234IBM1",
        "25.0",
        "36.4",
        "mp1234ibm1",
        "44.8",
        "68.7",
        "mp34ibm1",
        "39.6",
        "64.6",
        "mp4ibm1",
        "55.2",
        "65.7",
        "combined score",
        "mean",
        "P1234IBM1",
        "0.403",
        "+weights (0.15, 0.15,0.3,0.4)",
        "0.414",
        "mp1234ibm1",
        "0.466",
        "+weights (0.2, 0.05, 0.05, 0.2, 0.5)",
        "0.486",
        "mp34ibm1",
        "0.480",
        "+weights (0.25, 0.25, 0.5)",
        "0.498",
        "mp4ibm1",
        "0.494",
        "+weights (0.4, 0.6)",
        "0.496",
        "This method is currently being tested and further developed in the framework of the taraXU project.",
        "In this project, three industry and one research partners develop a hybrid machine translation architecture that satisfies current industry needs, which includes a number of large-scale evaluation rounds involving various languages: English, French, German, Czech, Spanish, Russian, Chinese and Japanese.",
        "By the time of writing this article, the first human evaluation round in taraXU on a pilot set of about 7000 sentences is running.",
        "The metrics proposed in this paper will be tested on the taraXU data as soon as they are available.",
        "First results will be reported in the presentation of this paper."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work has been partly developed within the taraXU project financed by TSB Technologiestiftung Berlin - Zukunftsfonds Berlin, co-financed by the European Union - European fund for regional development."
      ]
    }
  ]
}
