{
  "info": {
    "authors": [
      "Margaret Masterman"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C67-1011",
    "title": "Man-Aided Computer, Translation from English into French Using an On-Line System to Manipulate a Bi-Lingual Conceptual Dictionary, Or Thesaurus",
    "url": "https://aclweb.org/anthology/C67-1011",
    "year": 1967
  },
  "references": [],
  "sections": [
    {
      "heading": "Conference Internationale sur le traitement Automatique des Langues. MANAIDED COMPUTER TRANSLATION FROM ENGLISH INTO FRENCH USING AN ON-LINE SYSTEM TO MANIPULATE A BILINGUAL CONCEPTUAL DICTIONARY, OR THESAURUS. Author: MARGARET MASTERMAN",
      "text": [
        "Office of Scientific and Technical Information, State House, High Holborn, London.",
        "ga, References will be denoted thus: 0.3 I.",
        "Long-term Querying of the current state of despondency with regard to the prospects of Mechanical Translation.",
        "The immediate effect of the recently issued Report on Computers in Translation and Linguistics, LANGUAGE AND MACHINES U.)",
        "has been to spread the view that there is no future at all for research in Mechanical Translation as such; a view which contrasts sharply with the earlier, euphoric view that (now that disc-files provide computers with indefinitely large memory-systems which can be quickly searched by random-access procedures) the Mechanical Translation research problem was all but \"solved\".",
        "It is possible, however, that this second, ultra-despondent view is as exaggerated as the first one was; all the more so as the Report is written from a very narrow research background without any indication of this narrowness being given.",
        "Fir example, an M.T.",
        "Thee urus has never yet been put on a machine; 2 and the analogy between M.T.",
        "and Information-Retrieval has never yet been explored, (yet retrieving a translation in response to a user's request is basically the same as retrieving any other piece of information in response to a user's request.)",
        "CD No mention, moreover, is made in the Report of the work of",
        "(e.g.) Dolby and Resnikoff in analysing the nature tstructure of natural-language dictionaries, nor is any recommendation made that more of this evidently necessary work should be done.MiteMAr) the need for basic research into the true problem posed by the ambiguity and extensibility of individual language-signals of any order of length, and the connection of this with other learning-problems and character-recognition-problems3has never yet been faced.",
        "In fact, the situation is worse; a particular application has been pronounced useless and/or impossible before the general field of examining the basic semantic nature of human communication has been created.",
        "II.",
        "Recommendation: do not look at the theoretic complexities of current researches into language-problems: look rather at the technological advances which have already been made.",
        "Thus the basic recommendation given in the Report, namely that practical research into Mechanical Translation should be discontinued, while present, very narrow and fragmentary trends of \"pure\" theoretic linguistics research should be supported, can be queried both ways round.",
        "For the advances in this field are precisely coming from the technologies, as the Report itself shows, and that in several areas i) Thus computer-type-setting, in which hyphenation can be done with a \"logic\", that is, without a dictionary, is now an accomplished fact (3) ii) within information retrieval, mechanized retrieval systems of increasing sophistication and efficiency, are being constructed for practical use at Universities and within industry: iii) synthetic speech considered as synthetic message, - passed over in the Report because created by telephone engineers and not by linguists, - is making great strides ahead; iv) high-level programming languages increasingly operate more like natural languages, so that the machine can pick up and process something more like the user's normal way of thinking; v) the Mannheim and Luxembourg machine-aided translation-systems are acknowledged in the Report to save 40 - 60 per cent of a translator's time; (E) and vi) research in automatic character-recognition has now reached such a point that consideration of the extent to which this will slash M.T.",
        "costs and increase M.T.",
        "usefulness should have not been ignored.",
        "a) III.",
        "Report on an actual experiment in man-aided M.T.",
        "The experimental work to be reported on in this paper and which is still in progress, is the",
        "development of a computer-aided procedure for the full translation of one single paragraph of governmental report-style English into governmental-report-style Canadian French, to be made in such a way that the translation actually produced accounts for the actual non-literal translation which was actually made by the official Canadian Government Translator.",
        "The philosophy behind this research is that before employing automatic-translation-devices on a large scale, you.have got to understand what translation is yourself; just as before building a liner-smoke-funnel you have got to understand wind-flow.",
        "You may not in the end use, to assist translation, all the mechanical procedures which you develop in order to understand translation, but you have got to know what these areimechanically speaking, you have not got to be continually surprised and taken aback by what the human translator actually does.",
        "Even the amount of experimentation which we have performed so far has Sufficed to convince us that nobody does knew, in terms of automatic procedures, what translation is.",
        "So-called MAgxpregramslup to now, though they have performed ismAst more or less sophisticated feats in bilingual transformation of individual words and of individual constructions, have never in the true sense of the word, translated anything.",
        "We nave apw, npwever, started to put on a machine a more realistic translation-model of the following form'.",
        "The model draws on ii) iii) iv) and v) of the technological devices mentioned above.",
        "i) As is standard practise now on Information Retrieval, the model uses a Thesaurus.",
        "This Thesaurus, however, is not merely an Information-Retrieval-type Thesaurus of terms, but a\"Roget's Thesaurus\" type of technical dictionary, though of a novel kind.",
        "ii) The retrieval-procedure works by using as its \"requests\" a unit longer than the word, and which has been called a \"phrasing\" (Frs phrase rhythmiaue); (21) a computer-program, (written by J. Dobson for the Titan Computer at Cambridge University Mathematical Laboratory) now exists which derives pFirasings from written text (see appendix A) The user is on-line to a computer, on which the whole Thesaurus is Stored; and he reacts with this Thesaurus by means of question-and answer routines operating in real time which are programmed into the machine by.",
        "us the very sophisticated programming language T.R.A.C.",
        "(1).",
        "And v), the experiment presupposes the validity of the result that, in operation, the computer-stored dictionaries at Luxembourvand Trier (to which the user is not on-line and with which he cannot therefore react,)",
        "already, in spite of these limitations save 40-60% of the translators' time.",
        "It is inferred from this that on-line use of more sophisticated dictionaries by man-machine interaction in the conversational mode is the right way, from now on, for M.T.",
        "research to go.",
        "III.",
        "•The Basic Principle of the Man-Machine interaction.",
        "The input to the machine is a stressed and contoured phrasing, i.e. a phrasing with some stresses marked and minimal syntactic naming of the constituent words.",
        "Research to produce this input mechanically, by a phrasing-stresser-and-parser,is currently being supported by the Office of Scientific and Technical Information, London; at present the program (Mark II) segments the text into phrasings mechanically, but does not either mark the stressed words or provide any snytactic naming.",
        "(see Appendix A).",
        "In the mini-demonstation of the Ilan-mahhine interaction, therefore, (the only one which is already operational as a machine,) the operator at present types in a single phrasing at a time minus the stressed words, which have been pre-marked on his text.",
        "Thus, he does not type in a complete phrasing, but what we have called a phrasing-frame.",
        "(Later the machine will compute the phrasing-frame from the text.)",
        "Examples of assorted phrasing-frames are given below:"
      ]
    },
    {
      "heading": "[VERB INFIN.) {NOUN)",
      "text": [
        "key: stressed word omitted () silent beat do not translate though stressed.",
        "N.B.",
        "Other markers e.g. the marker 'Ito set in operation a routine to interconnect syntactically connected phrasings will be discussed in a further publication On receiving the phrasing-frame, the machine questions the opestor in order to make him specify further, from his general knowledge of the text and of its subilect, what the context of the particular phrasing-frame is.",
        "The example given below, in which is progressively specified the correct French translation of an English Serb of motion (one of the notoriously difficult English forms to translate into French) shows how complicated this questioning can be.",
        "Not more than three rounds of questioning are allowed, and when the operator has produced his specification, the unique correct trans-latioNif the frame is stored in the immediate-access store chine (see Appendix B).",
        "In the example set out below, however, the differing French translations of all possible answers obtainable under Round II and Round III of the interaction are set out immediately underneath the English statements which the machine would actually print out on the console, in order to show the underlying reason for the whole enterprise.",
        "A HE MOVED TO SOME POINT ?",
        ".6.",
        "A",
        "B HE DETERIORATED (idiom)?",
        "C HE CROSSED OVER SOME OBSTACLE ?",
        "D HE COMMUNICATED WITH SOME BEING ?",
        "Operator answers: A ROUND II Machine then asks: DO YOU MEAN A HE DEPARTED TO SOME DESTINATION ?",
        "Il partit pour ... B HE TRAVELLED TO SOME DISTANT REGION ?",
        "Il s'en alla h C HE FLED TO SOME REFUGE ?",
        "Il se refugia chez ... D HE ARRIVED AT SOME DESTINATION arriva E HE VISITED SOME PLACE ?",
        "Il visita",
        "Operator answers: B ROUND III Machine then asks: HOW DID HE TRAVEL?",
        "s'en alla 11. bicyclette G BY SWIMMING ?",
        "Il alla h la nage k Operator answers: A .7.",
        "STAGE TWO The operator then types in the two stressed words: FLEW and FRONTIER The machine then dictionary-matches and resolves: FLEW = fled = ALREADY TRANSLATED: DELETE XX = FRONTIER = FRONTIP.RE (f) and immediately for the text: He flew to the frontier The Machine prints out the translation; IL PRIT L'AVION POUR LA FRONTItRE",
        "Detailed examination of this example shows that hind this particular way of making an on-line system lateract with an operator there lies a strategy, a hypothesis and a prospect.",
        "V. The strategy is at all costs to avoid post-editing; but to allow maximal preprocessing of the input text by the machine interacting with the operator, all the Question-and-answer routines being in the operator's native language.",
        "The argument against post-editing (as the U.S. Report conclusively shows) is that it is either mechanical e.g. the resolution of French gender-concord - in which case the machine itself can be programmed to do it - or it is creative and/or intuitive)in which case it cannot be done at 411 without extensive reference back to the input text; ho could interpret \"Shakespeare Overspat\", which was the title of a Russian \"Pravda\" article as translated by the U.S. Air Force computer?",
        "The real meaning was \"Shakespeare is now a back number\"), in which came the post-editor might as well have translated the whole text himself in the first place.",
        "To avoid post-editing, however, the output produced by a man-machine reactive M.T.",
        "program has either got to be a blank space (when the program fails), or a unique translation which is known to be correct.",
        "Now uniqueness of output can be brutally produced, as everybody knows,tgprogramming the machine only to print out one et any set of alternatives.",
        "Correctness, however, can only be achieved by the target-language translation having been approved beforehand by the operator, from cues which the machine gives him, or which he gives the machine - in his own language; i.e. in the source language.",
        "The real use, therefore, of the three-stage question-and-answer routine exemplified above, is that it enables an Englishman with a console but who does .8. not know any French to produce a unique and correct idiomatic French translation of an English textrprovided that he is prepared to take the trouble to pre-process the English text so that it is finally restated in a Frenchified sort of way.",
        "After this the machine can of course transcribe it into French.",
        "In other words, a machine-aided translation program basically consists - a) of programming the machine to pick up the ambiguities in the source language which the target-language will not tolerate (not the other way round) and of making the operator produce the additional information which will resolve them.",
        "Take, as example, the phrasing /for a standby force/.",
        "This looks technical and unambiguous in the English, but comparative examination of bilingual text showed that it translated into French (and in the same document) as either i)/d'une force d'urgence/ i.e./\"of an emereency force or ii) /pour une force de re'serve/ i.e. /\"for a reserve force\"/, according to sophisticated considerations of context.",
        "Therefore, when the operator types the technical term STANDBY FORCE into the machine, in order to fill up the gaps in the phrasing-frame /FOR A",
        "The operator then has to choose, and type back into the machine the alternative he wants, after which the machine can make the translation.",
        "b) way mustmhe.",
        "found of onelpting the machine to pick up,from cues in the source language, the metaphors and idioms which the target-language will not tolerate/and to assist the operator to rephrase the stretch of text concerlltd,in terms which the target-language will tolerateahe difference between idioms and metaphors is that idioms can be mechanically picked up and matched by an idiom dictionary, whereas metaphors can't.",
        "• 9'.",
        "c) Similarly again, the machine must be programmed to pick up, from the source language input, the constructions which the target-language will not tolerate, and assist the operator to transform these into constructions which the target-language will tolerate (e.g. to turm English passives into French actives, and the adjectives of English adjective-noun strings into French post-positioned preppsitional phrases).",
        "Thus the whole translating work, really, is done iithin the source language.",
        "Once you can preprocess your English input into a Frenchified shape in the respects a), b), c), above, the machine can transform this Frenchified English, ;:ith no trouble at all, into elegant French.",
        "The strategic hope, of course, is that by analysing the printouts produced by a large number of sequences of such machine-man interactions, in translating many types of texts, we shall ultimately learn how to make the machine answer, as well as ask, some of the rounds of questions, (as is already being done in a whole range of machine \"edit\" programs), so that the machine shall progressively become able to do more of the Frenchifi-cation process for itself; thus finally producing, (if the machine ever became able completely to take over) exceedingly slow but reliable machine translation, which could)subsequently again,be speeded up.",
        "Before further discussion of the extent to which this strategic hope is a real hope and hew much a mere pious aspiration, i.e. the prospect, I will now set out the hypothesis (as opposed to the strategy) of the experiment.",
        "VI.",
        "The hypothesis which the translation-model gives is the following: Translation consists of the pairing of a phrasing, P7A, in Language A, with another Rhrasing, P2BIE in Language B, in such a way that P1 Okill01400forms an analogy with PiA, in a sense of \"analogy\" which can be ostensively defined intterms of the model.",
        "Thus translating a phrasing intro another language is no different, (according to this translation-model) from defining it, producing a parallel-phrasing to it, reiterating or otherwise further specifying it, in the same languagef The advantage of the model is that unambiguous criteria of the formation of such a pairing can be given.",
        "For any response given by the operator to a machine-question will form such a pair: the first member of the pair will be the original phrasing, (in English), the second the chosen machine-specification (called by us a template) .10. also in English.",
        "Then another pair will be formed whenever the machine translates the operator's final choice of template into French; the first member of the pair in this case, will be the final template chosen, and the second member will be the translation into French, with the stressed words translated and inserted into their correct places.",
        "Then again, an intermediate pair may be formed of which each member is a template; the first member of such a pair will be a more abstract template chosen at the first round of man-machine interaction, while the second member of it will be the more concrete template chosen by the operator at the second round of man-machine interaction; and so on recursively.",
        "Any such pairing formed by the translation model, whether between English phrasing and template, or between template and template, or between template and French phrasing, we shall call a semantic square.",
        "A philosophic discussion of the notion of semantic square is given in another publication CD)• A semantic square (in terms of this model) consists of the pairing of any two linguistic sequences P1 and P2, P1 and P2 each having the following characteristics: i) each has two stressed segments (which when P1 is paired to P2, form points of the square).",
        "ii) each has these embedded in some phrasing-frame, (which, when P1 is paired to P2 forms the frame of the square).",
        "iii) each has been selected as synonymous *ith the other at least once,either by the operator or by the machine.",
        "Thus, according to the model, translation consists of sequential semantic-square forming, the sequence of semantic squares thus formed continuing until it is brought to an end by the machine printing out a square which has a target-language phrasing as its second member.",
        "To make all this clearer, let us further develop the example of man-machine interaction given above,by assuming that the phrasing to be translated is /HE WENT to the police/.",
        "To translate this, the operator types in /HE...12D to the [PAST VERB] DOUNi and chooses, at the first round of questioning, the abstract template HF COMMUNICATED WITH SONE.ANIMATE BEING .11.",
        "The first semantic square of this sequence formed by the model is thus: /HE WENT TO THE POLICE/ /HE COMMUNICATED WITH SOME ANIMATE BEING/.",
        "The machine then asks: DO YOU MEAN A HE REVEALED-ALL TO THE ENEMY B HE TOLD-A-STORY TO SOME LISTENER C HE CONSULTED WITH SOME AUTHORITY The operator chooses A, thus forming the second semantic square in the sequence: /HE COMMUNICATED WITH SOME ANIMATE-BEING/ /HE REVEALED-ALL TO THE ENEMY/ The operator then types in the stressed word /POLICE/ (to specify the nature of the enemy), and the machine then forms the final semantic-square: /HE REVEALED-ALL TO THE ENEMY/ /IL TOUT RiVgLA AUX FLICS/ \"FLICS\" having been pre-chosen by the operator's choices of template from a bilingual tree-dictionary-entry for the English word \"police\" with nodes as follows: Thus the sequence of semantic44squares formed by this operation of.",
        "the model is HE WENT TO THE POLICE"
      ]
    },
    {
      "heading": "HE REVEALED-ALL TO THE ENEMY 3 IL TOUT REVELA AUX FLICS",
      "text": [
        "This square-sequence,with its AB BC CD overlap of content,I will call the semantic deep-structure of the models translation-operation, and the tree-structure given above I will call the semantic deep-structure of the dictionary-entry.",
        "The totality of semantic deep-structures given by the model is the model's total semantic-field.",
        "LL This, stated in the briefest possible terms, is the hypothesis given by the model.",
        "Now as to the prospect of developing this line of research.",
        "The first thing to say is that the model makes clear the unsuitability of the ordinary digital computer as compared to a human being for performing translation.",
        "For in this translation-model the computer handles each phrasing of the input text as a separate unit, and forces the operator, by successive rounds of questioning, so to specify it that it can be translated unambiguously into French.",
        "But the human being, who does not treat each phrasing of a text as a separate unit, but who uses his understanding of the earlier phrasings of a text to guide him in his understanding of the later ones, does not have to ask himself nearly so many questions.",
        "A progressive learning-model of translation, then, is what is really required, rather than the present single-phrasing-matching model.",
        "On the other hand, the complexity which has to be introduced into the model to account for all the differing French translations which have to be made of a single piece of English, according to its context, this would have to be introduced into any effective M.T.",
        "program: since you cannot retrieve from any computerised data-system any data which you have not first put in.",
        "But this second'type of complexity can be put into the machine gradually, by feeding in data obtained from examining the interlingual correspondencesin a large corpus of bilingual text.",
        "There is, however, another, much deeper obstacle to developing this research, and that is that (as M.T.",
        "research-workers have for some time past suspected) bilingual dictionaries provide almost no clue to semantic deep-structure.",
        "Within the context of the present experiment this became apparent in examining the English word \"deliberations\".",
        "The examination began with the construction of a dictionary-entry-card of the following form:"
      ]
    },
    {
      "heading": "English: DELIBERATIONS French: DELIBERATIONS",
      "text": [
        "This entry being queried (and the maker of it having defended himself by saying that \"deliberations\" was the only word he knew of in English which could really be translated by the corresponding word in French), it was checked with Vinay's Dictionaryt*hich gave the entry /d bats mpl, discussion/.",
        "However, when an investigation whe made of how it was actually translated in the corpus of text, it only occurred once, where it was translated \"membres\", as follows: English The illustrative and comparative materials presented may prove helpful to the deliberations of this committee French Les donnagiiaicatives et cqmllaratives () se rOvelerent, peut-etre tr4s utiles pour les membres du comity Moreover, the translator, in translating it tbus, was quite right; not only because \"utiles\" in French, likes a concrete complement, but also because this is what the.",
        "passage means.",
        "However, this t to a semantic deep-structure for the bilingual is onary-entry of \"deliberations\" of the following form:",
        "It bedomes evident, then, that if we.are to make a machine account for the translations& which good human translators actually produce using the kind of modeta which has been reported o this paper, the problem is that of finding the structures of the dictionary-entries from the data actually given by a bilingual corpus; for the construction of the square-forming templates must depend on these that is if the template-glossary and the bilingual dictionary are to interlock.",
        "Present research efforts are therefore being concentrated on the problem of \"forming up\" the whole notion of semantic dictionary-entry deep-structure.",
        ".14."
      ]
    },
    {
      "heading": "CONCLUSION",
      "text": [
        "In view of the great interest which has already been aroused by this experiment, its small scale and pilot nature must be emphasized.",
        "(Actual output from a trial run of the program is given in Appendix 1).",
        "It has been implemented only on an 1202 computer, with T.R.A.C.",
        "facility, to which a single keyboard has been attached, just under the print-out, on which the machine's \"replies\" to the operator, as well as his \"questions\" appear.",
        "This machine has only 4K store with no back-up, and 2K of this is occupied by the T.R.A.C.",
        "facility; the rest of the store will therefore only hold enough Thesaurus to process an average of 10 \"phrasing-frames\" at any one time, so the sections of Thesaurus which are needed for any particular test have to be prechosen by hand from the larger deck of punched cards of which the Thesaurus, in its machine-readable form, consists.",
        "Even these cards, however, are only punched as required; the basic triple dictionary, from which the Thesaurus is being built up,is being stored on ordinary business equipment, (Twinlock Handi2e' :index HRA 3 handled with a Shunic Signalling System Paper and a SASCO System so as to ensure maximum flexibility and ease of entry-change).",
        "Mark II of this program is to be implemented on en I.C.T.",
        "1903 with disc-file and multiple-access T.R.A.C.",
        "facility, but this is not expected to be operational till 1968.",
        "REFERENCES:",
        "1.",
        "Language and Machines: Computers in Translation and Linguistics.",
        "Available from Printing & Publishing Office, National Academy of Sciences, 2101 Constitution Avenue, Washington, D.C. 20418.",
        "Price $4.00.",
        "2.",
        "A project supported by the U.S. National Science",
        "Foundation at the University of Bloomington, Indiana, has just been started, to make a Thesaurus for Information Retrieval in 50 languages.",
        "Also a historical Thesaurus of English is being compiled on a long-term basis by Professor Samuel at the University of Glasgow; and another, compiled by John Bromwich, is being put on magnetic tape at the Linguistics Computation Centre, Cambridge University.",
        "The properties and structure of thesauruses and/or conceptual dictionaries have never yet, however, been mechanically examined; partly because, until lately, machines with rapid-access-time to sufficiently large memories were not available, and partly because of the overall cost of such a project.",
        "in 5 vols., (Lockheed Missiles &$pace Company, Sunnyvale, Cal.)",
        "1964.",
        "On the Structure of Written English Words (Language Vol.",
        "40, No.",
        "2,) 1964.",
        "5.",
        "Language & Machines, p.114.",
        "The Report gives this brilliant technical achievement just 3 sentences on p.114, and appears not to know of the fact that a mechanical justifier using a logic and working up to 95% accuracy is now in use on an actual newspaper (personal communication from Dolby & Resnikoff).",
        ".i."
      ]
    },
    {
      "heading": "REFERENCES (cont.)",
      "text": [
        "(See \"Segmenting Natural Language by Articulatory Features\" in the present Conference.)",
        "The phrasing method offers two operational simplifications i) by mapping the distribution of stresses on to a binary frame; ii) by applying a phonetically-derived feature to words, instead of to syllables or phonemes."
      ]
    },
    {
      "heading": "1/3/2 *CANADA *COuLD+HAVE+DEYELOPED 1/3/3 THE *CAPABILITY 1/3/4 TO *MANUFACTURE *NUCLEAR+WEAPONS 1/3/5 IT *ELECTED 1/3/6 AS A MATTER OF *DELIBERATE *CHOICE' 1/3/7 *NOT TO *BECOME 1/3/8 A *NUCLEAR *POWER. 2/1/1 *ALSO, *CANADA 2/1/2 DID *NOT *BEcONE+A+PARTY 2/1/3 TO THE *INTER *AMERICAN 2/1/4 *DEFENCE *SYSTEM, 2/2/1 *AND, AT THE *CONCLUSION 2/2/2 OF THE *KOREAN *WAR 2/2/3 *CANADA *WITHDREW 2/2/4 HER *TROOPS FROM *THAT+AREA, APPENDIX A (b)",
      "text": []
    }
  ]
}
