{
  "info": {
    "authors": [
      "Yumi Ichimura",
      "Yoshimi Saito",
      "Kazuhiro Kimura",
      "Hideki Hirakawa"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-1050",
    "title": "Kana-Kanji Conversion System With Input Support Based on Prediction",
    "url": "https://aclweb.org/anthology/C00-1050",
    "year": 2000
  },
  "references": [
    "acl-W97-0504",
    "acl-W97-0505"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We propose a kana-kanji conversion system with input support based on prediction.",
        "This system is composed or two parts: prediction of succeeding kanji character strings from typed kana ones, and ordinary liana-kanji conversion.",
        "It automatically shows candidates of kan,ji character strings which the user intends to input.",
        "Our prediction method features: (i)Arbitrary positions of typed kana character strings are regarded as the top or words.",
        "(ii)A system dictionary and a user dictionary are used, and each entry in the system dictionary has certainty factor calculated from the frequency or words in corpora.",
        "(iii)Candidates are estimated by certainty factor and 'usefulness factor, and likely ones with greater factors than thresholds are shown.",
        "The proposed system could reduce the user's key input operations to 78% from the original ones in our experiments."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "TOSHIBA developed the world's first Japanese word processor in 1978.",
        "Unlike languages based on an alphabet, Japanese uses thousands of kanji characters of varying complexity.",
        "Hence, to arrange all of kanii characters on keyboard is difficult.",
        "On the other hand, liana characters which are phonetic scripts of Japanese have 83 variations; these can be arranged on keyboard.",
        "As a result, conversion from kana notations to kanji ones, what is called kana-kanji conversion, has been used.",
        "Since Japanese is not written separately by words, segmentation of typed kana character strings has ambiguity.",
        "And an ambiguity in conversion exists, too; a kana notation may correspond to some different kanji notations.",
        "These make kana-kanji conversion challenging.",
        "We have made efforts to raise a precision of kana-kanji conversion, thinking that high precision can provide a better input environment for the user.",
        "A precision of our kana-kanji conversion system reaciies 95-98% for several kinds of texts in our previous experiments.",
        "Nevertheless, this approach is not enough in the situations where fast typing is hard, e.g., for beginners who are not familiar with keyboard or for palm-size computers.",
        "Thus, new method to reduce key input operations is needed.",
        "We propose a kan,a-kanji conversion system with input support based on prediction.",
        "This system is composed of two parts: prediction of succeeding kanji character strings from typed kana ones, and ordinary kana-kanji conversion.",
        "It automatically shows candidates of kanji char-ader strings which the user intends to input.",
        "The candidates change as the user inputs kana characters.",
        "if no appropriate choice is presented, Ole candidates automatically disappear when the next kana character is entered.",
        "Our system, therefore, can be used in the same manner as an ordinary kana-kanji conversion system, and allows the user to save time and efforts for key input without learning new key operations.",
        "We have been considered two issues to generate accurate candidates:",
        "(i) How to determine where typed kana character strings are segmented; since Japanese is not written separately by words, determination of positions where words start is needed to retrieve dictionaries.",
        "(ii) How to determine when prediction candidates are presented; if all of retrieval results are always shown, a system cannot be convenient.",
        "Surveying previous works from the view on above issues, we found that the Reactive Keyboard has been proposed (Darragh et al., 1980).",
        "It accelerates typewritten communication with",
        "a computer system by predicting what the user is going to type next.",
        "In this system, the top of typed character strings is regarded as the top of words, because English is written separately by words; the issue of segmentation of character strings does not occur.",
        "On the other hand, in previous works for Japanese, a predictive pen-based text input method has been proposed (Fukushima and Ya-mada, 1996).",
        "In this system, character strings are input by handwriting on LCD panel.",
        "Since the user usually inputs not only by Lima but also by k,anji and an alphabet, entered character strings are segmented with the help of the variety of characters.",
        "Thus, the issue of segmentation is not considered.",
        "The POBox (Pen-Operations Based On eX-ample) which is a text input method for pen-based computers has also been proposed (Ma-sui, 1998).",
        "It shows succeeding candidates from character staings input by software keyboard.",
        "Arbitrary positions of input character strings can be regarded as the top of words, and retrieval results are always shown as candidates; the prediction ordering is based on the user's previous choice.",
        "Since input speed by pen is not faster than that by keyboard, time to choose candidates is shorter than that to input characters.",
        "Hence, even if many candidates are shown, this method is effective for pen-based computers.",
        "It is, however, inefficient for ordinary keyboard.",
        "We propose a system with following features:",
        "(i) Arbitrary positions of typed kana character strings are regarded as the top of words.",
        "(ii) A system dictionary and a user dictionary are used, and each entry in the system dictionary has certainty factor calculated from the frequency of words in corpora.",
        "(iii) Candidates are estimated by certainty factor and usefulness factor, and likely ones with greater factors than thresholds are shown.",
        "These features provide an efficient Japanese text input environment for ordinary keyboard without learning new key operations.",
        "Section 2 shows an example of text input using the proposed system.",
        "Section 3 explains an input support method based on prediction.",
        "Section 4 shows efficiency of our system by means of experiments.",
        "Section 5 describes conclusions."
      ]
    },
    {
      "heading": "2 Example of Text Input",
      "text": [
        "Figure 1 shows an example of text input using the proposed system.",
        "Suppose that the user intends to input a sentence \"TM0)-P--; 0-e RIO (we request your attendance at the following meeting)\", typing kana characters \"i,P 0)i,P V\\ is)N itoye 10,11) -1)tab“o (kakino kaigiwo kaisai masunode gosanshuu negaimasu)\".",
        "When the user types \");P (ka)\" , (k,i)\" , and \"0 (no)\" keys, the system automatically opens a prediction menu window just below the typed characters, and shows two candidates in the menu window (Fig.1.",
        "(a)):",
        "(at the following address, modest ...) The first candidate is highlighted.",
        "If the menu window contains an appropriate candidate, the user can choose it by cursor; otherwise the user can continue entering the next; characters.",
        "Subsequently, when \"b' (ka)\" key is typed, the prediction menu window disappears (Fig.",
        "1(b)).",
        "When \"lo (i)\" and \"<.",
        ": (gi)\" keys are typed, the system automatically opens a prediction menu window again, and shows four new candidates (Fig.1(c)):",
        "(we request your attendance at the meeting) I t (we hold the meeting) (we hold the meeting) (we hold the meeting) Here the first one is what the user just wants; the user enters select key, then the prediction menu window disappears, and chosen candidate is inserted in the edit area.",
        "If remaining kana character string which was not included in the chosen candidate exists, kana-kanji conversion starts automatically; the first three lama characters of this sentence \"bN 0 (k,akino)\" is converted to kanji notation \"1lE0 (the following)\" (Fig.1(d)).",
        "This is the first result of kana-kanji conversion, so that the user can change it to others.",
        "An overline of the conversion result in Fig.1(d) shows that this result is not fixed yet.",
        "In above example, while 27 kanu, characters are needled to input in ordinary kana-kanji con",
        "and \"0\" keys are typed.",
        "(b) \"P\" key is typed, subsequently.",
        "(c) \"k''\" and \"s\" keys are typed, subsequently.",
        "(d)The first candidate in (c) is chosen.",
        "version, our system can reduce the input of 21 kana characters, hN vN ta (wo kaisai shimasunode gosanshuu negaimasu)\"; only 6 kana characters are needed to input."
      ]
    },
    {
      "heading": "3 Input Support Method Based on Prediction",
      "text": [
        "In this section, an overview of the system is shown.",
        "Then dictionaries used in the system, factors for estimation of candidates, and user learning are described.",
        "Figure 2 shows a diagram of the proposed system.",
        "It is composed of a kana-kanji conversion unit and an input prediction unit, and the latter has following four sub-units:"
      ]
    },
    {
      "heading": "Character Sub-strings Generation Unit(a) gener",
      "text": [
        "ates character sub-strings obtained from segmentation of typed kana character strings.",
        "Dictionary Retrieval Unit(b) retrieves prediction dictionaries using character sub-strings generated by Unit(a).",
        "lates certainty factor and 'usefulness factor for all of retrieved results by Unit(b) to estimate candidates.",
        "User Learning Unit(d) extracts phrases adopted by the user, and automatically registers them into the user dictionary."
      ]
    },
    {
      "heading": "3.2 Prediction Dictionary",
      "text": [
        "Two kinds of dictionaries are used as a prediction source:",
        "(ii) User Dictionary consists of phrases learned from texts which the user typed before.",
        "Each dictionary includes words and phrases without distinction.",
        "This is because Japanese is not written separately by words, and high frequent phrases consist of various grammatical forms, such as single word or two words.",
        "And each entry has k,ana notation (phonetic script) and kanji one."
      ]
    },
    {
      "heading": "3.3 Estimation of Prediction Candidates",
      "text": [
        "Two kinds of factors are used to estimate candidates:",
        "(i) Certainty Factor indicates how certain a candidate is.",
        "(ii) Usefulness Factor indicates how useful a candidate is.",
        "These two factors vary as the user inputs a character.",
        "Retrieval results are sorted in order of these factors, and only ones with greater factors than thresholds are shown as candidates."
      ]
    },
    {
      "heading": "3.4 Calculation of Certainty Factor",
      "text": [
        "Certainty factors for entries in the system dictionary and the user dictionary are calculated in different manner.",
        "First we make some notational conventions.",
        "A typed kana character string is denoted by S, which has right sub-strings Si (1 < i< L(S)).",
        "L(x) is the length of a string x.",
        "An entry in the dictionary is denoted by W, which has kanji notation WI\" and kana notation Wy."
      ]
    },
    {
      "heading": "3.4.1 Entry of System Dictionary",
      "text": [
        "When S is typed, certainty factor for W in the system dictionary is calculated as follows:"
      ]
    },
    {
      "heading": "Character strings Frequency in",
      "text": [
        "kana notation corpus 6,720",
        "The values of certainty factor corresponding to every character sub-strings are described in the system dictionary, and are read out at retrieval.",
        "3.4.2 Entry of User Dictionary Since the system cannot infer which phrases would be registered into the user dictionary, calculation of certainty factor for an entry in the user dictionary from corpora may be impossible.",
        "Hence, when S is typed, certainty factor for W in the user dictionary is calculated as follows:",
        "when S has a right sub-string Si which partially matches with the head of Wy otherwise when S has a right sub-string Si which partially matches with the head of Wy otherwise where FH(WH) is the frequency of WH in lartiji notation corpus, and F1(S) is the frequency of Si in kana notation corpus corresponding to kanji one.",
        "For example, certainty factor for \"iJN ts.nLyv Vic,t (k,ana-kanji conversion)\" is calculated using the frequency in Table 1: where N(Si) is the number of entries whose Lana notations start from Si in the user dictionary, and a is a constant to give greater factor for entries in the user dictionary than that in the system dictionary; i.e., the user dictionary has priority."
      ]
    },
    {
      "heading": "3.5 Calculation of Usefulness Factor",
      "text": [
        "An increase in the length of typed kana character strings raises the certainty on prediction, but lessens the usefulness.",
        "Hence, usefulness factor is introduced in addition to certainty factor.",
        "When S is typed, usefulness factor for W is calculated as follows: Usefulness f actor (W IS) = { L(1/17y) – L(Si), when S has a right substring Si which partially matches with the head of Wy 0, otherwise"
      ]
    },
    {
      "heading": "3.6 User Learning",
      "text": [
        "After the user adopts prediction or kana-kauji conversion candidates, words with longer length than threshold and phrases which satisfy given grammatical conditions are extracted; these are automatically registered into the user dictionary.",
        "For example, suppose that the user intends to input a phrase \"mt: MAN e,) (attend at the meeting)\", typing liana characters \"./.P 0)-39 t6 (kaigini shusseki slaw)\" .",
        "When \"h` (ka)\", \" (i)\", and (gi)\" keys are typed, four candidates are shown in the prediction menu window (Fig.",
        "1(c)).",
        "Here the prediction menu window dose not contain a candidate which the user wants, then the user continues entering the next liana characters \"4L U 4) (ni sliusseki slaw)\" and kana-kanji conversion -key.",
        "As a result, \"b\\l/N ts_ U (kaigini shasseki sum)\" is converted to4L Mnit 6 (attend at the meeting)\".",
        "When this conversion candidate is adopted, two words and a phrase are registered into the user dictionary: \"P.:: 2 (meeting)\", \"1111101-6 (at-tend)\", and U I.I■Ei5t 6' (attend at the meet-ing)\".",
        "Ii \"b (lea)\", \"ko (i)\", and \"--N (gi)\" keys are typed after this learning,\":-'4=g4,--11-16-I- \" contained in the prediction menu window."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "Efficiency of the proposed system is shown by means of experiments."
      ]
    },
    {
      "heading": "4.1 Evaluation Measures",
      "text": [
        "Neither start key for prediction nor cancel key for prediction candidates are needed.",
        "And se-lea key to adopt candidates is needed in both of prediction and ordinary kana-kanji conversion; we need not take into account of the input of select key.",
        "Thence, the length of complemented liana characters is just a decrease in key input operations.",
        "Two evaluation measures, an operation ratio and a precision, are defined as follows:",
        "where P is the length of the original kana text, Q is the length of kana characters complemented by prediction, R is the number of shown prediction menu windows containing appropriate choices, and S is the number of all of shown prediction menu windows."
      ]
    },
    {
      "heading": "4.2 Data and Conditions",
      "text": [
        "Two kind of texts, a paper on natural language processing and a letter, were used in our experiments; these texts were not included in the corpora used to calculate certainty factor.",
        "A system dictionary with 37,926 entries was used.",
        "Thresholds or certainty factor and usefulness factor were 0.1 and 2.",
        "The number of candidates presented in a prediction menu window was five or less.",
        "If a prediction menu window contained an appropriate clan cc, it was always adopted.",
        "With a view to examining each contribution of the system dictionary and user learning, experiments were carried out in three cases: (i) Only the system dictionary was used.",
        "(ii) Only user learning was used.",
        "(iii) Both the system dictionary and user learning were used.",
        "We calculated the length of complemented kana characters automatically.",
        "An operation ratio and a precision were recorded at every input of 4,500 kana characters."
      ]
    },
    {
      "heading": "4.3 Results",
      "text": [
        "Figure 3 shows experimental results.",
        "Decrease in key input operations: Using both the system dictionary and user learning, for the paper, an operation ratio was 97.3-78.6% (line (r3) in Fig.3(a)) and a precision was 20.0-26.7% (line (p3) in Fig.3(c)); for the letter, an operation ratio was 80.7-78.1% (line (r3) in Fig.3(b)) and a precision was 261-29.6% (line (p3) in",
        "Fig.3(d)).",
        "When 45,000 lama characters were typed, an average of the operation ratio was 78%, that is, a 22% decrease in the original operations was obtained; an average of the precision was 25%, that is, a quarter of shown prediction menu windows contained appropriate choices.",
        "This precision was enough to realize comfortable operations.",
        "Contribution of the system dictionary: Using only the system dictionary, for the paper, an operation ratio was 97.6-96.6% (line (ri) in Fig.3(a)), that is, a 2.4-3.4% decrease in the original operations was obtained; for the letter, an operation ratio was 90.6-78.8% (line (r]) in Fig.3(b)), that is, a 9.4-21.2% decrease in the original operations was obtained.",
        "As a result, the system dictionary is effective for a text like a letter with idioms or common phrases, because",
        "the system dictionary includes a lot of such phrases.",
        "Furthermore, compared a precision using both tile system dictionary and user learning with that using only user learning, the former was worse for the paper (lines (p2) and (p3) in Fig.3(c)(d)).",
        "As a result, for som.e kind of texts, the system dictionary not only is ineffective but also reduces a precision.",
        "Contribution of user learning: User learning had an effect for an operation ratio after more than 9,000 kana, characters were typed (lines (1.2) in Fig.(a)(b)).",
        "In fact, if the user types about ten pages of texts, a 15-20% decrease in the original operations can be obtained."
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "We proposed a kana-kanji conversion system.",
        "with input support based on prediction.",
        "Our system features: (i) It shows prediction candidates of kanji character strings which the user intends to input without any special key operation.",
        "If no appropriate choice is presented, the candidates disappear automatically when the next kana character is entered.",
        "(ii) Arbitrary positions of typed kana character strings are regarded as the top of words.",
        "(iii) A system dictionary and a user dictionary are used, and each entry in the system dictionary has certainly factor calculated from the frequency of words in corpora.",
        "(iv) Candidates are estimated by certainty factor and usefulness factor, and likely ones with greater factors than thresholds A...9, are shown.",
        "(v) Words and phrases are extracted from typed texts, and registered into the user dictionary au-tomati The proposed system could reduce the user's key input operations to 78% from the original ones in the experiments using two kinds of texts.",
        "This system was built into the TOSHIBA Japanese word processor, the JW-8020, which was released in autumn 1998 (Fig.4).",
        "To raise a precision by field information and context of texts is our future work."
      ]
    }
  ]
}
