{
  "info": {
    "authors": [
      "Aria Haghighi",
      "Dan Klein"
    ],
    "book": "Proceedings of the ACL 2010 Conference Short Papers",
    "id": "acl-P10-2054",
    "title": "An Entity-Level Approach to Information Extraction",
    "url": "https://aclweb.org/anthology/P10-2054",
    "year": 2010
  },
  "references": [
    "acl-D07-1075",
    "acl-D09-1016",
    "acl-P06-1055"
  ],
  "sections": [
    {
      "text": [
        "Aria Haghighi Dan Klein",
        "UC Berkeley, CS Division UC Berkeley, CS Division",
        "We present a generative model of template-filling in which coreference resolution and role assignment are jointly determined.",
        "Underlying template roles first generate abstract entities, which in turn generate concrete textual mentions.",
        "On the standard corporate acquisitions dataset, joint resolution in our entity-level model reduces error over a mention-level discriminative approach by up to 20%."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Template-filling information extraction (IE) systems must merge information across multiple sentences to identify all role fillers of interest.",
        "For instance, in the MUC4 terrorism event extraction task, the entity filling the individual perpetrator role often occurs multiple times, variously as proper, nominal, or pronominal mentions.",
        "However, most template-filling systems (Freitag and McCallum, 2000; Patwardhan and Riloff, 2007) assign roles to individual textual mentions using only local context as evidence, leaving aggregation for post-processing.",
        "While prior work has acknowledged that coreference resolution and discourse analysis are integral to accurate role identification, to our knowledge no model has been proposed which jointly models these phenomena.",
        "In this work, we describe an entity-centered approach to template-filling IE problems.",
        "Our model jointly merges surface mentions into underlying entities (coreference resolution) and assigns roles to those discovered entities.",
        "In the generative process proposed here, document entities are generated for each template role, along with a set of non-template entities.",
        "These entities then generate mentions in a process sensitive to both lexical and structural properties of the mention.",
        "Our model outperforms a discriminative mention-level baseline.",
        "Moreover, since our model is generative, it",
        "Template",
        "Document",
        "[S CSR] has said that [S it] has sold [S its] [B oil (b) interests] held in [A Delhi Fund].",
        "[P Esso Inc.] did not disclose how much [P they] paid for [A Dehli].",
        "Figure 1: Example of the corporate acquisitions role-filling task.",
        "In (a), an example template specifying the entities playing each domain role.",
        "In (b), an example document with coreferent mentions sharing the same role label.",
        "Note that pronoun mentions provide direct clues to entity roles.",
        "can naturally incorporate unannotated data, which further increases accuracy."
      ]
    },
    {
      "heading": "2. Problem Setting",
      "text": [
        "Figure 1(a) shows an example template-filling task from the corporate acquisitions domain (Freitag, 1998).",
        "We have a template of K roles (purchaser, amount, etc.)",
        "and we must identify which entity (if any) fills each role (CSR Limited, etc.).",
        "Often such problems are modeled at the mention level, directly labeling individual mentions as in Figure 1(b).",
        "Indeed, in this data set, the mention-level perspective is evident in the gold annotations, which ignore pronominal references.",
        "However, roles in this domain appear in several locations throughout the document, with pronominal mentions often carrying the critical information for template filling.",
        "Therefore, Section 3 presents a model in which entities are explicitly modeled, naturally merging information across all mention types and explicitly representing latent structure very much like the entity-level template structure from Figure 1(a).",
        "SELLER",
        "BUSINESS",
        "ACQUIRED",
        "PURCHASER",
        "CSR Limited",
        "Oil and Gas",
        "Delhi Fund",
        "Esso Inc.",
        "Purchaser Role",
        "Role Entity Parameters Other Entity Parameters",
        "Purchaser Mention",
        "Figure 2: Graphical model depiction of our generative model described in Section 3.",
        "Sample values are illustrated for key parameters and latent variables."
      ]
    },
    {
      "heading": "3. Model",
      "text": [
        "We describe our generative model for a document, which has many similarities to the coreference-only model of Haghighi and Klein (2010), but which integrally models template role-fillers.",
        "We briefly describe the key abstractions of our model.",
        "Mentions: A mention is an observed textual reference to a latent real-world entity.",
        "Mentions are associated with nodes in a parse tree and are typically realized as NPs.",
        "There are three basic forms of mentions: proper (NAM), nominal (NOM), and pronominal (PRO).",
        "Each mention M is represented as collection of key-value pairs.",
        "The keys are called properties and the values are words.",
        "The set of properties utilized here, denoted R, are the same as in Haghighi and Klein (2010) and consist of the mention head, its dependencies, and its governor.",
        "See Figure 2 for a concrete example.",
        "Mention types are trivially determined from mention head POS tag.",
        "All mention properties and their values are observed.",
        "Entities: An entity is a specific individual or object in the world.",
        "Entities are always latent in text.",
        "Where a mention has a single word for each property, an entity has a list of signature words.",
        "Formally, entities are mappings from properties r G R to lists Lr of \"canonical\" words which that entity uses for that property.",
        "Roles: The elements we have described so far are standard in many coreference systems.",
        "Our model performs role-filling by assuming that each entity is drawn from an underlying role.",
        "These roles include the K template roles as well as 'junk' roles to represent entities which do not fill a template role (see Section 5.2).",
        "Each role R is represented as a mapping between properties r and pairs of multinomials (6r, fr ).",
        "6r is aunigram distribution of words for property r that are semantically licensed for the role (e.g., being the subject of \"acquired\" for the acquired role).",
        "fr is a \"fertility\" distribution over the integers that characterizes entity list lengths.",
        "Together, these distributions control the lists Lr for entities which instantiate the role.",
        "We first present a broad sketch of our model's components and then detail each in a subsequent section.",
        "We temporarily assume that all mentions belong to a template role-filling entity; we lift this restriction in Section 5.2.",
        "First, a semantic component generates a sequence of entities E = (Ei,..., EK), where each Ej is generated from a corresponding role Rj.",
        "We use R = (R1;..., RK) to denote the vector of template role parameters.",
        "Note that this work assumes that there is a one-to-one mapping between entities and roles; in particular, at most one entity can fill each role.",
        "This assumption is appropriate for the domain considered here.",
        "Once entities have been generated, a discourse component generates which entities will be evoked in each of the n mention positions.",
        "We represent these choices using entity indicators denoted by Z = (Z1,..., Zn).",
        "This component utilizes a learned global prior 0 over roles.",
        "The Zj indicators take values in 1,..., K indicating the entity number (and thereby the role) underlying the ith mention position.",
        "Finally, a mention generation component renders each mention conditioned on the underlying entity and role.",
        "Formally: P(E, Z, M|R, 0) = restricted to antecedent mention positions j' which occur earlier in the same sentence or in the previous sentence.",
        "r",
        "0r",
        "fr",
        "GOV-NSUBJ",
        "[bought: 0.02, obtained:0.015, acquired: 0.01,...]",
        "[2: 0.18, 3:0.12, 1: 0.09,..",
        "HEAD-NAM",
        "[Inc.: 0.02,",
        "Corp.:0.015,",
        "Ltd.: 0.01,... ]",
        "[1: 0.19, 2:0.14,",
        "0: 0.08,..",
        "MOD-APPOS",
        "[company: 0.02, firm:0.015, group: 0.01,... ]",
        "[1: 0.02,",
        "0:0.015,",
        "2: 0.01,..",
        "Purchaser Entity",
        "r",
        "HEAD NAM",
        "Google, GOOG",
        "HEAD NOM",
        "company",
        "MOD NN",
        "search, giant",
        "MOD-PREP",
        "California",
        "r",
        "w",
        "HEAD-NAM",
        "Google",
        "GOV-NSUBJ",
        "bought",
        "Once the entity indicator has been drawn, we generate words associated with mention conditioned on the underlying entity E and role R. For each mention property r associated with the mention, a word w is drawn utilizing E's word list Lr as well as the multinomials (fr, 6r) from role R. The word w is drawn according to,",
        "HP (Mj lEZj ,Rz3",
        "Each role R generates an entity E as follows: for each mention property r, a word list, Lr, is drawn by first generating a list length from the corresponding fr distribution in R. This list is then populated by an independent draw from R's unigram distribution 6r.",
        "Formally, for each r G R, an entity word list is drawn according to,",
        "The discourse component draws the entity indicator Zj for the jth mention according to,",
        "P(Zj if non-pronominal",
        ".",
        "Xj, 1 Z?",
        "= Zj,]P(j'|j),o.w.",
        "When the jth mention is non-pronominal, we draw Zj from 0, a global prior over the K roles.",
        "When Mj is a pronoun, we first draw an antecedent mention position j', such that j' < j, and then we set Zj = Zj, .",
        "The antecedent position is selected according to the distribution, where TREEDiST(j',j) represents the tree distance between the parse nodes for Mj and Mj, .",
        "Mass is",
        "For each property r, there is a hyper-parameter arwhich interpolates between selecting a word uniformly from the entity list Lr and drawing from the underlying role distribution 6r.",
        "Intuitively, a small ar indicates that an entity prefers to reuse a small number of words for property r. This is typically the case for proper and nominal heads as well as modifiers.",
        "At the other extreme, setting ar to 1 indicates the property isn't particular to the entity itself, but rather always drawn from the underlying role distribution.",
        "We set ar to 1 for pronoun heads as well as for the governor properties."
      ]
    },
    {
      "heading": "4. Learning and Inference",
      "text": [
        "Since we will make use of unannotated data (see Section 5), we utilize a variational EM algorithm to learn parameters R and 0.",
        "The E-Step requires the posterior P (E, Z|R, M, 0), which is intractable to compute exactly.",
        "We approximate it using a surrogate variational distribution of the following factored form:",
        "Each rj(Zj) is a distribution over the entity indicator for mention Mj, which approximates the true posterior of Zj.",
        "Similarly, qi(Ei) approximates the posterior over entity Ei which is associated with role Ri.",
        "As is standard, we iteratively update each component distribution to minimize KL-divergence, fixing all other distributions:",
        "Table 1: Results on corporate acquisition tasks with given role mention boundaries.",
        "We report mention role accuracy and entity role accuracy (correctly labeling all entity mentions).",
        "For example, the update for a non-pronominal entity indicator component rj (•) is given by:",
        "A similar update is performed on pronominal entity indicator distributions, which we omit here for space.",
        "The update for variational entity distribution is given by:",
        "It is intractable to enumerate all possible entities ej (each consisting of several sets of words).",
        "We instead limit the support of qj(ej) to several sampled entities.",
        "We obtain entity samples by sampling mention entity indicators according to rj.",
        "For a given sample, we assume that Ej consists of the non-pronominal head words and modifiers of mentions such that Zj has sampled value i.",
        "During the E-Step, we perform 5 iterations of updating each variational factor, which results in an approximate posterior distribution.",
        "Using expectations from this approximate posterior, our M-Step is relatively straightforward.",
        "The role parameters Rj are computed from the qj(ei) and rj (z) distributions, and the global role prior < from the non-pronominal components of rj(z)."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "We present results on the corporate acquisitions task, which consists of 600 annotated documents split into a 300/300 train/test split.",
        "We use 50 training documents as a development set.",
        "In all documents, proper and (usually) nominal mentions are annotated with roles, while pronouns are not.",
        "We preprocess each document identically to Haghighi and Klein (2010): we sentence-segment using the OpenNLP toolkit, parse sentences with the Berkeley Parser (Petrov et al., 2006), and extract mention properties from parse trees and the Stanford Dependency Extractor (de Marneffe et al., 2006).",
        "We first consider the simplified task where role mention boundaries are given.",
        "We map each labeled token span in training and test data to a parse tree node that shares the same head.",
        "In this setting, the role-filling task is a collective classification problem, since we know each mention is filling some role.",
        "As our baseline, INDEP, we built a maximum entropy model which independently classifies each mention's role.",
        "It uses features as similar as possible to the generative model (and more), including the head word, typed dependencies of the head, various tree features, governing word, and several conjunctions of these features as well as coarser versions of lexicalized features.",
        "This system yields 60.0 mention labeling accuracy (see Table 1).",
        "The primary difficulty in classification is the disambiguation amongst the acquired, seller, and purchaser roles, which have similar internal structure, and differ primarily in their semantic contexts.",
        "Our entity-centered model, JOINT in Table 1, has no latent variables at training time in this setting, since each role maps to a unique entity.",
        "This model yields 64.6, outperforming INDEP.",
        "During development, we noted that often the most direct evidence of the role of an entity was associated with pronoun usage (see the first \"it\" in Figure 1).",
        "Training our model with pronominal mentions, whose roles are latent variables at training time, improves accuracy to 68.2.",
        "We now consider the more difficult setting where role mention boundaries are not provided at test time.",
        "In this setting, we automatically extract mentions from a parse tree using a heuristic ap-",
        "Ment Acc.",
        "Ent.",
        "Acc.",
        "INDEP",
        "60.0",
        "43.7",
        "JOINT",
        "64.6",
        "54.2",
        "JOINT+PRO",
        "68.2",
        "57.8",
        "Table 2: Results on corporate acquisitions data where mention boundaries are not provided.",
        "Systems must determine which mentions are template role-fillers as well as label them.",
        "ROLE ID only evaluates the binary decision of whether a mention is a template role-filler or not.",
        "Overall includes correctly labeling mentions.",
        "Our BEST system, see Section 5, adds extra unannotated data to our JOINT+PRO system.",
        "proach.",
        "Our mention extraction procedure yields 95% recall over annotated role mentions and 45% precision.",
        "Using extracted mentions as input, our task is to label some subset of the mentions with template roles.",
        "Since systems can label mentions as non-role bearing, only recall is critical to mention extraction.",
        "To adapt INDEP to this setting, we first use a binary classifier trained to distinguish role-bearing mentions.",
        "The baseline then classifies mentions which pass this first phase as before.",
        "We add 'junk' roles to our model to flexibly model entities that do not correspond to annotated template roles.",
        "During training, extracted mentions which are not matched in the labeled data have posteriors which are constrained to be amongst the 'junk' roles.",
        "We first evaluate role identification (Role ID in Table 2), the task of identifying mentions which play some role in the template.",
        "The binary classifier for INDEP yields 71.6 Fi.",
        "Our JOINT+PRO system yields 74.3.",
        "On the task of identifying and correctly labeling role mentions, our model outperforms INDEP as well (Overall in Table 2).",
        "As our model is generative, it is straightforward to utilize totally unannotated data.",
        "We added 700 fully unannotated documents from the mergers and acquisitions portion of the Reuters 21857 corpus.",
        "Training JOINT+PRO on this data as well as our original training data yields the best performance",
        "To our knowledge, the best previously published results on this dataset are from Siefkes (2008), who report 45.9 weighted Fi.",
        "Our BEST system evaluated in their slightly stricter way yields 51.1."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "We have presented a joint generative model of coreference resolution and role-filling information extraction.",
        "This model makes role decisions at the entity, rather than at the mention level.",
        "This approach naturally aggregates information across multiple mentions, incorporates unannotated data, and yields strong performance.",
        "Acknowledgements: This project is funded in part by the Office of Naval Research under MURI Grant No.",
        "N000140911081.",
        "Role ID",
        "Overall",
        "P",
        "R",
        "Fi",
        "P",
        "R",
        "Fi",
        "INDEP",
        "79.0",
        "65.5",
        "71.6",
        "48.6",
        "40.3",
        "44.0",
        "JOINT+PRO",
        "80.3",
        "69.2",
        "74.3",
        "53.4",
        "46.4",
        "49.7",
        "BEST",
        "80.1",
        "70.1",
        "74.8",
        "57.3",
        "49.2",
        "52.9"
      ]
    }
  ]
}
