{
  "info": {
    "authors": [
      "Asli Celikyilmaz",
      "Dilek Hakkani-Tur"
    ],
    "book": "ACL",
    "id": "acl-P12-1035",
    "title": "A Joint Model for Discovery of Aspects in Utterances",
    "url": "https://aclweb.org/anthology/P12-1035",
    "year": 2012
  },
  "references": [
    "acl-D09-1026",
    "acl-E09-1024",
    "acl-P06-1039",
    "acl-P06-1114",
    "acl-P09-1070",
    "acl-P10-1122",
    "acl-P10-1136",
    "acl-P11-1036",
    "acl-P11-1060",
    "acl-P11-1120",
    "acl-W04-3003",
    "acl-W10-2607"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We describe a joint model for understanding user actions in natural language utterances.",
        "Our multilayer generative approach uses both labeled and unlabeled utterances to jointly learn aspects regarding utterance's target domain (e.g. movies), intention (e.g., finding a movie) along with other semantic units (e.g., movie name).",
        "We inject information extracted from unstructured web search query logs as prior information to enhance the generative process of the natural language utterance understanding model.",
        "Using utterances from five domains, our approach shows up to 4.5% improvement on domain and dialog act performance over cascaded approach in which each semantic component is learned sequentially and a supervised joint learning model (which requires fully labeled data)."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Virtual personal assistance (VPA) is a human to machine dialog system, which is designed to perform tasks such as making reservations at restaurants, checking flight statuses, or planning weekend activities.",
        "A typical spoken language understanding (SLU) module of a VPA (Bangalore, 2006; Tur and Mori, 2011) defines a structured representation for utterances, in which the constituents correspond to meaning representations in terms of slot/value pairs (see Table 1).",
        "While target domain corresponds to the context of an utterance in a dialog, the dialog act represents overall intent of an utterance.",
        "The slots are entities, which are semantic constituents at the word or phrase level.",
        "Learning each component Sample utterances on ?plan a night out?",
        "scenario (I) Show me theaters in [Austin] playing [iron man 2].",
        "(II)I'm in the mood for [indian] food tonight, show me the ones [within 5 miles] that have [patios].",
        "mantic components, i.e., domain, dialog act, and slots.",
        "is a challenging task not only because there are no a priori constraints on what a user might say, but also systems must generalize from a tractably small amount of labeled training data.",
        "In this paper, we argue that each of these components are interdependent and should be modeled simultaneously.",
        "We build a joint understanding framework and introduce a multilayer context model for semantic representation of utterances of multiple domains.",
        "Although different strategies can be applied, typically a cascaded approach is used where each semantic component is modeled separately/sequentially (Begeja et al., 2004), focusing less on interrelated aspects, i.e., dialog's domain, user's intentions, and semantic tags that can be shared across domains.",
        "Recent work on SLU (Jeong and Lee, 2008; Wang, 2010) presents joint modeling of two components, i.e., the domain and slot or dialog act and slot components together.",
        "Furthermore, most of these systems rely on labeled training utterances, focusing little on issues such as information sharing between the discourse and word level components across different domains, or variations in use of language.",
        "To deal with de",
        "pendency and language variability issues, a model that considers dependencies between semantic components and utilizes information from large bodies of unlabeled text can be beneficial for SLU.",
        "In this paper, we present a novel generative Bayesian model that learns domain/dialog-act/slot semantic components as latent aspects of text utterances.",
        "Our approach can identify these semantic components simultaneously in a hierarchical framework that enables the learning of dependencies.",
        "We incorporate prior knowledge that we observe in web search query logs as constraints on these latent aspects.",
        "Our model can discover associations between words within a multi-layered aspect model, in which some words are indicative of higher layer (meta) aspects (domain or dialog act components), while others are indicative of lower layer specific entities.",
        "The contributions of this paper are as follows: (i) construction of a novel Bayesian framework for semantic parsing of natural language (NL) utterances in a unifying framework in ?4, (ii) representation of seed labeled data and information from web queries as informative prior to design a novel utterance understanding model in ?3 & ?4, (iii) comparison of our results to supervised sequential and joint learning methods on NL utterances in ?5.",
        "We conclude that our generative model achieves noticeable improvement compared to discriminative models when labeled data is scarce."
      ]
    },
    {
      "heading": "2 Background",
      "text": [
        "Language understanding has been well studied in the context of question/answering (Harabagiu and Hickl, 2006; Liang et al., 2011), entailment (Sam-mons et al., 2010), summarization (Hovy et al., 2005; Daume?-III and Marcu, 2006), spoken language understanding (Tur and Mori, 2011; Dinarelli et al., 2009), query understanding (Popescu et al., 2010; Li, 2010; Reisinger and Paşca, 2011), etc.",
        "However data sources in VPA systems pose new challenges, such as variability and ambiguities in natural language, or short utterances that rarely contain contextual information, etc.",
        "Thus, SLU plays an important role in allowing any sophisticated spoken dialog system (e.g., DARPA Calo (Berry et al., 2011), Siri, etc.)",
        "to take the correct machine actions.",
        "A common approach to building SLU framework is to model its semantic components separately, assuming that the context (domain) is given a priori.",
        "Earlier work takes dialog act identification as a classification task to capture the user's intentions (Margolis et al., 2010) and slot filling as a sequence learning task specific to a given domain class (Wang et al., 2009; Li, 2010).",
        "Since these tasks are considered as a pipeline, the errors of each component are transfered to the next, causing robustness issues.",
        "Ideally, these components should be modeled simultaneously considering the dependencies between them.",
        "For example, in a local domain application, users may require information about a sub-domain (movies, hotels, etc.",
        "), and for each sub-domain, they may want to take different actions (find a movie, call a restaurant or book a hotel) using domain specific attributes (e.g., cuisine type of a restaurant, titles for movies or star-rating of a hotel).",
        "There's been little attention in the literature on modeling the dependencies of SLU's correlated structures.",
        "Only recent research has focused on the joint modeling of SLU (Jeong and Lee, 2008; Wang, 2010) taking into account the dependencies at learning time.",
        "In (Jeong and Lee, 2008), a triangular chain conditional random fields (Tri-CRF) approach is presented to model two of the SLU's components in a single-pass.",
        "Their discriminative approach represents semantic slots and discourse-level utterance labels (domain or dialog act) in a single structure to encode dependencies.",
        "However, their model requires fully labeled utterances for training, which can be time consuming and expensive to generate for dynamic systems.",
        "Also, they can only learn dependencies between two components simultaneously.",
        "Our approach differs from the earlier work-in that-we take the utterance understanding as a multi-layered learning problem, and build a hierarchical clustering model.",
        "Our joint model can discover domain D, and user's act A as higher layer latent concepts of utterances in relation to lower layer latent semantic topics (slots) S such as named-entities (?New York?)",
        "or context bearing non-named entities (?vegan?).",
        "Our work resembles the earlier work of PAM models (Mimno et al., 2007), i.e., directed acyclic graphs representing mixtures of hierarchical topic structures, where upper level topics are multinomial over lower level topics in a hierarchy.",
        "In an analogical way to earlier work, the D and A in our",
        "approach represent common co-occurrence patterns (dependencies) between semantic tags S (Fig.",
        "2).",
        "Concretely, correlated topics eliminate assignment of semantic tags to segments in an utterance that belong to other domains, e.g., we can discover that ?Show me vegan restaurants in San Francisco?",
        "has a low probably of outputting a movie-actor slot.",
        "Being generative, our model can incorporate unlabeled utterances and encode prior information of concepts."
      ]
    },
    {
      "heading": "3 Data and Approach Overview",
      "text": [
        "Here we define several abstractions of our joint model as depicted in Fig. 1.",
        "Our corpus mainly contains NL utterances (?show me the nearest dim-sum places?)",
        "and some keyword queries (?iron man 2 trailers?).",
        "We represent each utterance u as a vector wu of Nu word n-grams (segments), wuj , each of which are chosen from a vocabulary W of fixed-size V. We use entity lists obtained from web sources (explained next) to identify segments in the corpus.",
        "Our corpus contains utterances from KD=4 main domains:?",
        "{movies, hotels, restaurants, events}, as well as out-of-domain other class.",
        "Each utterance has one dialog act (A) associated with it.",
        "We assume a fixed number of possible dialog acts KA for each domain.",
        "Semantic Tags, slots (S) are lexical units (segments) of an utterance, which we classify into two types: domain-independent slots that are shared across all domains, (e.g., location, time, year, etc.",
        "), and domain-dependent slots, (e.g. movie-name, actor-name, restaurant-name, etc.).",
        "For tractability, we consider a fixed number of latent slot types KS .",
        "Our algorithm assigns domain/dialog-act/slot labels to each topic at each layer in the hierarchy using labeled data (explained in ?4.)",
        "We represent domain and dialog act components as meta-variables of utterances.",
        "This is similar to author-topic models (Rosen-Zvi et al., 2004), that capture author-topic relations across documents.",
        "In that case, words are generated by first selecting an author uniformly from an observed author list and then selecting a topic from a distribution over words that is specific to that author.",
        "In our model, each utterance u is associated with domain and dialog act topics.",
        "A word wuj in u is generated by first selecting a domain and an act topic and then slot topic over words of u.",
        "The domain-dependent slots in utterances are usually not dependent on the dialog act.",
        "For instance, while ?find [hugo] trailer?",
        "and ?show me where [hugo] is playing?",
        "have both a movie-name slot (?hugo?",
        "), they have different dialog acts, i.e., find-trailer and find-movie, respectively.",
        "We predict posterior probabilities for domain P?",
        "(d ?",
        "D|u) dialog act P?",
        "(a ?",
        "A|ud) and slots P?",
        "(sj ?",
        "S|wuj , d, sj?1) of words wuj in sequence.",
        "To handle language variability, and hence discover correlation between hierarchical aspects of utterances1, we extract prior information from two web resources as follows: Web n-Grams (G).",
        "Large-scale engines such as Bing or Google log more than 100M search queries each day.",
        "Each query in the search logs has an associated set of URLs that were clicked after users entered a given query.",
        "The click information can be used to infer domain class labels, and therefore, can provide (noisy) supervision in training domain classifiers.",
        "For example, two queries (?cheap hotels Las Vegas?",
        "and ?wine resorts in Napa?",
        "), which resulted in clicks on the same base URL (e.g., www.hotels.com) probably belong to the same domain (?hotels?",
        "in this case).",
        "movie rest.",
        "hotel event other",
        "Given query logs, we compile sets of in-domain queries based on their base URLs2.",
        "Then, for each vocabulary item wj ?",
        "W in our corpus, we calculate frequency of wj in each set of in-domain queries and represent each word (e.g., ?room?)",
        "as a discrete normalized probability distribution ?jG over KD domains",
        "G. We inject them as nonuniform priors over domain and dialog act parameters in ?4.",
        "Entity Lists (E).",
        "We limit our model to a set of named-entity slots (e.g., movie-name, restaurant-name) and non-named entity slots (e.g., restaurant-cuisine, hotel-rating).",
        "For each entity slot, we extract a large collection of entity lists through the url's on the web that correspond to our domains, such as movie-names listed on IMDB, restaurant-names",
        "variables.",
        "Hyper-parameters are omitted.",
        "Sample informative priors over latent topics ?E and ?G are shown.",
        "Blue arrows indicate frequency of vocabulary terms sampled for each topic.",
        "We represent each entity list as observed nonuniform priors ?E and inject them into our joint learning process as V sparse multinomial distributions over latent topics D, and S to ?guide?",
        "the generation of utterances (Fig.",
        "1 top-left table), explained in ?4."
      ]
    },
    {
      "heading": "4 Multi-Layer Context Model - MCM",
      "text": [
        "The generative process of our multilayer context model (MCM) (Fig.",
        "1) is shown in Algorithm 1.",
        "Each utterance u is associated with d = 1..KD multinomial domain-topic distributions ?dD.",
        "Each domain d, is represented as a distribution over a = 1, ..,KA dialog acts ?daA (?",
        "d D ?",
        "?",
        "da A ).",
        "In our MCM model, we assume that each utterance is represented as a hidden Markov model with KS slot states.",
        "Each state generates n-grams according to a multinomial n-gram distribution.",
        "Once domain Du and act Aud topics are sampled for u, a slot state topic Sujd is drawn to generate each segment wuj of u by considering the word-tag sequence frequencies based on a simple HMM assumption, similar to the content models of (Sauper et al., 2011).",
        "Initial and transition probability distributions over the HMM states are sampled from Dirichlet distribution over slots ?dsS .",
        "Each slot state s generates words according to multinomial word distribution ?sS .",
        "We also keep track of the frequency of vocabulary termswj's in a V ?KD ma-trixMD.",
        "Every time awj is sampled for a domain d, we increment its count, a degree of domain bearing words.",
        "Similarly, we keep track of dialog act and slot bearing words in V ?KA and V ?KS matrices, MA and MS (shown as red arrows in Fig 1).",
        "Being Bayesian, each distribution ?dD, ?",
        "ad A , and ?",
        "ds S is sampled from a Dirichlet prior distribution with different parameters, described next.",
        "Algorithm 1 Multi-Layer Context Model Generation",
        "1: for each domain d?",
        "1, ...,KD 2: draw domain dist.",
        "?dD ?",
        "Dir(?",
        "?",
        "D) ?, 3: for each dialog-act a?",
        "1, ...,KA 4: draw dialog act dist.",
        "?daA ?",
        "Dir(?",
        "?",
        "A), 5: for each slot type s?",
        "1, ...,KS 6: draw slot dist.",
        "?dsS ?",
        "Dir(?",
        "?",
        "S).",
        "7: endfor 8: draw ?sS ?",
        "Dir(?)",
        "for each slot type s?",
        "1, ...,KS .",
        "9: for each utterance u?",
        "1, ..., |U |do 10: Sample a domain Du?Multi(?dD) and, 11: and act topic Aud?Multi(?daA ).",
        "12: for words wuj , j ?",
        "1, ..., Nu do 13: - Draw Sujd?Multi(?",
        "S) are parameterized based on prior knowledge.",
        "?",
        "Here HMM assumption over utterance words is used.",
        "In hierarchical topic models (Blei et al., 2003; Mimno et al., 2007), etc., topics are represented as distributions over words, and each document expresses an admixture of these topics, both of which have symmetric Dirichlet (Dir) prior distributions.",
        "Symmetric Dirichlet distributions are often used, since there is typically no prior knowledge favoring one component over another.",
        "In the topic model literature, such constraints are sometimes used to deterministically allocate topic assignments to known labels (Labeled Topic Modeling (Ramage et al., 2009)) or in terms of pre-learnt topics encoded as prior knowledge on topic distributions in documents (Reisinger and Pas?ca, 2009).",
        "Similar to previous work, we define a latent topic per each known semantic component label, e.g., five domain topics for five defined domains.",
        "Different from earlier work though, we also inject knowledge that we extract from several resources including entity lists from web search query click logs as well as seed labeled training utterances as prior information.",
        "We constrain the generation of the semantic components of our model by encoding prior knowledge in terms of",
        "asymmetric Dirichlet topic priors ?=(?m1,...,?mK) where each kth topic has a prior weight ?k=?mk, with varying base measure m=(m1,...,mk) 3.",
        "We update parameter vectors of Dirichlet domain prior ?u?D ={(?D?",
        "?",
        "the concentration parameter for domain Dirichlet distribution and ?uD={?",
        "d=1 is the base measure which we obtain from various resources.",
        "Because base measure updates are dependent on prior knowledge of corpus words, each utterance u gets a different base measure.",
        "Similarly, we update the parameter vector of the Dirichlet dialog act and slot priors ?u?A ={(?A?",
        "?",
        "Before describing base measure update for domain, act and slot Dirichlet priors, we explain the constraining prior knowledge parameters below: ?",
        "Entity List Base Measure(?jE): Entity features are indicative of domain and slots and MCM utilizes these features while sampling topics.",
        "For instance, entities hotel-name ?Hilton?",
        "and location ?New York?",
        "are discriminative features in classifying ?find nice cheap double room in New York Hilton?",
        "into correct domain (hotel) and slot (hotel-name) clusters.",
        "We represent entity lists corresponding to known domains as multinomial distributions ?jE , where each ?",
        "d|j E is the probability of entity-word wj used in the domain d. Some entities may belong to more than one domain, e.g., ?hotel California?",
        "can either be a movie, or song or hotel name.",
        "?",
        "Web n-Gram Context Base Measure (?jG): As explained in ?3, we use the web n-grams as additional information for calculating the base measures of the Dirichlet topic distributions.",
        "Normalized word distributions ?jG over domains were used as weights for domain and dialog act base measure.",
        "?",
        "Corpus n-Gram Base Measure (?jC): Similar to other measures, MCM also encodes n-gram constraints as word-frequency features extracted from labeled utterances.",
        "Concretely, we calculate the frequency of vocabulary items given domain-act label pairs from the training labeled utterances and convert there into probability measures over domain-acts.",
        "We encode conditional",
        "In (1) we assume that entities (E) are more indicative of the domain compared to other n-grams (G) and should be more dominant in sampling decision for domain topics.",
        "Given an utterance u, we calculate its base measure ?udD =(",
        "Once the domain is sampled, we update the prior weight of dialog acts Aud = a:",
        "Then we update their base measures for a given u as:"
      ]
    },
    {
      "heading": "4.1 Inference and Learning",
      "text": [
        "The goal of inference is to predict the domain, user's act and slot distributions over each segment given an utterance.",
        "The MCM has the following set of parameters: domain-topic distributions ?dD for each u, the act-topic distributions ?daA for each domain topic d of u, local slot-topic distributions for each domain ?S , and ?sS for slot-word distributions.",
        "Previous work (Asuncion et al., 2009; Wallach et al., 2009) shows that the choice of inference method has negligible effect on the probability of testing documents or inferred topics.",
        "Thus, we use Markov",
        "slot state Sujd, we assume that utterance is generated by the HMM model associated with the assigned domain.",
        "For each segment wuj in u, we sample a slot state Sujd given the remaining slots and hyper",
        "The Nkujd is the number of times segment wuj is generated from slot state s in all utterances assigned to domain topic d, NDu,s1s2 is the number of transitions from slot state s1 to s2, where"
      ]
    },
    {
      "heading": "4.2 Semantic Structure Extraction with MCM",
      "text": [
        "During Gibbs sampling, we keep track of the frequency of draws of domain, dialog act and slot indicating n-grams wj , in MD, MA and MS matrices, respectively.",
        "These n-grams are context bearing words (examples are shown in Fig.1.).",
        "For given u the predicted domain d?u is determined by:",
        "and predicted dialog act by arg maxa P?",
        "(a|ud ?",
        "):"
      ]
    },
    {
      "heading": "5 Experiments",
      "text": [
        "We performed several experiments to evaluate our proposed approach.",
        "Before presenting our results, we describe our datasets as well as two baselines."
      ]
    },
    {
      "heading": "5.1 Datasets, Labels and Tags",
      "text": [
        "Our dataset contains utterances obtained from di-alogs between human users and our personal assistant system.",
        "We use the transcribed text forms of Domain Sample Dialog Acts (DAs) & Slots movie DAs: find-movie/director/actor,buy-ticket Slots: name, mpaa-rating (g-rated), date, director/actor-name, award(oscar winning)... hotel DAs: find-hotel, book-hotel, Slots: name, room-type(double), amenities, smoking, reward-program(platinum elite)... restaurant DAs: find-restaurant, make-reservation, Slots: opening-hour, amenities, meal-type,... event DAs: find-event/ticket/performers, get-info..",
        "Slots: name, type(concert), performer....",
        "tags of utterance segments.",
        "Examples for some slots values are presented in parenthesis as italicized.",
        "the utterances obtained from (acoustic modeling engine) to train our models 4.",
        "Thus, our dataset contains 18084 NL utterances, 5034 of which are used for measuring the performance of our models.",
        "The dataset consists of five domain classes, i.e, movie, restaurant, hotel, event, other, 42 unique dialog acts and 41 slot tags.",
        "Each utterance is labeled with a domain, dialog act and a sequence of slot tags corresponding to segments in utterance (see examples in Table 1).",
        "Table 2 shows sample dialog act and slot labels.",
        "Annotation agreement, Kappa measure (Cohen, 1960), was around 85%.",
        "We pulled a month of web query logs and extracted over 2 million search queries from the movie, hotel, event, and restaurant domains.",
        "We also used generic web queries to compile a set of ?other?",
        "domain queries.",
        "Our vocabulary consists of n-grams and segments (phrases) in utterances that are extracted using web n-grams and entity lists of ?3.",
        "We extract distributions of n-grams and entities to inject as prior weights for entity list base (?jE) and web n-gram context base measures (?jG) (see ?4)."
      ]
    },
    {
      "heading": "5.2 Baselines and Experiment Setup",
      "text": [
        "We evaluated two baselines and two variants of our",
        "joint SLU approach as follows: ?",
        "Sequence-SLU: A traditional approach to SLU",
        "extracts domain, dialog act and slots as semantic components of utterances using three sequential models.",
        "Typically, domain and dialog act detection models are taken as query classification, where a given NL query is assigned domain and act labels.",
        "Among supervised query classification meth",
        "Model (MCM).",
        "Given samples of utterances, MCM is able to infer a meaningful set of dialog act (A) and slots (S), falling into broad categories of domain classes (D).",
        "ods, we used the Adaboost, utterance classification method that starts from a set of weak classifiers and builds a strong classifier by boosting the weak classifiers.",
        "Slot discovery is taken as a sequence la-beling task in which segments in utterances are labeled (Li, 2010).",
        "For segment labeling we use Semi"
      ]
    },
    {
      "heading": "Markov Conditional Random Fields (Semi-CRF)",
      "text": [
        "(Sarawagi and Cohen, 2004) method as a benchmark in evaluating semantic tagging performance.",
        "?",
        "Tri-CRF: We used Triangular Chain CRF (Jeong and Lee, 2008) as our supervised joint model baseline.",
        "It is a state-of-the art method that learns the sequence labels and utterance class (domain or dialog act) as meta-sequence in a joint framework.",
        "It encodes the interdependence between the slot sequence s and meta-sequence label (d or a) using a triangular chain (dual-layer) structure.",
        "?",
        "Base-MCM: Our first version injects an informative prior for domain, dialog act and slot topic distributions using information extracted from only labeled training utterances and inject as prior constraints (corpus n-gram base measure ?jC) during topic assignments.",
        "?",
        "WebPrior-MCM: Our full model encodes distributions extracted from labeled training data as well as structured web logs as asymmetric Dirichlet priors.",
        "We analyze performance gain by the information from web sources (?jG and ?",
        "j E) when injected into our approach compared to Base-MCM.",
        "We inject dictionary constraints as features to train supervised discriminative methods, i.e., boosting and Semi-CRF in Sequence-SLU, and Tri-CRF models.",
        "For semantic tagging, dictionary constraints apply to the features between individual segments and their labels, and for utterance classification (to predict domain and dialog acts) they apply to the features between utterance and its label.",
        "Given a list of dictionaries, these constraints specify which label is more likely.",
        "For discriminative methods, we use several named entities, e.g., Movie-Name, Restaurant-Name, Hotel-Name, etc., non-named entities, e.g., Genre, Cuisine, etc., and domain independent dictionaries, e.g., Time, Location, etc.",
        "We train domain and dialog act classifiers via Icsiboost (Favre et al., 2007) with 10K iterations using lexical features (up to 3-n-grams) and constraining dictionary features (all dictionaries).",
        "For feature templates of sequence learners, i.e., Semi-CRF and Tri-CRF, we use current word, bi-gram and dictionary features.",
        "For Base-MCM and WebPrior-MCM, we run Gibbs sampler for 2000 iterations with the first 500 samples as burn-in."
      ]
    },
    {
      "heading": "5.3 Evaluations and Discussions",
      "text": [
        "We evaluate the performance of our joint model on two experiments using two metrics.",
        "For domain and dialog act detection performance we present results in accuracy, and for slot detection we use the F1 pairwise measure.",
        "Experiment 1.",
        "Encoding Prior Knowledge: A common evaluation method in SLU tasks is to measure the performance of each individual semantic model, i.e., domain, dialog act and semantic tagging (slot filling).",
        "Here, we not only want to demonstrate the performance of each component of MCM but also their performance under limited amount of labeled data.",
        "We randomly select subsets of labeled training data U iL ?",
        "UL with different samples sizes, niL ={?",
        "?nL}, where nL represents the sample size of UL and ?={10%,25%,..} is the subset percentage.",
        "At each random selection, the rest of the utterances are used as unlabeled data to boost the performance of MCM.",
        "The supervised baselines do not leverage the unlabeled utterances.",
        "The results reported in Figure 3 reveal both the strengths and some shortcomings of our approach.",
        "When the number of labeled data is small (niL ?25%*nL), our WebPrior-MCM has a better performance on domain and act predictions compared to the two baselines.",
        "Compared to Sequence-SLU, we observe 4.5% and 3% performance improvement on the domain and dialog act",
        "models, whereas our gain is 2.6% and 1.7% over Tri-CRF models.",
        "As the percentage of labeled utterances in training data increase, Tri-CRF performance increases, however WebPrior-MCM is still comparable with Sequence-SLU.",
        "This is because we utilize domain priors obtained from the web sources as supervision during generative process as well as unlabeled utterances that enable handling language variability.",
        "Adding labeled data improves the performance of all models however supervised models benefit more compared to MCM models.",
        "Although WebPrior-MCM's domain and dialog act performances are comparable (if not better than) the other baselines, it falls short on the semantic tagging model.",
        "This is partially due to the HMM assumption compared to the supervised conditional model's used in the other baselines, i.e., Semi-CRF in Sequence-SLU and Tri-CRF).",
        "Our work can be extended by replacing HMM assumption with CRF based sequence learner to enhance the capability of the sequence tagging component of MCM.",
        "Experiment 2.",
        "Less is More?",
        "Being Bayesian, our model can incorporate unlabeled data at training time.",
        "Here, we evaluate the performance gain on domain, act and slot predictions as more unlabeled data is introduced at learning time.",
        "We use only 10% of the utterances as labeled data in this experiment and incrementally add unlabeled data (90% of labeled data are treated as unlabeled).",
        "The results are shown in Table 3. n% (n=10,25,..) unlabeled data indicates that the WebPrior-MCM is trained using n% of unlabeled utterances along with training utterances.",
        "Adding unlabeled data has a positive impact on the performance of all three se",
        "mantic components when WebPrior-MCM is used.",
        "The results show that our joint modeling approach has an advantage over the other joint models (i.e., Tri-CRF) in that it can leverage unlabeled NL utterances.",
        "Our approach might be usefully extended into the area of understanding search queries, where an abundance of unlabeled queries is observed."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "In this work, we introduced a joint approach to spoken language understanding that integrates two properties (i) identifying user actions in multiple domains in relation to semantic units, (ii) utilizing large amounts of unlabeled web search queries that suggest the user's hidden intentions.",
        "We proposed a semi-supervised generative joint learning approach tailored for injecting prior knowledge to enhance the semantic component extraction from utterances as a unifying framework.",
        "Experimental results using the new Bayesian model indicate that we can effectively learn and discover meta-aspects in natural language utterances, outperforming the supervised baselines, especially when there are fewer labeled and more unlabeled utterances."
      ]
    }
  ]
}
