{
  "info": {
    "authors": [
      "Peter Schauble",
      "Ulrike Glavitsch"
    ],
    "book": "Human Language Technology Conference",
    "id": "acl-H94-1073",
    "title": "Assessing the Retrieval Effectiveness of a Speech :Retrieval System by Simulating Recognition Errors",
    "url": "https://aclweb.org/anthology/H94-1073",
    "year": 1994
  },
  "references": [],
  "sections": [
    {
      "text": [
        "We show how the recognition performance of a speech recognition component in a speech retrieval system affects the retrieval effectiveness.",
        "A speech retrieval system facilitates content-based retrieval of speech documents, i.e. audio recordings containing spoken text.",
        "The speech retrieval process receives queries from users and for every query it ranks the speech documents in decreasing order of their probabilities that they are relevant to the query.",
        "The speech recognition component is an important part of a speech retrieval system, since it detects the occurrences of indexing features in the documents.",
        "Because the recognition of indexing features in continuous speech is error prone, the question arises how much an error prone recognition of indexing features affects the retrieval effectiveness.",
        "As an answer to this question and main contribution of this paper we simulated the recognition of indexing features in speech documents on standard information retrieval test collections and show the resulting retrieval accuracies."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "We show how the recognition performance of a speech recognition component in a speech retrieval system affects the retrieval effectiveness.",
        "A speech retrieval system facilitates content-based retrieval of speech documents, i.e. audio recordings containing spoken text [5].",
        "The speech retrieval process receives queries from users and for every query it ranks the speech documents in decreasing order of their probabilities that they are relevant to the query.",
        "These probabilities are derived from the occurrences of indexing features that were identified in the speech documents by a speech recognition component [4].",
        "Because the recognition of indexing features in continuous speech is error prone, the question arises how much an error prone recognition of indexing features affects the retrieval effectiveness.",
        "The indexing features used in our speech retrieval system are phonetically motivated subword units having an intermediate specificity.",
        "The general pattern of an indexing feature is a maximum sequence of consonants enclosed by two maximum sequences of vowels at both ends.",
        "We call these indexing features VCV-features where C stands for the maximum sequence of consonants and V stands for the maximum sequence of vowels.",
        "As an example, the word INTERNATIONAL contains the VCV-features INTE, ERNA, ATIO, and IONA.",
        "The indexing vocabulary is defined to be the set of those VCV-features gyp; whose inverse document frequencies idf(coi) are between a lower bound idfmin and an upper bound idfmax such that the indexing features are neither",
        "very specific nor very broad.",
        "The lower bound guarantees the suitability for indexing and the upper bound guarantees the trainability, i.e. there are enough examples to train the HMMs.",
        "Experiments on standard information retrieval test collections showed that when using an appropriate subset of only 1000 VCV-features we can achieve a retrieval effectiveness that is comparable to standard weighted retrieval which is based on a much larger indexing vocabulary [4].",
        "In addition to the VCV-features, we have also studied indexing vocabularies that have been extended by CV and VC-features at the word boundaries The recognition of speech documents is carried out with standard speech recognition technology, i.e. a wordspotter [6], [11], [14] locates the occurrences of indexing features in documents.",
        "For each document in the collection we create a description vector based on the number of occurrences of each feature and use a conventional retrieval function [12] to estimate the similarity between a document and a query description.",
        "Our indexing features consisting of VCV-features can be identified in both text and speech documents.",
        "As a consequence, the document collection may contain a mixture of text and speech documents.",
        "Furthermore, the query may also be entered as either text or speech.",
        "The controlled indexing vocabulary consisting of selected VCV-features has the advantage that the document description can be computed before the query evaluation.",
        "In particular, an access structure (e.g. an inverted file) can be constructed to allow fast query evaluation.",
        "Another important advantage of our indexing vocabulary for both text and speech retrieval is that speech retrieval can simulated by using text collections as described in the subsequent sections.",
        "Information Retrieval on audio documents has been investigated very little.",
        "A wordspotting system for voice indexing was developed by Wilcox and Bush [14] and an information retrieval system that classifies speech messages was presented by Rose, Chang, and Lippmann [10].",
        "Recently a project for video mail retrieval using voice was proposed by Olivetti research Limited, Cambridge University Engineering Department, and Cambridge University Computer Laboratory [7].",
        "The effects of recognition errors on on the retrieval effectiveness has been studied in the context of OCR based Information Retrieval [1].",
        "These results are not directly comparable because speech retrieval performance may be considerably affected by false alarms in contrast to OCR-based retrieval where false alarms can be ignored because the occur infrequently.",
        "MEDLARS: average precision of the reference method: 0.534 (100%)",
        "(key word) per hour within the range of 0 and 140.",
        "The numbers in brackets represent the percentage of the average precision of the reference method, i.e. a standard text retrieval method.",
        "The main contribution of this paper is the conclusion that speech retrieval is feasible to some extent even when the recognition performance is poor.",
        "A closer look reveals that recognition errors and occurrences of query features in the documents have different distributions and standard retrieval methods are quite good in distinguishing these two distributions.",
        "The next two sections describe the test setting and the results respectively.",
        "Then, some conclusions are drawn.",
        "2.",
        "Test Setting",
        "The experiments are performed by means of the the standard information retrieval text collections CRANFIELD, MED-LARS, and CACM [2].",
        "The indexing vocabulary consists of the VCV-, CV-, and VC-features (p. whose inverse document frequency idf n (cpi) := log +1df(vi) is between the lower bound idf„„.",
        ":= 1.6 and an upper bound idfmo.z which is chosen such that the indexing vocabulary consists of exactly 1000 features.",
        "Every indexing feature q,i and every document d, is assigned a weight aid := f f ((pi, di) * idf ((pi).",
        "Analogously, every indexing feature (p, is assigned a weight := f f ((pi, q) * idi (S0,) with respect to a given query q.",
        "As usual, the documents are presented to the user in decreasing order of the Retrieval Status Values RSV(q, di) that are determined by the cosine measure.",
        "The recognition errors were simulated in three steps.",
        "First, a parser converts a text document into a sequence of indexing features by detecting VCV-, CV-, and VC-features that belong to the indexing vocabulary.",
        "Second, the sequence of indexing features is converted into another sequence of indexing features by removing features as follows.",
        "For every feature in the input sequence it is randomly determined whether it is recognized or not.",
        "If it is recognized, the feature is included in the output sequence; otherwise, it is removed.",
        "The probability that a feature is recognized is equal to the specified detection rate.",
        "Third, the reduced sequence of indexing features is converted into a final sequence by adding indexing features as follows.",
        "Assume that the original document consists of k occurrences of a word.",
        "According to [8], an average",
        "speaker needs approximately k/170 minutes or At := k/1020 hours for such a document with k word occurrences.",
        "We then add f a * At occurrences of every indexing feature where fa denotes the specified false alarms per keyword per hour.",
        "For simplicity, every indexing feature is assumed to have the same detection rate and false alarms."
      ]
    },
    {
      "heading": "3. Results",
      "text": [
        "Table 1 shows the average precision values for various detection rates and false alarm rates.",
        "The numbers in brackets represent the percentage of a average precision of the reference method.",
        "The reference method represents a standard text retrieval method which is based on words rather than on VCV-features.",
        "In our case here, the reference method uses van Rijsbergen's [13] stoplist to eliminate the high-frequency words.",
        "Furthermore, it uses the word reduction algorithm by Porter [9] to reduce different variants of a words to the same normal form.",
        "The term weights consist of simple t f * idf weights and the retrieval status values are obtained by the cosine measure.",
        "Current wordspotting systems report high detection rates and low false alarms for the recognition of entire words in speech documents [2],[3],[4].",
        "These systems, however, are usually evaluated on small tasks: the vocabulary of the speech database is in the order of 1000 words and the number of words spotted is small.",
        "On the other hand, the task to identify 1000 VCV-features in speech documents with an unlimited vocabulary is much more difficult and the corresponding false alarms are one to two orders of magnitude higher.",
        "We therefore consider detection rates within the range of 40% and 90% and false alarms per keyword (i.e. per indexing feature) per hour within the range of 0 and 140."
      ]
    },
    {
      "heading": "4. Conclusions",
      "text": [
        "We have shown that speech retrieval is feasible to some extent even when the recognition performance is poor.",
        "It should be noted that a retrieval effectiveness which is moderate because of recognition errors may well be in the range of the retrieval effectiveness of the commonly used boolean retrieval method.",
        "In the case of MEDLARS, for instance, the boolean retrieval method achieves a retrieval effectiveness which corresponds to 40 % detection rate and 140 false alarms per indexing feature per hour [3].",
        "It seems that recognition errors and occurrences of query features in the documents have different distributions and standard retrieval methods are quite good in distinguishing these two distributions.",
        "Further investigations are needed to study the influence of the length of the queries and the length of the documents."
      ]
    }
  ]
}
