{
  "info": {
    "authors": [
      "Jing-Shin Chang",
      "Yih-Fen Luo",
      "Keh-Yih Su"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P92-1023",
    "title": "GPSM: A Generalized Probabilistic Semantic Model for Ambiguity Resolution",
    "url": "https://aclweb.org/anthology/P92-1023",
    "year": 1992
  },
  "references": [
    "acl-A88-1019",
    "acl-C88-2133",
    "acl-C92-1055",
    "acl-J83-3004",
    "acl-J88-1003",
    "acl-J90-2002",
    "acl-P89-1010"
  ],
  "sections": [
    {
      "heading": "GPSM: A GENERALIZED PROBABILISTIC SEMANTIC MODEL FOR AMBIGUITY RESOLUTION",
      "text": []
    },
    {
      "heading": "ABSTRACT",
      "text": [
        "In natural language processing, ambiguity resolution is a central issue, and can be regarded as a preference assignment problem.",
        "In this paper, a Generalized Probabilistic Semantic Model (GPSM) is proposed for preference computation.",
        "An effective semantic tagging procedure is proposed for tagging semantic features.",
        "A semantic score function is derived based on a score function, which integrates lexical, syntactic and semantic preference under a uniform formulation.",
        "The semantic score measure shows substantial improvement in structural disambiguation over a syntax-based approach."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In a large natural language processing system, such as a machine translation system (MTS), ambiguity resolution is a critical problem.",
        "Various rule-based and probabilistic approaches had been proposed to resolve various kinds of ambiguity problems on a case-by-case basis.",
        "In rule-based systems, a large number of rules are used to specify linguistic constraints for resolving ambiguity.",
        "Any parse that violates the semantic constraints is regarded as ungrammatical and rejected.",
        "Unfortunately, because every \"rule\" tends to have exception and uncertainty, and ill-formedness has significant contribution to the error rate of a large practical system, such \"hard rejection\" approaches fail to deal with these situations.",
        "A better way is to find all possible interpretations and place emphases on preference, rather than well-formedness (e.g., [Willcs 83].)",
        "However, most of the known approaches for giving preference depend heavily on heuristics such as counting the number of constraint satisfactions.",
        "Therefore, most such preference measures can not be objectively justified.",
        "Moreover, it is hard and costly to acquire, verify and maintain the consistency of the large fine-grained rule base by hand.",
        "Probabilistic approaches greatly relieve the knowledge acquisition problem because they are usually trainable, consistent and easy to meet certain optimum criteria.",
        "They can also provide more objective preference measures for \"soft re-jection.\"",
        "Hence, they are attractive for a large system.",
        "The current probabilistic approaches have a wide coverage including lexical analysis [DeRose 88, Church 88], syntactic analysis [Garside 87, Fujisalci 89, Su 88, 89, 91b], restricted semantic analysis [Church 89, Liu 89, 90], and experimental translation systems [Brown 90].",
        "However, there is still no integrated approach for modeling the joint effects of lexical, syntactic and semantic information on preference evaluation.",
        "A generalized probabilistic semantic model (GPSM) will be proposed in this paper to overcome the above problems.",
        "In particular, an integrated formulation for lexical, syntactic and semantic knowledge will be used to derive the semantic score for semantic preference evaluation.",
        "Application of the model to structural disam",
        "biguation is investigated.",
        "Preliminary experiments show about 10%-14% improvement of the semantic score measure over a model that uses syntactic information only."
      ]
    },
    {
      "heading": "2. Preference Assignment Using",
      "text": []
    },
    {
      "heading": "Score Function",
      "text": [
        "In general, a particular semantic interpretation of a sentence can be characterized by a set of lexical categories (or parts of speech), a syntactic structure, and the semantic annotations associated with it.",
        "Among the various interpretations of a sentence, the best choice should be the most probable semantic interpretation for the given input words.",
        "In other words, the interpretation that maximizes the following score function [Su 88, 89, 91b] or analysis score [Chen 911 is preferred:",
        "where (Lexk, Syni, Semi) refers to the kth set of lexical categories, the jth syntactic structure and the ith set of semantic annotations for the input Words.",
        "The three component functions are referred to as semantic score (Ssem), syntactic score (Ssy„) and lexical score (Stex), respectively.",
        "The global preference measure will be referred to as compositional score or simply as score.",
        "In particular, the semantic score accounts for the semantic preference on a given set of lexical categories and a particular syntactic structure for the sentence.",
        "Various formulation for the lexical score and syntactic score had been studied extensively in our previous works [Su 88, 89, 91b, Chiang 92] and other literatures.",
        "Hence, we will concentrate on the formulation for semantic score."
      ]
    },
    {
      "heading": "3. Semantic Tagging",
      "text": []
    },
    {
      "heading": "Canonical Form of Semantic Representation",
      "text": [
        "Given the formulation in Eqn.",
        "(1), first we will show how to extract the abstract objects (Semi, Syni, Lexk) from a semantic representation.",
        "In general, a particular interpretation of a sentence can be represented by an annotated syntax tree (AST), which is a syntax tree annotated with feature structures in the tree nodes.",
        "Figure 1 shows an example of AST.",
        "The annotated version of a node A is denoted as A AU A] in the figure, where fA is the feature structure associated with node A.",
        "Because an AST preserves both syntactic and semantic information, it can be converted to other deep structure representations easily.",
        "Therefore, without lose of generality, the AST representation will be used as the canonical form of semantic representation for preference evaluation.",
        "The techniques used here, of course, can be applied to other deep structure representations as well.",
        "(AST) and Phrase Levels (PL).",
        "The hierarchical AST can be represented by a set of phrase levels, such as Li through Lg in Figure 1.",
        "Formally, a phrase level (PL) is a set of symbols corresponding to a sentential form of the sentence.",
        "The phrase levels in Figure 1 are derived from a sequence of rightmost derivations, which is commonly used in an LR parsing mechanism.",
        "For example, L5 and Li correspond to the rightmost derivation B F c4 B c3 c4.",
        "Note"
      ]
    },
    {
      "heading": "TM",
      "text": [
        "that the first phrase level L1 consists of all lexical categories ci c„ of the terminal words (wi w„).",
        "A phrase level with each symbol annotated with its feature structure is called an annotated phrase level (APL).",
        "The i-th APL is denoted as F. For example, L5 in Figure 1 has an annotated phrase level F5 = {B [fa] , F [IF] , C4 Lic.j} as its",
        "counterpart, where fc, is the atomic feature of the lexical category c4, which comes from the lexical item of the 4th word w4.",
        "With the above notations, the score function can be reformulated as follows:",
        "where cin (a short form for {c/ c„)) is the kth set of lexical categories (Lexk), Lim ({Li L„,)) is the jth syntactic structure (Syni), and rim ((Pi rm)) is the ith set of semantic annotations (Semi) for the input words win ({wi wn)).",
        "A good encoding scheme for the PCs will allow us to take semantic information into account without using redundant information.",
        "Hence, we will show how to annotate a syntax tree so that various interpretations can be characterized differently."
      ]
    },
    {
      "heading": "Semantic Tagging",
      "text": [
        "A popular linguistic approach to annotate a tree is to use a unification-based mechanism.",
        "However, many information irrelevant to disambiguation might be included.",
        "An effective encoding scheme should be simple yet can preserve most discrimination information for disambiguation.",
        "Such an encoding scheme can be accomplished by associating each phrase structure rule A X1X2 ... X m with a head list (X2„Xi2...Xim).",
        "The head list is formed by arranging the children nodes (X1, X2, .",
        ".",
        ", Xm) in descending order of importance to the compositional semantics of their mother node A.",
        "For this reason, Xii, Xi2 and Xi, are called the primary, secondary and the j-th heads of A, respectively.",
        "The compositional semantic features of the mother node A can be represented as an ordered list of the feature structures of its children, where the order is the same as in the head list.",
        "For example, for S NP VP, we have a head list (VP, NP), because VP is the (primary) head of the sentence.",
        "When composing the compositional semantics of S. the features of VP and NP will be placed in the first and second slots of the feature structure of S, respectively.",
        "Because not all children and all features in a feature structure are equally significant for disambiguation, it is not really necessary to annotate a node with the feature structures of all its children.",
        "Instead, only the most important N children of a node is needed in characterizing the node, and only the most discriminative feature of a child is needed to be passed to its mother node.",
        "In other words, an N-dimensional feature vector, called a semantic N-tuple, could be used to characterize a node without losing much information for disambiguation.",
        "The first feature in the semantic N-tuple comes from the primary head, and is thus called the head feature of the semantic N-tuple.",
        "The other features come from the other children in the order of the head list.",
        "(Compare these notions with the linguistic sense of head and head feature.)",
        "An annotated node can thus be approximated as A A .f2, • • fiv), where fi HeadFeature (K;) is the (primary) head feature of its j-th head (i.e., Xi.)",
        "in the head list.",
        "Non-head features of a child node xi, will not be percolated up to its mother node.",
        "The head feature of A itself, in this case, is A.",
        "For a terminal node, the head feature will be the semantic tag of the corresponding lexical item; other features in the N-tuple will be tagged as 66 (NULL).",
        "Figure 2 shows two possible annotated syntax trees for the sentence \"... saw the boy in the park.\"",
        "For instance, the \"loc(ation)\" feature of \"park\" is percolated to its mother NP node as the head feature; it then serves as the secondary head feature of its grandmother node PP, because the NP node is the secondary head of PP.",
        "Similarly, the VP node in the left tree is annotated as VP(sta,anim) according to its primary head saw(sta,cb) and secondary head NP(anim,in).",
        "The VP(sta,in) node in the right tree is tagged differently, which reflects different attachment preference of the prepositional phrase.",
        "By this simple mechanism, the major characteristics of the children, namely the head features, can be percolated to higher syntactic levels, and",
        "sta: stative verb def: definite article loc: location anim: animate i3(fS-hi,f3- h4",
        "their correlation and dependency can be taken into account in preference evaluation even if they are far apart.",
        "In this way, different interpretations will be tagged differently.",
        "The preference on a particular interpretation can thus be evaluated from the distribution of the annotated syntax trees.",
        "Based on the above semantic tagging scheme, a semantic score will be proposed to evaluate the semantic preference on various interpretations for a sentence.",
        "Its performance improvement over syntactic score [Su 88, 89, 9113] will be investigated.",
        "Consequently, a brief review of the syntactic score evaluation method is given before going into details of the semantic score model.",
        "(See the cited references for details.)"
      ]
    },
    {
      "heading": "4. Syntactic Score",
      "text": [
        "According to Eqn.",
        "(2), the syntactic score can be formulated as follows [Su 88, 89, 91b]:",
        "where al, 01 are the left context and right context under which the derivation A1 4 x1x2...xm occurs.",
        "(Assume that Li = {al, Ai, A} and L1_1 = {cri, Xi,- - • ,Xm,i3i}.)",
        "If L left context symbols in a/ and R right context symbols in 0/ are consulted to evaluate the syntactic score, it is said to operate in LL,RR mode of operation.",
        "When the context is ignored, such an L.4)R0 mode of operation reduces to a stochastic context-free grammar.",
        "To avoid the normalization problem [Su 91b] arisen from different number of transition probabilities for different syntax trees, an alternative formulation of the syntactic score is to evaluate the transition probabilities between configuration changes of the parser.",
        "For instance, the configuration of an LR parser is defined by its stack contents and input buffer.",
        "For the AST in Figure 1, the parser configurations after the read of ci, c2, c3, c4 and $ (end-of-sentence) are equivalent to Li, L2, L4, L5 and L8, respectively.",
        "Therefore, the syntactic score can be approximated as [Su 89, 91b]:",
        "In this way, the number of transition probabilities in the syntactic scores of all AST's will be kept the same as the sentence length."
      ]
    },
    {
      "heading": "5. Semantic Score",
      "text": [
        "Semantic score evaluation is similar to syntactic score evaluation.",
        "From Eqn.",
        "(2), we have the following semantic model for semantic score:",
        "where Al E A/ (h,i, fo, • • • , fi,N) is the annotated version of Ai, whose semantic N-tuple is • • , ft,N), and rti, ,(3, are the annotated context symbols.",
        "Only 4/ is assumed to be significant for the transition to F/ in the last equation, because all required information is assumed to have been percolated to F,.j through semantics composition.",
        "Each term in Eqn.",
        "(5) can be interpreted as the probability that A1 is annotated with the particular set of head features (f,,i , 1.1,2, • • AN), given that X/ Xm are reduced to A/ in the context of Ti/- and 0/.",
        "So it can be interpreted informally as",
        "in the context of ii7,131).",
        "It corresponds to the semantic preference assigned to the annotated node A,.",
        "Since (ft,i,•• AN) are the head features from various heads of the substructures of A, each term reflects the feature co-occurrence preference among these heads.",
        "Furthermore, the heads could be very far apart.",
        "This is different from most simple Markov models, which can deal with local constraints only.",
        "Hence, such a formulation well characterizes long distance dependency among the heads, and provides a simple mechanism to incorporate the feature co-occurrence preference among them.",
        "For the semantic N-tuple model, the semantic score can thus be expressed as follows:",
        "where fii are the semantic tags from the children of Al.",
        "For example, we have terms like P (VP (sta, anim) I a, VP 4 – V NP,/3) and P (VP (sta, in) I a, VP 4 – V NP PP,O), respectively, for the left and right trees in Figure 2.",
        "The annotations of the context are ignored in evaluating Eqn.",
        "(6) due to the assumption of semantics compositionality.",
        "The operation mode will be called LLRR+AN, where N is the dimension of the N-tuple, and the subscript L (or R) refers to the size of the context window.",
        "With an appropriate N, the score will provide sufficient discrimination power for general disambiguation problem without resorting to full-blown semantic analysis."
      ]
    },
    {
      "heading": "6. Major Categories and Semantic Features",
      "text": [
        "As mentioned before, not all constituents are equally important for disambiguation.",
        "For instance, head words are usually more important than modifiers in determining the compositional semantic features of their mother node.",
        "There is also lots of redundancy in a sentence.",
        "For instance, \"saw boy in park\" is equally recognizable as \"saw the boy in the park.\"",
        "Therefore, only a few categories, including verbs, nouns, adjectives, prepositions and adverbs and their projections (NP, VP, AP, PP, ADVP), are used to carry semantic features for disambiguation.",
        "These categories are roughly equivalent to the major categories in linguistic theory [Sells 851 with the inclusion of adverbs as the only difference.",
        "The semantic feature of each major category is encoded with a set of semantic tags that well describes each category.",
        "A few rules of thumb are used to select the semantic tags.",
        "In particular, semantic features that can discriminate different linguistic behavior from different possible semantic N-tuples are preferred as the semantic tags.",
        "With these heuristics in mind, the verbs, nouns, adjectives, adverbs and prepositions are divided into 22, 30, 14, 10 and 28 classes, respectively.",
        "For example, the nouns are divided into \"human,\" \"plant,\" \"time,\" \"space,\" and so on.",
        "These semantic classes come from a number of sources and the semantic attribute hierarchy of the ArchTran Table 1.",
        "Close Test of Semantic Score MTS [Su 90, Chen 91]."
      ]
    },
    {
      "heading": "7. Test and Analysis",
      "text": [
        "The semantic N-tuple model is used to test the improvement of the semantic score over syntactic score in structure disambiguation.",
        "Eqn.",
        "(3) is adopted to evaluate the syntactic score in L2R1 mode of operation.",
        "The semantic score is derived from Eqn.",
        "(6) in L2/2/ i-AN mode, for N 1, 2, 3, 4, where N is the dimension of the semantic N-tuple.",
        "A total of 1000 sentences (including 3 unambiguous ones) are randomly selected from 14 computer manuals for training or testing.",
        "They are divided into 10 parts; each part contains 100 sentences.",
        "In close tests, 9 parts are used both as the training set and the testing set.",
        "In open tests, the rotation estimation approach [Devijver 82] is adopted to estimate the open test performance.",
        "This means to iteratively test one part of the sentences while using the remaining parts as the training set.",
        "The overall performance is then estimated as the average performance of the 10 iterations.",
        "The performance is evaluated in terms of Top-N recognition rate (TNRR), which is defined as the fraction of the test sentences whose preferred interpretation is successfully ranked in the first N candidates.",
        "Table 1 shows the simulation results of close tests.",
        "Table 2 shows partial results for open tests (up to rank 5.)",
        "The recognition rates achieved by considering syntactic score only and semantic score only are shown in the tables.",
        "(-.2R1+A3 and L2R1+A4 performance are the same as L2R1-1-A2 in the present test environment So they are not shown in the tables.)",
        "Since each sentence has about 70-75 ambiguous constructs on the average, the task perplexity of the current disambiguation task is high.",
        "The close test Top-1 performance (Table 1) for syntactic score (87%) is quite satisfactory.",
        "When semantic score is taken into account, substantial improvement in recognition rate can be observed further (97%).",
        "This shows that the semantic model does provide an effective mechanism for disambiguation.",
        "The recognition rates in open tests, however, are less satisfactory under the present test environment.",
        "The open test performance can be attributed to the small database size and the estimation error of the parameters thus introduced.",
        "Because the training database is small with respect to the complexity of the model, a significant fraction of the probability entries in the testing set can not be found in the training set.",
        "As a result, the parameters are somewhat \"overtuned\" to the training database, and their values are less favorable for open tests.",
        "Nevertheless, in both close tests and open tests, the semantic score model shows substantial improvement over syntactic score (and hence stochastic context-free grammar).",
        "The improvement is about 10% for close tests and 14% for open tests.",
        "In general, by using a larger database and better robust estimation techniques [Su 91a, Chiang 92], the baseline model can be improved further.",
        "As we had observed from other experiments for spoken language processing [Su 91a], lexical tagging, and structure disambiguation [Chiang 92], the performance under sparse data condition can be improved significantly if robust adaptive learning techniques are used to adjust the initial parameters.",
        "Interested readers are referred to [Su 91a, Chiang 92] for more details."
      ]
    },
    {
      "heading": "8. Concluding Remarks",
      "text": [
        "In this paper, a generalized probabilistic semantic model (GPSM) is proposed to assign semantic preference to ambiguous interpretations.",
        "The semantic model for measuring preference is based on a score function, which takes lexical, syntactic and semantic information into consideration and optimizes the joint preference.",
        "A simple yet effective encoding scheme and semantic tagging procedure is proposed to characterize various interpretations in an N dimensional feature space.",
        "With this encoding scheme, one can encode the interpretations with discriminative features, and take the feature co-occurrence preference among various constituents into account.",
        "Unlike simple Markov models, long distance dependency can be managed easily in the proposed model.",
        "Preliminary tests show substantial improvement of the semantic score measure over syntactic score measure.",
        "Hence, it shows the possibility to overcome the ambiguity resolution problem without resorting to full-blown semantic analysis.",
        "With such a simple, objective and trainable formulation, it is possible to take high level semantic knowledge into consideration in statistic sense.",
        "It also provides a systematic way to construct a disambiguation module for large practical machine translation systems without much human intervention; the heavy burden for the linguists to write fine-grained \"rules\" can thus be relieved."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
