{
  "info": {
    "authors": [
      "Robert A. Amsler"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P81-1030",
    "title": "A Taxonomy for English Nouns and Verbs",
    "url": "https://aclweb.org/anthology/P81-1030",
    "year": 1981
  },
  "references": [
    "acl-T78-1004"
  ],
  "sections": [
    {
      "text": [
        "ABSTRACT: The definition texts of a machine-readable pocket dictionary were analyzed to determine the disambiguated word sense of the kernel terms of each word sense being defined.",
        "The resultant sets of word pairs of defined and defining words were then computationally connected into two taxonomic semi-lattices (\"tangled hierarchies\") representing some 24,000 noun nodes and 11,000 verb nodes.",
        "The study of the nature of the \"topmost\" nodes in these hierarchies.",
        "and the structure of the trees reveal information about the nature of the dictionary's organization of the language, the concept of semantic primitives and other aspects of lexical semantics.",
        "The data proves that the dictionary offers a fundamentally consistent description of word meaning and may provide the basis for future research and applications in computational linguistic systems."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "In the late 1880's, John Olney et al.",
        "at System Development Corporation produced machine-readable copies of the Merriam-Webster NRK Pocket Dictionary and the Merriam-Webster Seventh gglleziate Dictionary.",
        "These massive data files have been widely distributed within the computational linguistic cammunity, yet research upon the basic structure of the dictionary has been exceedingly slow and difficult due to the significant computer resources required to process tens of thousands of definitions.",
        "The dictionary is a fascinating computational resource.",
        "It contains spelling, pronunciation, hyphenation.",
        "capitalization, usage notes for semantic domains.",
        "geographic regions, and propriety; etymological.",
        "syntactic and semantic information about the most basic units of the language.",
        "Accompanying definitions are example sentences which often use words in prototypical contexts.",
        "Thus the dictionary should be able to serve as a resource for a variety of computational linguistic needs.",
        "My primary concern within the dictionary has been the development of dictionary data for use in understanding systems.",
        "Thus I am concerned with what dictionary definitions tell us about the semantic and pragmatic structure of meaning.",
        "The hypothesis I am proposing is that definitions in the lexicon can be studied in the same manner as other large collections of objects such as plants, animals, and minerals are studied.",
        "Thus I am concerned with enumerating the classificational organization of the lexicon as it has been implicitly used by the dictionary's lexicographers.",
        "Each textual definition in the dictionary is syntactically a noun or verb phrase with one or more kernel terms.",
        "If one identifies these kernel terms of definitions, and then proceeds to disambiguate them relative to the senses offered in the same dictionary under their respective definitions, then one can arrive at a large collection of pairs of disambiguated words which can be assembled into a taxonomic semi-lattice.",
        "This task has been accomplished for all the definition texts of nouns and verbs in a common pocket dictionary.",
        "This paper is an effort to reveal the results of a preliminary examination of the structure of these databases.",
        "The applications of this data are still in the future.",
        "What might these applications be?",
        "First, the data should provide information on the contents of semantic domains.",
        "One should be able to determine from a lexical taxonomy what domains one might be in given one has encountered the word \"periscope\", or \"petiole\", or \"petroleum\".",
        "Second, dictionary data should be of use in resolving semantic ambiguity in text.",
        "Words in definitions appear in the company of their prototypical associates.",
        "Third, dictionary data can provide the basis for creating case grammar descriptions of verbs, and noun argument descriptions of nouns.",
        "Semantic templates of meaning are far richer when one considers the taxonomic inheritance of elements of the lexicon.",
        "Fourth.",
        "the dictionary should offer a classification which anthropological linguists and psycholinguists can use as an objective reference in comparison with other cultures or human memory observations.",
        "This isn't to say that the dictionary's classification is the same as the culture's or the human mind's, only that it is an objective datum from which comparisons can be made.",
        "Fifth.",
        "knowledge of how the dictionary is structured can be used by lexicographers to build better dictionaries.",
        "And finally, the dictionary if converted into a computer tool can become more readily accessible to all the disciplines seeking to use the current paper-based versions.",
        "Education, historical linguistics.",
        "sociology.",
        "English composition.",
        "etc.",
        "can all make steps forward given that they can assume access to a dictionary is immediately available via computer.",
        "I do not know what all these applications will be and the task at hand is simply an elucidation of the dictionary's structure as it currently exists."
      ]
    },
    {
      "heading": "2. \"TANGLED\" AIERARCRIES NOUNS AKRE=",
      "text": [
        "The grant.",
        "MCS77-01315, \"Development of a Computational Methodology for Deriving Natural Language Semantic Structures via Analysis of Machine-Readable Dictionaries\", created a taxonomy for the nouns and verbs of the Merriam-Webster Pocket Dictionary (NP?",
        ")), based upon the hand-disambiguated kernel words in their definitions.",
        "This taxonomy confirmed the anticipated structure of the lexicon to be that of a \"tangled hierarchy\" (8,9) of unprecedented size (24,000 noun senses.",
        "11.000 verb senses).",
        "This data base is believed to be the first to be assembled which is representative of the structure of the entire English lexicon.",
        "(A somewhat similar study of the Italian lexicon has been done (2.111).",
        "The content categories agree substantially with the semantic structure of the lexicon proposed by Nide [151, and the verb taxonomy confirms the primitives proposed by the San Diego LNR group (161.",
        "This \"tangled hierarchy\" may be described as a formal data structure whose bottom is a set of terminal disambiguated words that are not used as kernel defining terms; these are the most specific elements in the structure.",
        "The tops of the structure are senses of words such as \"cause\", \"thing\", \"class\", \"being\", etc.",
        "These are the most general elements in the tangled hierarchy.",
        "If all the top terms are considered to be",
        "members of the metaclass \"<word-sense>\", the tangled forest becomes a tangled tree.",
        "The terminal nodes of such trees are in general each connected to the top in a lattice.",
        "An individual lattice can be resolved into a set of \"traces\", each of which describes an alternate path from terminal to top.",
        "In a trace, each element implies the terms above it, and further specifies the sense of the elements below it.",
        "The collection of lattices forms a transitive acyclic digraph (or perhaps more clearly, a \"semi-lattice\", that is, a lattice with a greatest upper bound, <word-sense>, but no least lower bound).",
        "If we specify all the traces composing such a structure, spanning all paths from top to bottom.",
        "we have topologically specified the upon these measurements.",
        "For example.",
        "\"g\" has the most single-level descendants, 3, yet it is neither at the top of the tangled hierarchy, nor does it have the highest total number of descendants.",
        "The root node \"a\" is at the top of the hierarchy, yet it only has 1 single-level descendant.",
        "For nodes to be considered of major importance in a tangled hierarchy it is thus necessary to consider not only their total number of descendants, but whether these descendants are all actually immediately under some other node to which this higher node is attached.",
        "As we shall see, the nodes which have the most single-level descendants are actually more pivotal concepts in some cases.",
        "Turning to the actual forest of tangled hierarchies, Table 2 gives the frequencies of the size and depth of semi-lattice.",
        "Thus the list on the left in Figure 1 the largest noun hierarchies and Table 3 gives the sizes topologically specifies the tangled hierarchy on its alone for verb hierarchies (depths were not computed for right.",
        "these, unfortunately).",
        "Turning from the abstract description of the forest of 1083 11 MODE -.1A 495 6 STRUCTURE-.24 tangled hierarchies to the actual data, the first 1076 10 STATE-1.1A 494 10 RANK-2.4A question which was answered was, \"What are the largest 1076 9 CONDITION-1.3A 493 9 STEP-1.3A tangled hierarchies in the dictionary?\".",
        "The size of a tangled hierarchy is based upon two numbers, the maximum **• out of range due to data error depth below the \"root\" and the total number of nodes Table 3.",
        "Frequencies of Topmost transitively reachable from the root.",
        "Thus the tangled hierarchy of Figure 1 has a depth of 5 and contains a total of 11 nodes (including the \"root\" node.",
        "\"a\").",
        "MPD Tangled Verb Hierarchies However, since each non-terminal in the tangled 4175 REMAIN-.4A 365 GAIN-2.1A hierarchy was also enumerated, it is also possible to describe the \"sizes\" of the other nodes reachable from 4175 CONTINUE-.IA 334 DRIVE-1.1A/+ \"a\".",
        "Their number of elements and depths given in Table 4087 MAINTAIN-.3A 333 PUSH-1.1A",
        "These examples are being given to demonstrate the inherent consequences of dealing with tree sizes based While the verb tangled hierarchy appears to have a series of nodes above CAUSE-2.0A which have large numbers of descendants, the actual structure more closely resembles that of Figure 2.",
        "The list appears in terms of descending frequency.",
        "The topmost nodes don't have many descendants at one level below, but they each have one BIG descendant, the next node in the chain.",
        "CAUSE-2.0A has approximately 240 direct descendants, and MAKE-1.1A has 480 direct descendants - making these two the topmost nodes in terms of number of direct descendants, though they are ranked 9th and 13th in terms of total descendants (under words such as RE(AIN-.4A, CONTINUE-.1A, etc.).",
        "This points out in practice what the abstract tree of Figure 1 showed as possible in theory, and explains the seeming contradiction in having a basic verb such as \"CAUSE-2.0A\" defined in terms of a lesser verb such as \"REMAIN-.4a\".",
        "One phenomenon which was anticipated in computationally SORT 1.1B grown trees was the existence of loops.",
        "Loops are caused by having sequences of interrelated definitions KIND 1.2B SORT 1.1A whose kernels form a ring-like array (5.201.",
        "However.",
        "\\---___ 7 what was not anticipated was how important such clusters of nodes would be both to the underlying basis for the ---------- taxonomies and as primitives of the language.",
        "Such SPECIES .1A ------ SPECIES .1B circularity is sometimes evidence of a truly primitive concept, such as the set containing the words CLASS, GROUP, TYPE, RIND, SET.",
        "DIVISION, CATEGORY, SPECIES, Figure 4.",
        "\"GROUP\" Concept Primitive from INDIVIDUAL, GROUPING, PART and SECTION.",
        "To understand Dictionary Definitions this, consider the subset of interrelated senses these words share (Figure 3) and then the graphic * Note: SECTIONS, PARTS, and GROUPINGS have additional representation of these in Figure 4. connections not shown which lead to a related primitive cluster dealing with the PART/WHOLE concept.",
        "GROUP 1.0A - a number of individuals related by a common factor (as physical association, community of interests, or blood) CLASS 1.1A - a ;croup of the same general status or nature This complex interrelated set of definitions comprise a primitive concept, essentially equivalent to the notion of SET in mathematics.",
        "The primitiveness of the set is evident when one attempts to define any one of the above words without using another of them in that definition.",
        "This essential property, the inability to write a definition explaining a word's meaning without using another member of some small set of near synonymous words, is the basis for describing such a set as a PRIMITIVE.",
        "It is based upon the notion of definition given by Wilder [211, which in turn was based upon a presentation of the ideas of Padoa, a turn-of-the-century logician.",
        "The definitions are given, the disambiguation of their kernel's senses leads to a cyclic structure which cannot be resolved by attributing erroneous judgements to either the lexicographer or the disambiguator; therefore the structure is taken as representative of an undefinable primitive concept, and the words whose definitions participate in this complex structure are found to be undefinable without reference to the other members of the set of undefined terms.",
        "The question of what to do with such primitives is not really a problem.",
        "as Winograd notes [221, once one realizes that they must exist at some level, just as mathematical primitives must exist.",
        "In tree construction the solution is to form a single node whose English surface representation may be selected from any of the words in the primitive set.",
        "There probably are connotative differences between the members of the set.",
        "but the ordinary pocket dictionary does not treat these in its definitions with any detail.",
        "The Merriam-Webster Collfsiate Dictionary does include so-called \"synonym paragraphs\" which seem to discuss the connotative differences between words sharing a \"ring\".",
        "While numerous studies of lexical domains such as the verbs of motion [1.12,131 and possession [101 have been carried out by other researchers, it is worth noting that recourse to using ordinary dictionary definitions as a source of material has received little attention.",
        "Yet the \"primitives\" selected by Donald A. Norman, David E. Rumelhart, and the LNR Research Group for knowledge representation in their system bear a remarkable similarity to those verbs used most often as kernels in ME Merriam-Webster Pocket Dictionary and Donald Sherman has shown (Table 4) these topmost verbs to be among the most common verbs in the Collegiate Dictionary as well [191.",
        "The most frequent verbs of the MPD are, in descending order.",
        "MAKE, BE.",
        "BECOME, CAUSE.",
        "GIVE, MOVE, TAKE, PUT, FORM, BRING, HAVE.",
        "and GO.",
        "The similarity of these verbs to those selected by the LNR group for their semantic representations, i.e., BECOME.",
        "CAUSE.",
        "CHANGE, DO, MOVE.",
        "POSS (\"have\"), TRANSF (\"give\",\"take\"), etc., [10.14.181 is striking.",
        "This similarity is indicative of an underlying \"rightness\" of dictionary definitions and supports the proposition that the lexical information extractable from study of the dictionary will prove to be the same knowledge needed for computational linguistics.",
        "The enumeration of the primitives for nouns and verbs by analysis of the tangled hierarchies of the noun and verb forests grown from the MPD definitions is a considerable undertaking and one which goes beyond the scope of this paper.",
        "To see an example of how this technique works in practice, consider the discovery of the primitive group starting from PLACE-1.3A.",
        "place-1.3a - a building or locality used for a special purpose The kernels of this definition are \"building\" and \"locality\".",
        "Looking these up in turn we have: building-As - a usu.",
        "roofed and walled structure (as a house) for permanent use locality-.0a - a particular soot situation or"
      ]
    },
    {
      "heading": "location",
      "text": [
        "This gives us four new terms, \"structure\", \"spot\", \"situation\", and \"location\".",
        "Looking these up we find the circularity forming the primitive group.",
        "And finally, the only new term we encounter is \"site\" which yields, site-.0a - jocation ‹* of a building> (battle *> The primitive cluster thus appears as in Figure 5."
      ]
    },
    {
      "heading": "2.3 NOUNS TERMINATING IN RELATIONS TO OTHER NOUNS OR VERBS",
      "text": [
        "In addition to terminating in \"dictionary circles\" or \"loops\", nouns also terminate in definitions which are actually text descriptions of case arguments of verbs or relationships to other nouns.",
        "\"Vehicle\" is a fine",
        "example of the former, being as it were the canonical instrumental case argument of one sense of the verb \"carry\" or \"transport\".",
        "vehicle - a means of carrying or transporting something \"Leaf\" is an example of the latter, being defined as a part of a plant, leaf - a usu.",
        "flat and green outgrowth of a plant stem that is a unit of foliage and functions esp.",
        "in photosynthesis.",
        "Thus \"leaf\" isn't a type of anything.",
        "Even though under a strictly genus/differentia interpretation one would analyze \"leaf\" as being in an ISA relationship with \"outgrowth\", \"outgrowth\" hasn't a suitable homogeneous set of members and a better interpretation for modeling this definition would be to consider the \"outgrowth of\" phrase to signify a part/whole relationship between \"leaf\" and \"plant\".",
        "Hence we may consider the dictionary to have at least two taxonomic relationships (i.e. ISA and ISPART) as well as additional relations explaining noun terminals as verb arguments.",
        "One can also readily see that there will be taxonomic interactions among nodes connected across these relationship \"bridges\".",
        "While the parts of a plant will include the \"leaves\", \"stem\", \"roots\", etc., the corresponding parts of any TYPE of plant may have further specifications added to their descriptions.",
        "Thus \"plant\" specifies a functional form which can be further elaborated by descent down its ISA chain.",
        "For example, a \"frond\" is a type of \"leaf\", frond - a usu, large divided leaf (as of a fern) We knew from \"leaf\" that it was a normal outgrowth of a \"plant\", but now we see that \"leaf\" can be specialized, provided we get confirmation from the dictionary that a \"fern\" is a \"plant\".",
        "(Such confirmation is only needed if we grant \"leaf\" more than one sense meaning, but words in the Pocket Dictionary do typically average 2-3 sense meanings).",
        "The definition of \"fern\" gives us the needed linkage, offering, interaction of the PART-OF and ISA hierarchies.",
        "Historically even Raphael [17] used a PART-OF relationship together with the ISA hierarchy of SIR's deduction system.",
        "What however is new is that I am not stating \"leaf\" is a part of a plant because of some need use this fact within a particular system's operation.",
        "but \"discovering\" this in a published reference source and noting that such information results naturally from an effort to assemble the complete lexical structure of the dictionary."
      ]
    },
    {
      "heading": "2.4 PARTITIVES AND COLLECTIVES",
      "text": [
        "As mentioned in Section 2.3, the use of \"outgrowth\" in the definition of \"leaf\" causes problems in the taxonomy if we treat \"outgrowth\" as the true genus term of that definition.",
        "This word is but one example of a broad range of noun terminals which may be described as \"partitives\".",
        "A \"partitive\" may be defined as a noun which serves as a general term for a PART of another large and often very non-homogeneous set of concepts.",
        "Additionally.",
        "at the opposite end of the partitive scale, there is the class of \"collectives\".",
        "Collectives are words which serve as a general term for a COLLECTION of other concepts.",
        "The disambiguators often faced decisions as to whether some words were indeed the true semantic kernels of definitions, and often found additional words in the definitions which were more semantically appropriate to serve as the kernel -- albeit they did not appear syntactically in the correct position.",
        "Many of these terms were partitives and collectives.",
        "Figure 7 shows a set of partitives and collectives which were extracted and classified by Gretchen Hazard and John White during the dictionary project.",
        "The terms under \"group names\".",
        "\"whole units\", and \"system units\" are collectives.",
        "Those under \"individuators\".",
        "\"piece units\", \"space shapes\", \"existential units\", \"locus units\".",
        "and \"event units\" are partitives.",
        "These terms usually appeared in the syntactic frame \"An of\" and this additionally served to indicate their functional role."
      ]
    },
    {
      "heading": "1 QUANTIFIERS 3 EXISTENTIAL UNITS",
      "text": [
        "fern - any of a group of flowerless seedless vascular green plants Thus we have a specialized name for the \"leaf\" appendage of a \"plant\" if that plant is a \"fern\".",
        "This can be represented as in Figure 6."
      ]
    },
    {
      "heading": "ISPART leaf > plant 1.1 GROUP NAMES",
      "text": [
        "pair.collection.group cluster.bunch.",
        "band (of people) 1.2 INDIVIDUATORS member.unit,item.",
        "article, strand, branch (of science.",
        "etc.)"
      ]
    },
    {
      "heading": "2 SHAPE UNITS",
      "text": []
    },
    {
      "heading": "3.1 VARIANT",
      "text": [
        "version.form.sense"
      ]
    },
    {
      "heading": "3.2 STATE",
      "text": [
        "state, condition"
      ]
    },
    {
      "heading": "• 4 REFERENCE UNITS 4.1 LOCUS UNITS place.end,ground, point 2.1 PIECE UNITS sample,bit,piece, tinge,tint 4.2 PROCESS UNITS",
      "text": [
        "This conclusion that there are two major transitive taxonomies and that they are related is not of course new.",
        "Evens et al.",
        "[6,71 have dealt with the PART-OF relationship as second only to the ISA relationship in importance, and Fahlman 18,91 has also discussed the"
      ]
    },
    {
      "heading": "ACKNOWLEDGEMENTS",
      "text": [
        "This research on the machine-readable dictionary could not have been accomplished without the permission of the G. 6 C. Merriam Co., the publishers of the Merriam-Webster Pocket, Dictionary and the Merriam-Webster Seventh Collegiate Dictionary as well as the funding support of the National Science Foundation.",
        "Thanks should also go to Dr. John S. White.",
        "currently of Siemens Corp., Boca Raton, Florida; Gretchen Hazard; and Drs.",
        "Robert F. Simmons and Winfred P. Lehmann of the University of Texas at Austin."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
