{
  "info": {
    "authors": [
      "Ruslan Mitkov",
      "Shalom Lappin",
      "Branimir K. Boguraev"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J01-4001",
    "title": "Introduction to the Special Issue on Computational Anaphora Resolution",
    "url": "https://aclweb.org/anthology/J01-4001",
    "year": 2001
  },
  "references": [
    "acl-A00-1020",
    "acl-A88-1003",
    "acl-C88-1021",
    "acl-C90-3063",
    "acl-C94-2184",
    "acl-C94-2189",
    "acl-C96-1021",
    "acl-J94-4002",
    "acl-M95-1015",
    "acl-P87-1022",
    "acl-P93-1021",
    "acl-P95-1017",
    "acl-P96-1036",
    "acl-P98-2143",
    "acl-P98-2204",
    "acl-P99-1079",
    "acl-W97-0319",
    "acl-W97-1306",
    "acl-W97-1307",
    "acl-W98-1119",
    "acl-W99-0611"
  ],
  "sections": [
    {
      "text": [
        "Anaphora accounts for cohesion in texts and is a phenomenon under active study in formal and computational linguistics alike.",
        "The correct interpretation of anaphora is vital for natural language processing (NLP).",
        "For example, anaphora resolution is a key task in natural language interfaces, machine translation, text summarization, information extraction, question answering, and a number of other NLP applications.",
        "After considerable initial research, followed by years of relative silence in the early 1980s, anaphora resolution has attracted the attention of many researchers in the last 10 years and a great deal of successful work on the topic has been carried out.",
        "Discourse-oriented theories and formalisms such as Discourse Representation Theory and Centering Theory inspired new research on the computational treatment of anaphora.",
        "The drive toward corpus-based robust NLP solutions further stimulated interest in alternative and/or data-enriched approaches.",
        "Last, but not least, application-driven research in areas such as automatic abstracting and information extraction independently highlighted the importance of anaphora and coreference resolution, boosting research in this area.",
        "Much of the earlier work in anaphora resolution heavily exploited domain and linguistic knowledge (Sidner 1979; Carter 1987; Rich and LuperFoy 1988; Carbonell and Brown 1988), which was difficult both to represent and to process, and which required considerable human input.",
        "However, the pressing need for the development of robust and inexpensive solutions to meet the demands of practical NLP systems encouraged many researchers to move away from extensive domain and linguistic knowledge and to embark instead upon knowledge-poor anaphora resolution strategies.",
        "A number of proposals in the 1990s deliberately limited the extent to which they relied on domain and/or linguistic knowledge and reported promising results in knowledge-poor operational environments (Dagan and Itai 1990, 1991; Lappin and Leass 1994; Nasukawa 1994; Kennedy and Boguraev 1996; Williams, Harvey, and Preston 1996; Baldwin 1997; Mitkov 1996, 1998b).",
        "The drive toward knowledge-poor and robust approaches was further motivated by the emergence of cheaper and more reliable corpus-based NLP tools such as part-of-speech taggers and shallow parsers, alongside the increasing availability of corpora and other NLP resources (e.g., ontologies).",
        "In fact, the availability of corpora, both raw and annotated with coreferential links, provided a strong impetus to anaphora resolution",
        "with regard to both training and evaluation.",
        "Corpora (especially when annotated) are an invaluable source not only for empirical research but also for automated learning (e.g., machine learning) methods aiming to develop new rules and approaches; they also provide an important resource for evaluation of the implemented approaches.",
        "From simple co-occurrence rules (Dagan and Itai 1990) through training decision trees to identify anaphor-antecedent pairs (Aone and Bennett 1995) to genetic algorithms to optimize the resolution factors (Ordsan, Evans, and Mitkov 2000), the successful performance of more and more modern approaches was made possible by the availability of suitable corpora.",
        "While the shift toward knowledge-poor strategies and the use of corpora represented the main trends of anaphora resolution in the 1990s, there are other significant highlights in recent anaphora resolution research.",
        "The inclusion of the coreference task in the Sixth and Seventh Message Understanding Conferences (MUC-6 and MUC-7) gave a considerable impetus to the development of coreference resolution algorithms and systems, such as those described in Baldwin et al.",
        "(1995), Gaizauskas and Humphreys (1996), and Kameyama (1997).",
        "The last decade of the 20th century saw a number of anaphora resolution projects for languages other than English such as French, German, Japanese, Spanish, Portuguese, and Turkish.",
        "Against the background of a growing interest in multilingual NLP, multilingual anaphora /coreference resolution has gained considerable momentum in recent years (Aone and McKee 1993; Azzam, Humphreys, and Gaizauskas 1998; Harabagiu and Maiorano 2000; Mitkov and Barbu 2000; Mitkov 1999; Mitkov and Stys 1997; Mitkov, Belguith, and Stys 1998).",
        "Other milestones of recent research include the deployment of probabilistic and machine learning techniques (Aone and Bennett 1995; Kehler 1997; Ge, Hale, and Char-niak 1998; Cardie and Wagstaff 1999; the continuing interest in centering, used either in original or in revised form (Abracos and Lopes 1994; Strube and Hahn 1996; Hahn and Strube 1997; Tetreault 1999); and proposals related to the evaluation methodology in anaphora resolution (Mitkov 1998a, 2001b).",
        "For a more detailed survey of the state of the art in anaphora resolution, see Mitkov (forthcoming).",
        "The papers published in this issue reflect the major trends in anaphora resolution in recent years.",
        "Some of them describe approaches that do not exploit full syntactic knowledge (as in the case of Palomar et al.",
        "'s and Stuckardt's work) or that employ machine learning techniques (Soon, Ng, and Lim); others present centering-based pronoun resolution (Tetreault) or discuss theoretical centering issues (Kibble).",
        "Almost all of the papers feature extensive evaluation (including comparative evaluation as in the case of Tetreault's and Palomar et al.",
        "'s work) or discuss general evaluation issues (Byron as well as Stuckardt).",
        "Palomar et al.",
        "'s paper describes an approach that works from the output of a partial parser and handles third person personal, demonstrative, reflexive, and zero pronouns, featuring among other things syntactic conditions on Spanish NP-pronoun noncoreference and an enhanced set of resolution preferences.",
        "The authors also implement several known methods and compare their performance with that of their own algorithm.",
        "An indirect conclusion from this work is that an algorithm requires semantic knowledge in order to hope for a success rate higher than 75%.",
        "Soon, Ng, and Lim describe a C5-based learning approach to coreference resolution of noun phrases in unrestricted text.",
        "The approach learns from a small, annotated corpus and tackles pronouns, proper names, and definite descriptions.",
        "The coreference resolution module is part of a larger coreference resolution system that also includes sentence segmentation, tokenization, morphological analysis, part-of-speech tagging, noun phrase identification, named entity recognition, and semantic class determination (via WordNet).",
        "The evaluation is carried out on the MUC-6 and MUC-7 test",
        "Mitkov, Boguraev, and Lappin Anaphora Resolution: Introduction corpora.",
        "The paper reports on experiments aimed at quantifying the contribution of each resolution factor and features error analysis.",
        "Stuckardt's work presents an anaphor resolution algorithm for systems where only partial syntactic information is available.",
        "Stuckardt applies Government and Binding Theory principles A, B, and C to the task of coreference resolution on partially parsed texts.",
        "He also argues that evaluation of anaphora resolution systems should take into account several factors beyond simple accuracy of resolution.",
        "In particular, both developer-oriented (e.g., related to the selection of optimal resolution factors) and application-oriented (e.g., related to the requirement of the application, as in the case of information extraction, where a proper name antecedent is needed) evaluation metrics should be considered.",
        "Tetreault's contribution features comparative evaluation involving the author's own centering-based pronoun resolution algorithm called the Left-Right Centering algorithm (LRC) as well as three other pronoun resolution methods: Hobbs's naive algorithm (Hobbs 1978), BFP (Brennan, Friedman, and Pollard 1987), and Strube's S-list approach (Strube 1998).",
        "The LRC is an alternative to the original BFP algorithm in that it processes utterances incrementally.",
        "It works by first searching for an antecedent in the current sentence; if none can be found, it continues the search on the Cf-list of the previous and the other preceding utterances in a left-to-right fashion.",
        "In her squib, Byron maintains that additional kinds of information should be included in an evaluation in order to make the performance of algorithms on pronoun resolution more transparent.",
        "In particular, she suggests that the pronoun coverage be explicitly reported and proposes that the evaluation details be presented in a concise and compact tabular format called standard disclosure.",
        "Byron also proposes a measure, the resolution rate, which is computed as the number of pronouns resolved correctly divided by the number of (only) referential pronouns.",
        "Finally, in his squib Kibble discusses a reformulation of the centering transitions (Continue, Retain, and Shift), which specify the center movement across sentences.",
        "Instead of defining a total preference ordering, Kibble argues that a partial ordering emerges from the interaction among cohesion (maintaining the same center), salience (realizing the center as subject), and cheapness (realizing the anticipated center of a following utterance as subject).",
        "The last years have seen considerable advances in the field of anaphora resolution, but a number of outstanding issues either remain unsolved or need more attention and, as a consequence, represent major challenges to the further development of the field (Mitkov 2001a).",
        "A fundamental question that needs further investigation is how far the performance of anaphora resolution algorithms can go and what the limitations of knowledge-poor methods are.",
        "In particular, more research should be carried out on the factors influencing the performance of these algorithms.",
        "One of the impediments to the evaluation or fuller utilization of machine learning techniques is the lack of widely available corpora annotated for anaphoric or coreferential links.",
        "More work toward the proposal of consistent and comprehensive evaluation is necessary; so too is work in multilingual contexts.",
        "Some of these challenges have been addressed in the papers published in this issue, but ongoing research will continue to address them in the near future."
      ]
    }
  ]
}
