{
  "info": {
    "authors": [
      "Michael Schiehlen"
    ],
    "book": "Conference of the European Association for Computational Linguistics – Student Sessions",
    "id": "acl-E93-1053",
    "title": "Localising Barriers Theory",
    "url": "https://aclweb.org/anthology/E93-1053",
    "year": 1993
  },
  "references": [],
  "sections": [
    {
      "heading": "1 Introduction",
      "text": [
        "Government-Binding Parsing has become attractive in the last few years.",
        "A variety of systems have been designed in view of a correspondence as direct as possible with linguistic theory ([Johnson, 1989], [Pollard and Sag, 1991], [Kroch, 1989]).",
        "These approaches can be classified by their method of handling global constraints.",
        "Global constraints are syntactic in nature: They cover more than one projection.",
        "In contrast, local constraints can be checked inside a projection and, thus, lend themselves to a treatment in the lexicon.",
        "Conditions on features have been the subject of intensive study and viable logics have been proposed for them (see e.g. the CUF formalism [Diirre and Eisele, 1991], [Dorna, 1992]).",
        "In this paper, we assume such a unification-based mechanism to take care of local conditions and focus on global constraints.",
        "One class of approaches to principle based parsing (see [Pollard and Sag, 1991] for HPSG, [Kroch, 19891 for TAG) attempts to reduce global conditions to local constraints and thus to make them accessible to treatment in a feature framework.",
        "This strategy has been pursued only at the expense of sacrificing the precise formulation of the theory and the definitory power stemming from it.",
        "The result has been a shift from the structural perspective assumed by GB theory to the object-oriented view taken by unification formalisms.",
        "The other class of approaches ([Johnson, 1989]) has allowed the full range of possible restrictions on trees and has incurred potential undecidability for its parsers.",
        "We take up a middle stance on the matter in that we propose a separate logic for global constraints and posit that global constraints only work on ancestor lines (see 7).",
        "We assume \"movement\" to be encoded by the kind of gap-threading technique familiar from HPSG, LFG.",
        "In order to integrate global constraints a \"state\" (information that serves to express barrier configurations in the part of the tree which has already been built up) is associated with each \"chain\" (information about a moved element).",
        "Following HPSG, LFG, we have in mind a rule-based parser.",
        "Thus, states are manipulated when rules are chained.",
        "We need a calculus that is able to derive global constraints working on a local basis.",
        "We begin by developing this calculus hand in hand with an analysis of Chomsky's frame1 wish to thank Robin Cooper, Mark Johnson and Esther KOnig-Baumer for comments on earlier versions of this paper.",
        "work.",
        "We then go on to show that many approaches to barriers theory and a variety of diverse phenomena can be moulded into our format and conclude with an indication of ways to use the system on-line during parsing."
      ]
    },
    {
      "heading": "2 Dependencies Between Nodes",
      "text": [
        "We take a free T to be a structure (N,>), where N is a set of nodes and > stands for dominance, a binary relation on N. We say that nodes a and b are connected if a > b V b>a V a= b.",
        "We define the relation of immediate dominance between two nodes a and b as a > b A : a>cAc> b. Dominance is an irreflexive partial order relation satisfying the axioms (1-3).",
        "Ancestors of a node are connected (1), there exists a (single) root (2), dominance reduces to immediate dominance (3).",
        "Variables are universally quantified unless specified otherwise.",
        "(1) x>z A y>z x connected with y (2) 3xVy : x > y (3) x>z+3y:x>-y A y>z Chomsky [1986, 9,30] discusses several definitions for constraints on unbounded dependencies.",
        "(13) a c-commands f3 if a does not dominate 16 [and does not dominate or equal a] and every 7 that dominates a dominates 13.",
        "Where 7 is restricted to maximal projections we will say that a m-commands O.",
        "(18) a governs fi if a m-commands 13 and there is no 7, 7 a barrier for f3, such that 7 excludes a.",
        "(59) )3 is n-subjacent to a if there are fewer than n+1 barriers for fl that exclude a.",
        "All of these can be moulded into the general format introduced in (4): Two nodes can only stand in a relation R if they are unconnected and, furthermore, at most n barriers for the second node do not dominate the first one.",
        "The notion of a barrier B remains to be specified.",
        "For now, we only demand that barrier hood entail dominance.",
        "We call relations that satisfy axiom (4) definable with barrier concepts, for short BC-definable.",
        "(4) aRb a, b unconnected A Re I B(c,b) A ,c>a}l < n Balanced relations like government require a definition in terms of two BC-definable relations: Ri(a, b) and R2(b, a).",
        "(5) B(c,b), c>b We can show several properties of BC-definable relations.",
        "The nodes are unconnected.",
        "(6) aRb ^ a, b unconnected In order to investigate BC-definable relations it suffices to investigate the ancestor lines of their second argument b (that is {y I y> b}).",
        "(7) x-y A x>ai A --iy>ai A x>a2 A -w>a2 A y > b (aillb a2Rb) (7) gives rise to equivalence classes for the first argument of R. For a particular pair (a,b) we can always find a y as defined in (8).",
        "(8) a E [y] 4-+x-y A x>a A ty>a A y> b Definable relations are never empty.",
        "Barriers are preserved in the upward direction of the ancestor line: (9) [y] Ry (10) x > y A [y] Rb 4 [x] Rb (10) is less innocent than it looks.",
        "I give a revealing binding example from Kamp and Reyle [1993].",
        "If EC P=x [CP=y hei sees Mary ] and she smiles] Johni is happy.",
        "*[cp=x [CP=y Hei sees Mary ] and Johni is happy]."
      ]
    },
    {
      "heading": "3 Barrier Definitions 3.1 Adjunction",
      "text": [
        "Adjunction rules raise a problem for algebraic investigations of barriers theory (e.g. [Kracht, 1992]): They insert material into a tree but do not create new projections.",
        "Thus, adjunction rules imply a distinction between projections and segment nodes that correspond to graph-theoretical nodes.",
        "We shall use Greek letters to refer to projection nodes and Latin letters for segment nodes.",
        "The only way to create projections covering more than one segment is through adjunction.",
        "Since adjunction rules have equivalent mother and daughter nodes, projections are coherent in the sense that: Va # Vbi , b2: a > bia > h _ 2 Chomsky [1986] defines projection dominance so that a dominates 13 only if every segment of a dominates (every segment of) #.",
        "In case this definition is not empty, (1) guarantees a unique minimal segment amin of a.",
        "Thus, we can rephrase Chomsky's definition in terms of segment nodes and get that a dominates # just in case the minimal segment of a dominates some segment of #.",
        "(11) dominate(a,#)E a A bEf3A minimal segment(a) A a> b Likewise, Chomsky's definition of exclusion, viz that a excludes f3 if no segment of a dominates (any segment of) (3, can be transformed to the equivalent condition that a excludes # if the maximal segment of a does not dominate a segment of #.",
        "(12) exclude(a,#) 4-4aEa A b E A maximal segment(a) A > b",
        "This way, we reduce projection dominance to segment dominance.",
        "In (13-15), conditions of segment minimality or maximality are included where they are appropriate by (11) and (12)."
      ]
    },
    {
      "heading": "3.2 Chomsky's Theory",
      "text": [
        "Chomsky [1986, 14] gives the following two core definitions for barriers.",
        "We are not concerned about the exact formulation of L-marking (for a definition see [Chomsky, 1986, 24]).",
        "We understand 7 in (25) and (26) to be a maximal projection, and we understand \"immediately dominate\" in (26a) to be a relation between maximal projections (so that 7 immediately dominates (5 in this sense even if a nonmaximal projection intervenes).",
        "Formulation of these definitions in first order logic yields (13-15).",
        "In order to obtain an open-ended definition scheme the equivalence of the above definitions is held implicit: Barrier concepts are true if they comply with a manifest definition (see also 22 and 23).",
        "(13) blocking category(c,b) maximal projection(c)",
        "The examples below are drawn from Cinque [1990, 831.",
        "He uses a superscription convention to annotate the scope of the negation and assumes an LF amalgamation process triggered by coindexing of this sort.",
        "CP is no barrier anymore for LF-amalgamated elements since they become wh-movable.",
        "We might model amalgamation with the \"nonphantom\" clause of (21).",
        "Then, this clause would have to hold true for inherently wh-movable elements (bare quantifiers in Cinque's analysis) as well.",
        "*Molti amici, [cp ha invitato t, che io sap pia.",
        "Molti amici, [cP [Negp non ha invitato t, che io sappia."
      ]
    },
    {
      "heading": "3.4 Properties of the Definition Schemes",
      "text": [
        "In this paragraph we further investigate properties of the three definition schemes we are dealing with.",
        "We summarize scheme (16) in (22).",
        "def is a variable ranging over the given definitions.",
        "(22) B(c,b) 4-^3def :L def(c) A c>b We can collapse all definitions del into a single definition with local condition K(c)VdefLdef(c).",
        "In order to summarize the schemes (16-17) we introduce vectors of definitions def of length n and corresponding sequences of nodes of length n 1. xi is fixed to c and xn+1 to b.",
        "(23) B(c, b)3 def, : Vi{1, ...,n} def(i)(xi) A xi > For definitions conforming to type (16-17) we can show the following property: If we have found a son y violating the relation R all descendants b of the father x will be inaccessible to R. (24) x y A aRx A --iaRy A x > b In a full-fledged definition scheme where (16-18) are available (24) ceases to hold.",
        "In the example discussed above a does not govern y but does govern b. a [cp.x [vp.y b In pre-Barriers GB theory and most current computational approaches only inherent barriers are allowed (scheme 16) and the violating number of barriers in axiom (4) is set to null.",
        "Note that under these provisos, barriers theory shrinks to command theory:",
        "(4') aRb 4-, a, b unconnected A Vc :K(c) A c>b--,c>a The following constraint holds in this configuration: A barrier as in (24) is not affected by the triggering first argument.",
        "(25) x>.-y A 3a: [aRx A -iaRy] A bRx -ibRy Chomsky [1986, 11] discusses (25) at some length.",
        "In his example (see below) \"decide\" =a does not govern \"PRO\", but \"e\" =b would.",
        "He shows that if either of the mentioned requirements (n=0 and intrinsic barriers) is not met the theorem is refuted.",
        "(21) John decided [cp e [ip PRO to [vP see the movie ]]] If (16-18) are given then we can show the following theorem: Brothers are equivalent when occurring as a second argument of a BC-definable relation.",
        "(26) a, b1 unconnected A a, b2 unconnected A b1 >.-b1 A bi b2aRb2)"
      ]
    },
    {
      "heading": "4 Localising the Global Constraints",
      "text": [
        "The next step is to localise the definitions (16 18).",
        "For ease of reference we repeat the definition schemes.",
        "(27) B(c,b) 4-, 3def : [Li(c) A c> b]V [Li(c) A 1(c,b, B, L2)] V [Li (c) A c>b AB, We only take into account nodes c that separate a from b in the sense that they sit on the ancestor line of b but not on that of a (see also the restrictions of 4 and 5).",
        "Theorem (28) specifies a connection between the inheritance clauses valid on a father node x and those valid on the son y.",
        "Recall that inheritance clauses are the only global conditions we consider.",
        "(28)y A y>b A -w>a (B(y, b) V (I(y, b, B, L) A -1(y)) 1(x,b, B, L)) In parsing, an unbounded dependency (formally, a relation R) is triggered by a node n1 (e.g. because it lacks a t9-role or cannot take up a 19-role assigned to it) and successfully terminates when a corresponding node n2 is found (that can supply the missing t9-role or absorb a superfluous t9-role).",
        "When searching, ancestor lines are either ascended or descended.",
        "Accordingly we have to make a distinction between the upward and downward state of dependency information."
      ]
    },
    {
      "heading": "4.1 Upward States",
      "text": [
        "Upward states supply information about barrier nodes encountered on the ancestor line below.",
        "They are constructed when the second argument b of a relation R has been found and the tree is being searched for the first argument a.",
        "Formally, upward states are sets (standing for conjunctions) associated with some node c and some dependency coming from b.",
        "The rule schemes (27-28) supply all sufficient and necessary conditions for transfer of inheritance clauses between nodes.",
        "Accordingly an atomic formula in the upper downward state can be transformed into a formula holding for the lower node c. False formulae are discarded, while true formulae increase the counter.",
        "We use downward states to restrict the search space.",
        "By (24) we can sometimes infer that search into a subtree will be pointless.",
        "Negative inheritance clauses, however, can only be checked when a candidate for b has been encountered.",
        "When the parser descends paths while searching, it always assumes that the current path will dominate b.",
        "For upward states, in contrast, the ancestor line of b is fixed.",
        "Only downward states scan trees.",
        "(26) shows that a state will not change for brother nodes.",
        "So we only have to store one downward state per rule (e.g. under its mother node)."
      ]
    },
    {
      "heading": "4.3 Example",
      "text": [
        "Consider the chain of \"how\" in the following example how do [1p.",
        "you [vp.",
        "t [vp remember [cP ti*whY [ip Bill t behaved t 11111 In a left-to-right top-down parse, the first barrier to be encountered would be IP* if it dominated either a blocking category (BC) or no other tensed IP.",
        "VP* is no BC or barrier since it does not dominate the intermediate trace (it is not the minimal segment of the VP node).",
        "CP is L-marked and hence a barrier only if it dominates a BC.",
        "If \"why\" excludes a trace in SpecCP, the BC IP occurs between CP and the next trace.",
        "Due to the t9-role of \"how\", government is violated leading to an ungrammatical sentence.",
        "If an intermediate trace is allowed, a new chain is started and no BC occurs.",
        "IP refutes the hypothesis that IP* is the deepest embedded tensed IP, and it turns out to be this IP as soon as the variable is found.",
        "So only one subjacency barrier occurs: The sentence is grammatical."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "We have described a mechanism that handles global constraints on long movement from a local basis.",
        "The device has been derived from a logical formulation of Chomsky's [1986] theory so that equivalence to this theory is easily proved.",
        "We have sketched methods to use the logic for early determination of ungrammatical readings in a parser.",
        "In my thesis aSchiehlen, 1992)) the technique has been implemented in an Earley parser that generates all readings in parallel.",
        "In this system local conditions are couched into feature terms.",
        "Feature clashes lead to creation and abolition of dependencies modelling the GB notion of failed feature assignment and last resource.",
        "The barriers logic restricts rule choice for the predictor (descending ancestor lines) and discards analyses in the completer (ascending ancestor lines).",
        "Ongoing work is centred around an application of the barriers framework to the generation of semantic structure (Discourse Representation Structure).",
        "Kracht's [1992] approach to analysing barriers theory is related to the one presented here.",
        "However, Kracht's emphasis is not so much on parsing.",
        "A Proofs Proof of (6) is trivial.",
        "The theorem (7) is symmetric for al and az.",
        "Suppose aiRb A -ia2Rb.",
        "az and b are unconnected.",
        "So there exist ki barriers not dominating al (k1 < n) and kz barriers not dominating az (k2 > n).",
        "Suppose c is a barrier not dominating az but dominating al (there are at least kz - ki > 1 such barriers).",
        "c> b and y> b, hence c and y are connected.",
        "But y> c entails y> a1.",
        "If c> y then either x > c> y or c> x.",
        "But c> x implies c> az.",
        "To prove (9) note that all barriers for y dominate y by (5).",
        "Hence they also dominate a E [91.",
        "We now turn to (10).",
        "Take al E [x] and az E .",
        "az and y are not connected.",
        "We show that if --,c> az and c> b then > al.",
        "Assume c> b and c> al.",
        "Then x and c are connected both dominating b.",
        "We know that ix > c> al.",
        "Hence c> x > y.",
        "Suppose yi is y's father.",
        "Then c> x >yj >- y and equally c> x > az.",
        "We obtain that {c I B(c, b) A --,c> al} J {c I B(c, b) A -'c> a2}.",
        "Hence -i[x]Rb.",
        "We prove (24).",
        "Suppose c is a barrier for x.",
        "Then by (23) there is a sequence of nodes x1 = c and xn >xn+i = x.",
        "But xn> x > b , so c is a barrier for b as well, a and y are unconnected.",
        "Suppose c is a barrier for y but not x.",
        "Then xi = c and xn > xn+i = y. xn and x are connected both dominating y.",
        "We know that > x > y and ix > x else c would be a barrier for x.",
        "Hence xn = x and we get xn = x > b.",
        "There are at least as many barriers for b as there are for y, so -iaRb.",
        "To prove (25) we adopt the argumentation of the foregoing proof and infer that x is a barrier for y. bRx shows that b, x are unconnected, hence ix > b and -ibRy.",
        "(26) follows if we prove B(c, b1) B(c, bz) by induction.",
        "The theorem is symmetric.",
        "Assume a c such that B(c, b1).",
        "Then either scheme (16) holds: L(c) A c > bi hence c > bz.",
        "Or (17) and L(c) A ad : B(d, bi) A c>d A Ve :c>e>d---+ -,L(e).",
        "By induction B(d, bz) as well.",
        "For the negative scheme (18) we use symmetry to extend the implication I(c, bi, B, L) I(c, bz, B, L) to an equivalence.",
        "For (28) we give a proof by cases.",
        "Either B(y, b) 1(x, b, B, L).",
        "y is the barrier node d referred to in the consequent.",
        "Or I(y, b, B, L) A -1(y) I(x, b, B, L).",
        "We set the barrier node d of the first inheritance clause equal to the one of the second.",
        "Does a node e between x and d satisfy L?",
        "y does not, nor do the nodes between y and d, and there is no node between x and y.",
        "But y and e must be connected, both dominating d. We show I(x, b, B, L) B(y, b) V I(y, b, B, L).",
        "The barrier node d of the antecedent clause and y are connected, both dominating b (see 5).",
        "d cannot sit between x and y.",
        "If d = y the first disjunct holds.",
        "If y> d we set d equal to the barrier node of the second disjunct.",
        "No e between y and d satisfies L. We reduce (29) to (10).",
        "If a > y> b we make use of (6).",
        "Otherwise let xi be the smallest node that dominates both y and a and let x be such that xi x > y.",
        "Then by (10) -i[x]Rb, meaning -iaRb (see 8)."
      ]
    }
  ]
}
