{
  "info": {
    "authors": [
      "Cristina Butnariu",
      "Su Nam Kim",
      "Preslav Nakov",
      "Ó",
      "Diarmuid Séaghdha",
      "Stan Szpakowicz",
      "Tony Veale"
    ],
    "book": "Proceedings of the Workshop on Semantic Evaluations: Recent Achievements and Future Directions (SEW-2009)",
    "id": "acl-W09-2416",
    "title": "SemEval-2010 Task 9: The Interpretation of Noun Compounds Using Paraphrasing Verbs and Prepositions",
    "url": "https://aclweb.org/anthology/W09-2416",
    "year": 2009
  },
  "references": [
    "acl-C08-1011",
    "acl-D08-1027",
    "acl-E03-1073",
    "acl-P06-2064",
    "acl-P07-1072",
    "acl-P08-1052",
    "acl-P84-1109",
    "acl-W01-0511",
    "acl-W03-1803",
    "acl-W04-0404",
    "acl-W96-0309"
  ],
  "sections": [
    {
      "text": [
        "University College Dublin",
        "ioana.butnariu@ucd.ie",
        "Su Nam Kim Preslav Nakov",
        "nkim@csse.unimelb.edu.au nakov@comp.nus.edu.sg",
        "Diarmuid O Seaghdha",
        "szpak@site.uottawa.ca",
        "tony.veale@ucd.ie",
        "We present a brief overview of the main challenges in understanding the semantics of noun compounds and consider some known methods.",
        "We introduce a new task to be part of SemEval-2010: the interpretation of noun compounds using paraphrasing verbs and prepositions.",
        "The task is meant to provide a standard testbed for future research on noun compound semantics.",
        "It should also promote paraphrase-based approaches to the problem, which can benefit many NLP applications."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Noun compounds (NCs) - sequences of two or more nouns acting as a single noun, e.g., colon cancer tumor suppressor protein - are abundant in English and pose a major challenge to the automatic analysis of written text.",
        "Baldwin and Tanaka (2004) calculated that 3.9% and 2.6% of the tokens in the Reuters corpus and the British National Corpus (BNC), respectively, are part of a noun compound.",
        "Compounding is also an extremely productive process in English.",
        "The frequency spectrum of compound types follows a Zipfian or power-law distribution (O Seaghdha, 2008), so in practice many compound tokens encountered belong to a \"long tail\" of low-frequency types.",
        "For example, over half of the two-noun NC types in the BNC occur just once (Lapata and Lascarides, 2003).",
        "Even for relatively frequent NCs that occur ten or more times in the BNC, static English dictionaries give only 27% coverage (Tanaka and Baldwin, 2003).",
        "Taken together, the factors of high frequency and high productivity mean that achieving robust NC interpretation is an important goal for broad-coverage semantic processing.",
        "NCs provide a concise means of evoking a relationship between two or more nouns, and natural language processing (NLP) systems that do not try to recover these implicit relations from NCs are effectively discarding valuable semantic information.",
        "Broad coverage should therefore be achieved by post-hoc interpretation rather than pre-hoc enumeration, since it is impossible to build a lexicon of all NCs likely to be encountered.",
        "The challenges presented by NCs and their semantics have generated significant ongoing interest in NC interpretation in the NLP community.",
        "Representative publications include (Butnariu and Veale, 2008; Girju, 2007; Kim and Baldwin, 2006; Nakov, 2008b; Nastase and Szpakowicz, 2003; 0 Seaghdha and Copestake, 2007).",
        "Applications that have been suggested include Question Answering, Machine Translation, Information Retrieval and Information Extraction.",
        "For example, a question-answering system may need to determine whether headaches induced by caffeine withdrawal is a good paraphrase for caffeine headaches when answering questions about the causes of headaches, while an information extraction system may need to decide whether caffeine withdrawal headache and caffeine headache refer to the same concept when used in the same document.",
        "Similarly, a machine translation system facing the unknown NC WTO Geneva headquarters might benefit from the ability to paraphrase it as Geneva headquarters of the WTO or as WTO headquarters located in Geneva.",
        "Given a query like can cer treatment, an information retrieval system could use suitable paraphrasing verbs like relieve and prevent for page ranking and query refinement.",
        "In this paper, we introduce a new task, which will be part of the SemEval-2010 competition: NC interpretation using paraphrasing verbs and prepositions.",
        "The task is intended to provide a standard testbed for future research on noun compound semantics.",
        "We also hope that it will promote paraphrase-based approaches to the problem, which can benefit many NLP applications.",
        "The remainder of the paper is organized as follows: Section 2 presents a brief overview of the existing approaches to NC semantic interpretation and introduces the one we will adopt for SemEval-2010 Task 9; Section 3 provides a general description of the task, the data collection, and the evaluation methodology; Section 4 offers a conclusion."
      ]
    },
    {
      "heading": "2. Models of Relational Semantics in NCs",
      "text": [
        "The prevalent view in theoretical and computational linguistics holds that the semantic relations that implicitly link the nouns of an NC can be adequately enumerated via a small inventory of abstract relational categories.",
        "In this view, mountain hut, field mouse and village feast all express 'location in space', while the relation implicit in history book and nativity play can be characterized as 'topicality' or 'aboutness'.",
        "A sample of some of the most influential relation inventories appears in Table 1.",
        "Levi (1978) proposes that complex nominals a general concept grouping together nominal compounds (e.g., peanut butter), nominalizations (e.g., dream analysis) and non-predicative noun phrases (e.g., electric shock) - are derived through the complementary processes of recoverable predicate deletion and nominalization; each process is associated with its own inventory of semantic categories.",
        "Table 1 lists the categories for the former.",
        "Warren (1978) posits a hierarchical classification scheme derived from a large-scale corpus study of NCs.",
        "The top-level relations in her hierarchy are listed in Table 1, while the next level subdivides CONSTITUTE into SOURCE-RESULT, RESULT-SOURCE and COPULA; COPULA is then further subdivided at two additional levels.",
        "In computational linguistics, popular inventories of semantic relations have been proposed by Nastase and Szpakowicz (2003) and Girju et al.",
        "(2005), among others.",
        "The former groups 30 finegrained relations into five coarse-grained super-categories, while the latter is a flat list of 21 relations.",
        "Both schemes are intended to be suitable for broad-coverage analysis of text.",
        "For specialized applications, however, it is often useful to use domain-specific relations.",
        "For example, Rosario and Hearst (2001) propose 18 abstract relations for interpreting NCs in biomedical text, e.g., DEFECT, MATERIAL, PERSON AFFILIATED,",
        "ATTRIBUTE OF CLINICAL STUDY.",
        "Inventory-based analyses offer significant advantages.",
        "Abstract relations such as 'location' and 'possession' capture valuable generalizations about NC semantics in a parsimonious framework.",
        "Unlike paraphrase-based analyses (Section 2.2), they are not tied to specific lexical items, which may themselves be semantically ambiguous.",
        "They also lend themselves particularly well to automatic interpretation methods based on multi-class classification.",
        "On the other hand, relation inventories have been criticized on a number of fronts, most influentially by Downing (1977).",
        "She argues that the great variety of NC relations makes listing them all impossible; creative NCs like plate length ('what your hair is when it drags in your food') are intuitively compositional, but cannot be assigned to any standard inventory category.",
        "A second criticism is that restricted inventories are too impoverished a representation scheme for NC semantics, e.g., headache pills and sleeping pills would both be analyzed as FOR in Levi's classification, but express very different (indeed, contrary) relationships.",
        "Downing writes (p. 826): \"These interpretations are at best reducible to underlying relationships..., but only with the loss ofmuch ofthe semantic material considered by subjects to be relevant or essential to the definitions.\"",
        "A further drawback associated with sets of abstract relations is that it is difficult to identify the \"correct\" inventory or to decide whether one proposed classification scheme should be favored over another.",
        "An alternative approach to NC interpretation associates each compound with an explanatory para-",
        "Author(s) Relation Inventory",
        "Warren (1978) POSSESSION, LOCATION, PURPOSE, ACTIVITY-ACTOR, RESEMBLANCE, CONSTITUTE",
        "Nastase and CAUSALITY (cause, effect, detraction, purpose),",
        "Szpakowicz PARTICIPANT (agent, beneficiary, instrument, object_property,",
        "QUALITY (container, content, equative, material, measure, topic, type), SPATIAL(direction, location_at, location_from, location), TEMPORALITY (frequency, time.at, time_through) Girju et al.",
        "(2005) POSSESSION, ATTRIBUTE-HOLDER, AGENT, TEMPORAL, PART-WHOLE, IS-A, CAUSE,",
        "MAKE/PRODUCE, INSTRUMENT, LOCATION/SPACE, PURPOSE, SOURCE, TOPIC, MANNER,",
        "Table 1: Previously proposed inventories of semantic relations for noun compound interpretation.",
        "The first two come from linguistic theories; the rest have been proposed in computational linguistics.",
        "phrase.",
        "Thus, cheese knife and kitchen knife can be expanded as a knife for cutting cheese and a knife used in a kitchen, respectively.",
        "In the paraphrase-based paradigm, semantic relations need not come from a small set; it is possible to have many subtle distinctions afforded by the vocabulary of the paraphrasing language (in our case, English).",
        "This paradigm avoids the problems of coverage and representational poverty, which Downing (1977) observed in inventory-based approaches.",
        "It also reflects cognitive-linguistic theories of NC semantics, in which compounds are held to express underlying event frames and whose constituents are held to denote event participants (Ryder, 1994).",
        "Lauer (1995) associates NC semantics with prepositional paraphrases.",
        "As Lauer only considers a handful of prepositions (about, at, for, from, in, of, on, with), his model is essentially inventory-based.",
        "On the other hand, noun-preposition co-occurrences can easily be identified in a corpus, so an automatic interpretation can be implemented through simple unsupervised methods.",
        "The disadvantage of this approach is the absence of a one-to-one mapping from prepositions to meanings; prepositions can be ambiguous (of indicates many different relations) or synonymous (at, in and on all express 'location').",
        "This concern arises with all paraphrasing models, but it is exacerbated by the restricted nature of prepositions.",
        "Furthermore, many NCs cannot be paraphrased adequately with prepositions, e.g., woman driver, honey bee.",
        "A richer, more flexible paraphrasing model is afforded by the use of verbs.",
        "In such a model, a honey bee is a bee that produces honey, a sleeping pill is a pill that induces sleeping and a headache pill is a pill that relieves headaches.",
        "In some previous computational work on NC interpretation, manually constructed dictionaries provided typical activities or functions associated with nouns (Finin, 1980; Isabelle, 1984; Johnston and Busa, 1996).",
        "It is, however, impractical to build large structured lexicons for broad-coverage systems; these methods can only be applied to specialized domains.",
        "On the other hand, we expect that the ready availability of large text corpora should facilitate the automatic mining of rich paraphrase information.",
        "The SemEval-2010 task we present here builds on the work of Nakov (Nakov and Hearst, 2006; Nakov, 2007; Nakov, 2008b), where NCs are paraphrased by combinations of verbs and prepositions.",
        "Given the problem of synonymy, we do not provide a single correct paraphrase for a given NC but a probability distribution over a range of candidates.",
        "For example, highly probable paraphrases for chocolate bar are bar made ofchocolate and bar that tastes like chocolate, while bar that eats chocolate is very unlikely.",
        "As described in Section 3.3, a set of goldstandard paraphrase distributions can be constructed by collating responses from a large number of human subjects.",
        "In this framework, the task of interpretation becomes one of identifying the most likely paraphrases for an NC.",
        "Nakov (2008b) and Butnariu and Veale (2008) have demonstrated that paraphrasing information can be collected from corpora in an unsupervised fashion; we expect that participants in",
        "SemEval-2010 Task 9 will further develop suitable techniques for this problem.",
        "Paraphrases ofthis kind have been shown to be useful in applications such as machine translation (Nakov, 2008a) and as an intermediate step in inventory-based classification of abstract relations (Kim and Baldwin, 2006; Nakov and Hearst, 2008).",
        "Progress in paraphrasing is therefore likely to have follow-on benefits in many areas."
      ]
    },
    {
      "heading": "3. Task Description",
      "text": [
        "The description of the task we present below is preliminary.",
        "We invite the interested reader to visit the official Website of SemEval-2010 Task 9, where up-to-date information will be published; there is also a discussion group and a mailing list.",
        "In a preliminary study, we asked 2 -30 human subjects to paraphrase 2 0 noun-noun compounds using suitable paraphrasing verbs.",
        "This is the Levi-250 dataset (Levi, 1978); see (Nakov, 2008b) for details.",
        "The most popular paraphrases tend to be quite apt, while some less frequent choices are questionable.",
        "For example, for chocolate bar we obtained the following paraphrases (the number of subjects who proposed each one is shown in parentheses):",
        "We propose a task in which participating systems must estimate the quality of paraphrases for a test set of NCs.",
        "A list of verb/preposition paraphrases will be provided for each NC, and for each list a participating system will be asked to provide aptness scores that correlate well (in terms of frequency distribution) with the human judgments collated from our test subjects.",
        "Trial/Development Data.",
        "As trial/development data, we will release the previously collected paraphrase sets for the Levi-250 dataset (after further review and cleaning).",
        "This dataset consists of 2 0 noun-noun compounds, each paraphrased by 2 -30 human subjects (Nakov, 2008b).",
        "Test Data.",
        "The test data will consist of approximately 300 NCs, each accompanied by a set of paraphrasing verbs and prepositions.",
        "Following the methodology of Nakov (2008b), we will use the Amazon Mechanical Turk Web service to recruit human subjects.",
        "This service offers an inexpensive way to recruit subjects for tasks that require human intelligence, and provides an API which allows a computer program to easily run tasks and collate the responses from human subjects.",
        "The Mechanical Turk is becoming a popular means to elicit and collect linguistic intuitions for NLP research; see Snow et al.",
        "(2008) for an overview and a discussion of issues that arise.",
        "We intend to recruit 100 annotators for each NC, and we will require each annotator to paraphrase at least five NCs.",
        "Annotators will be given clear instructions and will be asked to produce one or more paraphrases for a given NC.",
        "To help us filter out subjects with an insufficient grasp of English or an insufficient interest in the task, annotators will be asked to complete a short and simple multiple-choice pretest on NC comprehension before proceeding to the paraphrasing step.",
        "Post-processing.",
        "We will manually check the trial/development data and the test data.",
        "Depending on the quality of the paraphrases, we may decide to drop the least frequent verbs.",
        "License.",
        "All data will be released under the Creative Commons Attribution 3.0 Unported license.",
        "Single-NC Scores.",
        "For each NC, we will compare human scores (our gold standard) with those proposed by each participating system.",
        "We have considered three scores: (1) Pearson's correlation, (2) cosine similarity, and (3) Spearman's rank correlation.",
        "Pearson's correlation coefficient is a standard measure of the correlation strength between two distributions; it can be calculated as follows:",
        "where X = (xi,..., £„) and Y = (yi,..., y„) are vectors of numerical scores for each paraphrase provided by the humans and the competing systems, respectively, n is the number of paraphrases to score, and E(X) is the expectation of X.",
        "Cosine correlation coefficient is another popular alternative and was used by Nakov and Hearst (2008); it can be seen as an uncentered version of Pearson's correlation coefficient:",
        "Spearman's rank correlation coefficient is suitable for comparing rankings of sets of items; it is a special case of Pearson's correlation, derived by considering rank indices (1,2,.)",
        "as item scores .",
        "It is defined as follows:",
        "7itVi ncirif",
        "One problem with using Spearman's rank coefficient for the current task is the assumption that swapping any two ranks has the same effect.",
        "The often-skewed nature of paraphrase frequency distributions means that swapping some ranks is intuitively less \"wrong\" than swapping others.",
        "Consider, for example, the following list of human-proposed paraphrasing verbs for child actor, which is given in",
        "Clearly, a system that swaps the positions for be (22) and look like (4) for child actor will have made a significant error, while swapping contain (17) and be made of (16) for chocolate bar (see Section 3.1) would be less inappropriate.",
        "However, Spearman's coefficient treats both alterations identically since it only looks at ranks; thus, we do not plan to use it for official evaluation, though it may be useful for post-hoc analysis.",
        "Final Score.",
        "A participating system's final score will be the average of the scores it achieves over all test examples.",
        "Scoring Tool.",
        "We will provide an automatic evaluation tool that participants can use when training/tuning/testing their systems.",
        "We will use the same tool for the official evaluation."
      ]
    },
    {
      "heading": "4. Conclusion",
      "text": [
        "We have presented a noun compound paraphrasing task that will run as part of SemEval-2010.",
        "The goal of the task is to promote and explore the feasibility of paraphrase-based methods for compound interpretation.",
        "We believe paraphrasing holds some key advantages over more traditional inventory-based approaches, such as the ability ofparaphrases to represent fine-grained and overlapping meanings, and the utility of the resulting paraphrases for other applications such as Question Answering, Information Extraction/Retrieval and Machine Translation.",
        "The proposed paraphrasing task is predicated on two important assumptions: first, that paraphrasing via a combination of verbs and prepositions provides a powerful framework for representing and interpreting the meaning of compositional nonlexical-ized noun compounds; and second, that humans can agree amongst themselves about what constitutes a good paraphrase for any given NC.",
        "As researchers in this area and as proponents of this task, we believe that both assumptions are valid, but if the analysis of the task were to raise doubts about either assumption (e.g., by showing poor agreement amongst human annotators), then this in itself would be a meaningful and successful output of the task.",
        "As such, we anticipate that the task and its associated dataset will inspire further research, both on the theory and development of paraphrase-based compound interpretation and on its practical applications."
      ]
    }
  ]
}
