{
  "info": {
    "authors": [
      "James Pustejovsky",
      "Peter G. Anick"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2110",
    "title": "On the Semantic Interpretation of Nominals",
    "url": "https://aclweb.org/anthology/C88-2110",
    "year": 1988
  },
  "references": [
    "acl-C88-2149",
    "acl-P86-1035",
    "acl-P87-1025",
    "acl-P87-1028"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper we examine a subset of polysemous elements, the logical structure of nominals, and argue that many cases of polysemy have well-defined calculi, which interact with the grammar in predictable and determinate ways for disambiguation.",
        "These calculi constitute part of the lexical organization of the grammar and contribute to the lexical semantics of a word.",
        "The lexical system of the grammar is distinct from the conceptual representation associated with a lexical item, where polysemy is less constrained by grammar.",
        "We propose a structured semantic representation, the Lexical Conceptual Paradigm (LOP) which groups nouns into paradigmatic classes exhibiting like behavior."
      ]
    },
    {
      "heading": "I. Introduction",
      "text": [
        "Much of the work on polysemy has tended to confuse the nature of word meaning by labeling many different types of ambiguity as the same phenomenon.",
        "In the extreme case, every possible lexical semantic distinction is a case of polysemy and must have its own conceptual representation.",
        "In such a theory, various features are introduced to distinguish one sense from another; but the meanings are all part of the same homogeneous conceptual space.",
        "in this paper, we argue that there are various types of polysemy, some more accessible to grammatical phenomena than others.",
        "We use this as a principled distinguishing characteristic of polysemous types.",
        "We distinguish two systems that together comprise the meaning of lexical items, the lexical system and the conceptual system.",
        "In particular, if there are certain grammatical characteristics that are affected by a polysemous relation between concepts, then we will say that this relation is overtly part of the lexical",
        "system.' The major point to be argued here is that polysemy is not a single phenomenon operating over all lexical items with equal force and frequency.",
        "Rather, there are subsystems in the lexicon which exhibit a restricted range of polysemous behavior.",
        "Each subsystem is determined by a representation called a Lexical Conceptual Paradigm (LCP), which groups elements into classes with similar behavior.",
        "We limit ourselves in this paper to cases of polysemy involving nominals.",
        "We will proceed as follows.",
        "In Section Two we examine the different types of polysemous nominals.",
        "In particular, we look at a classification of relational nouns, paying particular attention to those exhibiting polysemous behavior.",
        "Then we examine the semantic interpretations possible for artifactual nominals such as book and record, and their associated polysemous behavior resulting from certain syntactic contexts.",
        "In Section Three we introduce a framework for representing this information in the lexicon.",
        "We argue that certain semantic information associated with nominals is more priviliged and accessible to syntactic selection than other knowledge associated with the word.",
        "We term these privileged properties the hidden-event roles of a nominal, and they form part of the Lexical System of semantic analysis.",
        "All other information forms part of the more traditional notion of a conceptual space, what we term simply the Conceptual System.",
        "Finally, in Section Four we look at the computational implications of",
        "such a lexical organization.",
        "The distinction is an important one for computational reasons.",
        "First, it establishes clear criteria for partitioning the semantic information associated with a word; this will bear directly on the decisions made by a parser in order to disambiguate lexical items during a parse.",
        "Secondly, it affects the planning strategies necessary for lexical selection in the process of language generation.",
        "Finally, it relates to the question of how to enter multiple word senses for a lexical item.",
        "According to this view, those words containing logical ambiguities carry these senses in the same entry."
      ]
    },
    {
      "heading": "2. The Relational Structure of Nominals",
      "text": [
        "One reason to study the semantics of relational nominals is that they exhibit polysemy in very well-defined and structured ways.",
        "For example, nominalizations such as arrival, destruction, and solution are ambiguous between the event nominal reading and the resultative reading, as illustrated in (1) through (3).2",
        "(1) a.",
        "We witnessed the city's destruction.",
        "Event b.",
        "The destruction was widespread throughout the city.",
        "Resultaiive (2) a. Mary's arrival is expected to be at 3:00 pm.",
        "Event b. Mary's arrival means that she gets the couch.",
        "Resultative (3) a. John's solution to the problem took 20 minutes.",
        "Event b.",
        "This solution is too difficult to understand.",
        "Resultative",
        "It seems natural to ascribe the relational senses to nominalizations as being some projection of their related verbal argument structure.",
        "There are many nominals, however, which are not nominalizations, yet seem to refer to relations in their meaning.",
        "Classic examples include nouns such as picture and story.",
        "The difference is that their relational structures are implicit, while the relation in a nominalization is explicit.",
        "Let us now turn to the class of dependent nominals.",
        "If the denotation of one sense of a lexical item is \"dependent\" on another, then that dependency is part of the semantic representation of that lexical item.",
        "A familiar example is father or mother, where the relational nature must be part of the semantics of the noun.\"' We term these Primitive relational nominals.",
        "Perhaps not as familiar are nouns such as blemish, wart, scratch, cut, etc.",
        "In each of these cases, the object is evaluated with respect to another object, and in fact it is hard to imagine the dependent object existing in isolation.",
        "For this reason, these will be called Primitive Figure-Ground nominals.",
        "The object itself is the figure to a necessary ground object.",
        "A related class of lexical items includes nouns such as window and door.",
        "These are not simply Primitive Figure-Ground nominals, for notice that there is a hidden argument present that relational nouns such as wart do not have.",
        "(4) a.",
        "Plastic windows are on sale at Lechmere.",
        "b.",
        "The cat crawled through the window.",
        "(5) a. John painted the door blue.",
        "b. John walked through the door quickly.",
        "As pointed out in /Lakoff 1987/, as well as /Talmy 1975/, the nouns here are polysemous, since the window referred to can be the opening as well as the object.",
        "Thus, the hidden argument mentioned is the open space that is left as a result of the absence of the window.",
        "We term this argument the inverted figure, and the noun class itself Double Figure-Ground Nominals.",
        "6 In Section Three, it will be shown that the polysemy illustrated in (4) and (5) is very different from word senses not making reference to either the figure or inverted figure.",
        "The next class of relational nominals are those which enter into a specified relation; namely, the class of artifacts.",
        "An artifact is, by definition, an object associated with a particular activity or event; for example, cigarettes arc for smoking, books are for reading, etc.",
        "Because of these associated activities, this class of nouns exhibit polysemous behavior.",
        "(6) a.",
        "This record weighs an ounce.",
        "b.",
        "This record lasts 35 minutes.",
        "(7) a.",
        "The book has a red cover.",
        "b.",
        "This book will take a week (to read).",
        "(8) a.",
        "These cigarettes are longer than the normal size.",
        "b.",
        "His cigarette is bothering me.",
        "3 See /Pustejovsky 1984/, /Safir 1987/, and /Williams 1985/ for further discussion.",
        "4 /Partee and Kamp 1986/ discusses the semantics of such nominals.",
        "The polysemy in (6) arises because of the possible reference to the event of playing the record as well as the record by itself.",
        "Similarly, in (7) the book itself or the event of reading the book can be referred to by the nominal.",
        "Finally, the difference in (8) points to the cigarette as an object with attributes versus an object in the context of being smoked.",
        "In this section we have presented five types of relational nominals (nominalizations, primitive relationals, primitive figure-grounds, double figure-grounds, and artifactual nominals), showing how they exhibit subtle but productive polysemous behavior.",
        "In the next section, we outline our approach to polysemy and present an explanation of these lexical ambiguities in terms of a richer semantic representation."
      ]
    },
    {
      "heading": "3. The Theory of Lexical Organization",
      "text": [
        "Unlike many previous approaches to word meaning, we distinguish the logical lexical semantics of a word from its deeper, conceptual denotation.",
        "7 We term these the L-system and C-system, respectively.",
        "The L-system is the particular organization that the lexicon assumes independently of the conceptual system.",
        "Only semantic information that is somehow reflected in the syntax is represented here.",
        "g The C-system is the organization of the concepts themselves and not the language.",
        "This is the structure of the meanings, and as such, would be represented as a semantic network or radial category structures (Cf./Hayes 1977/, /Lakoff 1987/).",
        "For each of the nominal types described in the previous sections, we give lexical representations which allow us to capture their polysemous behavior.",
        "Consider first the Double Figure-Ground Nominals in (4) and (5).",
        "The lexical semantics of such nouns as window and door must refer to the three arguments mentioned by the implicit relation, the figure, ground, and inverted-figure.",
        "Assuming a first-order, partial-decomposition model of lexical semantics, as given in /Pustejovsky 1987/, the translations for this class would be as follows:",
        "(9) window Axdy[ariif acd(x) A Figure(x) A Ground(c) A Ficrai.ei(y) A 5(5, see.thru(w,y))1.",
        "(10) door Ax.dy[artifact(x) A Figtire(x) A Geo lid(e) A Figurei(y) A w(x, go.thru(w, y))].",
        "where the three-place relation is explicitly represented as a conjunction of functions over the arguments, c is a con-start, Figure; is the inverted-figure, and w is a metalogical operator indicating the purpose of the object being defined (Cf. /Pustejovsky ire preparation!).",
        "The important thing to note about this representation is that it predicates two distinct types of information over two different but related arguments, x and y; namely, that a door, for example, is defined in terms of both the concrete object which is artifact (the figure), and the space in the absence of this object (the inverted-figure).",
        "Thus, different matrix predications will foreground different suhexpressions in the semantics for the noun.",
        "For example, in (5a), the artifact reading is selected, picking out the figure, while in (5b) the inverted-figure is selected.",
        "(5) a. John painted the door blue.",
        "b. John walked through the door quickly.",
        "We argue that these are the only two types of polysemy for these nominals that are lexically motivated, and that other apparent cases of polysemy are simply inferences associated with the conceptual representation of the object.",
        "This can be seen in sentence such as (11), taken from /bakoff 1987/.",
        "(11) a.",
        "The window is rotting.",
        "(Reference to the wood) b.",
        "The kids broke the window.",
        "(Reference to the pane)",
        "These are not really polysemous in our sense, since the argument structure of the verb selecting the nominal does not specify how the noun is to be interpreted.",
        "That is, although both readings select for the artifact interpretation, only inferences in the conceptual system, and not the lexical semantics, tells us that rotting is predicated of the wooden part of the window.8 Another important aspect to the representations in (9) and (10) is the expression introduced by the operator tir.",
        "This is an example of a hidden-event role denoted by a nominal expression.",
        "In the case of door, the hidden-event",
        "is godhrough(w, , y), a pointer to a particular lexical item, its argument structure, and its selectional properties.",
        "The richer representations in (9) and (10) now provides us with a mechanism for capturing some interesting and subtle lexical distinctions in the artifact nominal class.",
        "For nouns such as record, book, and bulb, we assign the following semantics:9",
        "(12) record =-,4.",
        "Ax]elarti f act(x) A sr(v,piay(e,x))].'° (13) book Ax3e[atdifact(x) A 7r(x,read(e, w, x))].",
        "(14) bulb Ax3e[arti f act(x) A x-(x,inuminate(e,x))).",
        "By explicitly referencing the event that the object is associated with we can solve several puzzles.",
        "First, notice that when the event readings of record and book are selected, they differ in their aspectual interpretations.",
        "(15) a.",
        "This record lasts 35 minutes.",
        "b.",
        "This book takes a week (to read).",
        "c. *This record takes 35 minutes.",
        "d. ?This book lasts a week.",
        "This is certainly surprising if no reference is made to the type of event referenced by the object.",
        "Within the calculus of aspect outlined in /Pustejovsky 1987/, play(x) and read(x,y) fall into different event-types, activity and accomplishment, respectively, and license different temporal predicates.",
        "So, it is not surprising that lexical semantic information is accessible to such processes in the grammar.",
        "Another interesting application of the notion of hidden event (or h-event) comes from evaluative predicates.\" For example, consider the differences between the (a) and (b) NPs below:",
        "(16) a. a vinyl record: ..V.Paxae[ariifaci(x) A via yl(x) A r(x , play(e, x)) A P(x)].",
        "b. a long record AP3x3e[arti f act(x) A x(x,play(e,x)) A long (e) A P(x)].",
        "(17) a. an opaque bulb AP3x3e[arti f act(x) A opaque(x) A x(x, ithaninate(e,x)) A P(x)].",
        "b. a bright bulb Ax]e[arti f act(x) A r(x , illuminate(e, x)) A brig ht(e) A P(x)].",
        "fu (16b), long is a property that only the playing of the record has, while in (17b), bright is a property that only the state of illumination for bulbs has (cf. /Jackendoff 1983/ for multiple senses of lexical items).",
        "By adopting a semantics that snakes reference to events, just as with nom-inalizations,\" we can begin to understand how to analyze evaluative predicates.",
        "Namely, in the cases above, we can distinguish the types of attribution as predication over an individual variable, the artifact ((16a) and (17a)), or over an event variable, the hidden event ((16b) and (17b)).",
        "The structures given in (12)-(14) are all examples of artifactual objects.",
        "The general abstraction for these individuals is the concept of an object made for a particular use:",
        "where e is some predicate.",
        "Such a structure we will term a Lexical Conceptual Paradigm (L CP).",
        "We view these nominals as exhibiting paradigmatic behavior (much like the inflectional endings for verb classes) for the following reason: a paradigm acts as both an abstraction, in that it defines classes, as well as a structured object, with a clustering of different behaviors.",
        "When an object is assigned to a particular paradigm, it assumes the set of behaviors characteristic of that entire class.",
        "So it is with such artifactual nominals.",
        "There arc many such subsystems in the lexicon, each with their own internal consistency represented by unique paradigms.",
        "This idea is explored in detail in /Pustejovsky and Anick 1988/."
      ]
    },
    {
      "heading": "4. Computational Implications of Lexical Organization",
      "text": [
        "In this section we discuss the relevance and implications of the above analysis of nominal semantics for computational purposes.",
        "We will first look at the effect that richer semantic representations have on lexical selection is, the process of language generation.",
        "Secondly, we outline how the problem of lexical disambiguation is facilitated by the use of such lexical entries in the process of analysis.",
        "Imagine a linguistic generation system in the service of a fairly rich semantic knowledge base and planner.",
        "Lexical selection can be defined as the mapping from such 9 We follow /Davidson, 1980] and the extensions in /Parsons, 1985/ for our representation of an event variable for the verb.",
        "See /Pustejovsky 1987/ for discussion.",
        "a knowledge base to a linguistic generation system.",
        "Appropriate word choice is, of course, a function of numerous factors and considerations (/Ward 1988/, /Pustejovsky and Nirenburg 1987/, /Danlos 1987/), but, in any case, the selection process makes sense only if the incoming semantic representation provides for there to be a distinction that is later reflected as a lexical distinction.",
        "Consider now an implicitly relational nominal such as cigarette.",
        "The lexical representation for such a noun is given as (18).",
        "(18) cigarette Ax3e[artifact(x) A ir(x,smoke(e,w,x))].",
        "One of the properties of such nominals is that they may denote the situation or event that the object is embedded within (in this way, it seems to stand in a metonymic relation to the event).",
        "Thus, if given an underlying semantic form such as that in (19), the generator could produce, among others, the linguistic forms shown in (20).",
        "(19) 3e13e23x[smoke(ei,x) A cigarette(x) A bother(e2, el john)] (20) a.",
        "The cigarette's smoking bothered John.",
        "b.",
        "The smoking of the cigarette bothered John.",
        "c. The cigarette bothered John.",
        "The interesting thing to notice here is that (20c) makes use of the nominal without explicit mention of the predicate smoke.",
        "In general, such paraphrase classes as that in (20) involve the hidden event associated with an object.",
        "Furthermore, such classes exist mainly for nominals that are artifacts and have such lexical semantic representations.",
        "A similar decision procedure is at work in the examples in (21), this time in matrix object position.",
        "(21) a. John enjoyed the cigarette.",
        "(h-event = smoke) b. Mary enjoyed the book.",
        "(h-event = read) c. Bill hated the movie.",
        "(h-event = watch) For each nominal appearing as head in the object position in these examples, there is an associated hidden event that allows for the appropriate default presupposition for just what activity was enjoyed for each object.",
        "Thus, it is clear how the representation here provides for choice points in the process of lexical selection.",
        "As an indication of how lexical disambiguation can be facilitated with the richer nominal representations presented here, consider the multiple uses of a polysemous noun such as lisp, illustrated in (22).",
        "(22) a. John is running lisp.",
        "b. Mary has entered lisp.",
        "c. John knows lisp well.",
        "d. Mary is writing lisp.",
        "Now, it might be argued that these senses are all slight variants of one central sense for the nominal, perhaps that of lisp as a language.",
        "Yet what we know about lisp that makes it different from another language, say FORTRAN, is that it is an environment as well as a language.",
        "We can think of the preference rules in /Boguraev's 1979/ lexical disambiguation system as being elements of structured packets, where the above senses are all logically related in one lexical representation of lisp; that is, its Lexical Conceptual Paradigm.",
        "These word senses compete as a group with other unrelated meanings.",
        "Then, finer discriminations are achieved by reference to the internal structure of the LCP for that word.",
        "We explore such a technique in /Pustejovsky and Anick 1988/ and compare our approach to /Hirst 1987/ and other lexical disambiguation systems."
      ]
    },
    {
      "heading": "5. Conclusion and Future Research",
      "text": [
        "In this paper we have argued against the treatment of polysemy as a relation between meanings in a homogeneous concept space.",
        "Rather, we argue, that for nominals at least, there are well-defined subsystems of logically structured ambiguities arising from determinate and finite sources.",
        "We suggest that the incorporation of hidden events in the lexical entry of a nominal provides a handle for linking to other grammatical systems such as aspect and thematic roles, as well as exposing the behavior of other relationships, such as figure-ground, which also have grammatical reflexes.",
        "The utility of such a representation in NLU systems is illustrated by the applications to such tasks as lexical selection in natural language generation as well as to word sense disambiguation tasks and applications in machine translation.",
        "For example, we are examining the subtle range of grammaticalizations involved in German nominalization patterns using an event-based semantics; i.e. assessing the appropriateness of one nominal expression over another.",
        "Finally, it is interesting to speculate on what the relationship between LCP-theory and acquisition and metaphor is.",
        "We are exploring this in current extensions to this work."
      ]
    },
    {
      "heading": "effefreeees",
      "text": []
    }
  ]
}
