{
  "info": {
    "authors": [
      "Charlotte Price",
      "Valeria Paiva",
      "Tracy Holloway King"
    ],
    "book": "Coling 2008: Proceedings of the workshop on Cross-Framework and Cross-Domain Parser Evaluation",
    "id": "acl-W08-1602",
    "title": "Context Inducing Nouns",
    "url": "https://aclweb.org/anthology/W08-1602",
    "year": 2008
  },
  "references": [
    "acl-H94-1020",
    "acl-W06-3907",
    "acl-W08-0506"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "It is important to identify complement-taking nouns in order to properly analyze the grammatical and implicative structure of the sentence.",
        "This paper examines the ways in which these nouns were identified and classified for addition to the Bridge natural language understanding system."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "One of the goals of computational linguistics is to draw inferences from a text: that is, for the system to be able to process a text, and then to conclude, based on the text, whether some other statement is true.",
        "Clausal complements confound the process because, despite their surface similarity to adjuncts, they generate very different inferences.",
        "In this paper we examine complement-taking nouns: how to identify them and how to incorporate them into an inferencing system.",
        "We first discuss what we mean by complement-taking nouns (section 2) and how to identify a list of such nouns (section 3).",
        "We then describe the question-answering system that uses the complement-taking nouns as part of its inferencing (section 4), how the nouns are added to the system (section 5), and how the coverage is tested (section 6).",
        "Finally, we discuss several avenues for future work (section 7), including automating the search process, identifying other context-inducing forms, and taking advantage of cross-linguistic data."
      ]
    },
    {
      "heading": "2 What is a complement-taking noun?",
      "text": [
        "Identifying complement-taking nouns is somewhat involved.",
        "It is important to identify the clause, to ensure that the clause is indeed a complement and not an adjunct (e.g. a relative clause or a purpose infinitive), and to figure out what is licensing the complement, as it is not only nouns that license complements.",
        "A clause is a portion of a sentence that includes a predicate and its arguments.",
        "Clauses come in a variety of forms, a subset of which is shown in (1) for verbs taking complements.",
        "The italicized part is the complement, and the part in bold is what licenses it.",
        "The surface form of the clause can vary significantly depending on the licensing verb.",
        "(1) a. Mary knows that Bob is happy.",
        "b. John wants (Mary) to leave right now.",
        "c. John likes fixing his bike.",
        "d. John let Mary fix his bike.",
        "For this paper, we touch briefly on nouns taking to clauses, as in (2b), but the main focus is on that clauses, as in (2a).",
        "(2) a. the fact that Mary hopped b. the courage to hop",
        "Both types of complements pose problems in mining corpora for lexicon development.",
        "The that clauses can superficially resemble relative clauses, as in (3), and the to clauses can resemble purpose infinitives, as in (4).",
        "(3) a. complement-taking noun: John liked the idea that Mary sang last evening.",
        "b. relative clause: John liked the song that Mary sang last evening.",
        "(4) a. complement-taking noun: John had a chance to sing that song.",
        "b. purpose infinitive: John had a song book (in order) to sing that song.",
        "As discussed in section 3, this superficial resemblance makes the automatic identification of complement-taking nouns very difficult: simple string-based searches would return large numbers of incorrect candidates which would have to be vetted before incorporating the new nouns into the system.",
        "Complements and relative clause adjuncts allow very different inferences.",
        "Whereas the speaker's beliefs about adjuncts take on the truth value of the clause they are embedded in, the truth value of clausal complements is also affected by the licensing noun.",
        "Compare the sentences below.",
        "The italicized clause in (5) is a complement, while in (6) it is an adjunct.",
        "(5) The lie that Mary was ill paralyzed Bob.",
        "=>■ Mary was not ill.",
        "(6) The situation that she had gotten herself into paralyzed Bob.",
        "She had gotten herself into a situation.",
        "To explain how this is possible, we introduce the notion of implicative contexts (Nairn et al., 2006), and claim that complement-taking nouns introduce a context for the complement, whereas no such context is created for the adjuncts.",
        "Perhaps the easiest way to think of a context is to imagine embedding the complement in an extra layer, with the layer adding information about how to adjust the truth-value of its contents.",
        "This allows us to conclude in (5) that the speaker believes that Mary and Bob exist, as does the event of Bob's paralysis, but the event Mary was ill does not.",
        "These are ref-ered to as the (un)instantiability of the components in the sentence.",
        "Contexts can be embedded within each other recursively, as in (7).",
        "Note that these semantic contexts often, but not always, correspond to syntactic embedding.",
        "(7) Paul believes [that John's lie [that Mary worries [that fish can fly]] surprised us].",
        "Contexts may have an implication signature (Nairn et al., 2006) attached to them, specifying, for example, that the clause is something that the speaker presupposes to be true or that the speaker believes the truth value of the clause should be reversed.",
        "The default for a context is to allow no implications to be drawn, as in (1b), where the speaker has not committed to whether or not Mary is leaving.",
        "Below is a more detailed example showing how the context introduced by a noun changes the implications of the sentence, and how it would behave differently from a relative clause adjunct to a noun.",
        "Consider the pair of sentences in (8).",
        "(8) a.",
        "The lie that Mary had won surprised John.",
        "Mary did not win.",
        "b.",
        "The bonus that Mary had won surprised John.",
        "=^ Mary won a bonus.",
        "In (8), that John was surprised is in the speaker's top context, which is what the author commits to as truth.",
        "In (8a), lie is within the context of surprised.",
        "Surprised does not change the implications of elements within its context.",
        "Therefore, lie gets a true value: that a lie was told is considered true.",
        "That Mary won, however, is within the context of lie, which reverses the polarity of implications within its scope or context.",
        "If that Mary won were only within the context of surprised instead of within lie, which would be the case if lie did not create a context, then that Mary won would fall within the context of surprised.",
        "The implication signature of surprised would determine the veridicality of the embedded clause instead of the signature of lie: this would incorrectly allow the conclusion that Mary won.",
        "The content of the relative clause in (8b) is in the same context as surprise since no additional context is introduced by bonus.",
        "As such, we can conclude that Mary did win a bonus.",
        "The previous subsection focused on finite complements introduced by that.",
        "From the perspective of aiding inferencing in the Bridge system, the nouns that take to complements that are not deverbal nouns (see section 2.4 for discussion of dever-bals) seem to fall into three main classes: ability, bravery, and chance.",
        "Examples are shown in (9).",
        "(9) a. John has the ability to sing.",
        "b. John has the guts to sing out loud.",
        "c. John's chance to sing came quickly.",
        "These all have an implication signature that gives a (negative) implication only in a negative context, as in (10); in a positive context as in (9), no implication can be drawn.",
        "(10) John didn't have the opportunity to sing.",
        "John didn't sing.",
        "Note also that the implication only applies when the verb is have.",
        "Other light verbs, such as take in (11) change the implications.",
        "(11) John took the opportunity to sing.",
        "John sang.",
        "For this reason, these nouns are treated differently than those with that complements.",
        "They are marked in the grammar as taking a complement in the same way that that complements are (section 5), but the mechanism which attaches an implication signature takes the governing verb into account.",
        "A large number of complement-taking nouns are related to verbs that take complements.",
        "These nouns are analyzed differently than non-deverbal nouns.",
        "They are linked to their related verb and classified according to how the arguments of the noun and the sentence relate to the arguments for the verb (e.g. -ee, -er).",
        "The Bridge system uses this linking to map these nouns to their verbal counterparts and to draw conclusions of implicativity as if they were verbs, as explained in (Gurevich et al., 2006).",
        "Consider (12) where the paraphrases using fear as a verb or a noun are clearly related.",
        "(12) a.",
        "The fear that Mary was ill paralyzed Bob.",
        "b.",
        "Bob feared that Mary was ill; this fear paralyzed Bob.",
        "Deverbal nouns can take that complements or, as in (13), to complements.",
        "Most often, the context introduced by a deverbal noun does not add an implication signature, as in (11), which results in the answer unknown to the question Was Mary ill?.",
        "(13) a. John's promise to go swimming surprised us.",
        "b. John's persuasion of Mary to sing at the party surprised us.",
        "Gerunds, being even more verb-like, are treated as verbs in our system and hence inherit the implicative properties from the corresponding verb.",
        "(14) Knowing that Mary had sung upset John.",
        "Mary sang.",
        "Gerunds and deverbal nouns are discussed in detail in (Gurevich et al., 2006) and are outside of the scope of this paper."
      ]
    },
    {
      "heading": "3. Finding complement-taking nouns",
      "text": [
        "in order for the system to draw the inferences discussed above, the complement-taking nouns must first be identified and then classified and incorporated into the Bridge system (section 4).",
        "First, the gerunds are removed since these are mapped by the syntax into their verbal counterparts.",
        "Then the non-gerund deverbal nouns (section 2.4) are linked to their verbal counterpart so that they can be analyzed by the system as events.",
        "These two classes represent a significant number of the nouns that take that complements.",
        "However, there are many complement-taking nouns that are not deverbal.",
        "To expand our lexicon of these nouns, we started with a seed set garnered from the Penn Treebank (Marcus et al., 1994), which uses distinctive tree structures for complement-taking nouns, and a small list of linguistically prominent nouns.",
        "For each of these lexical items, we extracted words in the same semantic class from wordNet.",
        "Classes include words like fact, which direct attention to the clausal complement, as in (15), and nouns expressing emotion, as in (16).",
        "(15) it's a fact that Mary came.",
        "(16) Bob's joy that Mary had returned reduced him to tears.",
        "These semantic classes provided a starting point for discovering more of these nouns: the class of emotion nouns, for example, has more than a hundred hyponyms.",
        "Identifying the class is not enough, as not all members take clausal complements.",
        "Compare joy in (16) and warmheartedness in (17) from the emotion class.",
        "The sentence containing joy is much more natural than that in (17).",
        "(17) #Bob's warmheartedness that Mary had returned reduced him to tears.",
        "From the candidate list, the deverbal nouns are added to the lexicon of deverbal noun mappings.",
        "The remaining list is checked word-by-word.",
        "To ease the process, test sentences that take a range of meanings are created for each class of nouns, as in (18) .",
        "(18) Bob's___that Mary visited her mother reduced him to tears.",
        "If the noun does not fit the test sentences, a web search is done on \"X that\" to extract potential complement-bearing sentences.",
        "These are checked to eliminate sentences with adjuncts, or where some other feature licenses the clause, such as in (19) where the bold faced structure is licensing the italicized clause.",
        "(19) a. John is so warmhearted that he took her in without question.",
        "b.",
        "They had such a good friendship that she could tell him anything.",
        "Using these methods, from a seed set of 13 nouns, ~170 non-deverbal complement-taking nouns were identified, most in the emotion and feeling classes.",
        "The same techniques were then applied to the state and information classes.",
        "Once the Penn Treebank seeds were incorporated, the same process was applied to the complement-taking nouns from nomlex (Macleod et al., 1998).",
        "As examples (8a) and (8b) showed, whether a word takes a complement is lexically determined; so is the type of implication signature introduced by the word.",
        "Compare the implications in (20).",
        "(20) a.",
        "The fact that Mary had returned surprised",
        "John.",
        "=>- Mary had returned.",
        "b.",
        "The falsehood that Mary had returned surprised John.",
        "Mary had not returned.",
        "c. The possibility that Mary had returned surprised John.",
        "?=> Mary had returned.",
        "These nouns have different implication signatures: facts imply truth; lies imply falsehood; and possibilities do not allow truth or falsehood to be established.",
        "The default for complements is that no implications can be drawn, as in (20c), which in the Bridge system is expressed as the noun having no implication signature.",
        "Once identified and its implication signature determined, adding the complement-taking noun to the Bridge system and deriving the correct inferences is straightforward.",
        "This process is described in section 5."
      ]
    },
    {
      "heading": "4. The Bridge system",
      "text": [
        "The Bridge system (Bobrow et al., 2007) includes a syntactic grammar, a semantics rule set (Crouch and King, 2006), an abstract knowledge representation (AKR) rule set, and an entailment and contradiction detection (ECD) system.",
        "The syntax, semantics, and AKR all depend on lexicons.",
        "The Bridge grammar defines syntactic properties of words, such as predicate-argument structure, tense, number, and nominal specifiers.",
        "The grammar produces a packed representation of the sentence which allows ambiguity to be dealt with efficiently (Maxwell and Kaplan, 1991).",
        "The parses are passed to the semantic rules which also work on packed structures (Crouch, 2005).",
        "The semantic layer looks up words in a Unified Lexicon (UL), connects surface arguments of verbs to their roles, and determines the context within which a word occurs in the sentence.",
        "Negation introduces a context, as do the complement-taking nouns discussed here (Bobrow et al., 2005).",
        "The UL combines several sources ofinformation (Crouch and King, 2005).",
        "Much of the information comes from the syntactic lexicon, VerbNet (Kipper et al., 2000), and WordNet (Fellbaum, 1998), but there are also handcoded entries that add semantically relevant information such as its implication signature.",
        "A sample UL entry is given in Figure 1.",
        "The current number of complement-taking nouns in the system is shown in (21).",
        "Only a source(hand_annotated_data), source(xle), xfr :concept_for(% 1 ,fact), xfr:lex_class(%l,impl_pp_nn), xfr:wordnet_classes(%l,[])).",
        "Figure 1: One entry for the word fact in the Unified Lexicon.",
        "noun-extra states that this use of fact fits in structures such as it is a fact that...",
        "The WordNet meaning is found by looking up the concept for fact in the WordNet database.",
        "The implication signature of the word is impl_pp_nn or + + / - as seen in (22).",
        "Lastly, the sources for this information are noted.",
        "fifth of the nouns have implication signatures.",
        "However, all of the nouns introduce contexts; the default implication for contexts is to allow neither true nor false to be concluded, as in (20c).",
        "Complement-taking Nouns that complements 411 to complements 173 with implication signatures 107",
        "The output of the semantics level is fed into the AKR.",
        "At this level, contexts are used to determine (un)instantiability based on the relationship between contexts.",
        "An entity's (un)instantiability encodes whether it exists in some context.",
        "In (8a), for example, we can conclude that the speaker believes that Mary exists, but that the event Mary won is uninstantiated: the speaker believes it did not happen.",
        "The final layer is the ECD, which uses the structures built by the AKR to reason about a given passage-query pair to determine whether or not the query is inferred by the passage, answering with yes, no, unknown, or ambiguous.",
        "For more details, see (Bobrow et al., 2005)."
      ]
    },
    {
      "heading": "5. Adding complement-taking nouns to the system",
      "text": [
        "Adding complement-taking nouns to the Bridge system is straightforward.",
        "A syntactic entry is added indicating that the noun takes a complement.",
        "The syntactic classes are defined by templates, and the relevant template is called in the lexical entry for that word.",
        "For example, the template call @(noun-extra %stem) is added to the entry for fact.",
        "If there is an implication signature for the complement, this is added to the noun's entry in the file for hand-annotated data used to build the UL.",
        "The fifth line in Figure 1 is an example.",
        "The AKR and ECD rules that calculate the context and implications on verbs and deverbal nouns generalize to handle implications on complement-taking nouns and so do not need to be altered as new complement-taking nouns are found.",
        "As described in section 3, deciding which nouns take complements is currently hand curated, as it is quite difficult to distinguish them entirely automatically."
      ]
    },
    {
      "heading": "6. Testing",
      "text": [
        "To ensure that complement-taking nouns are working properly in the system, for each noun, a passage-query-correct answer triplet such as:",
        "(22) Passage: The fact that Mary had returned surprised John.",
        "Query: Had Mary returned?",
        "Answer: yes is added to a testsuite.",
        "The testsuites are run and the results reported as part of the daily regression testing (Chatzichrisafis et al., 2007).",
        "Both naturally occurring and hand-crafted examples are used to ensure that the correct implications are being drawn.",
        "Natural examples test interactions between phenomena such as noun complementation and copular constructions, while hand-crafted examples allow isolation of the phenomenon and show that all cases are being tested (Cohen et al., 2008), e.g., that the correct entailments emerge under negation as well as in the positive case.",
        "Our current testsuites contain about 180 handcrafted examples.",
        "The number of natural examples is harder to count as they occur somewhat rarely in the mixed-phenomena testsuites.",
        "One of our natural example files, which is based on newswire extracts from the PASCAL Recognizing Textual Entailment Challenge (Dagan et al., 2005), shows an approximate breakdown ofthe uses ofthe word that is as shown in (23).",
        "This sample, which is somewhat biased towards verbal complements since it contains many examples that can be paraphrased as said that, nonetheless shows the relative scarcity of noun complements in the wild and underscores the importance ofhand-crafted examples for testing purposes.",
        "It it is clear that these noun complements were being analyzed incorrectly before; what is unclear is how much of an impact the misanalysis would have caused.",
        "Perhaps some other domain would demonstrate a significantly higher presence of non-deverbal nouns that take complements and would be more significantly impacted by their misanalysis."
      ]
    },
    {
      "heading": "7. Future work",
      "text": [
        "The detection and incorporation of noun complements for use in the Bridge system can be expanded in several directions, such as automating the search process, identifying and classifying other parts of speech that take complements, and exploring transferability to other languages.",
        "Testing whether a clause is an adjunct or a noun complement or is licensed by something else is currently done by hand.",
        "Automating the testing would allow many more nouns to be tested.",
        "However, this is non-trivial.",
        "As (8a) and (8b) demonstrated, the surface structure can appear very similar; it is only when we try to figure out the implications of the examples that the differences emerge.",
        "The Penn Treebank (Marcus et al., 1994) was initially used to extract complement-taking nouns.",
        "As more tree and dependency banks, as well as lexical resources (Macleod et al., 1998), are available, further lexical items can be extracted in this way.",
        "However, such resources are costly to build and so are only slowly added to the available NLP resources.",
        "Rather than trying to identify all potential noun complement clauses, a simpler approach would be to reduce the search space for the human judge.",
        "For example, some adjuncts (perhaps three quarters of them) could be eliminated from natural examples by using a part-of-speech tagger to identify occurrences where a conjugated verb immediately follows the word that, as in (24).",
        "These commonly identify adjuncts.",
        "(24) The shark that bit the swimmer appears to have left.",
        "By eliminating these adjuncts and by removing those sentences where it is known that the clause is a complement of the verb based on the syntactic classification of that verb (the syntactic lexicon contains ^2500 verbs with various clausal complements), as in (25), the search space could be significantly reduced.",
        "(25) The judge announced that the defendant was guilty.",
        "contexts",
        "Verbs, adjectives, and adverbs can also license complements and hence contexts with implication signatures.",
        "Examples in (26) show different parts of speech that introduce contexts.",
        "(26) a. Verb: John said that Paul had arrived.",
        "b. Adjective: It is possible that someone ate the last piece of cake.",
        "c. Adjective: John was available to see Mary.",
        "d. Adverb: John falsely reported that Mary saw Bill.",
        "Many classes of verbs have already been identified and are incorporated into the system (Nairn et al., 2006): verbs relating to speech (e.g., say, report, etc.",
        "), implicative verbs such as manage and fail (Karttunen, 2007), and factive verbs (e.g. agree, realize, consider) (Vendler, 1967; Kiparsky and Kiparsky, 1971), to name a few.",
        "Many adjectives have also been added to the system, including ones taking to and that complements.",
        "As with the complement-taking nouns, a significant part of the effort in incorporating the complement-taking adjectives into the system was identifying which adjectives license complements.",
        "The adverbs have not been explored in as much depth.",
        "Uses of the word that in RTE 2007",
        "verbal complements",
        "68",
        "adjuncts",
        "50",
        "deverbal complements",
        "14",
        "noun complements",
        "3",
        "other",
        "19",
        "The fact that it has been productive to search for complement-taking nouns through synonyms and WordNet classes suggests that other languages could benefit from the work done in English.",
        "It would be interesting to see to what extent the implicative signatures from one language carry over into another, and to what extent they differ.",
        "Strong similarities could, for example, suggest some common mechanism at work in these nouns that we have been unable to identify by studying only one language.",
        "Searching in other languages could also potentially turn up classes or candidates that were missed in English."
      ]
    },
    {
      "heading": "8. Conclusions",
      "text": [
        "It is important to identify complement-taking nouns in order to properly analyze the grammatical and implicative structure of the sentence.",
        "Here we described a bootstrapping approach whereby annotated corpora and existing lexical resources were used to identify complement-taking nouns.",
        "WordNet was used to find semantically similar nouns.",
        "These were then tested in closed examples and in Web searches in order to determine whether they licensed complements and what the implicative signature of the complement was.",
        "Although identifying the complete set of these nouns is non-trivial, the context mechanism for dealing with implicatives makes adding them to the Bridge system to derive the correct implications straightforward."
      ]
    },
    {
      "heading": "9. Appendix: Complement-taking nouns",
      "text": [
        "This appendix contains sample complement-taking nouns and their classification in the Bridge system.",
        "Ability nouns (impl_nn with verb have): ability, choice, energy, flexibility, freedom, heart, means, way, wherewithal Asset nouns (impl_nn with verb have): money, option, time Bravery nouns (impl_nn with verb have): audacity, ball, cajones, cheek, chutzpah, cojones, courage, decency, foresight, gall, gumption, gut, impudence, nerve, strength, temerity Chance nouns (impLnn with verb have): chance, occasion, opportunity Effort nouns (impLnn with verb have): initiative, liberty, trouble Other nouns (no implicativity or not yet classified): accord, action, agreement, aim, ambition, appetite, application, appointment, approval, attempt, attitude, audition, authority, authorization, battle, bid, blessing, campaign, capacity, clearance, commission, commitment, concession, confidence, consent, consideration, conspiracy, contract, cost, decision, demand, desire, determination, directive, drive, duty, eagerness, effort, evidence, expectation, failure, fear, fight, figure, franchise, help, honor, hunger, hurry, idea, impertinence, inability, incentive, inclination, indication, information, intent, intention, invitation, itch, job, journey, justification, keenness, legislation, license, luck, mandate, moment, motion, motive, move, movement, need, note, notice, notification, notion, obligation, offer, order, pact, pattern, permission, plan, pledge, ploy, police, position, potential, power, pressure, principle, process, program, promise, propensity, proposal, proposition, provision, push, readiness, reason, recommendation, refusal, reluctance, reminder, removal, request, requirement, responsibility, right, rush, scheme, scramble, sense, sentiment, shame, sign, signal, stake, stampede, strategy, study, support, task, temptation, tendency, threat, understanding, undertaking, unwillingness, urge, venture, vote, willingness, wish, word, work",
        "Nouns with impl_pp_nn: abomination, angriness, angst, animosity, anxiousness, apprehensiveness, ardor, awe, bereavement, bitterness, case, choler, consequence, consternation, covetousness, disconcertion, disconcertment, disquiet, disquietude, ecstasy, edginess, enmity, enviousness, event, fact, fearfulness, felicity, fright, frustration, fury, gall, gloom, gloominess, grudge, happiness, hesitancy, hostility, huffiness, huffishness, inquietude, insecurity, ire, jealousy, jitteriness, joy, joyousness, jubilance, jumpiness, lovingness, poignance, poignancy, premonition, presentiment, problem, qualm, rancor, rapture, sadness, shyness, situation, somberness, sorrow, sorrowfulness, suspense, terror, trepidation, truth, uneasiness, unhappiness, wrath Nouns with fact_p: absurdity, accident, hypocrisy, idiocy, irony, miracle Nouns with impl_pn_np: falsehood, lie Other nouns (no implicativity or not yet classified): avowal, axiom, conjecture, conviction, critique, effort, fear, feeling, hunch, hysteria, idea, impudence, inability, incentive, likelihood, news, notion, opinion, optimism, option, outrage, pact, ploy, point, police, possibility, potential, power, precedent, premise, principle, problem, prospect, proviso, reluctance, responsibility, right, rumor, scramble, sentiment, showing, sign, skepticism, stake, stand, story, strategy, tendency, unwillingness, viewpoint, vision, willingness, word"
      ]
    }
  ]
}
