{
  "info": {
    "authors": [
      "Hiroya Takamura",
      "Takashi Inui",
      "Manabu Okumura"
    ],
    "book": "Human Language Technologies 2007: the Conference of the North American Chapter of the Association for Computational Linguistics; Proceedings of the Main Conference",
    "id": "acl-N07-1037",
    "title": "Extracting Semantic Orientations of Phrases from Dictionary",
    "url": "https://aclweb.org/anthology/N07-1037",
    "year": 2007
  },
  "references": [
    "acl-E06-1026",
    "acl-H05-1044",
    "acl-H05-1052",
    "acl-J93-1007",
    "acl-P02-1053",
    "acl-P04-3020",
    "acl-P05-1017",
    "acl-P06-1134",
    "acl-P97-1023",
    "acl-W06-1642"
  ],
  "sections": [
    {
      "text": [
        "Hiroya Takamura Takashi Inui",
        "Precision and Intelligence Laboratory Integrated Research Institute",
        "Tokyo Institute of Technology Tokyo Institute of Technology",
        "We propose a method for extracting semantic orientations of phrases (pairs of an adjective and a noun): positive, negative, or neutral.",
        "Given an adjective, the semantic orientation classification of phrases can be reduced to the classification of words.",
        "We construct a lexical network by connecting similar/related words.",
        "In the network, each node has one of the three orientation values and the neighboring nodes tend to have the same value.",
        "We adopt the Potts model for the probability model of the lexical network.",
        "For each adjective, we estimate the states of the nodes, which indicate the semantic orientations of the adjective-noun pairs.",
        "Unlike existing methods for phrase classification, the proposed method can classify phrases consisting of unseen words.",
        "We also propose to use unlabeled data for a seed set of probability computation.",
        "Empirical evaluation shows the effectiveness of the proposed method."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Technology for affect analysis of texts has recently gained attention in both academic and industrial areas.",
        "It can be applied to, for example, a survey of new products or a questionnaire analysis.",
        "Automatic sentiment analysis enables a fast and comprehensive investigation.",
        "The most fundamental step for sentiment analysis is to acquire the semantic orientations of words: positive or negative (desirable or undesirable).",
        "For example, the word \"beautiful\" is positive, while the word \"dirty\" is negative.",
        "Many researchers have developed several methods for this purpose and obtained good results.",
        "One of the next problems to be solved is to acquire semantic orientations of phrases, or multi-term expressions, such as \"high+risk\" and \"light+laptop-computer\".",
        "Indeed the semantic orientations of phrases depend on context just as the semantic orientations of words do, but we would like to obtain the orientations of phrases as basic units for sentiment analysis.",
        "We believe that we can use the obtained basic orientations of phrases for affect analysis of higher linguistic units such as sentences and documents.",
        "A computational model for the semantic orientations of phrases has been proposed by Takamura et al.",
        "(2006).",
        "However, their method cannot deal with the words that did not appear in the training data.",
        "The purpose of this paper is to propose a method for extracting semantic orientations of phrases, which is applicable also to expressions consisting of unseen words.",
        "In our method, we regard this task as the noun classification problem for each adjective; the nouns that become respectively positive (negative, or neutral) when combined with a given adjective are distinguished from the other nouns.",
        "We create a lexical network with words being nodes, by connecting two words if one of the two appears in the gloss of the other.",
        "In the network, each node has one of the three orientation values and the neighboring nodes expectedly tend to have the same value.",
        "For example, the gloss of \"cost\" is \"a sacrifice, loss, or penalty\" and these words (cost, sacrifice, loss, and penalty) have the same orientation.",
        "To capture this tendency of the network, we adopt the Potts model for the probability distribution of the lexical network.",
        "For each adjective, we estimate the states of the nodes, which indicate the semantic orientations of the adjective-noun pairs.",
        "Information from seed words is diffused to unseen nouns on the network.",
        "We also propose a method for enlarging the seed set by using the output of an existing method for the seed words of the probability computation.",
        "Empirical evaluation shows that our method works well both for seen and unseen nouns, and that the enlarged seed set significantly improves the classification performance of the proposed model."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "The semantic orientation classification of words has been pursued by several researchers.",
        "Some of them used corpora (Hatzivassiloglou and McKeown, 1997; Turney and Liftman, 2003), while others used dictionaries (Kobayashi et al., 2001; Kamps et al., 2004; Takamura et al., 2005; Esuli and Sebastiani, 2005).",
        "Turney (2002) applied an internet-based technique to the semantic orientation classification of phrases, which had originally been developed for word sentiment classification.",
        "In their method, the number of hits returned by a search-engine, with a query consisting of a phrase and a seed word (e.g., \"phrase NEAR good\") is used to determine the orientation.",
        "Baron and Hirst (2004) extracted collocations with Xtract (Smadja, 1993) and classified the collocations using the orientations of the words in the neighboring sentences.",
        "Their method is similar to Turney's in the sense that cooccurrence with seed words is used.",
        "In addition to individual seed words, Kanayama and Nasukawa (2006) used more complicated syntactic patterns that were manually created.",
        "The four methods above are based on context information.",
        "In contrast, our method exploits the internal structure of the semantic orientations of phrases.",
        "Wilson et al.",
        "(2005) worked on phrase-level semantic orientations.",
        "They introduced a polarity shifter.",
        "They manually created the list of polarity shifters.",
        "Inui (2004) also proposed a similar idea.",
        "Takamura et al.",
        "(2006) proposed to use based on latent variable models for sentiment classification of noun-adjective pairs.",
        "Their model consists of variables respectively representing nouns, adjectives, semantic orientations, and latent clusters, as well as the edges between the nodes.",
        "The words that are similar in terms of semantic orientations, such as \"risk\" and \"mortality\" (i.e., the positive orientation emerges when they are \"low\"), make a cluster in their model, which can be an automated version of Inui's or Wilson et al.",
        "'s idea above.",
        "However, their method cannot do anything for the words that did not appear in the labeled training data.",
        "In this paper, we call their method the latent variable method (LVM)."
      ]
    },
    {
      "heading": "3. Potts Model",
      "text": [
        "If a variable can have more than two values and there is no ordering relation between the values, the network comprised of such variables is called Potts model (Wu, 1982).",
        "In this section, we explain the simplified mathematical model of Potts model, which is used for our task in Section 4.",
        "The Potts system has been used as a mathematical model in several applications such as image restoration (Tanaka and Morita, 1996) and rumor transmission (Liu et al., 2001).",
        "Suppose a network consisting ofnodes and weighted edges is given.",
        "States of nodes are represented by c. The weight between i and j is represented by wij.",
        "Let H (c) denote an energy function, which indicates a state of the whole network:",
        "where (3 is a constant called the inverse-temperature, L is the set of the indices for the observed variables, ai is the state of each observed variable indexed by i, and a is a positive constant representing a weight on labeled data.",
        "Function 5 returns 1 if two arguments are equal to each other, 0 otherwise.",
        "The state is penalized if ci (i £ L) is different from ai.",
        "Using H(c), the probability distribution of the network is represented as P(c) = exp{ – H(c)}/Z, where Z is a normalization factor.",
        "However, it is computationally difficult to exactly estimate the state of this network.",
        "We resort to a mean-field approximation method that is described by Nishimori (2001).",
        "In the method, P(c) is replaced by factorized function p(c) = rji pi(ci).",
        "Then we can obtain the function with the smallest value of the variational free energy:",
        "By minimizing F(c) under the condition that Vi, J2Ci pi(ci) = 1, we obtain the following fixed point equation for i L:",
        "The fixed point equation for i £ L can be obtained by removing a5(c, ai) from above.",
        "This fixed point equation is solved by an iterative computation.",
        "In the actual implementation, we represent pi with a linear combination of the discrete Tchebycheff polynomials (Tanaka and Morita, 1996).",
        "Details on the Potts model and its computation can be found in the literature (Nishimori, 2001).",
        "After the computation, we obtain the function Lli pi(ci).",
        "When the number of classes is 2, the Potts model in this formulation is equivalent to the mean-field Ising model (Nishimori, 2001).",
        "This Potts model with the mean-field approximation has relation to several other models.",
        "As is often discussed (Mackay, 2003), the minimization of the variational free energy (Equation (2)) is equivalent to the obtaining the factorized model that is most similar to the maximum likelihood model in terms of the Kullback-Leibler divergence.",
        "The second term of Equation (2) is the entropy of the factorized function.",
        "Hence the optimization problem to be solved here is a kind of the maximum entropy model with a penalty term, which corresponds to the first term of Equation (2).",
        "We can find a similarity also to the PageRank algorithm (Brin and Page, 1998), which has been applied also to natural language processing tasks (Mihalcea, 2004; Mihalcea, 2005).",
        "In the PageRank algorithm, the pagerank score ri is updated as",
        "where d is a constant (0 < d < 1).",
        "This update equation consists of the first term corresponding to random jump from an arbitrary node and the second term corresponding to the random walk from the neighboring node.",
        "Let us derive the first order Taylor expansion of Equation (3).",
        "We use the equation for i / L and denote the denominator by Zp, for simplicity.",
        "Since exp x ~ 1 + x, we obtain",
        "Equation (5) clearly has a quite similar form as Equation (4).",
        "Thus, the PageRank algorithm can be regarded as an approximation of our model.",
        "Let us clarify the difference between the two algorithms.",
        "The PageRank is designed for two-class classification, while the Potts model can be used for an arbitrary number of classes.",
        "In this sense, the PageRank is an approximated Ising model.",
        "The PageRank is applicable to asymmetric graphs, while the theory used in this paper is based on symmetric graphs."
      ]
    },
    {
      "heading": "4. Potts Model for Phrasal Semantic Orientations",
      "text": [
        "In this section, we explain our classification method, which is applicable also to the pairs consisting of an adjective and an unseen noun.",
        "We construct a lexical network, which Takamura et al.",
        "(2005) call the gloss network, by linking two words if one word appears in the gloss of the other word.",
        "Each link belongs to one of two groups:",
        "the same-orientation links SL and the different-orientation links _DL.",
        "If a negation word (e.g., nai, for Japanese) follows a word in the gloss of the other word, the link is a different-orientation link.",
        "Otherwise the links is a same-orientation link.",
        "We next set weights W = (wij) to links :",
        "I 0 otherwise where lij denotes the link between word i and word j, and d(i) denotes the degree of word i, which means the number of words linked with word i.",
        "Two words without connections are regarded as being connected by a link of weight 0.",
        "Takamura et al.",
        "(2005) used the Ising model to extract semantic orientations of words (not phrases).",
        "We extend their idea and use the Potts model to extract semantic orientations of phrasal expressions.",
        "Given an adjective, the decision remaining to be made in classification of phrasal expressions concerns nouns.",
        "We therefore estimate the state of the nodes on the lexical network for each adjective.",
        "The nouns paring with the given adjective in the training data are regarded as seed words, which we call seen words, while the words that did not appear in the training data are referred to as unseen words.",
        "We use the mean-field method to estimate the state of the system.",
        "If the probability pi(c) of a variable being positive (negative, neutral) is the highest of the three classes, then the word corresponding to the variable is classified as a positive (negative, neutral) word.",
        "We explain the reason why we use the Potts model instead of the Ising model.",
        "While only two classes (i.e., positive and negative) can be modeled by the Ising model, three classes (i.e., positive, negative and neutral) can be modelled by the Potts model.",
        "For the semantic orientations of words, all the words are sorted in the order of the average orientation value, equivalently the probability of the word being positive.",
        "Therefore, even if the neutral class is not explicitly incorporated, we can manually determine two thresholds that define respectively the positive/neutral and negative/neutral boundaries.",
        "For the semantic orientations of phrasal expressions, however, it is impractical to manually determine the thresholds for each of the numerous adjectives.",
        "Therefore, we have to incorporate the neutral class using the Potts model.",
        "For some adjectives, the semantic orientation is constant regardless of the nouns.",
        "We need not use the Potts model for those unambiguous adjectives.",
        "We thus propose the following two-step classification procedure for a given noun-adjective pair < n, a >.",
        "1. if the semantic orientation of all the instances with a in L is c, then classify < n, a > into c.",
        "2. otherwise, use the Potts model.",
        "We can also construct a probability model for each noun to deal with unseen adjectives.",
        "However, we focus on the unseen nouns in this paper, because our dataset has many more nouns than adjectives.",
        "The performance of the proposed method largely depends on the value of hyper-parameter [.",
        "In order to make the method more practical, we propose a criterion for determining its value.",
        "Takamura et al.",
        "(2005) proposed two kinds of criteria.",
        "One of the two criteria is an approximated leave-one-out error rate and can be used only when a large labeled dataset is available.",
        "The other is a notion from statistical physics, that is, magnetization:",
        "At a high temperature, variables are randomly oriented (paramagnetic phase, 0).",
        "At a low temperature, most of the variables have the same direction (ferromagnetic phase, m = 0).",
        "It is known that at some intermediate temperature, ferromagnetic phase suddenly changes to paramagnetic phase.",
        "This phenomenon is called phase transition.",
        "Slightly before the phase transition, variables are locally polarized; strongly connected nodes have the same polarity, but not in a global way.",
        "Intuitively, the state of the lexical network is locally polarized.",
        "Therefore, they calculate values of m with several different values of [ and select the value just before the phase transition.",
        "Since we cannot expect a large labeled dataset to be available for each adjective, we use not the approximated leave-one-out error rate, but the magnetization-like criterion.",
        "However, the magnetization above is defined for the Ising model.",
        "We therefore consider that the phase transition has occurred, if a certain class c begins to be favored all over the system.",
        "In practice, when the maximum of the spatial averages of the approximated probabilities maxcX^ pi(c)/N exceeds a threshold during increasing [ , we consider that the phase transition has occurred.",
        "We select the value of [ slightly before the phase transition.",
        "We usually have only a few seed words for a given adjective.",
        "Enlarging the set of seed words will increase the classification performance.",
        "Therefore, we automatically classify unlabeled pairs by means of an existing method and use the classified instances as seeds.",
        "As an existing classifier, we use LVM.",
        "Their model can classify instances that consist of a seen noun and a seen adjective, but are unseen as a pair.",
        "Although we could classify and use all the nouns that appeared in the training data (with an adjective which is different from the given one), we do not adopt such an alternative, because it will incorporate even non-collocating pairs such as \"green+idea\" into seeds, resulting in possible degradation of classification performance.",
        "Therefore, we sample unseen pairs consisting of a seen noun and a seen adjective from a corpus, classify the pairs with the latent variable model, and add them to the seed set.",
        "The enlarged seed set consists of pairs used in newspaper articles and does not include non-collocating pairs."
      ]
    },
    {
      "heading": "5. Experiments 5.1 Dataset",
      "text": [
        "We extracted pairs of a noun (subject) and an adjective (predicate), from Mainichi newspaper articles (1995) written in Japanese, and annotated the pairs with semantic orientation tags : positive, neutral or negative.",
        "We thus obtained the labeled dataset consisting of 12066 pair instances (7416 different pairs).",
        "The dataset contains 4459 negative instances, 4252 neutral instances, and 3355 positive instances.",
        "The number of distinct nouns is 4770 and the number of distinct adjectives is 384.",
        "To check the inter-annotator agreement between two annotators, we calculated k statistics, which was 0.640.",
        "This value is allowable, but not quite high.",
        "However, positive-negative disagreement is observed for only 0.7% of the data.",
        "In other words, this statistics means that the task of extracting neutral examples, which has hardly been explored, is intrinsically difficult.",
        "We should note that the judgment in annotation depends on which perspective the annotator takes; \"high+salary\" is positive from employee's perspective, but negative from employer's perspective.",
        "The annotators are supposed to take a perspective subjectively.",
        "Our attempt is to imitate annotator's decision.",
        "To construct a classifier that matches the decision of the average person, we also have to address how to create an average corpus.",
        "We do not pursue this issue because it is out of the scope of the paper.",
        "As unlabeled data, we extracted approximately 65,000 pairs for each iteration of the 10-fold cross-validation, from the same news source.",
        "The average number of seed nouns for each ambiguous adjective was respectively 104 in the labeled seed set and 264 in the labeled+unlabeled seed set.",
        "Please note that these figures are counted for only ambiguous adjectives.",
        "Usually ambiguous adjectives are more frequent than unambiguous adjectives.",
        "We employ 10-fold cross-validation to obtain the averaged classification accuracy.",
        "We split the data such that there is no overlapping pair (i.e., any pair in the training data does not appear in the test data).",
        "Hyperparameter a was set to 1000, which is very large since we regard the labels in the seed set is reliable.",
        "For the seed words added by the classifier, lower a can be better.",
        "Determining a good value for a is regarded as future work.",
        "Hyperparameter [ is automatically selected from {0.1, 0.2, • • •, 2.5} for each adjective and each fold of the cross-validation using the prediction method described in Section 4.3.",
        "The results of the classification experiments are summarized in Table 1.",
        "The proposed method succeeded in classifying, with approximately 65% in accuracy, those phrases consisting of an ambiguous adjective and an unseen noun, which could not be classified with existing computational models such as LVM.",
        "Incorporation of unlabeled data improves accuracy by 15.5 points for pairs consisting of a seen noun and an ambiguous adjective, and by 3.5 points for pairs consisting of an unseen noun and an ambiguous adjective, approximately.",
        "The reason why the former obtained high increase is that pairs with an ambiguous adjective are usually frequent and likely to be found in the added unlabeled dataset.",
        "If we regard this classification task as binary classification problems where we are to classify instances into one class or not, we obtain three accuracies: 90.76% for positive, 81.75% for neutral, and 86.85% for negative.",
        "This results suggests the identification of neutral instances is relatively difficult.",
        "Next we compare the proposed method with LVM.",
        "The latent variable method is applicable only to instance pairs consisting of an adjective and a seen noun.",
        "Therefore, we computed the accuracy for 6586 instances using the latent variable method and obtained 80.76 %.",
        "The corresponding accuracy by our method was 80.93%.",
        "This comparison shows that our method is better than or at least comparable to the latent variable method.",
        "However, we have to note that this accuracy of the proposed method was computed using the unlabeled data classified by the latent variable method.",
        "There are still 3320 (=12066-8746) word pairs which could not be classified, because there are no entries for those words in the dictionary.",
        "However, the main cause of this problem is word segmentation, since many compound nouns and exceedingly-subdivided morphemes are not in dictionaries.",
        "An appropriate mapping from the words found in corpus to entries of a dictionary will solve this problem.",
        "We found a number of proper nouns, many of which are not in the dictionary.",
        "By estimating a class of a proper noun and finding the words that matches the class in the dictionary, we can predict the semantic orientations of the proper noun based on the orientations of the found words.",
        "In order to see the overall tendency of errors, we calculated the confusion matrices both for pairs of an ambiguous adjective and a seen noun, and for pairs of an ambiguous adjective and an unseen noun (Table 2).",
        "The proposed method works quite well for positive/negative classification, though it finds still some difficulty in correctly classifying neutral instances even after enhanced with the unlabeled data.",
        "In order to qualitatively evaluate the method, we list several word pairs below.",
        "These word pairs are classified by the Potts model with the la-beled+unlabeled seed set.",
        "All nouns are unseen; they did not appear in the original training dataset.",
        "Please note again that the actual data is Japanese.",
        "positive instances_",
        "noun adjective cost low basic price low loss little intelligence high educational background high contagion not-happening version new cafe many salary high commission low",
        "negative instances",
        "For example, although both \"salary\" and \"commission\" are kinds of money, our method captures",
        "noun",
        "adjective",
        "damage",
        "heavy",
        "chance",
        "little",
        "terrorist",
        "many",
        "trouble",
        "many",
        "variation",
        "little",
        "capacity",
        "small",
        "salary",
        "low",
        "disaster",
        "many",
        "disappointment",
        "big",
        "knowledge",
        "little",
        "Table 1: Classification accuracies (%) for various seed sets and test datasets.",
        "'Labeled' seed set corresponds to the set of manually labeled pairs.",
        "'Labeled+unlabeled' seed set corresponds to the union of 'labeled' seed set and the set of pairs labeled by LVM.",
        "'Seen nouns' for test are the nouns that appeared in the training data, while 'unseen nouns' are the nouns that did not appear in the training dataset'.",
        "Please note that seen pairs are excluded from the test data.",
        "'Unambiguous' adjectives corresponds to the pairs with an adjective which has a unique orientation in the original training dataset, while 'ambiguous' adjectives corresponds to the pairs with an adjective which has more than one orientation in the original training dataset.",
        "the difference between them; \"high salary\" is positive, while \"low (cheap) commission\" is also positive."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "We proposed a method for extracting semantic orientations of phrases (pairs of an adjective and a noun).",
        "For each adjective, we constructed a Potts system, which is actually a lexical network extracted from glosses in a dictionary.",
        "We empirically showed that the proposed method works well in terms of classification accuracy.",
        "Future work includes the following:",
        "• We assumed that each word has a semantic orientation.",
        "However, word senses and subjectiv-",
        "ity have strong interaction (Wiebe and Mihalcea, 2006).",
        "• The value of a must be properly set, because lower a can be better for the seed words added by the classifier,",
        "• To address word-segmentation problem discussed in Section 5.3, we can utilize the fact that the heads of compound nouns often inherit the property determining the semantic orientation when combined with an adjective.",
        "• The semantic orientations ofpairs consisting of a proper noun will be estimated from the named entity classes of the proper nouns such as person name and organization.",
        "seed\\test",
        "seen nouns",
        "unseen nouns",
        "total",
        "labeled",
        "68.24",
        "73.70",
        "69.59",
        "(4494/6586)",
        "(1592/2160)",
        "(6086/8746)",
        "unambiguous",
        "ambiguous",
        "unambiguous",
        "ambiguous",
        "98.l5",
        "6l.65",
        "94.85",
        "6l.85",
        "(ll66/ll88)",
        "(3328/5398)",
        "(736/776)",
        "(856/l384)",
        "labeled+unlabeled",
        "80.93",
        "75.88",
        "79.68",
        "(5330/6586)",
        "(l639/2l60)",
        "(6969/8746)",
        "unambiguous",
        "ambiguous",
        "unambiguous",
        "ambiguous",
        "98.l5",
        "77.l4",
        "94.85",
        "65.25",
        "(ll66/ll88)",
        "(4l64/5398)",
        "(736/776)",
        "(903/l384)",
        "Potts model",
        "seen nouns",
        "unseen nouns",
        "positive",
        "neutral",
        "negative",
        "sum",
        "positive",
        "neutral",
        "negative",
        "sum",
        "positive",
        "964",
        "254",
        "60",
        "l278",
        "l26",
        "84",
        "30",
        "240",
        "Gold standard",
        "neutral",
        "l98",
        "l656",
        "286",
        "2l40",
        "60",
        "427",
        "l04",
        "59l",
        "negative",
        "39",
        "397",
        "l544",
        "l980",
        "46",
        "l57",
        "350",
        "553",
        "sum",
        "l20l",
        "2307",
        "l890",
        "5398",
        "232",
        "668",
        "484",
        "l384"
      ]
    }
  ]
}
