{
  "info": {
    "authors": [
      "David Andrzejewski",
      "Xiaojin Zhu"
    ],
    "book": "Proceedings of the NAACL HLT 2009 Workshop on Semi-supervised Learning for Natural Language Processing",
    "id": "acl-W09-2206",
    "title": "Latent Dirichlet Allocation with Topic-in-Set Knowledge",
    "url": "https://aclweb.org/anthology/W09-2206",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Latent Dirichlet Allocation with Topic-in-Set Knowledge*",
        "Computer Sciences Department University of Wisconsin-Madison",
        "Madison, WI 53706, USA",
        "Latent Dirichlet Allocation is an unsupervised graphical model which can discover latent topics in unlabeled data.",
        "We propose a mechanism for adding partial supervision, called topic-in-set knowledge, to latent topic modeling.",
        "This type of supervision can be used to encourage the recovery of topics which are more relevant to user modeling goals than the topics which would be recovered otherwise.",
        "Preliminary experiments on text datasets are presented to demonstrate the potential effectiveness of this method."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Latent topic models such as Latent Dirichlet Allocation (LDA) (Blei et al., 2003) have emerged as a useful family of graphical models with many interesting applications in natural language processing.",
        "One of the key virtues of LDA is its status as a fully generative probabilistic model, allowing principled extensions and variations capable of expressing rich problem domain structure (Newman et al., 2007; Rosen-Zvi et al., 2004; Boyd-Graber et al., 2007; Griffiths et al., 2005).",
        "LDA is an unsupervised learning model.",
        "This work aims to add supervised information in the form of latent topic assignments to LDA.",
        "Traditionally, topic assignments have been denoted by the variable z in LDA, and we will call such supervised information \"z-labels.\"",
        "In particular, a z-label is the knowl-",
        "* We would like to acknowledge the assistance of Brandi Gancarz with the biological annotations.",
        "This work is supported in part by the Wisconsin Alumni Research Foundation.",
        "edge that the topic assignment for a given word position is within a subset of topics.",
        "As such, this work is a combination of unsupervised model and supervised knowledge, and falls into the category similar to constrained clustering (Basu et al., 2008) and semi-supervised dimensionality reduction (Yang et al., 2006).",
        "A similar but simpler type of topic labeling information has been applied to computer vision tasks.",
        "Topic modeling approaches have been applied to scene modeling (Sudderth et al., 2005), segmentation, and classification or detection (Wang and Grimson, 2008).",
        "In some of these vision applications, the latent topics themselves are assumed to correspond to object labels.",
        "If labeled data is available, either all (Wang and Mori, 2009) or some (Cao and Fei-Fei, 2007) of the z values can be treated as observed, rather than latent, variables.",
        "Our model extends z-labels from single values to subsets, thus offer additional model expressiveness.",
        "If the topic-based representations of documents are to be used for document clustering or classification, providing z-labels for words can be seen as similar to semi-supervised learning with labeled features (Druck et al., 2008).",
        "Here the words are features, and z-label guidance acts as a feature label.",
        "This differs from other supervised LDA variants (Blei and McAuliffe, 2008; Lacoste-Julien et al., 2008) which use document label information.",
        "The ALDA model for statistical software debugging (Andrzejewski et al., 2007) partitions the topics into 2 sets: \"usage\" topics which can appear in all documents, and \"bug\" topics which can only appear in a special subset of documents.",
        "This effect was achieved by using different a hyperparameters for the 2 subsets of documents.",
        "z-labels can achieve the same effect by restricting the z's in documents outside the special subset, so that the z's cannot assume the \"bug\" topic values.",
        "Therefore, the present approach can be viewed as a generalization of ALDA.",
        "Another perspective is that our z-labels may guide the topic model towards the discovery of secondary or non-dominant statistical patterns in the data (Chechik and Tishby, 2002).",
        "These topics may be more interesting or relevant to the goals of the user, but standard LDA would ignore them in favor of more prominent (and perhaps orthogonal) structure."
      ]
    },
    {
      "heading": "2. Our Model",
      "text": [
        "We briefly review LDA, following the notation of (Griffiths and Steyvers, 2004) x.",
        "Let there be T topics.",
        "Let w = w\\... wn represent a corpus of D documents, with a total of n words.",
        "We use di to denote the document of word Wj, and zithe hidden topic from which wi is generated.",
        "Let (/>jw) = p(w|z = j), and ojd) = p(z = j) for document d. LDA involves the following generative model:",
        "where a and are hyperparameters for the document-topic and topic-word Dirichlet distributions, respectively.",
        "Even though they can be vector valued, for simplicity we assume a and are scalars, resulting in symmetric Dirichlet priors.",
        "Given our observed words w, the key task is inference of the hidden topics z.",
        "Unfortunately, this posterior is intractable and we resort to a Markov Chain Monte Carlo (MCMC) sampling scheme, specifically Collapsed Gibbs Sampling (Griffiths and Steyvers, 2004).",
        "The full conditional equation used for sampling individual z values from the posterior is given by where n(d) v is the number of times topic v is used in document d, and is the number of times word wi is generated by topic v. The – i notation signifies that the counts are taken omitting the value of zi.",
        "We now define our z-labels.",
        "Let C(i) be the set of possible z-labels for latent topic zj.",
        "We set a hard constraint by modifying the Gibbs sampling equation with an indicator function £(v G Cwhich takes on value 1 if v G C(j) and is 0 otherwise:",
        "If we wish to restrict zi to a single value (e.g., zi = 5), this can now be accomplished by setting C(i) = {5}.",
        "Likewise, we can restrict zi to a subset of values {1, 2, 3} by setting C(i) = {1, 2, 3}.",
        "Finally, for unconstrained zi we simply set C(i) = {1, 2,...,T}, in which case our modified sampling (6) reduces to the standard Gibbs sampling (5).",
        "This formulation gives us a flexible method for inserting prior domain knowledge into the inference of latent topics.",
        "We can set C(i) independently for every single word wi in the corpus.",
        "This allows us, for example, to force two occurrences of the same word (e.g., \"Apple pie\" and \"Apple iPod\") to be explained by different topics.",
        "This effect would be impossible to achieve by using topic-specific asymmetric // vectors and setting some entries to zero.",
        "This hard constraint model can be relaxed.",
        "Let 0 < n < 1 be the strength of our constraint, where n = 1 recovers the hard constraint (6) and n = 0 recovers unconstrained sampling (5):",
        "While we present the z-label constraints as a mechanical modification to the Gibbs sampling equations, it can be derived from an undirected extension of LDA (omitted here) which encodes z-labels.",
        "The soft constraint Gibbs sampling equation arises naturally from this formulation, which is the basis for the First-Order Logic constraints described later in the future work section."
      ]
    },
    {
      "heading": "3. Experiments",
      "text": [
        "We now present preliminary experimental results to demonstrate some interesting applications for topic-in-set knowledge.",
        "Unless otherwise specified, symmetric hyperparameters a = .5 and = .1 were used and all MCMC chains were run for 2000 samples before estimating 0 and 0 from the final sample, as in (Griffiths and Steyvers, 2004).",
        "We explore the use of topic-in-set for identifying words related to a target concept, given a set of seed words associated with that concept.",
        "For example, a biological expert may be interested in the concept \"translation\".",
        "The expert would then provide a set of seed words which are strongly related to this concept, here we assume the seed word set {translation,trna,anticodon,ribosome}.",
        "We add the hard constraint that zi = 0 for all occurrences of these four words in our corpus of approximately 9,000 yeast-related abstracts.",
        "We ran LDA with the number of topics T = 100, both with and without the z-label knowledge on the seed words.",
        "Table 1 shows the most probable words in selected topics from both runs.",
        "Table 1a shows Topic 0 from the constrained run, while Table 1b shows the topics which contained seed words among the top 50 most probable words from the unconstrained run.",
        "In order to better understand the results, these top words were annotated for relevance to the target concept (translation) by an outside biological expert.",
        "The words in Table 1 were then colored blue if they were one of the original seed words, red if they were judged as relevant, and left black otherwise.",
        "From a quick glance, we can see that Topic 0 from the constrained run contains more relevant terms than Topic 43 from the standard LDA run.",
        "Topic 31 has a similar number of relevant terms, but taken together we can see that the emphasis of Topic 31 is slightly off-target, more focused on \"mRNA turnover\" than \"translation\".",
        "Likewise, Topic 73 seems more focused on the ribosome itself than the process oftranslation.",
        "Overall, these results demonstrate the potential effectiveness of z-label information for guiding topic models towards a user-seeded concept.",
        "Suppose that a user has chosen a set of terms and wishes to discover different topics related to these terms.",
        "By constraining these terms to only appear in a restricted set of topics, these terms will be concentrated in the set of topics.",
        "The split within those set of topics may be different from what a standard LDA will produce, thus revealing new information within the data.",
        "To make this concrete, say we are interested in the location \"United Kingdom\".",
        "We seed this concept with the following LOCATION-tagged terms { britain, british, england, uk, u.k., wales, scotland, london} .",
        "These terms are then restricted to appear only in the first 3 topics.",
        "Our corpus is an entity-tagged Reuters newswire corpus used for the CoNLL-2003 shared task (Tjong Kim Sang and De Meulder, 2003).",
        "In order to focus on our target location, we also restrict all other LOCATION-tagged tokens to not appear in the first 3 topics.",
        "For this experiment we set T = 12, arrived at by trial-and-error in the baseline (standard LDA) case.",
        "The 50 most probable words for each topic are shown in Figure 2, and tagged entities are prefixed with their tags for easy identification.",
        "Table 2a shows the top words for the first 3 topics of our z-label run.",
        "These three topics are all related to the target LOCATION United Kingdom, but they also split nicely into business, cricket, and soccer.",
        "Words which are highly relevant to each of these 3 concepts are colored blue, red, and green, respectively.",
        "In contrast, in Table 2b we show topics from standard LDA which contain any of the \"United Kingdom\" LOCATION terms (which are underlined) among the 50 most probable words for that topic.",
        "We make several observations about these topics.",
        "First, standard LDA Topic 0 is mostly concerned with political unrest in Russia, which is not particu-",
        "Figure 1: Concept seed words are colored blue, other words judged relevant to the target concept are colored red.",
        "larly related to the target location.",
        "Second, Topic 2 is similar to our previous business topic, but with a more US-oriented slant.",
        "Note that \"dollar\" appears with high probability in standard LDA Topic 2, but not in our z-label LDA Topic 0.",
        "Standard LDA Topic 8 appears to be a mix of both soccer and cricket words.",
        "Therefore, it seems that our topic-inset knowledge helps in distilling topics related to the seed words.",
        "Given this promising result, we attempted to repeat this experiment with some other nations (United States, Germany, China), but without much success.",
        "When we tried to restrict these LOCATION words to the first few topics, these topics tended to be used to explain other concepts unrelated to the target location (often other sports).",
        "We are investigating the possible causes of this problem."
      ]
    },
    {
      "heading": "4. Conclusions and Future Work",
      "text": [
        "We have defined Topic-in-Set knowledge and demonstrated its use within LDA.",
        "As shown in the experiments, the partial supervision provided by z-labels can encourage LDA to recover topics relevant to user interests.",
        "This approach combines the pattern-discovery power of LDA with user-provided guidance, which we believe will be very attractive to practical users of topic modeling.",
        "Future work will deal with at least two important issues.",
        "First, when will this form of partial supervision be most effective or appropriate?",
        "Our experimental results suggest that this approach will struggle if the user's target concepts are simply not prevalent in the text.",
        "Second, can we modify this approach to express richer forms of partial supervision?",
        "More sophisticated forms of knowledge may allow users to specify their preferences or prior knowledge more effectively.",
        "Towards this end, we are investigating the use of First-Order Logic in specifying prior knowledge.",
        "Note that the set z-labels presented here can be expressed as simple logical formulas.",
        "Extending our model to general logical formulas would allow the expression of more powerful relational preferences.",
        "Topic 0",
        "translation, ribosomal, trna, rrna, initiation, ribosome, protein, ribosomes, is, factor, processing, translational nucleolar, pre-rrna, synthesis, small, 60s, eukaryotic, biogenesis, subunit, trnas, subunits, large, nucleolus factors, 40, synthetase, free, modification, rna, depletion, eif-2, initiator, 40s, ef-3, anticodon, maturation 18s, eif2, mature, eif4e, associated, synthetases, aminoacylation, snornas, assembly, eif4g, elongation",
        "(a) Topic 0 with z-label",
        "Topic 31",
        "mrna, translation, initiation, mrnas, rna, transcripts, 3, transcript, polya, factor, 5, translational, decay, codon decapping, factors, degradation, end, termination, eukaryotic, polyadenylation, cap, required, efficiency synthesis, show, codons, abundance, rnas, aug, nmd, messenger, turnover, rna-binding, processing, eif2, eif4e eif4g, cf, occurs, pablp, cleavage, eif5, cerevisiae, major, primary, rapid, tail, efficient, upflp, eif-2",
        "Topic 43",
        "type, is, wild, yeast, trna, synthetase, both, methionine, synthetases, class, trnas, enzyme, whereas, cytoplasmic because, direct, efficiency, presence, modification, aminoacylation, anticodon, either, eukaryotic, between different, specific, discussed, results, similar, some, met, compared, aminoacyl-trna, able, initiator, sam not, free, however, recognition, several, arclp, fully, same, forms, leads, identical, responsible, found, only, well",
        "Topic 73",
        "ribosomal, rrna, protein, is, processing, ribosome, ribosomes, rna, nucleolar, pre-rrna, rnase, small, biogenesis depletion, subunits, 60s, subunit, large, synthesis, maturation, nucleolus, associated, essential, assembly components, translation, involved, rnas, found, component, mature, rp, 40s, accumulation, 18s, 40, particles snornas, factors, precursor, during, primary, rrnas, 35s, has, 21s, specifically, results, ribonucleoprotein, early",
        "(b) Standard LDA Topics"
      ]
    }
  ]
}
