{
  "info": {
    "authors": [
      "Eiichiro Sumita",
      "Fumiaki Sugaya"
    ],
    "book": "Human Language Technology Conference and Meeting of the North American Association for Computational Linguistics – Short Papers",
    "id": "acl-N06-2041",
    "title": "Using the Web to Disambiguate Acronyms",
    "url": "https://aclweb.org/anthology/N06-2041",
    "year": 2006
  },
  "references": [
    "acl-J03-3001",
    "acl-N06-2042"
  ],
  "sections": [
    {
      "heading": "1 NiCT 2 ATR SLC",
      "text": []
    },
    {
      "heading": "Abstract",
      "text": [
        "This paper proposes an automatic method for disambiguating an acronym with multiple definitions, considering the context surrounding the acronym.",
        "First, the method obtains the Web pages that include both the acronym and its definitions.",
        "Second, the method feeds them to the machine learner.",
        "Cross-validation tests results indicate that the current accuracy of obtaining the appropriate definition for an acronym is around 92% for two ambiguous definitions and around 86% for five ambiguous definitions."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Acronyms are short forms of multiword expressions (we call them definitions) that are very convenient and commonly used, and are constantly invented independently everywhere.",
        "What each one stands for, however, is often ambiguous.",
        "For example, “ACL” has many different definitions, including “Anterior Cruciate Ligament (an injury),” “Access Control List (a concept in computer security),” and “Association for Computational Linguistics (an academic society).” People tend to write acronyms without their defini"
      ]
    },
    {
      "heading": "Fumiaki Sugaya3 3 KDDI R&D Labs",
      "text": [
        "Saitama 356-8502, JAPAN fsugaya@kddilabs.jp tion added nearby (Table 1), because acronyms are used to avoid the need to type long expressions.",
        "Consequently, there is a strong need to disambiguate acronyms in order to correctly analyze or retrieve text.",
        "It is crucial to recognize the correct acronym definition in information retrieval such as a blog search.",
        "Moreover, we need to know the meaning of an acronym to translate it correctly.",
        "To the best of our knowledge, no other studies have approached this problem.",
        "Figure 1 Acronyms and their definitions co-occur in some pages of the Web On the other side of the coin, an acronym should be defined in its neighborhood.",
        "For instance, one may find pages that include a certain acronym and its definition (Figure 1).",
        "First, our proposed method obtains Web pages that include both an acronym and its definitions.",
        "Second, the method feeds them to the machine learner, and the classification program can determine the correct definition according to the context information around the acronym in question."
      ]
    },
    {
      "heading": "Definition 1 Anterior Cruciate Ligament http://www.ehealthmd.com/library/acltears",
      "text": [
        "She ended up with a torn ACL, MCL and did some other damage to her knee.",
        "(http://aphotofreak.blogspot.com/2006/01/illgive-you-everything-i-have-good.html)"
      ]
    },
    {
      "heading": "Definition 2 Access Control List http://en.wikipedia.org/wiki",
      "text": [
        "Here, we assume that the list of possible definitions for an acronym is given from sources external to this work.",
        "Listing pairs of acronyms and their original definitions, on which many studies have been done, such as Nadeau and Turney (2005), results in high performance.",
        "Some sites such as http://www.acronymsearch.com/ or http://www.findacronym.com/ provide us with this function.",
        "This paper is arranged as follows.",
        "Section 2 explains our solution to the problem, and Section 3 reports experimental results.",
        "In Sections 4 and 5 we follow with some discussions and related works, and the paper concludes in Section 6."
      ]
    },
    {
      "heading": "2 The proposal",
      "text": [
        "The idea behind this proposal is based on the observation that an acronym often co-occurs with its definition within a single Web page (Figure 1).",
        "For example, the acronym ACL co-occurs with one of its definitions, “Association for Computational Linguistics,” 211,000 times according to google.com.",
        "Our proposal is a kind of word-sense disambiguation (Pedersen and Mihalcea, 2005).",
        "The hit pages can provide us with training data for disambiguating the acronym in question, and the snippets in the pages are fed into the learner of a classifier.",
        "Features used in classification will be explained in the latter half of this subsection.",
        "We do not stick to a certain method of machine learning; any state-of-the-art method will suffice.",
        "In this paper we employed the decision-tree learning program provided in the WEKA project."
      ]
    },
    {
      "heading": "Collecting the training data from the Web",
      "text": [
        "Our input is the acronym in question, A, and the set of its definitions, {Dk |k=1 – K}.",
        "for all k =1 – K do",
        "1.",
        "Search the Web using query of “A AND Dk.” 2.",
        "Obtain the set of snippets, {Sl (A, Dk) |l=1 – L}.",
        "3.",
        "Separate Dk from Sl and obtain the set of training data,{(Tl(A), Dk) |l=1 – L}."
      ]
    },
    {
      "heading": "End",
      "text": [
        "In the experiment, L is set to 1,000.",
        "Thus, we have for each definition Dk of A, at most 1,000 training data."
      ]
    },
    {
      "heading": "Training the classifier",
      "text": [
        "From training data Tl(A), we create feature vectors, which are fed into the learner of the decision tree with correct definition Dk for the acronym A.",
        "Here, we write Tl(A) as W-m W-(m-1) ... W-2 W-1 A W1 W2 ... Wm-1 Wm, where m is from 2 to M, which is called the window size hereafter.",
        "We use keywords within the window of the snippet as features, which are binary, i.e., if the keyword exists in Tl(A), then it is true.",
        "Otherwise, it is null.",
        "Keywords are defined in this experiment as the top N frequent words 1, but for A in the bag consisting of all words in {Tl(A)}.",
        "For example, keywords for “ACL” are “Air, Control, and,"
      ]
    },
    {
      "heading": "3 Experiment",
      "text": []
    },
    {
      "heading": "3.1 Acronym and definition preparation",
      "text": [
        "We downloaded a list of acronyms in capital letters only from Wikipedia and filtered them by eliminating acronyms shorter than three letters.",
        "Then we obtained definitions for each acronym from http://www.acronymsearch.com/ and discarded acronyms that have less than five definitions.",
        "Finally, we randomly selected 20 acronyms.",
        "We now have 20 typical acronyms whose ambiguity is more than or equal to five.",
        "For each acronym A, a list of definitions { Dk |k=1 – K K>=5 }, whose elements are ordered by the count of page including A and Dk, is used for the experiment."
      ]
    },
    {
      "heading": "3.2 Ambiguity and accuracy",
      "text": [
        "Here we examine the relationship between the degree of ambiguity and classification accuracy by using a cross-validation test for the training data.",
        "The first experiment was performed with the selected twenty acronyms by limiting the top two most frequent definitions.",
        "Table 2 summarizes the tenfold cross validation.",
        "While the accuracy changes acronym by acronym, the average is high about 90% of the time.",
        "The M in the table denotes the window size, and the longer the window, the higher the accuracy.",
        "The “base” column displays the average accuracy of the baseline method that always picks the most frequent definition.",
        "The proposed method achieves better accuracy than the baseline.",
        "Ambiguity of five Next, we move on to the ambiguity of five (Table 3).",
        "As expected, the performance is poorer than the abovementioned case, though it is still high, i.e., the average is about 80%.",
        "Other than this, our observations were similar to those for the ambiguity of two."
      ]
    },
    {
      "heading": "4 Discussion on biased data",
      "text": []
    },
    {
      "heading": "4.1 Problem caused by biased distribution and a countermeasure against it",
      "text": [
        "For some words, the baseline is more accurate than the proposed method because the baseline method reaches all occurrences on the Web thanks to the search engine, whereas our method limits the number of training data by L as mentioned in Section 2.",
        "The average quantity of training data was about 830 due to the limit of L, 1,000.",
        "The distribution of these training data is rather flat.",
        "This causes our classifier to fail in some cases.",
        "For example, for the acronym “ISP,” the most frequent definition out of five has a share of 99.9% (Table 4) on the Web, whereas the distribution in the training data is different from the sharp distribution.",
        "Thus, our classification accuracy is not as good as that of the baseline.",
        "Considering the acronym “CEC,” the most frequent out of five definitions has the much smaller share of 26.3% on the Web (Table 5), whereas the",
        "distribution in the training data is similar to the flat distribution of real data.",
        "Furthermore, the decision tree learns the classification well, whereas the baseline method performs terribly.",
        "These two extreme cases indicate that for some acronyms, our proposed method is beaten by the baseline method.",
        "The slanting line in Figure 2 shows the baseline performance compared with our proposed method.",
        "In the case where our method is strong, the gain is large, and where our method is weak, the reduction is relatively small.",
        "The average performance of our proposed method is higher than that of the baseline.",
        "A possible countermeasure to this problem would be to incorporate prior probability into the learning process."
      ]
    },
    {
      "heading": "4.2 Possible dissimilarity of training and real data",
      "text": [
        "The training data used in the above experiment were only the type of snippets that contain acronyms and their definitions; there is no guarantee for documents that contain only acronyms are similar to the training data.",
        "Therefore, learning is not necessarily successful for real data.",
        "However, we tested our algorithm for a similar problem introduced in Section 5.",
        "1, where we conducted an open test and found a promising result, suggesting that the above-mentioned fear is groundless."
      ]
    },
    {
      "heading": "5 Related works",
      "text": []
    },
    {
      "heading": "5.1 Reading proper names",
      "text": [
        "The contribution of this paper is to propose a method to use Web pages for a disambiguation task.",
        "The method is applicable to different problems such as reading Japanese proper names (Sumita and Sugaya, 2006).",
        "Using a Web page containing a name and its syllabary, it is possible to learn how to read proper names with multiple readings in a similar way.",
        "The accuracy in our experiment was around 90% for open data."
      ]
    },
    {
      "heading": "5.2 The Web as a corpus",
      "text": [
        "Recently, the Web has been used as a corpus in the NLP community, where mainly counts of hit pages have been exploited (Kilgarriff and Grefen-stette, 2003).",
        "However, our proposal, Web-Based Language Modeling (Sarikaya, 2005), and Bootstrapping Large Sense-Tagged corpora (Mihalcea, 2002) use the content within the hit pages."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "This paper proposed an automatic method of disambiguating an acronym with multiple definitions, considering the context.",
        "First, the method obtains the Web pages that include both the acronym and its definitions.",
        "Second, the method feeds them to the learner for classification.",
        "Cross-validation test results obtained to date indicate that the accuracy of obtaining the most appropriate definition for an acronym is around 92% for two ambiguous definitions and around 86% for five ambiguous definitions."
      ]
    }
  ]
}
