{
  "info": {
    "authors": [
      "Munpyo Hong",
      "Young-Kil Kim",
      "Sangkyu Park",
      "Young-Jik Lee"
    ],
    "book": "Workshop on Multilingual Linguistic Resources",
    "id": "acl-W04-2211",
    "title": "Semi-Automatic Construction of Korean-Chinese Verb Patterns Based on Translation Equivalency",
    "url": "https://aclweb.org/anthology/W04-2211",
    "year": 2004
  },
  "references": [
    "acl-C96-2211",
    "acl-P98-2223"
  ],
  "sections": [
    {
      "heading": "ETRI ETRI ETRI ETRI",
      "text": []
    },
    {
      "heading": "Abstract",
      "text": [
        "This paper addresses a new method of constructing Korean-Chinese verb patterns from existing patterns.",
        "A verb pattern is a subcategorization frame of a predicate extended by translation information.",
        "Korean-Chinese verb patterns are invaluable linguistic resources that only used for Korean-Chinese transfer but also for Korean parsing.",
        "Usually a verb pattern has been either hand-coded by expert lexicographers or extracted automatically from bilingual corpus.",
        "In the first case, the dependence on the linguistic intuition of lexicographers may lead to the incompleteness and the inconsistency of a dictionary.",
        "In the second case, extracted patterns can be domain-dependent.",
        "In this paper, we present a method to construct Korean-Chinese verb patterns semi-automatically from existing Korean-Chinese verb patterns that are manually written by lexicographers."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "PBMT (Pattern-based Machine Translation) approach has been adopted by many MT researchers, mainly due to the portability, customizability and the scalability of the approach.",
        "cf. Hong et al.",
        "(2003a), Takeda (1996), Watanabe & Takeda (1998).",
        "However, major drawback of the approach is that it is often very costly and time-consuming to construct a large amount of data enough to assure the performance of the PBMT system.",
        "From this reason many studies from PBMT research circles have been focused on the data acquisition issue.",
        "Most of the data acquisition studies were about automatic acquisition of lexical resources from bilingual corpus.",
        "Since 2001, ETRI has developed a Korean-Chinese MT system, TELLUS K-C, under the auspices of the MIC (Ministry of Information and Communication) of Korean government.",
        "We have adopted verb pattern based approach for Korean-Chinese MT.",
        "The verb patterns play the most crucial role not only in the transfer but also in the source language analysis.",
        "In the beginning phase of the development, most of the verb patterns were constructed manually by experienced Korean-Chinese lexicographers with some help of editing tools and electronic dictionaries.",
        "In the setup stage of a system, the electronic dictionary is very useful for building a verb pattern DB.",
        "It provides with a comprehensive list of entries along with some basic examples to be added to the DB.",
        "In most cases, however, the examples in the dictionary with which the lexicographers write a verb pattern are basic usages of the verb in question, and other various usages of the verb are often neglected.",
        "Bilingual corpus can be useful resources to extract verb patterns.",
        "However, as for language pairs like Korean-Chinese for which there are not so much bilingual corpus available in electronic form, the approach does not seem to be suitable.",
        "Another serious problem with the bilingual corpus-based approach is that the patterns extracted from the corpus can be domain-dependent.",
        "The verb pattern generation based on translation equivalency is another good alternative to data acquisition from bilingual corpus.",
        "The idea was originally introduced by Fujita & Bond (2002) for Japanese to English MT.",
        "In this paper, we present a method to construct Korean-Chinese verb patterns from existing Korean-Chinese verb patterns that are manually written by lexicographers.",
        "The clue for the semi-automatic generation is provided by the idea that verbs of similar meanings often share the argument structure as already shown in Levin (1993).",
        "The synonymy among Korean verbs can be indirectly inferred from the fact that they have the same Chinese translation.",
        "We have already applied the approach to TELLUS KC and increased the number of verb patterns from about 110,000 to 350,000.",
        "Though 350,000 patterns still contain many erroneous patterns, the evaluations in section 5 will show that the accuracy of the semi-automatically generated patterns is noteworthy and the pattern matching ratio improves significantly with 350,000 pattern DB."
      ]
    },
    {
      "heading": "2 Related Works",
      "text": [
        "When constructing verb pattern dictionary, too much dependence on the linguistic intuition of lexicographers can lead to the inconsistency and the incompleteness of the pattern dictionary.",
        "Similar problems are encountered when working with a paper dictionary due to the insufficient examples.",
        "Hong et al. (2002) introduced the concept of causative/passive linking to Korean word dictionary.",
        "The active form ‘mekta (to eat)’ is linked to its causative/passive forms ‘mekita (to let eat)’, and ‘mekhita (to be eaten)’, respectively.",
        "The linking information of this sort helps lexicographers not to forget to construct verb patterns for causative/passive verbs when they write a verb pattern for active verbs.",
        "The semi-automatic generation of verb patterns using translation equivalency was tried in Hong et al. (2002).",
        "However, as only the voice information was used as a filter, the over-generation problem is serious.",
        "Fujita & Bond (2002) and Bond & Fujita (2003) introduced the new method of constructing a new valency entry from existing entries for Japanese-English MT.",
        "Their method creates valency patterns for words in the word dictionary whose English translations can be found in the valency dictionary.",
        "The created valency patterns are paraphrased using monolingual corpus.",
        "The human translators check the grammaticality of the paraphrases.",
        "Yang et al.",
        "(2002) used passive/causative alternation relation for semi-automatic verb pattern generation.",
        "Similar works have been done for Japanese by Baldwin & Tanaka (2000) and Baldwin & Bond (2002) ."
      ]
    },
    {
      "heading": "3 Verb Pattern in TELLUS KC",
      "text": [
        "The term ‘verb pattern’ is understood as a kind of subcategorization frame of a predicate.",
        "However, a verb pattern in our approach is slightly different from a subcategorization frame in the traditional linguistics.",
        "The main difference between the verb pattern and the subcategorization frame is that a verb pattern is always linked to the target language word (the predicate of the target language).",
        "Therefore, a verb pattern is employed not only in the analysis but also in the transfer phase so that the accurate analysis can directly lead to the natural and correct generation.",
        "In the theoretical linguistics, a subcategorization frame always contains arguments of a predicate.",
        "An adjunct of a predicate or a modifier of an argument is usually not included in it.",
        "However, in some cases, these words must be taken into account for the proper translation.",
        "In translations adjuncts of a verb or modifiers of an argument can seriously affect the selection of target words.",
        "(1) exemplifies verb patterns of “cata (to sleep)”:",
        "swuyeha!ta Step3: Exchange the verbs, if the following three conditions are met: - The two Korean verbs of the pair have the same voice information - Neither of the two verbs is idiomatic expressions - The Chinese translation is not ssawuta1 (to fight) : A=HUMAN!ka B=PROPERTY!wa ssawu!ta"
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "Korean-Chinese verb patterns are invaluable linguistic resources that cannot only be used for Korean-Chinese transfer but also for Korean analysis.",
        "In the set-up stage of the development, a paper dictionary can be used for exhaustive listing of entry words and the basic usages of the words.",
        "However, as the verb patterns made from the examples of a dictionary are often insufficient, a PBMT system suffers from the coverage problem of the verb pattern dictionary.",
        "Considering there are not so many Korean-Chinese bilingual corpus available in electronic form till now, we believe the translation-based approach, i.e. Chinese-based pattern generation approach provides us with a good alternative.",
        "The focus of our future research will be given on the pre-filtering options to prevent over-generation more effectively.",
        "Another issue will be about post-filtering technique using monolingual corpus with minimized human intervention."
      ]
    }
  ]
}
