{
  "info": {
    "authors": [
      "Charles Greenbacker",
      "Kathleen F. McCoy"
    ],
    "book": "Proceedings of the 2009 Workshop on Language Generation and Summarisation (UCNLG+Sum 2009)",
    "id": "acl-W09-2819",
    "title": "UDel: Generating Referring Expressions Guided by Psycholinguistc Findings",
    "url": "https://aclweb.org/anthology/W09-2819",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "UDel: Generating Referring Expressions Guided by Psycholinguistic Findings",
        "Charles Greenbacker and Kathleen McCoy",
        "of Computer and Information Sciences University of Delaware Newark, Delaware, USA",
        "We present an approach to generating referring expressions in context utilizing feature selection informed by psycholinguistic research.",
        "Features suggested by studies on pronoun interpretation were used to train a classifier system which determined the most appropriate selection from a list of possible references.",
        "This application demonstrates one way to help bridge the gap between computational and empirical means of reference generation."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "This paper provides a system report on our submission for the GREC-MSR (Main Subject References) Task, one of the two shared task competitions for Generation Challenges 2009.",
        "The objective is to select the most appropriate reference to the main subject entity from a given list of alternatives.",
        "The corpus consists of introductory sections from approximately 2,000 Wikipedia articles in which references to the main subject have been annotated (Belz and Varges, 2007).",
        "The training set contains articles from the categories of cities, countries, mountains, people, and rivers.",
        "The overall purpose is to develop guidelines for natural language generation systems to determine what forms of referential expressions are most appropriate in a particular context."
      ]
    },
    {
      "heading": "2. Method",
      "text": [
        "The first step of our approach was to perform a literature survey of psycholinguistic research related to the production of referring expressions by human beings.",
        "Our intuition was that findings in this field could be used to develop a useful set of features with which to train a classifier system to perform the GREC-MSR task.",
        "Several common factors governing the interpretation of pronouns were identified by multiple authors (Arnold, 1998; Gordon and Hen-drick, 1998).",
        "These included Subjecthood, Parallelism, Recency, and Ambiguity.",
        "Following (McCoy and Strube, 1999), we selected Recency as our starting point and tracked the intervals between references measured in sentences.",
        "Referring expressions which were separated from the most recent reference by more than two sentences were marked as longdistance references.",
        "To cover the Subjecthood and Parallelism factors, we extracted the syntactic category of the current and three most recent references directly from the GREC data.",
        "This information also helped us determine if the entity was the subject of the sentence at hand, as well as the two previous sentences.",
        "Additionally, we tracked whether the entity was in subject position of the sentence where the previous reference appeared.",
        "Finally, we made a simple attempt at recognizing potential interfering antecedents (Siddharthan and Copestake, 2004) occurring in the current sentence and the text since that last reference.",
        "Observing the performance of prototyping systems led us to include boolean features indicating whether the reference immediately followed the words \"and,\" \"but,\" or \"then,\" or if it appeared between a comma and the word \"and.\"",
        "We also found that non-annotated instances of the entity's name, which actually serve as references to the name itself rather than to the entity, factor into Recency.",
        "Figure 1 provides an example of such a \"non-referential instance.\"",
        "We added a feature to measure distance to these items, similar to the distance between references.",
        "Sentence and reference counters rounded out the full set of features.",
        "The municipality was abolished in 1928, and the name \"Mexico City\" can now refer to two things.",
        "Figure 1: Example of non-referential instance.",
        "In this sentence, \"Mexico City\" is not a reference to the main entity (Mexico City), but rather to the name \"Mexico City.\""
      ]
    },
    {
      "heading": "3. System Description",
      "text": [
        "A series of C5.0 decision trees (RuleQuest Research Pty Ltd, 2008) were trained to determine the most appropriate reference type for each instance in the training set.",
        "Each tree used a slightly different subset of features.",
        "It was determined that one decision tree in particular performed the best on mountain and person articles, and another tree on the remaining categories.",
        "Both of these trees were incorporated into the submitted system.",
        "Our system first performed some preprocessing for sentence segmentation and identified any non-referential instances as described in Section 2.",
        "Next, it marshalled all of the relevant data for the feature set.",
        "These data points were used to represent the context of the referring expression and were sent to the decision trees to determine the most appropriate reference type.",
        "Once the type had been selected, the list of alternative referring expressions were scanned using a few simple rules.",
        "For the first instance of a name in an article, the longest non-emphatic name was chosen.",
        "For subsequent instances, the shortest non-emphatic name was selected.",
        "For the other 3 types, the first matching option in the list was used, backing off to a pronoun or name if the preferred type was not available."
      ]
    },
    {
      "heading": "4. Results",
      "text": [
        "The performance of our system, as tested on the development set and scored by the GREC evaluation software, is offered in Table 1."
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "We've shown that psycholinguistic research can be helpful in determining feature selection for generating referring expressions.",
        "We suspect the performance of our system could be improved by employ-",
        "Component Score Value ing more sophisticated means of sentence segmentation and named entity recognition for identifying interfering antecedents."
      ]
    }
  ]
}
