{
  "info": {
    "authors": [
      "Rani Nelken",
      "Stuart M. Shieber"
    ],
    "book": "Workshop on Computational Approaches to Semitic Languages",
    "id": "acl-W05-0711",
    "title": "Arabic Diacritization Using Weighted Finite-State Transducers",
    "url": "https://aclweb.org/anthology/W05-0711",
    "year": 2005
  },
  "references": [
    "acl-N04-4038",
    "acl-P03-1006",
    "acl-W02-0504",
    "acl-W02-0505",
    "acl-W04-1606",
    "acl-W04-1612"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Arabic is usually written without short vowels and additional dianitics, which are nevertheless important for several applications.",
        "We present a novel algorithm for restoring these symbols, using a cascade of probabilistic finitestate transducers trained on the Arabic treebank, integrating a word-based language model, a letter-based language modeL and an extremely simple morphological model.",
        "This combination of probabilistic methods and simple linguistic information yields high levels of accuracy."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "Most semitic languages in both ancient and contemporary times arc usually written without short vowels and other diacritic marks, often leading to potential ambiguity.",
        "While such ambiguity only rarely impedes proficient speakers, it can certainly be a source of confusion for beginning readers and people with learning disabilities (Abu-Rabia, 1999).",
        "The problem becomes even more acute when people are required to actively generate diacritized script, as used for example in poetry or children's books.",
        "Diacritization is even more problematic for computational systems, adding another level of ambiguity to both analysis and generation of text.",
        "For example, full vocalization is required for textto-speech applications, and has been shown to improve speech-recognition perplexity and error rate (Kirchoff et al., 2002).",
        "We present a system for Arabic diacritization1 in Modern Standard Arabic (MSA) using weighted finite-state transducers.",
        "The system is constructed using standardly available finitestate tools, and encodes only minimal morphological knowledge, yet achievei; very high levels of accuracy.",
        "While the methods deRcribed in thiR paper arc applicable to additional semitic languages, the choice of MSA was motivated by the availability of the Arabic Treebank, distributed by the Linguii;tic Data Consortium (LDC), a sizable electronic corpus of diacritized text, which we could use for training and testing.",
        "Such resources are rare for other semitic languages.",
        "Thii; paper is structured as follows.",
        "In Section 1, we describe the task, including a brief introduction to Arabic diacritization, and the corpus we used.",
        "In Section 2, we desnibe the design of our system, which consists of a trigram wordbased language model, augmented by two extensions: an extremely simple morphological analyzer and a letter-based language model, which arc used to address the data sparsity problem.",
        "In Section 3, we report the system's experimental evaluation.",
        "We review related work in Section 4, and close with conclusions and directions for future research in Section 5.",
        "1 The task The Arabic vowel system consists of 3 short vowels and 3 long vowels, as summarized in Ta-1.",
        "We distinguish between vocafo~ation the restoration of vowel symbols-and diacritization, which includes additionally the restoration of a richer system of diacritic marks, as explained below.",
        "80 Short vowels Vocalized Unvoc.",
        "Pronounc.",
        "Arab.",
        "Tran.",
        "Arab.",
        "Tran.",
        "-, u - - /u/ -, a - - /a/ , i - - /i/ Long vowels , ~ UY w /u:/ _, ~ aA(l),(2) I A /a:/ , aY 1.5 y(3) /a:/ i..s-~ iy ~ y /i:/ Doubled case endings -~.",
        "N - - /un/ F - - /an/ \\:: AF I A /an/ ; K - - /in/ (1) aA may also appear as A even in vocalized text.",
        "<2 ) In some lexical items, aA is >v:ritten a.;; '; in which case it is dropped in undiacritized text.",
        "( 3 ) Y and y can appea.r interchangeably in the corpus (Buckwalter, 2004).",
        "Table 1: Arabic vowels ble 1.",
        "2 Short vowels are written as symbols either above or below the letter in diacritizcd text) and dropped altogether in undiacritized text.",
        "Long vowels arc written as a combination of a short vowel symbol, followed by a vowel letter; in undiacritized text) the short vowel symbol is dropped.",
        "Arabic also uses vowels at the end of words to mark case distinctions, which include both the short vowels and an additional doubled form (\"tan ween\").",
        "Diacritized text also contains two syllabification marks: y (trans.",
        ": \"\") denoting doubling of the preceding consonant (in this case, y), and w (trans.",
        ": o), denoting the lack of a vowel.",
        "The Arabic glottal stop ( \"harnza\") deserves special mention, as it can appear in several different forms in diacritizecl tf~xt, enumerated in 2Throughout the paper we follow Buckwalter's transliteration of Arabic: into 7-bit ASCII characters (2002a).",
        ".A rab.",
        "Tran .",
        "Arab.",
        "Tran.",
        "\\ > I I •\\ < -• ' .•, & T { 0 } Table 2: Arabic glottal stop Table 2.",
        "In undiacritized text, it appears either as A or as one of the forms in the table.",
        "We used the LDC's Arabic Treehank of diacritized news stories (Part 2).",
        "The corpus consists of 501 news stories collected from Al-Hayat for a total of 144,199 words.",
        "In addition to diacritization, the corpus contains several types of annotations.",
        "After being transliterated, it was morphologically analyzed using the Buckwalter morphological analyzer (2002b).",
        "Buckwalter's system provides a list of all possible analyses of each word, including a full diacritization, and a part-of-speech (POS) tag.",
        "From this candidate list, annotators chose a single analysis.",
        "Afterwards, clitics, which are prevalent in Arabic were separated and marked, and a full parsetree was manually generated.",
        "For our purposes, we have stripped all the POS tagging, to retain two versions of each filc-diacritizcd and undiacritized1 whkh we use for both training and evaluation as will be explained below.",
        "An example sentence fragment in Arabic is given in Figure 1 in three forms: undiacritized, diacritized without case endings, and with case endings.",
        "... 0'\" y J/ ~_rJI JJ..UI ~~ iWI ~~I ~.J ... ~ y J_;j ~_?\\ J_slll ~~ fWI .",
        ":,~~I ~j ···~ y J_;j ~_?\\ ~_sill ~~ rWI c~~I ~j Figure 1: Example sentence fragment The transliteration and translation are given in Figure 2.",
        "We follow precisely the form that appears in the Arabic treebank.3 3The diacritization of this example is (strictly speaking) incomplete with respect to the diac:ritization of the LM SP DD UNK 81 PRE MID SUF 82 83 ma8c.",
        "dual), km (your/your8 masc.",
        "pl.",
        "), knA (your/yours fem.",
        "dual), kn (your/yours fem.",
        "pl.",
        "), h (him/his), hA (her/hers), hmA (their/theirs masc.",
        "dual), hnA (their/theirs fem.",
        "dual), hm (their/theirs masc.",
        "pl.",
        "), hn (their/theirs fem.",
        "pl).",
        "We integrate CC into the cascade by composing it aft.er DD, and before UNK.",
        "Tlnrn, clitic8 appear in their undiacritized form.",
        "Our model now assumes that the diacritized input text has clitics separated.",
        "This requires two changes to our method.",
        "First, training must now be performed on text in which clitics are separated.",
        "This is straightforward since clitics are tagged in the corpus.",
        "Second, in the undiacritized test data, we keep clitics intact.",
        "Running Viterbi decoding on the augmented model would not only diacritizc it, but also separate clitics.",
        "To generate grammatical Arabic, we reconnect the clitic8 as a post-processing step.",
        "We use a greedy strategy of connecting each prefix to the following word, and each :mffix to the preceding word.",
        "5 While our handling of clitics helps overcome data sparsity, there is also a potential cost for decoding.",
        "Clitics, which are, intuitively speaking, less informative than regular words, are now treated as lexical items of \"equal stature\".",
        "For instance, a bigram model may include the collocation Al>amiyn AlEAm,-..., (the secretary general).",
        "Once clitics are separated this becomes Al >amiyn Al EAm\"'.",
        "A bigram model would no longer retain the connection between eac.h of the main words, >amiyn and EAm\"\"' , but only between them and the determiner Al, which is potentially less informative.",
        "Figure 5 shows an example transduction through the word-based model, where for illustration purposes, we assume that Aldwl i8 an unknown word.",
        "2.3 Letter model for unknown words To diacritize unknown words, we trained a letter-based 4-gram language model of Arabic 5The only case that requires special attention is ka which can be either a prefix (meaning \"as\") or a suffix (meaning \"your/yours\" masc.).",
        "The greedy strategy always chooses the suffix meaning.",
        "vVe correct it by comparison with the input text.",
        "words, LLM, on the letter sequences of words in the training set.",
        "Composing LLM with the vowel-drop transducer, DD, yields a probabilistic generative model of Arabic letter and diacritiz; ation patterns, including for words that were never encountered in training.",
        "In principle, we could use the letter model as an alternative model of the full text, but we found it more effective to use it selectively, only on unknown words.",
        "Thus, after running the word-based language model, we extract all the words tagged as (UNK) and run the letter-based model on them.",
        "Here is an example transduction: Diacritized Alduwal LLM (Weighted) DD (Diacritics dropped) Aldwl We chose not to apply any special clitic handling for the letter-based model.",
        "To sec why, consider the alternative model that would include CC.",
        "Since LLM is unaware of word tokens, there is no pressure on the decoding algorithm to split the clitics from the word, and clitics may therefore be incorrectly vocalized.",
        "3 Experiments We randomly split the set of news articles in each of the two parts of the Arabic treebank into a training and held-out testing set of sizes 903 and 10% respectively.",
        "We trained both the word-based and the letter-based language models on the diacritized version of the training set.",
        "We then ran Viterbi decoding on the undiacritizcd version of the testing set, which consists of a total of over 14,000 words.",
        "As a baseline, we used a unigram word model without clitic handling, constructed using the same transducer technology.",
        "We ran two batches of experiments-one in which case endings were stripped throughout tlu~ training and testing data, and we did not attempt to restore them, and one in which <.",
        ":ase markings were included.",
        "Results are reported in Table 3.",
        "For each model, we report two measures: the word error rate (WER), and the diacritization error rate (DER) , i.e., the proportion of incorrectly restored diacritics.",
        "Surprisingly, a trigram word-based language 84 Diacritized LM radrva Al >amiyn Al EAmrv li jAmiEap (uNK) (Weighted, but otherwise unchanged) SP DD cc (Change in token rnmlution from words to letters) (Diacritics dropped) rd Al >myn Al EAm 1 j AmEp (Clitics concatenated) rd Al>myn AlEAm ljAmEp UNK ((uNK) be<.",
        ":omes Aldwl) rd Al>myn AlEAm ljAmEp Aldwl Figure 5: Example transduction I Model without case with case WER DER WER DER Baseline 15.483 17.33% 30.39% 24.033 3-gram word 14.64% 16.9% 28.42% 23.34% 3-gram word + CC 8.49% 9.32% 24.22% 15.36% 3-gram word + CC + 4-gram letter 7.333 6.35% 23.613 12.793 Table 3: Results on the Al-Hayat corpus model yields only a mode1>t improvement over the baseline unigram model.",
        "The addition of a clitic connection model and a letter-based language model leads to a marked improvement in both WER and DER.",
        "This trend is repeated for both variants of the task-either with or without case endings.",
        "Including case information naturally yields proportionally worse accuracy.",
        "Since case marking1> encode higher-order grammatical information, they would require a more powerful grammatical model than offered by finite-state methods.",
        "To illustrate the system's performance, here are some decodings made by the different versions of the model.",
        "Basic model • An, <inrva, and >an,....,a, three versions of the word \"that'', which may all appear as An in undiacritized text, are often confused.",
        "As Buckwalter (2004) notes, the corpus itself is sometimes inconsistent about the use of <in\"\"'a and >an,....,a.",
        "• Several of the third-person possessive pronoun ditics can appear either with a u or an i, for instance, the third person singular masculine possessive can appear as either hu or hi.",
        "The correct form depends on the preceding letter and vowel (including the case vowels).",
        "Part of the tradeoff of treating ditic1> as independent lexical items is that the word-based model is ignorant of the letter preceding a suffix clitic.",
        "Clitic model • wstkwn was correctly decoded to wa sa takuwnu, which after post-processing becomes wasatakuwnu (\"and [it] Rhall be\").",
        "Letter model • AstfzAz correctly decoded to { isotifozAz (\"instigation\").",
        "This example is interesting, since a morphological analysis would deterministically predict this diacritization.",
        "The probabilistic letter model was able to correctly decode it even though it has no explicit encoding of such knowledge.",
        "• Non-Arabic names arc obviously problematic for the model.",
        "For instance bwrtlAnd was incorrectly decoded to buwrotilAnoda rather than buwrotlAnod (Portland), but note that Rome of the diacritics were correctly restored.",
        "Al-Onaizan and Knight (2002) proposed a transducer for modeling the Arabic 8pelling of :mch names for the purpose of translating from Arabic.",
        "Such a model could be seamlessly integrated into our architecture, for improved accuracy.",
        "85 4 Related work Gal (2002) constructed an HMM-based bigram model for restoring vowels (but not additional diacritic8) in Arabic and Hebrew.",
        "For Arabic, the model was applied to the Qur'an; a corpus of about 90,000 words, a<.",
        ":hieving 14% WER.",
        "The word-based language model component of our system is very similar to Gal's HMM.",
        "The very Hexible framework of transducers allows us to easily enhance the model with our simple but effective morphology handler and letter-based language model.",
        "Several commercial tools are available for Arabic diacritization, which unfortunately we did not have access to.",
        "Vergyri and Kirchhoff (2004) evaluated one (urrnpecified) system on two MSA texts, reporting a 93 DEil without case information, and 28% DER with case endings.",
        "Kirchoff et al. {2002) focu8es on vocalizing transcripts of oral conversational Arabic.",
        "Since conversational Arabic is much more free-flowing, and prone to dialect and speaker differences, diacritization of such transcripts proves much more difficult.",
        "Kirchoff et al. started from a nnigrarn model, and augmented it with the following heuristic.",
        "For ea<.",
        ":h unknown word, they search for the closest known unvocalized word to it according to Levenshtein distance, and apply whatever transformation that word undergoes, yielding 16.5% WER.",
        "Our letter-based model provides an alternative method of generalizing the diacritization from known words to unknown ones.",
        "Vergyri and Kirchhoff (2004) al8o handled conversational Arabic, and showed that some of the complexity inherent in vocalizing such text can be offaet by combining information on the acoustic signal with morphological and contextual information.",
        "They treat the latter problem as an 'unsupervised tagging problem, where each word is assigned a tag representing one of its possible diacritizations according to Buckwalter's morphological analyzer (2002b).",
        "They use Expectation Maximization (EM) to train a trigram model of tag sequences.",
        "The evaluation shows that the combined model yields a significant improvement over just the acoustic model.",
        "5 Conclusions and future directions We have presented an effective probabilistic finite-state architecture for Arabic diacritization.",
        "The modular design of the system, based on a composition of ::;imple and compact transducers allows us to achieve high levels of accuracy while encoding extremely limited morphological knowledge.",
        "In particular, while our system is aware of the existence of Arabic clitics, it has no explicit knowledge of how they can be combined.",
        "Such pattem8 are automatically learned from the training data.",
        "Likewise, while the system is aware of different orthographic variant8 of the glottal stop, it encodes no explicit rules to predict their distribution.",
        "The main resource that our method relies on is the existence of sufficient quantities of diacritized text.",
        "Since semitic languages are typkally written without vowels, it is rare to find sizable collections of diacritized text in digital form.",
        "The alternative is to diacritize text using a combination of manual annotation and computational tool8.",
        "Thi8 is preci8ely the proce88 that was followed in the compilation of the Arabic treebank, and similar efforts are now underway for Hebrew (Wintner and Yona, 2003).",
        "In contrast to morphological analyzers, which usually provide only an unranked list of all possible analyses, our method provides the most probable analysis, and with a trivial extension, could provide a ranked n-best list.",
        "Reducing and ranking the possible analyses may help simplify the annotator's job.",
        "The burden of requiring large quantities of diacritized text could be assuaged by iterative boot8trapping-training the system and manually correcting it on corpora of increasing size.",
        "As another future direction, we note that occasionally one may find a vowel or two, even in otherwise undiacritized text fragments.",
        "This is especially true for extremely short text fragments, where ambiguity is undesirable, as in banners or advertisements.",
        "Thi::; raises an interesting optimization problem-what is the least number of vowel symbols that are required in 86 order to ernmre an unambignom; reading1 and where should they be placed?",
        "Assuming that the errors of the probabilistic model are indicative of the types of errors that a human might make, we can use this model to predict where disambiguating vowels would be most informative.",
        "A Rimple change to the model de8cribed in this paper would make vowel drop optional rather than obligatory.",
        "Such a model would then be able to generate not only fully unvocalized text, but also partially vocalized variants of it.",
        "The optimization problem would then become one of finding the partially diacritized text with the minimal number of vowels that would be least ambiguous.",
        "Acknowledgments We thank Ya'akov Gal for his comments on a previous version of this paper.",
        "This work was supported in part by grant IIS-0329089 from the National Science Foundation.",
        "References Salim Abu-Rabia.",
        "1999.",
        "The effect of Arabic vowels on the reading comprehension of second and sixth-grade native Arab children.",
        "J011,rnal of Psycholingnist Research, 28(1):93-101, January.",
        "Yaser Al-Onaizan and Kevin Knight.",
        "2002.",
        "Machine transliteration of names in Arabic texts.",
        "In Proceedings of the Workshop on Computational Approaches to Semitic Langnages, pages 34-46, Philadelphia, July.",
        "Assodation for Computational Linguistics.",
        "Cyril Allauzen, Mehryar Mohri, and Brian Roark.",
        "2003.",
        "Generalized algorithms for constructing statistical language models.",
        "In Proceedings of the 41st Anmwl Meeting of the Association for Computational Linguistics (ACL'2003), pages 40-47.",
        "Tim Buckwalter.",
        "2002a.",
        "Arabic transliteration table.",
        "http://www.qarnus.org/transliteration.htrn.",
        "Tim Buckwalter.",
        "2002b.",
        "Buckwalter Arabic morphological analyzer version 1.0.",
        "Linguistic Data Consortium, catalog number LDC2002L49 and ISBN 1-58563-257-0.",
        "Tim Buckwalter.",
        "2004.",
        "Issues in Arabic orthography and morphology analysis.",
        "In Ali Farghaly and Karine :VIegerdoomian, editors, COLING 2004 Compntational Approaches to Arabic Script-based Langnages, pages 31-34, Geneva, Switzerland, August 28th.",
        "COLI::-.l\"G. :VIona Diab, Kadri Hacioglu, and Daniel .Jnrafaky.",
        "2004.",
        "Automatic tagging of Arabic text: From raw text to base phrase chunks.",
        "In Susan Dumais, Daniel :Vlarcu, and Salim Roukos, editors, HLT-NAACL 2004: Short Papers, pages 149-152, Boston, :VIassachusett.s, USA, l\\fay 2 May 7.",
        "Association for Computational Linguistics.",
        "Ya'akov Gal.",
        "2002.",
        "An HMl\\,I approach to vowel restoration in Arabic and He brew.",
        "In Proceedings of the Workshop on Comp,utational Approaches to Semitic Larwuages, pages 27-33, Philadelphia, .July.",
        "Association for Computational Linguistics.",
        "Slava M. Katz.",
        "1987.",
        "Estimation of probabilities from sparse data for the language model component of a speech recognizer.",
        "IEEE Transactions on Acoustics, Speech and Signal Processing, 35(3) :400-4001, MaJ:ch.",
        "Katrin Kirchoff, Jeff Ililmes, Sourin Das, Nicolae Duta, Melissa Egan, Gang Ji, Feng He, John Henderson, Daben Liu, Mohamed Noamany, Pat Schone, Richard Schv,rarta, and Dimitra Vergyri.",
        "2002.",
        "Novel approaches to Arabic speech recognition: report from the 2002 Johns-Hopkins summer workshop.",
        "Technical report, .Johns Hopkins University.",
        "'vfohryar Mohri, Fernando Pereira, and Michael Riley.",
        "2000.",
        "The design principles of a weighted finite-state transducer library.",
        "Theoretical Computer Sci;ence, 231(1):17-32.",
        "Fernando C. N. Pereira and Ivlichael Riley.",
        "1997.",
        "Speech recognition by composition of weighted finite automata.",
        "In Emmanuel Roche and Yves Schabes, editors, Finite-State Devices for Natural Lang11,age Proce8.~ing.",
        "MIT Press, Cambridge, MA.",
        "Dimitra Vergyri and Katrin Kirchhoff.",
        "2004.",
        "Automatic diacritization of Arabic for acoustic modeling in speech recognition.",
        "In Ali Fargha.ly and Karine :VIegerdoomian, editors, COLING 2004 Computational Approaches to Arabic Script-based Langnage8, pages 66-73, Geneva, Switzerland, August 28th.",
        "COLI::-.l\"G. Shuly Vl\"intner and Shlomo Yona.",
        "2003.",
        "Resources for processing Hebrew.",
        "In Proceedings of the MT Summit IX Workshop on Machine Tiunslation for Semitic Language.~, New Orleans, September."
      ]
    }
  ]
}
