{
  "info": {
    "authors": [
      "Kremena Ivanova",
      "Ulrich Heid",
      "Sabine Schulte Im Walde",
      "Adam Kilgarriff",
      "Jan Pomikálek"
    ],
    "book": "LREC",
    "id": "acl-L08-1011",
    "title": "Evaluating a German Sketch Grammar: A Case Study on Noun Phrase Case",
    "url": "https://aclweb.org/anthology/L08-1011",
    "year": 2008
  },
  "references": [
    "acl-C00-2105",
    "acl-E06-2001",
    "acl-E99-1016"
  ],
  "sections": [
    {
      "text": [
        "Kremena Ivanova*, Ulrich Heid*, Sabine Schulte im Walde*, Adam Kilgarriff, Jan Pomikaiek'",
        "* Institute for Natural Language Processing, University of Stuttgart, Germany \"Lexical Computing Ltd, Brighton, UK >Masaryk University, Brno, Czech Republic",
        "{ivanovka,heid,schulte}@ims.uni-stuttgart.de, adam@lexmasterclass.com, xpomikal@fi.muni.cz",
        "Word sketches are part of the Sketch Engine corpus query system.",
        "They represent automatic, corpus-derived summaries of the words' grammatical and collocational behaviour.",
        "Besides the corpus itself, word sketches require a sketch grammar, a regular expression-based shallow grammar over the part-of-speech tags, to extract evidence for the properties of the targeted words from the corpus.",
        "The paper presents a sketch grammar for German, a language which is not strictly configurational and which shows a considerable amount of case syncretism, and evaluates its accuracy, which has not been done for other sketch grammars.",
        "The evaluation focuses on NP case as a crucial part of the German grammar.",
        "We present various versions of NP definitions, so demonstrating the influence of grammar detail on precision and recall."
      ]
    },
    {
      "heading": "1.. Introduction",
      "text": [
        "The Sketch Engine (Kilgarriff et al.",
        "(2004)) is a corpus query tool which supports the extraction of word sketches, corpus-based summaries of a word's grammatical and collocational behaviour, from large corpora.",
        "Word sketches serve as a starting point for the description of lexicographic properties at the syntax-semantics interface such as subcat-egorisation, selectional preferences and collocations.",
        "The Sketch Engine has been used, for lexicography and for linguistic research, for around twenty languages to date.",
        "In this paper, we apply the Sketch Engine to German.",
        "German occupies an intermediate position between configura-tional languages like English, which encode grammatical relations (e.g. subject-hood, object-hood, etc.)",
        "through the position of constituents, and case languages where morphological marking identifies grammatical relations, leaving a freer constituent order.",
        "German also has a number of sentence patterns which specify the position of the finite verb, and once the verb position is specified, noun phrases are subject to a considerable amount of scrambling.",
        "In addition, around 80% of noun phrases are case-ambiguous (Evert, 2004).",
        "These factors present challenges in the development of word sketches for German.",
        "We evaluate different options for designing a German sketch grammar.",
        "The evaluation relies on a gold standard corpus of 1,000 test sentences annotated with noun phrase structure and case.",
        "For German, NP case is central to creating useful word sketches.",
        "The gold standard corpus lets us compute precision and recall for NP case identification.",
        "Our results are comparable to other shallow grammars of German, but inferior to results achieved using more sophisticated parsing frameworks.",
        "We outline how we plan to improve German word sketches using a richer framework.",
        "Like other language technologies, a sketch grammar and the resulting word sketches might be evaluated from either of two perspectives: the developers' or the users'.",
        "The developer is interested in improving the system, so the evaluation needs to distinguish the contributions of different modules and show where changes in the method improve performance.",
        "By contrast the user is interested in the system as a whole, and whether it can support them in their work.",
        "This paper takes the developer's view; a complementary evaluation which assesses word sketches as a tool for users (who are lexicographers), across five languages, is currently in progress."
      ]
    },
    {
      "heading": "2.. The Sketch Engine",
      "text": [
        "The Sketch Engine, like other corpus tools, can be used for concordancing, and has a full range of functions for specifying, sorting and extracting keywords from concordances.",
        "Its distinctive feature is however word sketches.",
        "Word sketches are summaries of a word's behaviour based on a sketch grammar, which is used to identify collocations in a range of grammatical relations to the headword.",
        "Given a sketch grammar and a part-of-speech-tagged corpus, the system extracts lexical relations, between e.g. nouns and their attributive adjectives, verbs and their subjects, verbs and their objects, elements of a conjunction etc.",
        "The word sketch for a word presents a list of its collocates, organised according to the grammatical relation they stand in to the headword and sorted according to co-occurrence significance.",
        "For an example see Tables 1 and 2.",
        "The sketch grammar defines linear patterns in the form of regular expressions, and the participants of the grammatical relations are marked.",
        "Context may be provided by describing the intervening and surrounding words and/or structures within the regular expression.",
        "So far, sketch grammars have been produced for a range of languages, both configurational (for example English (Kilgarriff et al., 2004) and Chinese (Kilgarriff et al., 2005)) and languages which have a detailed case morphology (including Slovene (Krek and Kilgarriff, 2006) and Czech (Kilgarriff et al., 2004))."
      ]
    },
    {
      "heading": "3.. Characteristics of German",
      "text": [
        "The writer of a German sketch grammar faces three types of problems arising from the sentence structure of the language.",
        "Firstly, more work is to be done than for a con-igurational language, as German has several models of constituent order (verb-initial, verb-second and verb-inal).",
        "Secondly, these models allow for considerable freedom in the placement of noun phrases and prepositional phrases (in the Mittelfeld).",
        "Thirdly, only about 21% of all NP tokens in a news corpus are unambiguous with respect to case (Evert, 2004).",
        "Another 21% are fully ambiguous, and 58% are two-or three-way ambiguous.",
        "The ambiguity rate of individual elements of NPs, i.e. determiners, adjectives and nouns, taken in isolation, is even higher.",
        "The following example, taken from a German administrative text, illustrates these problems.",
        "(1) wenn die Mitgliedsstaaten der Gemeinschaft solche Vorschriften erlassen,...",
        "'if the member states of the Community enact such regulations, .",
        ".",
        ".",
        "In (1), die Mitgliedsstaaten and solche Vorschriften can both be either nominative or accusative, thus subject or object.",
        "The NP der Gemeinschaft can be a genitive (adjunct to the preceding noun) or a dative (complement or free dative), and the verb erlassen can take two arguments (subject and object) or three (subject, object and indirect object in the dative).",
        "The order of the three NPs could be scrambled (at least under certain information structural conditions), and PPs and/or adverbs (e.g. local or temporal adjuncts) could be placed between the NPs.",
        "The same is possible under the two other verb placement models."
      ]
    },
    {
      "heading": "4.. Corpora, tools and tagsets",
      "text": [
        "For work on large German corpora, standard low-level annotation tools are available for tokenising, part-of-speech-tagging and lemmatisation.",
        "Our corpus is DeWaC, a 1.6 billion word corpus of German drawn from the web (Ba-roni and Kilgarriff (2006)).",
        "The corpus is tokenised, lemmatised and part-of-speech-tagged by the Tree Tagger (Schmid, 1994) using the Stuttgart-Tübingen TagSet (STTS, Schilleretal.",
        "(1999)).",
        "STTS is coarse-grained.",
        "It provides just one tag each for common nouns and articles, whatever their case, gender or number, and the only distinction it makes for adjectives is between attributive and predicative.",
        "For verbs it does not identify tense, person or number.",
        "As a point of comparison, all tagsets for English, however coarse-grained, distinguish singular and plural nouns.",
        "A tagset following the MULTEXT model would provide slots for case, gender and number for nouns, adjectives and articles, and for number, tense and person for verbs (Multext, 1995).",
        "There are, however, various arguments for making more, or less, fine-grained tagsets; in addition, it is more difficult to determine nominal case, gender and number on a word basis (without disambiguating context) in German than in English (cf.",
        "Section 3).",
        "Thus, STTS allows POS-taggers to avoid guessing in difficult cases where they would be likely to make many errors.",
        "Concerning the sketch grammar, however, this means that we need to establish nominal case, if verb+subject and verb+object pairs are to be found with any confidence.",
        "A considerable part of the work invested in the creation of a German sketch grammar was devoted to providing or approximating exactly this type of data."
      ]
    },
    {
      "heading": "5.. A sketch grammar for German",
      "text": [
        "A simple example of a sketch grammar rule is the following, for extracting adjective-noun collocations:",
        "2:[tag=\"ADJA\"] 1:[tag=\"NE|NN\"] The rule has two anchors, a noun (marked by 1 , with a disjunction of part-of-speech tags NE for proper names and NN for common nouns), and an attributive adjective (marked by '2', with part-of-speech tag 'ADJA').",
        "The rule can be used to cover both the modifier and the modifiee relationship between adjective and noun.",
        "Thus, one obtains a list of modified nouns for an adjective within the adjective s word sketch, and a list of modifying adjectives for a noun within the noun s word sketch, as Tables 1 and 2 illustrate for the adjective klein 'small' and the noun Dorf 'village'.",
        "The first column in each table lists the collocate and an English gloss, the second gives the collocation frequency and the third, the salience score for the collocation.",
        "The tables show the 10 most prominent collocates, sorted by significance.",
        "The grammar defines twelve grammatical relations, covering attributive and predicative adjectives, noun phrase functions (subjects and direct and indirect objects of verbs, genitive modification), prepositional phrases, conjunctions and disjunctions, and verb particles.",
        "The German grammar does not include sentential complements, and is restricted to active clauses only.",
        "Passives, which pose the same problems of scrambling and add sub-patterns for the placement of auxiliaries and participles (Heid and Weller, 2008) have not yet been addressed.",
        "Most of the grammar rules are as simple as the above example suggests.",
        "Verb subcategorisation is not.",
        "It relies heavily on identifying noun phrases and noun phrase case.",
        "Relations between verbs and subcategorised-for nouns are central to any account of collocation, so the definition of noun phrases and their combination within subcategorisation is a crucial task for a sketch grammar.",
        "Once noun phrases (and their cases) are identified, assigning syntactic functions is relatively straightforward.",
        "Providing subcategori-sation data has two sub-tasks, (1) the identification of noun phrases and their case; (2) the identification of clause patterns.",
        "We explored different strategies for each.",
        "Nouns modified by adjective klein 'small'.",
        "Adjectives modifying the noun Dorf'village .",
        "Simple German NP structures can be extracted by the following regular expression:",
        "det?",
        "adv* adja* noun",
        "covering a linear sequence of a (possible) determiner, zero to several adverbs, zero to several attributive adjectives, and a noun.",
        "Problems arise as soon as one is interested in the cases and grammatical functions of the NPs.",
        "Complete disambiguation of NP case with both recall and precision of 100% may not be possible, but there are various strategies that provide linguistic knowledge in addition to the lemmas and the part-of-speech tags in the corpus data.",
        "In general, additional knowledge constrains the search: we get higher recall and less precision with underspecified queries, and higher precision but less recall for the more specific queries.",
        "For testing purposes, we use different versions of the sketch grammar, where we include different amounts of linguistic knowledge to identify the case (and thus the grammatical function) of the NPs:",
        "Morphological restrictions",
        "inflections The inflection of determiners and adjectives, by itself or together with information about the number and gender of nouns (see next item) disambiguates many NPs; we write a disjunctive set of specific rules to account for these inter-relationships.",
        "For example, specifying a determiner ending of em in combination with an adjective ending of en disambiguates the NP case to dative.",
        "affix-gender There are regularities between derivational affixes and the gender of nouns; we partition derived nominals into three subsets according to gender.",
        "The suffixes -heit, -schaft, -ine amongst others indicate feminine nouns and the suffixes -ismus, -ist indicate masculine nouns.",
        "In combination with determiner and/or adjective endings, the gender information disambiguates case.",
        "For example, the basic pattern det noun with the determiner den (which is ambiguous between accusative singular and dative plural) is disambiguated to dative plural where the noun is feminine.",
        "Structural restrictions",
        "no-structure We do not take any sentence structure into account at all.",
        "verb-final We only consider verb-final clauses.",
        "This puts the strongest restrictions on sentence structure.",
        "German verb-final clauses are sub-clauses that constitute around 20% of the data.",
        "They contain all subcategorisation-relevant material between a subordinating conjunction and the finite verb form and thus provide a clearly delimited domain for finding the complements (Eckle, 1999).",
        "Furthermore, NPs put restrictions on each other: a sub-clause with transitive frame might contain a nominative and an accusative NP in either order, but not two nominative or two accusative NPs.",
        "The sketch grammar for verb-final clauses uses the NP models and checks for patterns where one, two or three NP complements appear with the verb, in all possible constituent order permutations.",
        "In addition to the complements, we allow various types of modifications (such as adverbial phrases).",
        "all-clauses Here we also take structural information into account, but not restricted to verb-final clauses.",
        "We model all clause types (verb-initial, verb-second, verbfinal) at the same time.",
        "This knowledge type puts less restrictions on the clause types that are taken into account but at the same time allows more confusion between NP cases, as we are going beyond the clearly delimited domain of verb-final clauses.",
        "We consider inflection to be the minimum information that we might use.",
        "affix-gender disambiguates some previously unclear noun cases but substantially restricts recall.",
        "The same applies to the structural restrictions in verb-final and all-clauses.",
        "We tested various combinations of the above linguistic knowledge levels, cf. Table 3.",
        "Note that we did not use a lexicon to establish gender or case in any of the conditions; we plan to do this in future work.",
        "no affix-gender no-structure; x verb-final; with affix-gender all-clauses 5.2.",
        "Processing inside and outside the Sketch Engine Additional linguistic input may be provided in corpus preprocessing by a POS-tagger or parser, or it may be provided within a sketch grammar.",
        "We began by preparing sketch grammar rules for identifying case (and, as part of that process, sometimes number and gender) for noun phrases.",
        "These rules became complex, and began taking a long time to run.",
        "On investigating the problem, we realised that we were sometimes recomputing a noun s case many times over, as the system tried to find all the ways in which each sketch-grammar clause might match a sentence.",
        "So we took the rules for assigning case and applied them as a pre-process, with the result being stored as an attribute of the word.",
        "The attribute was then indexed and was available for using in higher-level processing to find grammatical relations.",
        "The functionality was unchanged, but the implementation was markedly more efficient and it was possible to build word sketches for large corpora in reasonable time.",
        "Viewed in this way, we implemented a specialist POStagger which takes STTS-tagged data as input and returns data tagged according to a finer-grained tagset, in particular with nouns marked for case.",
        "Modified nouns",
        "Freq",
        "Sign",
        "Ausschnitt",
        "'extract'",
        "188",
        "37.49",
        "Junge",
        "'boy",
        "325",
        "33.91",
        "Dorf",
        "'village",
        "274",
        "32.80",
        "Meerjungfrau",
        "'mermaid",
        "46",
        "31.19",
        "Madchen",
        "'girl",
        "352",
        "30.88",
        "Gruppe",
        "'group",
        "627",
        "29.34",
        "Nenner",
        "'denominator",
        "61",
        "27.93",
        "Detail",
        "'detail",
        "169",
        "27.76",
        "Würfel",
        "'dice",
        "68",
        "27.47",
        "Schönheitsfehler",
        "'flaw'",
        "23",
        "27.22",
        "Modifying adjectives",
        "Freq",
        "Sign",
        "klein",
        "'small'",
        "274",
        "37.68",
        "umliegend",
        "'surrounding",
        "39",
        "37.30",
        "malerisch",
        "'picturesque",
        "20",
        "28.96",
        "entlegen",
        "'remote",
        "16",
        "28.58",
        "verschlafen",
        "'sleepy",
        "12",
        "26.18",
        "gelegen",
        "'situated",
        "26",
        "26.05",
        "zerstört",
        "'destroyed",
        "17",
        "25.52",
        "ganz",
        "'whole",
        "118",
        "25.44",
        "abgelegen",
        "'remote",
        "13",
        "25.15",
        "kurdisch",
        "'Kurdish'",
        "16",
        "24.54",
        "As the gold standard, we use 1,000 randomly selected sentences from the DeWaC corpus, manually annotated for NPs by one of the co-authors.",
        "We annotated start and end point, and case.",
        "Examples (2)-(3) present three sentences from our gold standard annotation.",
        "The beginning and end point are marked by the brackets; the end bracket is accompanied by the NP case label.",
        "In total, the gold standard contains 1,709 NPs with nominative case, 618 NPs with accusative case, 149 NPs with dative case, and 437 NPs with genitive case.",
        "(2) Doch auch [den Terroristen]NPdat gelingt [die Flucht] N Pnom ■ 'But also the terrorists succeed in the getaway.",
        "(3) [Ich]NPnom musste [meine Arbeit]NPakk schon sehr gut machen, um anerkannt zu werden ■ 'I have to do my work really well to be approved.'",
        "The sketch grammar is applied to this test corpus in six conditions, resulting from the combinations in Table 3:"
      ]
    },
    {
      "heading": "1.. inflection + no-structure",
      "text": []
    },
    {
      "heading": "2.. inflection + affix-gender + no-structure",
      "text": []
    },
    {
      "heading": "3.. inflection + verb-final",
      "text": []
    },
    {
      "heading": "4.. inflection + affix-gender + verb-final",
      "text": []
    },
    {
      "heading": "5.. inflection + all-clauses",
      "text": []
    },
    {
      "heading": "6.. inflection + affix-gender + all-clauses",
      "text": [
        "Tables 4 and 5 present two example word sketches, for the verb offnen 'open' and the noun Pflanze 'plant', in German only.",
        "The word sketches list all grammatical relations the respective headwords appear with in our corpus, followed by the 20 most significant collocates that have a minimum joint frequency of 3 with the headword.",
        "subj/subj-of refers to the subjects of the verb, obj-acc and obj-dat to accusative and dative objects, adv to adverbs, attr-adj to attributive adjectives, gen-atr/gen-atr-of to genitive attributes, and and/or to conjunctions and disjunctions.",
        "The sketches were created by condition 6.",
        "Table 4 illustrates the distinct NP cases that underlie subj vs. obj-acc vs. obj-dat: The strong overlap between subj and obj-acc on the one hand results from the verb offnen that can but need not be used as a reflexive verb; on the other hand, this shows the difficulty to distinguish nominative and accusative case.",
        "obj-dat is dominated by personal pronouns, as offnen is often accompanied by a benefactive.",
        "Table 6 presents the precision and recall in the six conditions.",
        "An NP that is extracted by our grammar is counted as \"correct\" if the end point of the NP (indicating the nominal head) and the case label are both identical to the gold standard annotation.",
        "The left half of the table presents the results for the three conditions without affix-gender and the right half presents the results for conditions with it.",
        "Since our sketch grammar does not incorporate the subcategori-sation of genitive NPs (as there are only few German verbs that subcategorise for a genitive case, we only consider NPs for genitive modification), conditions 3 and 4 that restrict the grammar to verb-final clauses are not implemented for genitive case and thus missing in the table.",
        "Mistakes that are made by the grammar might be contributed either to the corpus data (which includes incomplete and incorrect sentences), to the preprocessing (which can go wrong in assigning part-of-speech tags, or lemmas), or to the sketch grammar itself.",
        "It would be a further task to separate these various sources of noise, and thus the results refer to overall success.",
        "Comparing condition 1 with condition 2 describes the effect of adding derivational gender information to the NP definition.",
        "Recall falls for all NP cases; precision increases.",
        "Comparing condition 1 with condition 3 and comparing condition 2 with condition 4 describes the effect of restricting the NP search to verb-final clauses.",
        "Recall goes down greatly (as we are only considering ca.",
        "20% of all clauses now) and precision rises.",
        "The decrease of recall and the increase of precision are both stronger in condition 3 than in condition 2, showing that the limitation by verb-final clause structure is more severe than the limitation by affix gender.",
        "Comparing condition 1 with condition 5 and comparing condition 2 with condition 6 describes the effect of adding sentence structure to the NP descriptions without restricting the NP search to a certain clause type.",
        "Again, recall falls and precision rises.",
        "In comparison to conditions 3 and 4, the effect is less strong, because we allowed all clause types.",
        "In contrast to our expectations, the precision values for accusative and dative case are better in conditions 5/6 than in conditions 3/4.",
        "The overall best precision and recall results are in bold in the table.",
        "Unsurprisingly, the recall is largest in condition 1, with least restrictions.",
        "The best precision, however, is, in three out of four cases, not achieved by condition 4, the most restricted version of the grammar, but by condition 6, which takes all clause types into account.",
        "This result demonstrates that structural information helps the grammar but need not be restricted to the clearly delimited type.",
        "subj",
        "3017",
        "5.1",
        "obj-acc",
        "282",
        "5.9",
        "obj-dat",
        "136",
        "5.4",
        "adv",
        "140",
        "5.2",
        "Tur",
        "238",
        "49.37",
        "Tur",
        "39",
        "36.24",
        "ihr",
        "13",
        "19.98",
        "täglich",
        "12",
        "22.68",
        "Pforte",
        "35",
        "35.20",
        "Auge",
        "26",
        "26.67",
        "sie",
        "8",
        "19.40",
        "versehentlich",
        "3",
        "16.92",
        "Ture",
        "29",
        "33.78",
        "Pforte",
        "7",
        "22.71",
        "er",
        "9",
        "18.96",
        "leicht",
        "6",
        "13.89",
        "Tor",
        "62",
        "32.34",
        "Wohnungstur",
        "3",
        "21.61",
        "wir",
        "16",
        "16.62",
        "weit",
        "13",
        "13.61",
        "Auge",
        "114",
        "32.29",
        "Ture",
        "5",
        "19.38",
        "Markt",
        "3",
        "9.04",
        "gleichzeitig",
        "4",
        "12.37",
        "Fenster",
        "49",
        "28.69",
        "Datei",
        "4",
        "12.23",
        "ich",
        "6",
        "7.86",
        "automatisch",
        "3",
        "11.42",
        "Schleuse",
        "10",
        "23.27",
        "Tor",
        "4",
        "11.7",
        "endlich",
        "3",
        "11.25",
        "GAT-Bereich",
        "4",
        "19.16",
        "Fenster",
        "3",
        "9.32",
        "langsam",
        "3",
        "10.97",
        "Haustur",
        "8",
        "18.88",
        "Herz",
        "3",
        "7.72",
        "plotzlich",
        "3",
        "10.94",
        "Klappe",
        "8",
        "18.20",
        "erneut",
        "3",
        "9.90",
        "Hangartor",
        "3",
        "15.93",
        "schnell",
        "3",
        "8.30",
        "Datei",
        "13",
        "15.51",
        "erst",
        "3",
        "4.05",
        "Schere",
        "6",
        "14.77",
        "and/or",
        "90",
        "0.7",
        "Luke",
        "4",
        "14.49",
        "schließen",
        "33",
        "35.85",
        "Herz",
        "19",
        "14.41",
        "herunterladen",
        "3",
        "18.83",
        "Schublade",
        "6",
        "14.08",
        "lesen",
        "4",
        "12.65",
        "Zimmertur",
        "3",
        "14.00",
        "Wurmloch",
        "3",
        "13.91",
        "Holztur",
        "3",
        "13.57",
        "Reiseland",
        "4",
        "13.42",
        "attr-adj",
        "1566",
        "2.0",
        "subj-of",
        "905",
        "2.5",
        "and/or",
        "379",
        "2.7",
        "gen-atr-of",
        "601",
        "2.0",
        "gentechnisch",
        "94",
        "47.14",
        "wachsen",
        "26",
        "24.45",
        "Tier",
        "218",
        "56.82",
        "Anbau",
        "20",
        "30.63",
        "verändert",
        "100",
        "42.3",
        "gedeihen",
        "6",
        "18.46",
        "Pflanzenteil",
        "9",
        "29.08",
        "Lebensraum",
        "10",
        "20.25",
        "genmanipuliert",
        "30",
        "39.44",
        "anbauen",
        "5",
        "18.30",
        "Baum",
        "12",
        "20.87",
        "Bestaubung",
        "4",
        "20.17",
        "fleischfressend",
        "16",
        "35.93",
        "werden",
        "73",
        "15.91",
        "Mikroorganismus",
        "6",
        "20.13",
        "Blatt",
        "13",
        "20.15",
        "transgenen",
        "16",
        "34.59",
        "konnen",
        "44",
        "15.15",
        "Tierwelt",
        "4",
        "17.24",
        "Wachstum",
        "13",
        "19.51",
        "exotisch",
        "24",
        "30.00",
        "sollen",
        "30",
        "15.03",
        "Blume",
        "6",
        "16.92",
        "Wurzelbereich",
        "3",
        "19.16",
        "transgener",
        "8",
        "28.45",
        "gießen",
        "4",
        "14.52",
        "Frucht",
        "6",
        "14.28",
        "Metamorphose",
        "5",
        "18.09",
        "giftig",
        "18",
        "26.44",
        "graben",
        "4",
        "14.37",
        "Strauch",
        "3",
        "13.10",
        "Nährstoffbedarf",
        "3",
        "17.90",
        "heimisch",
        "20",
        "23.37",
        "sein",
        "109",
        "14.01",
        "Tierart",
        "3",
        "12.02",
        "Same",
        "5",
        "15.79",
        "manipuliert",
        "10",
        "23.30",
        "bluhen",
        "4",
        "13.48",
        "Stein",
        "4",
        "11.04",
        "Wurzel",
        "8",
        "15.67",
        "abgestorben",
        "9",
        "23.27",
        "müssen",
        "22",
        "12.65",
        "Gebaude",
        "3",
        "6.91",
        "Freisetzung",
        "4",
        "14.96",
        "wachsend",
        "25",
        "22.89",
        "fressen",
        "4",
        "12.15",
        "Produkt",
        "3",
        "6.02",
        "Gedeihen",
        "3",
        "14.43",
        "genverandert",
        "6",
        "22.73",
        "vermehren",
        "3",
        "11.36",
        "Biochemie",
        "3",
        "14.21",
        "geschadigt",
        "10",
        "21.23",
        "brauchen",
        "9",
        "11.27",
        "gen-atr",
        "108",
        "0.4",
        "Wasserversorgung",
        "4",
        "14.03",
        "krautige",
        "4",
        "20.69",
        "ausbreiten",
        "3",
        "11.15",
        "Bibel",
        "4",
        "14.83",
        "Monitoring",
        "3",
        "13.95",
        "selten",
        "20",
        "20.58",
        "befallen",
        "3",
        "10.92",
        "Art",
        "9",
        "14.56",
        "Aussterben",
        "3",
        "13.61",
        "schnellwachsend",
        "4",
        "19.39",
        "hervorbringen",
        "3",
        "10.86",
        "Monat",
        "5",
        "13.32",
        "Pflege",
        "6",
        "12.60",
        "robust",
        "8",
        "18.99",
        "entwickeln",
        "7",
        "10.43",
        "Baum",
        "3",
        "11.02",
        "Aussehen",
        "4",
        "12.56",
        "genetisch",
        "14",
        "18.44",
        "auswahlen",
        "3",
        "10.35",
        "Insel",
        "3",
        "10.33",
        "Auswahl",
        "7",
        "12.54",
        "tropisch",
        "9",
        "18.19",
        "haben",
        "42",
        "10.20",
        "Erde",
        "3",
        "9.79",
        "Systematik",
        "3",
        "11.85",
        "Case",
        "N",
        "Conditions",
        "incl.",
        "inflection",
        "incl.",
        "inflection + affix-gender",
        "1",
        "3",
        "5",
        "2",
        "4",
        "6",
        "R",
        "P",
        "R",
        "P",
        "R",
        "P",
        "R",
        "P",
        "R",
        "P",
        "R",
        "P",
        "Nominative",
        "1,709",
        "85",
        "28",
        "7",
        "76",
        "26",
        "65",
        "43",
        "53",
        "9",
        "81",
        "28",
        "60",
        "Accusative",
        "618",
        "64",
        "24",
        "6",
        "37",
        "18",
        "41",
        "51",
        "30",
        "6",
        "35",
        "14",
        "45",
        "Dative",
        "149",
        "62",
        "9",
        "21",
        "34",
        "41",
        "35",
        "55",
        "13",
        "25",
        "59",
        "40",
        "T4",
        "Genitive",
        "437",
        "T8",
        "34",
        "65",
        "79",
        "57",
        "44",
        "60",
        "82",
        "To the best of our knowledge nobody has performed the identical task before.",
        "Closest to our work are probably German noun chunkers (Brants, 1999; Schmid and Schulte im Walde, 2000) and work on automatic extraction of German verb subcategorisation (Eckle, 1999; Wauschkuhn, 1999; Schulte im Walde, 2002).",
        "Brants used Cascaded Markov Models to identify NP and PP chunks.",
        "He acheived up to 84.5% recall and 91.4% precision.",
        "However, he only evaluated the chunk structures but not the chunk labels, so it is dificult to compare his results with ours.",
        "Schmid and Schulte im Walde evaluated NP case labels in addition to the chunk structure, resulting in 83/84% recall and precision.",
        "Their results are considerably above ours, which can be attributed to their deeper approach.",
        "They used probabilistic context-free grammars.",
        "Concerning verb subcategorisation acquisition, Eckle's methods were similar to ours, also being based on regular expressions over POS-tags and using morphosyntactic and structural constraints.",
        "Her objective was to obtain high-precision results, and she reported a recall of ca.",
        "2%, with a precision of over 90%.",
        "Wauschkuhn's deeper, context-free grammar approach achieved a recall of 56.60% and a precision of 68.20%.",
        "The even deeper approach by Schulte im Walde achieved a recall of 69.74% and a precision 74.53%.",
        "Schulte im Walde (2008) provides an overview of approaches.",
        "The differences in these results demonstrate how deeper approaches, usually requiring more input form linguists, result in higher precision and recall, whereas with shallow approaches, either precision or recall is sacriiced.",
        "Our approach is closest to Eckle's, in both method and results."
      ]
    },
    {
      "heading": "6.. Discussion 6.1. Precision against recall",
      "text": [
        "In the short term, our question is how to trade off precision against recall, to give the best output.",
        "Once the corpus and linguistic markup are given, the appropriate recall-precision tradeoff depends on users.",
        "As mentioned in the introduction, a user-oriented evaluation which may give some clues is currently under way.",
        "Different users may have different preferences, with respect to the application the word sketches are intended for.",
        "A lexicographer, for example, who relies on the availability of information that is as correct as possible (and who is potentially under time pressure to choose from the available word sketches), might prefer high precision over high recall.",
        "In contrast, a computational linguist who is interested in as much information as possible, even with low significance values, to avoid the sparse data problem, might prefer high recall over high precision.",
        "In sum, from a user's perspective, the German sketch grammar should be chosen according to the predominant application of the word sketches.",
        "Since we intend only to maintain one public version of the German sketch grammar, we shall be making the judgement according to the likely preferences of our \"lead users\", lexicographers and linguists studying lexis and grammar.",
        "Working in our favour is the size of the corpus.",
        "In general the quality of a word sketch depends on the number of occurrences of a word in the corpus: a rule of thumb is that 600 instances give a good-quality sketch.",
        "So, for high-frequency words, even a small corpus will give a high-quality sketch, but for rarer words, the corpus needs to be very large for there to be high-quality word sketches for rarer words.",
        "Consider a word like Waldbrand 'forest fire'.",
        "The lemma has 1,976 instances in deWaC, and a healthy word sketch.",
        "In a BNC-sized corpus, one would expect around 120 instances: not enough for a good word sketch.",
        "The rule-of-thumb of 600 is critically dependent on the recall of the sketch grammar.",
        "We may look at our word sketch for Waldbrand, find that it is too noisy, identify the looseness in the sketch grammar that allowed the noise to creep in, and add further constraints to improve the sketch gram-mmar precision, at a cost to recall.",
        "Since Waldbrand, with 1,976, had ample data, it is likely that it will still have enough for a cleaner, higher-quality word sketch even after we have tightened the grammar.",
        "If, for example, we apply condition 6 with the effect of excluding around two thirds of the data from consideration when seeking subcat-egorisation patterns, we are still using a dataset of one third of 1,976 - over the 600 mark for Waldbrand and probably enough for a good word sketch.",
        "We also note that word sketches are often much cleaner than recall and precision figures calculated over data instances (as above) might lead us to expect.",
        "The statistical sorting makes the system robust: even if there are many errors, they tend to be spread between different potential collocates, so, given large corpora, they rarely result in any single non-collocate getting a high enough salience score to appear in the word sketch.",
        "For the longer term, the message is simple.",
        "Richer linguistic analysis gives better performance.",
        "A simple way to improve performance will be to integrate lexical lookup for finding noun gender, which will enable us to unambiguously establish noun case in more cases.",
        "This will be part of a further strategy to prepare a POStagger which includes case, number and gender information in its output.",
        "The tagger might operate standalone, or as a post processor which takes as its input data already tagged by Tree Tagger using the STTS tagset, as in our experiments.",
        "We are also looking into using parsers to pre-process the data.",
        "(Initial experiments have been undertaken for English.)",
        "While this paper has discussed sketch grammars, the Sketch Engine is also equipped to generate word sketches directly from parser output, without using a sketch grammar at all.",
        "Clearly, speed is a constraint: parsing 1.6 billion words is prohibitive for most parsers.",
        "We may also ask, how do our evaluation results transfer to other sketch grammars?",
        "Obviously, the German grammar is highly language-specific, so there cannot be any direct transfer of grammar rules (other than some trivial ones, such as adjective-noun combinations).",
        "However, we believe that the general methodology of integrating linguistic knowledge into the grammar rules to various degrees, in order to control for precision vs. recall of the grammar, is relevant to other languages as well.",
        "This general idea is not novel, of course, but this paper demonstrates how strong the effects of the grammar restrictions are, and thus how important it is to integrate and compare the various grammar parameters."
      ]
    },
    {
      "heading": "7.. Conclusions",
      "text": [
        "The paper set out to apply the Sketch Engine framework to German and to evaluate against manually annotated data.",
        "We selected German NPs as a test scenario, assuming that NP case is a crucial ingredient when extracting sub-categorised verb complements and building useful word sketches.",
        "Furthermore, they are relatively easy to annotate, since in context they are easily disambiguated by the human reader.",
        "Our sketch grammar defined NPs with respect to six linguistic conditions, taking inflectional and derivational information as well as sentence structure into account.",
        "As expected, if we restrict the rules, we get higher precision and lower recall.",
        "The recall is largest in the condition which puts the least restrictions on the sketch grammar definitions; the best precision is reached in the condition that incorporates inflectional and derivational information and in addition takes all clause types (and not only the clearly delimited type) into account.",
        "The overall results are being evaluated by users in a separate study.",
        "Which German sketch grammar to choose (according to precision vs. recall values) should be decided according to the predominant application of the word sketches.",
        "The study has shown that the methods we have used are inferior to methods using richer linguistic inputs.",
        "This sets an agenda for us to improve German word sketches, by exploiting a lexicon to find noun gender, reviewing pos-tagging and in particular, the tagset we have been using, and, in the longer term, using richer parsing strategies."
      ]
    }
  ]
}
