{
  "info": {
    "authors": [
      "Yuk Wah Wong",
      "Raymond J. Mooney"
    ],
    "book": "45th Annual Meeting of the Association of Computational Linguistics",
    "id": "acl-P07-1121",
    "title": "Learning Synchronous Grammars for Semantic Parsing with Lambda Calculus",
    "url": "https://aclweb.org/anthology/P07-1121",
    "year": 2007
  },
  "references": [
    "acl-J03-1002",
    "acl-J05-1003",
    "acl-J97-3002",
    "acl-N06-1056",
    "acl-N07-1022",
    "acl-P01-1067",
    "acl-P03-1067",
    "acl-P05-1033",
    "acl-P06-1121",
    "acl-W04-0818"
  ],
  "sections": [
    {
      "text": [
        "Learning Synchronous Grammars for Semantic Parsing with",
        "Lambda Calculus",
        "Yuk Wah Wong and Raymond J. Mooney Department of Computer Sciences The University of Texas at Austin",
        "This paper presents the first empirical results to our knowledge on learning synchronous grammars that generate logical forms.",
        "Using statistical machine translation techniques, a semantic parser based on a synchronous context-free grammar augmented with Aoperators is learned given a set of training sentences and their correct logical forms.",
        "The resulting parser is shown to be the best-performing system so far in a database query domain."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Originally developed as a theory of compiling programming languages (Aho and Ullman, 1972), synchronous grammars have seen a surge of interest recently in the statistical machine translation (SMT) community as a way of formalizing syntax-based translation models between natural languages (NL).",
        "In generating multiple parse trees in a single derivation, synchronous grammars are ideal for modeling syntax-based translation because they describe not only the hierarchical structures of a sentence and its translation, but also the exact correspondence between their sub-parts.",
        "Among the grammar formalisms successfully put into use in syntax-based SMT are synchronous context-free grammars (SCFG) (Wu, 1997) and synchronous tree-substitution grammars (STSG) (Yamada and Knight, 2001).",
        "Both formalisms have led to SMT systems whose performance is state-of-the-art (Chiang, 2005; Galley et al., 2006).",
        "Synchronous grammars have also been used in other NLP tasks, most notably semantic parsing, which is the construction of a complete, formal meaning representation (MR) of an NL sentence.",
        "In our previous work (Wong and Mooney, 2006), semantic parsing is cast as a machine translation task, where an SCFG is used to model the translation of an NL into a formal meaning-representation language (MRL).",
        "Our algorithm, Wasp, uses statistical models developed for syntax-based SMT for lexical learning and parse disambiguation.",
        "The result is a robust semantic parser that gives good performance in various domains.",
        "More recently, we show that our SCFG-based parser can be inverted to produce a state-of-the-art NL generator, where a formal MRL is translated into an NL (Wong and Mooney, 2007).",
        "Currently, the use of learned synchronous grammars in semantic parsing and NL generation is limited to simple MRLs that are free of logical variables.",
        "This is because grammar formalisms such as SCFG do not have a principled mechanism for handling logical variables.",
        "This is unfortunate because most existing work on computational semantics is based on predicate logic, where logical variables play an important role (Blackburn and Bos, 2005).",
        "For some domains, this problem can be avoided by transforming a logical language into a variable-free, functional language (e.g. the Geoquery functional query language in Wong and Mooney (2006)).",
        "However, development of such a functional language is non-trivial, and as we will see, logical languages can be more appropriate for certain domains.",
        "On the other hand, most existing methods for mapping NL sentences to logical forms involve substantial handwritten components that are difficult to maintain (Joshi and Vijay-Shanker, 2001; Bayer et al., 2004; Bos, 2005).",
        "Zettlemoyer and Collins (2005) present a statistical method that is considerably more robust, but it still relies on handwritten rules for lexical acquisition, which can create a performance bottleneck.",
        "In this work, we show that methods developed for SMT can be brought to bear on tasks where logical forms are involved, such as semantic parsing.",
        "In particular, we extend the WASP semantic parsing algorithm by adding variable-binding A-operators to the underlying SCFG.",
        "The resulting synchronous grammar generates logical forms using A-calculus (Montague, 1970).",
        "A semantic parser is learned given a set of sentences and their correct logical forms using SMT methods.",
        "The new algorithm is called A-WASP, and is shown to be the best-performing system so far in the GEOQUERY domain."
      ]
    },
    {
      "heading": "2. Test Domain",
      "text": [
        "In this work, we mainly consider the GEOQUERY domain, where a query language based on Prolog is used to query a database on U.S. geography (Zelle and Mooney, 1996).",
        "The query language consists of logical forms augmented with meta-predicates for concepts such as smallest and count.",
        "Figure 1 shows two sample logical forms and their English glosses.",
        "Throughout this paper, we use the notation #i, x2,... for logical variables.",
        "Although Prolog logical forms are the main focus of this paper, our algorithm makes minimal assumptions about the target MRL.",
        "The only restriction on the MRL is that it be defined by an unambiguous context-free grammar (CFG) that divides a logical form into subformulas (and terms into subterms).",
        "Figure 2(a) shows a sample parse tree of a logical form, where each CFG production corresponds to a subformula."
      ]
    },
    {
      "heading": "3. The Semantic Parsing Algorithm",
      "text": [
        "Our work is based on the WASP semantic parsing algorithm (Wong and Mooney, 2006), which translates NL sentences into MRs using an SCFG.",
        "In WASP, each SCFG production has the following form:",
        "where a is an NL phrase and // is the MR translation of a.",
        "Both a and // are strings of terminal and nonterminal symbols.",
        "Each non-terminal in a appears in / exactly once.",
        "We use indices to show the correspondence between non-terminals in a and / .",
        "All derivations start with a pair of co-indexed start symbols, , £q]).",
        "Each step of a derivation involves the rewriting of a pair of co-indexed non-terminals by the same SCFG production.",
        "The yield of a derivation is a pair of terminal strings, (e, f), where e is an NL sentence and f is the MR translation of e. For convenience, we call an SCFG production a rule throughout this paper.",
        "While WASP works well for target MRLs that are free of logical variables such as CLANG (Wong and Mooney, 2006), it cannot easily handle various kinds of logical forms used in computational semantics, such as predicate logic.",
        "The problem is that WASP lacks a principled mechanism for handling logical variables.",
        "In this work, we extend the WASP algorithm by adding a variable-binding mechanism based on A-calculus, which allows for compositional semantics for logical forms.",
        "This work is based on an extended version of SCFG, which we call A-SCFG, where each rule has the following form:",
        "where a is an NL phrase and / is the MR translation of a.",
        "Unlike (1), / is a string of terminals, non-terminals, and logical variables.",
        "The variable-binding operator A binds occurrences of the logical variables x1;..., xk in //, which makes Ax1... Axk.// a A-function of arity k. When applied to a list of arguments, (xil,..., xik), the A-function gives //a, where a is a substitution operator, {x1/xil,..., xk/xik}, that replaces all bound occurrences of xj in // with xij.",
        "If any of the arguments xij appear in // as a free variable (i.e. not bound by any A), then those free variables in / must be renamed before function application takes place.",
        "Each non-terminal Aj in / is followed by a list of arguments, Xj = (xj1,...",
        ",xjk.).",
        "During parsing, Aj must be rewritten by a A-function fj of arity kj.",
        "Like SCFG, a derivation starts with a pair of co-indexed start symbols and ends when all nonterminals have been rewritten.",
        "To compute the yield of a derivation, each fj is applied to its corresponding arguments Xj to obtain an MR string free of Aoperators with logical variables properly named.",
        "equal (x4, stateid(texas))))) How many major cities are in states bordering Texas?",
        "Query Query 1 1 answer FORM) answer FORM(x1))",
        "As a concrete example, Figure 2(b) shows an MR parse tree that corresponds to the English parse, [What is the [smallest [state] [by area]]], based on the A-SCFG rules in Figure 3.",
        "To compute the yield of this MR parse tree, we start from the leaf nodes: apply Ax1.state(x1) to the argument (x1), and Ax1.Ax2.area(x1, x2) to the arguments (x1;x2).",
        "This results in two MR strings: state(x1) and area(x1, x2).",
        "Substituting these MR strings for the FORM nonterminals in the parent node gives the A-function Ax1.smallest( x2,(state( x1),area( x1, x2))) .",
        "Applying this A-function to (x1) gives the MR string smallest( x2,(state( x1),area( x1, x2))) .",
        "Substituting this MR string for the FORM nonterminal in the grandparent node in turn gives the logical form in Figure 1(a).",
        "This is the yield of the MR parse tree, since the root node of the parse tree is reached.",
        "Given a set of training sentences paired with their correct logical forms, {(ei, fi)}, the main learning task is to find a A-SCFG, G, that covers the training data.",
        "Like most existing work on syntax-based SMT (Chiang, 2005; Galley et al., 2006), we construct G using rules extracted from word alignments.",
        "We use the K = 5 most probable word alignments for the training set given by GIZA++ (Och and Ney, 2003), with variable names ignored to reduce sparsity.",
        "Rules are then extracted from each word alignment as follows.",
        "To ground our discussion, we use the word alignment in Figure 4 as an example.",
        "To represent the logical form in Figure 4, we use its linearized parse – a list of MRL productions that generate the logical form, in top-down, leftmost order (cf.",
        "Figure 2(a)).",
        "Since the MRL grammar is unambiguous, every logical form has a unique linearized parse.",
        "We assume the alignment to be n-to-1, where each word is linked to at most one MRL production.",
        "Rules are extracted in a bottom-up manner, starting with MRL productions at the leaves of the MR parse tree, e.g. FORM – state (x1) in Figure 2(a).",
        "Given an MRL production, A – / , a rule A – (a, Axi1 ... Axik.//) is extracted such that: (1) a is the NL phrase linked to the MRL production; (2) xi1 , .",
        ".",
        ".",
        ", xik are the logical variables that appear in / and outside the current leaf node in the MR parse tree.",
        "If xi1,..., xik were not bound by A, they would become free variables in / , subject to renaming during function application (and therefore, invisible to the rest of the logical form).",
        "For example, since x1 is an argument of the state predicate as well as answer and area, x1 must be bound (cf. the corresponding tree node in Figure 2(b)).",
        "The rule extracted for the state predicate is shown in Figure 3.",
        "The case for the internal nodes of the MR parse tree is similar.",
        "Given an MRL production, A – //, where // contains non-terminals A1;..., An, a rule A – (a, Axi1 ... Axik.//') is extracted such that: (1) a is the NL phrase linked to the MRL production, with non-terminals A1;..., An showing the positions of the argument strings; (2) //' is // with each non-terminal Aj replaced with Aj (xj1,..., xjk.",
        "), where xj1,..., xjk are the bound variables in the A-function used to rewrite Aj; (3) xi1,..., xik are the logical variables that appear in //' and outside the current MR sub-parse.",
        "For example, see the rule",
        "FORM – (state , Xxi.state (xi)) what is the smallest state by area",
        "Query – answer (xi, Form)",
        "FORM – smallest(x2, (FORM, FORM))",
        "FORM – state( xi) FORM – area( xi, x2) extracted for the smallest predicate in Figure 3, where x2 is an argument of smallest, but it does not appear outside the formula smallest(...), so x2 need not be bound by A.",
        "On the other hand, x1 appears in /?",
        "', and it appears outside smallest (...) (as an argument of answer), so x1 must be bound.",
        "Rule extraction continues in this manner until the root of the MR parse tree is reached.",
        "Figure 3 shows all the rules extracted from Figure 4.",
        "Since the learned A-SCFG can be ambiguous, a probabilistic model is needed for parse disambiguation.",
        "We use the maximum-entropy model proposed in Wong and Mooney (2006), which defines a conditional probability distribution over derivations given an observed NL sentence.",
        "The output MR is the yield of the most probable derivation according to this model.",
        "Parameter estimation involves maximizing the conditional log-likelihood of the training set.",
        "For each rule, r, there is a feature that returns the number of times r is used in a derivation.",
        "More features will be introduced in Section 5."
      ]
    },
    {
      "heading": "4. Promoting NL/MRL Isomorphism",
      "text": [
        "We have described the A-Wasp algorithm which generates logical forms based on A-calculus.",
        "While reasonably effective, it can be improved in several ways.",
        "In this section, we focus on improving lexical acquisition.",
        "To see why the current lexical acquisition algorithm can be problematic, consider the word alignment in Figure 5 (for the sentence pair in Figure 1(b)).",
        "No rules can be extracted for the state predicate, because the shortest NL substring that covers the word states and the argument string Texas, i.e. states bordering Texas, contains the word bordering, which is linked to an MRL production outside the MR sub-parse rooted at state.",
        "Rule extraction is forbidden in this case because it would destroy the link between bordering and next_to.",
        "In other words, the NL and MR parse trees are not isomorphic.",
        "This problem can be ameliorated by transforming the logical form of each training sentence so that the NL and MR parse trees are maximally isomorphic.",
        "This is possible because some of the operators used in the logical forms, notably the conjunction operator (, ), are both associative (a,(b,c) = (a,b),c = a,b,c) and commutative (a,b = b, a).",
        "Hence, conjuncts can be reordered and regrouped without changing the meaning of a conjunction.",
        "For example, rule extraction would be possible if the positions of the next_to and state conjuncts were switched.",
        "We present a method for regrouping conjuncts to promote isomorphism between NL and MR parse trees.",
        "Given a conjunction, it does the following: (See Figure 6 for the pseudocode, and Figure 5 for an illustration.)",
        "Step 1.",
        "Identify the MRL productions that correspond to the conjuncts and the meta-predicate that takes the conjunction as an argument (count in Figure 5), and figure them as vertices in an undi-",
        "Step 4.",
        "Assign edge weights how many major cities are in states bordering texas",
        "QUERY – answer( xi, FORM)",
        "Conj – city(x2), Conj",
        "CONJ – major (x2) , CONJ",
        "Conj – state (x3), Form",
        "FORM – equal( x4,stateid(texas)) how many",
        "answer( x1, FORM)",
        "Step 6.",
        "Construct MR parse bordering",
        "state(X3) , Conj I equal (x4, stateid(texas))",
        "answer( x1, FORM) 1 equal(x4, stateid(texas))",
        "Figure 5: Transforming the logical form in Figure 1(b).",
        "The step numbers correspond to those in Figure 6.",
        "Input: A conjunction, c, of n conjuncts; MRL productions, pi,..., pn, that correspond to each conjunct; an MRL production, p0, that corresponds to the meta-predicate taking c as an argument; an NL sentence, e; a word alignment, a.",
        "1 Let v(p) be the set of logical variables that appear in p. Create an undirected graph, r, with vertices V = (pi |i = 0,..., n} and edges E = ((pi,pj)|i < j, v(pi) n v(p) = 0}.",
        "2 Let e(p) be the set of words in e to which p is linked according to a.",
        "Let span(pi,pj) be the shortest substring of e that includes e(pi) U e(pj).",
        "Subtract ((pi,pj)|i = 0, span(pi;pj) n e(p0) = 0} from E.",
        "3 Add edges (p0, pi ) to E if pi is not already connected to p0.",
        "4 For each edge (pi,pJ) in E, set edge weight to the minimum word distance between e(pi) and e(pj).",
        "5 Find a minimum spanning tree, T, for r using Kruskal's algorithm.",
        "6 Using p0 as the root, construct a conjunction c' based on T, and then replace c with c'.",
        "rected graph, r. An edge (pi,Pj) is in r if and only if pi and pj contain occurrences of the same logical variables.",
        "Each edge in r indicates a possible edge in the transformed MR parse tree.",
        "Intuitively, two concepts are closely related if they involve the same logical variables, and therefore, should be placed close together in the MR parse tree.",
        "By keeping occurrences of a logical variable in close proximity in the MR parse tree, we also avoid unnecessary variable bindings in the extracted rules.",
        "Step 2.",
        "Remove edges from r whose inclusion in the MR parse tree would prevent the NL and MR parse trees from being isomorphic.",
        "Step 3.",
        "Add edges to r to make sure that a spanning tree for r exists.",
        "Steps 4-6.",
        "Assign edge weights based on word distance, find a minimum spanning tree, T, for r, then regroup the conjuncts based on T. The choice of T reflects the intuition that words that occur close together in a sentence tend to be semantically related.",
        "This procedure is repeated for all conjunctions that appear in a logical form.",
        "Rules are then extracted from the same input alignment used to regroup conjuncts.",
        "Of course, the regrouping of conjuncts requires a good alignment to begin with, and that requires a reasonable ordering of conjuncts in the training data, since the alignment model is sensitive to word order.",
        "This suggests an iterative algorithm in which a better grouping of conjuncts leads to a better alignment model, which guides further regrouping until convergence.",
        "We did not pursue this, as it is not needed in our experiments so far.",
        "(a) answer (x1 ,largest(x2, (state(x1) ,major(x1), river(x1), traverse(x1,x2) ) ) ) What is the entity that is a state and also a major river, that traverses something that is the largest?",
        "(c) answer equalstateid(alaska) )) Alaska?",
        "Figure 7: Typical errors made by the A-Wasp parser, along with their English interpretations, before any language modeling for the target MRL was done."
      ]
    },
    {
      "heading": "5. Modeling the Target MRL",
      "text": [
        "In this section, we propose two methods for modeling the target MRL.",
        "This is motivated by the fact that many of the errors made by the A-Wasp parser can be detected by inspecting the MR translations alone.",
        "Figure 7 shows some typical errors, which can be classified into two broad categories:",
        "1.",
        "Type mismatch errors.",
        "For example, a state cannot possibly be a river (Figure 7(a)).",
        "Also it is awkward to talk about the population density of a state's highest point (Figure 7(b)).",
        "2.",
        "Errors that do not involve type mismatch.",
        "For example, a query can be overly trivial (Figure 7(c)), or involve aggregate functions on a known singleton (Figure 7(d)).",
        "The first type of errors can be fixed by type checking.",
        "Each m-place predicate is associated with a list of m-tuples showing all valid combinations of entity types that the m arguments can refer to:",
        "These m-tuples of entity types are given as domain knowledge.",
        "The parser maintains a set of possible entity types for each logical variable introduced in a partial derivation (except those that are no longer visible).",
        "If there is a logical variable that cannot refer to any types of entities (i.e. the set of entity types is empty), then the partial derivation is considered invalid.",
        "For example, based on the tuples shown above, point (x1) and density (x1, _) cannot be both true, because {point} n {country, state, city} = 0.",
        "The use of type checking is to exploit the fact that people tend not to ask questions that obviously have no valid answers (Grice, 1975).",
        "It is also similar to Schuler's (2003) use of model-theoretic interpretations to guide syntactic parsing.",
        "Errors that do not involve type mismatch are handled by adding new features to the maximum-entropy model (Section 3.2).",
        "We only consider features that are based on the MR translations, and therefore, these features can be seen as an implicit language model of the target MRL (Papineni et al., 1997).",
        "Of the many features that we have tried, one feature set stands out as being the most effective, the two-level rules in Collins and Koo (2005), which give the number of times a given rule is used to expand a non-terminal in a given parent rule.",
        "We use only the MRL part of the rules.",
        "For example, a negative weight for the combination of Query – answer(x1,Form(x1)) and Form – Ax1.equal(x1^) would discourage any parse that yields Figure 7(c).",
        "The two-level rules features, along with the features described in Section 3.2, are used in the final version of A-Wasp."
      ]
    },
    {
      "heading": "6. Experiments",
      "text": [
        "We evaluated the A-Wasp algorithm in the Geo-query domain.",
        "The larger Geoquery corpus consists of 880 English questions gathered from various sources (Wong and Mooney, 2006).",
        "The questions were manually translated into Prolog logical forms.",
        "The average length of a sentence is 7.57 words.",
        "We performed a single run of 10-fold cross validation, and measured the performance of the learned parsers using precision (percentage of translations that were correct), recall (percentage of test sentences that were correctly translated), and F-measure (harmonic mean of precision and recall).",
        "A translation is considered correct if it retrieves the same answer as the correct logical form.",
        "Number of training examples",
        "(a) Precision (b) Recall",
        "Wasp algorithm compared to: (1) the original Wasp algorithm which uses a functional query language (FunQL); (2) Scissor (Ge and Mooney, 2005), a fully-supervised, combined syntactic-semantic parsing algorithm which also uses FunQL; and (3) Zettlemoyer and Collins (2005) (Z&C), a CCG-based algorithm which uses Prolog logical forms.",
        "Table 1 summarizes the results at the end of the learning curves (792 training examples for A-Wasp, Wasp and Scissor, 600 for Z&C).",
        "A few observations can be made.",
        "First, algorithms that use Prolog logical forms as the target MRL generally show better recall than those using FunQL.",
        "In particular, A-Wasp has the best recall by far.",
        "One reason is that it allows lexical items to be combined in ways not allowed by FunQL or the handwritten templates in Z&C, e.g. [smallest [state] [by area]] in Figure 3.",
        "Second, Z&C has the best precision, although their results are based on 280 test examples only, whereas our results are based on 10-fold cross validation.",
        "Third, A-Wasp has the best F-measure.",
        "To see the relative importance of each component of the A-Wasp algorithm, we performed two ablation studies.",
        "First, we compared the performance of A-Wasp with and without conjunct regrouping (Section 4).",
        "Second, we compared the performance of A-Wasp with and without language modeling for the MRL (Section 5).",
        "Table 2 shows the results.",
        "It is found that conjunct regrouping improves recall (p < 0.01 based on the paired t-test), and the use of two-level rules in the maximum-entropy model improves precision and recall (p < 0.05).",
        "Type checking also significantly improves precision and recall.",
        "A major advantage of A-Wasp over Scissor and Z&C is that it does not require any prior knowledge of the NL syntax.",
        "Figure 9 shows the performance of A-Wasp on the multilingual Geoquery data set.",
        "The 250-example data set is a subset of the larger Geoquery corpus.",
        "All English questions in this data set were manually translated into Spanish, Japanese and Turkish, while the corresponding Prolog queries remain unchanged.",
        "Figure 9 shows that A-Wasp performed comparably for all NLs.",
        "In contrast, Scissor cannot be used directly on the non-English data, because syntactic annotations are only available in English.",
        "Z&C cannot be used directly either, because it requires NL-specific templates for building CCG grammars."
      ]
    },
    {
      "heading": "7. Conclusions",
      "text": [
        "We have presented A-Wasp, a semantic parsing algorithm based on a A-SCFG that generates logical forms using A-calculus.",
        "A semantic parser is learned given a set of training sentences and their correct logical forms using standard SMT techniques.",
        "The result is a robust semantic parser for predicate logic, and it is the best-performing system so far in the Geoquery domain.",
        "This work shows that it is possible to use standard SMT methods in tasks where logical forms are involved.",
        "For example, it should be straightforward to adapt A-Wasp to the NL generation task – all one needs is a decoder that can handle input logical forms.",
        "Other tasks that can potentially benefit from",
        "(%)",
        "A-Wasp",
        "Wasp",
        "Scissor",
        "Z&C",
        "Precision",
        "91.95",
        "87.19",
        "92.08",
        "96.25",
        "Recall",
        "86.59",
        "74.77",
        "72.27",
        "79.29",
        "F-measure",
        "89.19",
        "80.50",
        "80.98",
        "86.95",
        "Number of training examples ioo iso 2oo",
        "(a) Precision (b) Recall this include question answering and interlingual MT.",
        "In future work, we plan to further generalize the synchronous parsing framework to allow different combinations of grammar formalisms.",
        "For example, to handle long-distance dependencies that occur in open-domain text, CCG and TAG would be more appropriate than CFG.",
        "Certain applications may require different meaning representations, e.g. frame semantics.",
        "Acknowledgments: We thank Rohit Kate, Raz-van Bunescu and the anonymous reviewers for their valuable comments.",
        "This work was supported by a gift from Google Inc.",
        "Precision",
        "Recall",
        "(%)",
        "Precision",
        "Recall",
        "A-Wasp",
        "91.95",
        "86.59",
        "A-Wasp",
        "91.95",
        "86.59",
        "w/o conj.",
        "regrouping",
        "90.73",
        "83.07",
        "w/o two-level rules",
        "88.46",
        "84.32",
        "and w/o type checking",
        "65.45",
        "63.18"
      ]
    }
  ]
}
