{
  "info": {
    "authors": [
      "Philip R. Cohen"
    ],
    "book": "International Conference on Computational Linguistics and Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P84-1046",
    "title": "Referring as Requesting",
    "url": "https://aclweb.org/anthology/P84-1046",
    "year": 1984
  },
  "references": [
    "acl-J80-3003",
    "acl-T78-1010"
  ],
  "sections": [
    {
      "heading": "1. Introductionl",
      "text": [
        "Searle 1141 has argued forcefully that referring is a speech act; that people refer, not just expressions.",
        "This paper considers what kind of speech act referring might be.",
        "I propose a generalization of Searle's \"propositional\" act of referring that treats it as an illocution-ary act, a request, and argue that the propositional act of referring is unnecessary.",
        "The essence of the argument is as follows: First, I consider Searle's definition of the propositional act of referring (which I term the PAA, for Propositional Act Account).",
        "This definition is found inadequate to deal with various utterances in discourse used for the sole purpose of referring.",
        "Although the relevance of such utterances to the propositional act has been defined away by Searle, it is clear that any comprehensive account of referring should treat them.",
        "I develop an account of their use in terms of a speaker's requesting the act of referent identification, which is to be understood in a perceptual sense.",
        "This illocutionary art analysis (IAA) is shown to satisfy Searle's conditions for referring yet captures utterances that the PAA cannot.",
        "The converse position is then examined: Can the IAA capture the same uses of referring expressions as the PAA?",
        "If one extends the perceptually-based notion of referent identification to include Searle's concept of identification, then by associating a complex propositional attitude to one use of the definite determiner, a request can be derived.",
        "The IAA thus handles the referring use of definite noun phrases with independently motivated rules.",
        "Referring becomes a kind of requesting.",
        "Hence, the propositional act of referring is unnecessary."
      ]
    },
    {
      "heading": "2. Referring as a propositional speech act",
      "text": [
        "Revising Austin's [2] locutionary/illocutionary dichotomy, Searle distinguishes between illocutionary acts (IAs) and propositional acts (PAs) of referring and predicating.",
        "Both kinds of acts are performed in making an utterance, but propositional acts can only be performed in the course of performing some illocutionary act.",
        "Let us consider Searle's rules for referring, which I term the \"propositional act analysis\", or PAA.",
        "A speaker, S, \"successfully and non-defectively performs the speech act of singular identifying refer-ence\" in uttering a referring expression, R, in the presence of hearer, H, in a context, C, if and only if:",
        "1.",
        "Normal input and output conditions obtain.",
        "2.",
        "The utterance of R occurs as part of the utterance of some sentence (or similar stretch of discourse) T. 3.",
        "The utterance of T is the (purported) performance of an illocutionary act.",
        "4.",
        "There exists some object X such that either R con",
        "'The research reported in this paper was supported initially by the Fairchild Camera and Instrument Corp. Its subsequent development has been made possible by a gift from the System Development Foundation.",
        "I have benefitted from many discussions with Hector Levesque and Ray Perrault.",
        "tains an identifying description of X or S is able to supplement R with an identifying description of X.",
        "5.",
        "S intends that the utterance of It will pick out or identify X to II.",
        "6.",
        "S intends that the utterance of R will identify X to H by means of H's recognition of S's intention to identify X and he intends this recognition to be achieved by means of H's knowledge of the rules governing R and his awareness of C. 7.",
        "The semantical rules governing It are such that it is correctly uttered in T in C if and only if conditions 1-6 obtain.\" ( 1141, pp.",
        "94-95.)",
        "Conditions 2 and 3 are justified as follows: Propositional acts cannot occur alone; that is one cannot just !emphasis in original – PRCI refer and predicate without making an assertion or asking a question or performing some other illocutionary act ... One only refers as part of the performance of an illocutionary act, and the grammatical clothing of an illocutionary act is the complete sentence.",
        "An utterance of a referring expression only counts as referring if one says something.",
        "(lbid, p.",
        "25.)",
        "The essence of Conditions 4 and 5 is that the speaker needs to utter an \"identifying description\".",
        "For Searle, \"identification\" means \"... there should no longer be any doubt what exactly is being talked about\".",
        "(Aid, p.",
        "85.)",
        "Furthermore, not only should the description be an identifying one (one that would pick out an object), but the speaker should intend it to do so uniquely (Condition 5).",
        "Moreover, the speaker's intention is supposed to be recognized by the hearer (Condition 6).",
        "This latter Gricean 171 condition is needed to distinguish having the hearer pick out an object by referring to it versus, for example, hitting him in the back with it."
      ]
    },
    {
      "heading": "3. Problems for the Propositional Act Account",
      "text": [
        "In a recent experiment 131, it was shown that in giving instructions over a telephone, speakers, but not users of keyboards, often made separate utterances for reference and for predication.",
        "Frequently, these \"referential utterances\" took the form of existential sentences, such as \"Now, there's a black 0-ring\".",
        "Occasionally, speakers used question noun phrases \"OK, now, the smallest of the red pieces?\" The data present two problems for the PAA."
      ]
    },
    {
      "heading": "3.1. Referring as a Sentential Phenomenon",
      "text": [
        "Conditions 2 and 3 require the referring expression to be embedded in a sentence or \"similar stretch of discourse\" that predicates",
        "something If the referent as part of the performance of some illocu-thinary act.",
        "However, it is obvious that speakers can refer by issuing isolated noun phrase or prepositional phrases.",
        "Since speakers performed illocutionary acts in making these utterances, then, according to Conditions 2 and 3, there should be an act of predication, either in the sentence or the \"similar stretch of discourse\".",
        "For example, consider the following dialog-tie fragment:",
        "1.",
        "\"Now, the small blue cap we talked about before?\" 2.",
        "\"Uli-huli\", 3.",
        "\"Put that over the hole on the side of that tube ...\"",
        "The illocutionary act performed by littering phrase (I) is finished and responded to in phrase (2) before the illocutionary act performed in phrase (3) containing the predication \"put\" is performed.",
        "The appeal to a sentence or stretch of discourse in which to find the illocutionary act containing the propositional act in (I) is therefore is unconvincing.",
        "The cause of this inadequacy is that, according to Searle, to perform an illocutionary act, an act of predicating is required, and the predicate must be littered (Aid, pp.",
        "126-127).",
        "Hence, there is no appeal to context to supply obvious predications.",
        "Likewise, there is no room for context to supply an obvious focus of attention.",
        "Unfortunately, we can easily imagine cases in which an object is mutually, but nonlinguistically, focused upon (e.g., when Holmes, having come upon a body on the ground, listens for a heartbeat, and says to Watson: \"Dead\").",
        "In such a case, we need only predicate.",
        "Thus, the requirement that the act of reference he jointly located with some predication in a sentence or illocutionary act is too restrictive -- the goals involved with reference and predication can he satisfied separately and contextually.",
        "The point of this paper is to bring such goals to the fore."
      ]
    },
    {
      "heading": "3.2. Referring without a Propositional Act",
      "text": [
        "The second problem is that most of the separate utterances issued to secure reference were declarative sentences whose logical form was 3 .r P(z).",
        "For example.",
        "\"there is a little yellow piece of rubber\", and \"it's got a plug in it\".",
        "However, Searle claims that these utterances contain no referring act.",
        "(Ibid.",
        "p.",
        "29.)",
        "How then can speakers use them to refer?",
        "The answer involves an analysis of indirect speech acts.",
        "Although such declarative utterances can lie issued just to be informative, they are also issued as requests that the hearer identify the referent.",
        "2 The analysis of these utterances as requests depends on our positing an action of referent identification.",
        "4.",
        "Identification as a Requested Action In Searle's account, speakers identify referents for hearers.",
        "I revise this notion slightly and treat identification as an act performed by the hearer 13).",
        "I use the term \"identify\" in a very narrow, though important and basie.",
        "sense – one that intimately involves perception.",
        "Thus, the analysis is not intended to be general; it applies only to the case when the referents are perceptually accessible to the hearer, and when the hearer is intended to use perceptual means to pick them out.",
        "For the time being.",
        "I am explicitly not concerned with a hearer's mentally \"identifying\" sonic entity satisfying a description, or discovering a coreferring description.",
        "The perceptual use of \"identification\" would appear to he a special case of Searle's use of the term, and thus Searle's conditions should apply ti, it.",
        "Referent identification in this perceptual sense requires an agent and a description.",
        "The essence of the act is that the agent pick out the thing or things satisfying the description.",
        "The agent need not =The classification of these utterances as identification requests was done by two coders who were trained by the author, but who worked independently.",
        "The reliability of their codings were high – over 90 per cent for such existential statements.",
        "be the speaker of the description, and indeed, the description need not be communicated linguistically, or even communicated at all.",
        "A crucial component of referent identification is the act of perceptually searching for something that satisfies the description.",
        "The description is decomposed by the agent into a plan of action for identifying the referent.",
        "The intended and expected physical, sensory, and cognitive actions may be signalled by the speaker's choice of predicates.",
        "For example, a speaker uttering the phrase \"the magnetic screwdriver\", may intend for the hearer to place various screwdrivers against some piece of iron to determine which is magnetic.",
        "Speakers know that hearers map (at least some) predicates, onto actions that determine their extensions, and thus, using a model of the hearer's capabilities and the causal connections among people, their senses, and physical objects, design their expression, D, so that hearers can successfully execute those actions in the context of the overall plan.",
        "Not only does a speaker plan for a hearer to identify the referent of a description, but he often indicates his intention that the hearer do so.",
        "According to Searle, one possible way to do this is to use a definite determiner.",
        "Of course, not all definite NP's are used to refer; for example, in the sentence \"the last piece is the nozzle-, the referent of the first NP is intended to be identified, whereas the referent of the second NP is not.",
        "The attributive use of definite noun phrases [GI is a case in which the speaker has no intention that the hearer identify a referent.",
        "Yet other nonanaphoric uses of definite noun phrases include labeling an object, correcting a referential miscommunication, having the hearer wait while the speaker identifies the referent, etc.",
        "To respond appropriately, a hearer decides when identification is the act he is supposed to perform on a description, what part this act will play in the speaker's and hearer's plans, and how and when to perform the act.",
        "If perceptually identifying a referent i represented as an action in the speaker's plan, hearers can reason about it Pist as any other act, thereby allowing them to infer the 5 peak,r',, intentions behind indirect identification requests.",
        "In summary, referent identification shall mean the conducting of a perceptual search process for the referent of a description.",
        "The verb \"pick out\" should be taken as synonymous.",
        "The following is a sketchy definition of the referent identification action, in which the description is formed from \"a/the y such that D(y)\".",
        "The formula follows the usual axioniatitation of actions in dynamic logic: P [Act]Q; that is, ill', after doing Act, Q.",
        "Follow Mg Nfoore's [91 possible worlds semantics for action, the modal operator RESULT is taken to he true of an agent, an action, and a formula, if in the world resulting from the agent's tierfortning that action, the formula is true.",
        "5 The antecedent includes three conditions.",
        "The fir,t is a -per-'See also [Is, ICI for discussion of speakers' goal: towards the irdi ri descriptions.",
        ".This definition is not particularly illuminating, but it is n:d. any VAVIt•i.",
        "than Searle's.",
        "The point of giving it is that if a definition can be given in this form (i.e., as an action characterizable in a dynamic logic), the illocutionary analysis applies.",
        "'Actually, Moore characterizes RESULT as taking an event and a formula as arguments, and an agent's doing an action denotes an event.",
        "This difference is not critical for what follows.",
        "ceptual accessibility\" condition to guarantee that the IDENTIFY-REFERENT action is applicable.",
        "This should guarantee that, for example, a speaker does not intend someone to pick out the referent of \"3\", \"democracy\", or \"the first man to land on Mars\".",
        "The condition is satisfied in the experimental task since it rapidly becomes mutual knowledge that the task requires communication about the objects in front of the hearer.",
        "The second condition states that X fulfills the description D. Here, I am ignoring cases in which the description is not literally true of the intended referent, including metonymy, irony, and the like (but see 1121).",
        "Lastly.",
        "D should be a description that is identifiable to this particular Agt.",
        "It should use descriptors whose extension the agent already knows or can discover via action.",
        "I am assuming that we can know that a combination of descriptors is identifiable without having formed a plan for identifying the referent.",
        "To give a name to the state of knowledge we are in after having identified the referent of D, we will use (IDENTIFIED.",
        "REFERENT Agt D X).",
        "That is, Agt has identified the referent of D to be X.",
        "Of course, what has been notoriously difficult to specify is just what Agt has to know about X to say he has identified it as the referent of D. At a minimum, the notion of identification needs to be made relative to a purpose, which, perhaps, could be derived from the bodily actions that someone (in the context) is intended to perform upon X.",
        "Clearly, \"knowing who the D is\" 18, 91, is no substitute for having identified a referent.",
        "After having picked out the referent of a description D, we may still not not know who the D is.",
        "On the other hand, we may know who or what the description denotes, for example, by knowing some \"standard name\" for it, and yet be unable to use that knowledge to pick out the object.",
        "For example, if we ask \"Which is the Seattle train?\" and receive the reply \"It's train number 11689, we may still not be able to pick out and board the train if its serial number is not plainly in view.",
        "Finally, athough not stated in this definition, the means by which the act is performed is some function mapping D to some procedure that, when executed by Agt, enables Agt to discover the X that is the referent of D."
      ]
    },
    {
      "heading": "4.1. Requesting",
      "text": [
        "Con,ider what it takes to make a request.",
        "Hector Levesque and I 14, 31 argue that requests and other illocutionary acts can be defined in terms of interacting plans – i.e., as beliefs about the conversants' shared knowledge of the speaker's goals and the causal consequences of achieving those goals.",
        "In this formalism, illocutionary acts are no longer conceptually primitive, but rather amount to theorems that can be proven about a state of affairs.",
        "The proof requires an axiomatization of agents beliefs, expectations, goals, plans, actions, and a correlation of utterance mood with certain propositional attitudes.",
        "The important point here is that the definition of a request is not merely stipulated, but is derived from an independently motivated theory of action.",
        "Any act that brings about the right effects in the right way satisfies the request theorem.",
        "Briefly, a request is an action (or collection of actions) that makes it (1) shared knowledge that the speaker's goal is that the hearer thinks the speaker wants the hearer to adopt the goal of doing a particular act, thereby making it (2) shared knowledge between the speaker and hearer that the speaker wants the hearer to do that act.",
        "This inference requires an additional \"gating\" condition that it be shared knowledge that the speaker is both sincere and can perform the requested act (i.e., he knows how, and the preconditions of that act are true).",
        "The processing of an utterance is assumed to begin by applying the propositional attitude correlated with its mood to the propositional content associated with its literal interpretation.",
        "Thus, correlated with imperatives and interrogatives is the attitude above (corresponding to goal (1)): 6",
        "(DONE Hearer Act P) is true if Hearer has done act Act and has brought about P. For yes/no interrogatives, Act would be an INFORMIF 1111; for imperatives, it would be the act mentioned in the sentence.",
        "Declaratives would be correlated with a different propositional attitude.",
        "Beginning with the utterance-correlated attitudes, a derivation process that constitutes plan-recognition reasoning determines what the speaker meant 171.",
        "Thus, for example, what the speaker meant could be classified as a request if the derivation included making (2) true by making the above formula true.",
        "An act may simultaneously achieve the goals constituting more than one illocutionary act.",
        "This ability underlies the analysis of indirect speech acts.",
        "Formalisms have been developed 15, 111 that describe when we can conclude, from a speaker's wanting the hearer to want the precondition of some act to hold, (or wanting the hearer to believe the precondition does hold), that the speaker wants the hearer to adopt the goal of performing the act.",
        "The conditions licensing this inference are that it be mutually known that the act (or its effect) is an expected goal or the speaker, and that it be mutually known that: the hearer can perform the act, is cooperative, and does not want not to do it.",
        "Returning to the troublesome existential sentences, this pattern of reasoning, which I term the \"illocutionary act analysis\" (IAA), can be used to derive a request for referent identification.",
        "The reasoning is similar to that needed to infer a request to open the door on hearing a speaker, with two arm-loads of groceries, say \"the door is closed\".",
        "The general form of this reasoning involves the assertion of an action's precondition when the effect of the action is an expected goal of the speaker.",
        "In the case at hand, the speaker's existential assertion causes the hearer to believe the existential precondition of the referent identification act, since speaker and hearer both think they are talking about objects in front of the hearer, and because the description is identifiable.",
        "Hence, the hearer concludes Ile is intended to pick out its referent.",
        "The hearer may go on to infer that he is intended to perform other acts, such as to pick up the object.",
        "This inference process also indicates when the indirect request interpretation is not intended, for example, if it is mutually known that the description is not identifiable, or if it is mutually known that time hearer would not want to identify the referent.",
        "I argue that this kind of reasoning underlies the propositional act account.",
        "First, I show that Searle's conditions on referring are a special case of the conditions for requesting referent identification.",
        "Then, I show that if one extends the definition of IDENTIFY-REFERENT to cover Searle's more general concept of identification, the IAA is applicable in the same circumstances as Searle's analysis.",
        "Because the IAA is independently motivated and covers more cases, it should be preferred."
      ]
    },
    {
      "heading": "5. Accounting for Searle's Conditions on Referring",
      "text": [
        "Assume Searle's Condition 1, the \"normal I/O conditions.\" For the reasons outlined above, do not assume Conditions 2 and 3.",
        "Now, clearly, a speaker's planning of a request that the hearer identify the referent of some description should comply with the rules for requesting, namely: the speaker is trying to achieve one of the effects of the cThe justification for this formula can be found in 14",
        "requested action (i.e., IDENTIFIED-REFERENT) by way of communicating (in the Gricean sense) his intent that the hearer perform the action, provided that it is shared knowledge that the hearer can do the action.",
        "The last condition is true if it is shared knowledge that the the precondition to the action holds, which includes Searle's existential Condition 1.",
        "Searle's Condition 5 states that the speaker intends to identify Ilie referent to the hearer.",
        "This condition is captured in the IAA by its becoming mutual knowledge that the speaker intends to achieve the effect of the referent identification act, IDENTIFIED-REFERENT.",
        "Finally, Searle's Gricean intent recognition Condition (6) takes hold in the same way that it does for other illocutionary acts.",
        "namely in virtue of a \"feature\" of the utterance (e.g., utterance mood, or a definite determiner) that is correlated with a complex propositional attitude.",
        "This attitude becomes the basis for subsequent reasoning about the speaker's plans.",
        "In summary, Searle's conditions can be accounted for by simply positing an action that the speaker requests and that the hearer reasons about and performs.",
        "So far, the IAA and PAA are complementary.",
        "They each account for different aspects of referring.",
        "The IAA characterizes utterances whose sole purpose is to secure referent identification, and the PAA characterizes the use of referring phrases within an illocutionary act.",
        "I now procede to show how the IAA can subsume the PAA.",
        "Searle argues that one use of the definite article in uttering an NP is to indirate the speaker's intention to refer uniquely.",
        "Moreover, from Condition 5, this intention is supposed to be recognized by the hearer.",
        "We can get this effect by correlating the following expression with the definite deterniiner:",
        "Think of this expression as being a pragmatic \"feature\" of a syntactic constituent, as in current linguistic formalisms.",
        "When this expression is applied to a descriptor (supplied from the semantics of the NP) we have a complete formula that becomes the seed for deriving a request.",
        "Namely, if it is mutually believed the speaker is sincere, 7 then it is 11111 Wally believed there is a unique object that speaker wants the hearer to want to pick out.",
        "If it is mutually believed the hearer can do it (i.e.. the preconditions to the referent identification act hold, and the hearer knows how to do it by decomposing the description into a plan of action).",
        "it is mutually believed of some object that the speaker's goal is that tine hearer actually pick it out.",
        "Hence, a request.",
        "8 Thus, for the perceptual case, the IAA subsumes the PAA."
      ]
    },
    {
      "heading": "5.1. Extending the Analysis",
      "text": [
        "Assume that instead of just considering the act of identification in its perceptual sense, we adopt Searle's concept – namely that \"... there should no longer be any doubt what exactly is being talked about.\" Identification in this sense is primarily a process of establishing a coreferential link between the description in question and some other whose referent is in some way known to the hearer.",
        "However, we again regard identification as an act that the hearer performs, not something the speaker does to/for a hearer.",
        "If an analysis of this"
      ]
    },
    {
      "heading": "7Sincerity can be dispensed with at no significant loss of generality",
      "text": [
        "'That is, 1 am suggesting that the interpretation of how the speaker intends the noun phrase to be interpreted (e.g., referentially, attributively, etc.)",
        "begins with such a propositional attitude.",
        "If the referential reading is unsuccessful, the hearer needs to make other inferences to derive the intended reading.",
        "extended notion can be made similar in form to the analysis of the perceptual identification act, then the IAA completely subsumes the PAA.",
        "Because both accounts are equally vague on what constitutes identification (as are, for that matter, all other accounts of which I am aware), the choice between them must rest on other grounds.",
        "The grounds favoring the identification request analysis include the use of separate utterances and illocutionary acts for referring, and the independently motivated satisfaction of Searle's conditions on referring."
      ]
    },
    {
      "heading": "5.2. Searle vs. Russell",
      "text": [
        "Using the propositional act of referring.",
        "Searle argues against Russell's PI theory of descriptions, which holds that the uttering of an expression \"the 0\" is equivalent to the assertion of an uniquely existential proposition \"there is a unique 0\".",
        "Thus, when reference fails, it is because the uniquely existential proposition is not true.",
        "Searle claims instead that the existence of the referent is a precondition to the action of referring.",
        "In referring to X, we do not assert that X exists any more than we do in hitting X (/bid, p. However, the precondition is necessary for successful performance.",
        "Searle's argument against this theory essentially comes down to: ...",
        "It (Russell's theory' presents the propositional act of definite reference, when performed with definite descriptions ... as equivalent to the illocutionary act of asserting a uniquely existential proposition, and there is no coherent way to integrate such a theory into a theory of illocutionary acts.",
        "Under no condition is a propositional act identical with the illocutionary act of assertion, for a propositional act can only occur as part of some illocutionary act, never simply by itself (Ibid, p.",
        "15.)",
        "There are two difficulties with this argument.",
        "First, the requirement that acts of referring be part of an illocutionary act was shown to be unnecessarily restrictive.",
        "Second, there is a way to assimilate the assertion of an existential proposition - - an act that Searle claims does not contain a referring act – into an analysis of illocutionary acts, namely as an indirect request for referent identification.",
        "However, because an assertion of a uniquely existential proposition may fail to convey an indirect request for referent identification (just as uttering \"It's cold in here\" may fail to convey an indirect request) Searle's argument, though weakened, still stands."
      ]
    },
    {
      "heading": "6. Summary",
      "text": [
        "There are a number of advantages for treating referent identification as an action that speakers request.",
        "and this for treating the speech act of referring as a request.",
        "The analysis not .",
        "'sly accounts for data that Searle's account cannot.",
        "but it a1,0 predicts each of Searle's conditions for performing the act of singular identifying reference, yet it allows for appropriate extension into a planning process.",
        "If we extend the perceptual use of referent identification to Searl•'s more general concept of identification, and we correlate a certain (Gricean) propositional attitude with the use of definite determiners in a noun phrase, then Searle's analysis is subsumed by the act of requesting referent identification.",
        "The propositional act of referriag is therefore unnecessary.",
        "The promissory note introduced by this approach is to show how the same kind of plan-based reasoning used in analyzing indirect speech acts can take hold when a hearer realizes lie cannot, and was not intended to, identify the referent of a description.",
        "That is, plan-based reasoning should explain how a hearer might decide that the speaker's intention cannot be what it appears to be (based on the intent correlated with the use of a definite determiner), leading him, for example, to decide to treat a description attributively (6).",
        "Moreover, such reasoning should be useful in determining intended referents, as",
        "Ortony 1101 has argued.",
        "To keep this promise, we need to be specific about speaker-intentions for other uses of noun phrases.",
        "This will be no easy task.",
        "One difficulty will be to capture the distinction between achieving ef-fec s on a hearer, and doing so communicatively (i.e., in the Gricean way).",
        "Thus, for example, a hearer cannot comply with the illocutionary force of \"Quick, don't think of an elephant\" because there seems to be an \"automatic\" process of \"concept activation\" Ill.",
        "Achieving effects non-communicatively, i.e., without the recognition of intent, may be central to some kinds of reference.",
        "In such cases, speakers would be able to identify referents for a hearer.",
        "If this held for singular identifying reference, then there could be grounds for a propositional act.",
        "However, we might have to give up the Gricean condition (5), which I suspect Searle would not want to (10.",
        "Finally, there are obviously many aspects of reference that need to be accounted for by any comprehensive theory.",
        "I make no claims (yet) about the utility of the present approach for dealing with them.",
        "Rather, I hope to have opened the door to a formal pragmatics for one"
      ]
    }
  ]
}
