{
  "info": {
    "authors": [
      "Dirk Speelman",
      "Geert Adriaens"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2166",
    "title": "A Dutch to SQL Database Interface Using Generalized Quantifier Theory",
    "url": "https://aclweb.org/anthology/C94-2166",
    "year": 1994
  },
  "references": [
    "acl-J82-3002"
  ],
  "sections": [
    {
      "heading": "2 GSR: GENERAL OUTLINE",
      "text": [
        "The question what GSB.",
        "should look like was to a large extent tackled in a very pragmatical way.",
        "As far as the linguistic module of the program is concerned, the following criteria were formulated.",
        "GSB, had to be a formal representation (i) with sufficient expressive power so that every possibly useful query can be formulated in it in a not too complex fashion, (ii) that is relatively easy to reach computationally, starting off from natural language.",
        "A general observation is that, considering the kind of NI, sentences one can expect as input to the system, GSB, inevitably had to differ from logical formalisms such as the ones used in formal semantics (focussing on propositions).",
        "In view of the general decision to work with intermediate semantic expressions the denotation of which is the answer to the NL questions, the basic types of complete expressions listed in Fig. 3 were found useful.",
        "In this figure co stands for an arbitrary proposition in some logical language L. The extension of L created by introducing these new types will be called L'.",
        "(i) propositions (format: ,p), to be used when people ask yes-or-no questions"
      ]
    },
    {
      "heading": "3 FROM DUTCH TO GSR",
      "text": [
        "3.1and V: problems The traditional .way of coping with quantification in NI, database interfaces is by using 3 and V, the classical first order predicate logic (PL) instruments (see e.g. Warren & Pereira, 1982).",
        "This approach, however, does not meet the criteria set out above.",
        "To illustrate this, we basically rely on two observations 13arwise & Cooper (1981) made to show a fundamental difference in the natures of NI, and PL.",
        "Their observations will be 'transposed' to the computational application at hand.",
        "The first observation is illustrated in figure 4, which contains some Dutch questions and their most natural FL' counterparts.",
        "Whereas the Dutch sentences have the same syntactic structure, their FL' counterparts have different formats.",
        "These and many other examples suggests that there is no trivially compositional way of translating NL expressions to their nearest PL' equivalents.",
        "The problem is that the quantificational information, which in NL has a fixed location, is spread over the PL' expression in a seemingly arbitrary way.",
        "It may be concluded that criterium (ii) for a good GSB, is violated.",
        "A second, more serious reason for the inadequacy of 3 and V is that some forms of NI, quantification can only be expressed in a very complex way (e.g.",
        "Fig.",
        "4, examples 2 and 3) or simply cannot be expressed at all (e.g.",
        "Fig.",
        "4, example 4).",
        "Here criterium (i) is not satisfied.",
        "A third problem, mentioned in K.aati, Kas Pull-land (1990), is that in practice, e.g. in implementations, one is tempted to make rough translations, and to neglect nuances or strong conversational implicatures in natural language, when one is limited to and V. So, for instance, in Warren Pereira (1982) 'a', 'some' and 'the' all are simply interpreted as J."
      ]
    },
    {
      "heading": "3.2 L(GQ)': a solution",
      "text": [
        "There are many ways to try and get around the shortcomings of the traditional approach.",
        "To score better on criterium (i), i.e. to increase expressive power, one could consider the introduction of numbers in the logical formalism.",
        "Only, one can imagine that, if made in an ad hoc way, this extension could result in a hybrid formalism (with respect to quantification) showing an even greater syntactical mismatch with NI, (decreasing the score on criterium ii).",
        "A solution for these problems was first explored by Montague (1973), and later thoroughly worked out by 13arwise k; Cooper (1981) in a formalism called L(GQ).",
        "In contrast to traditional PL, which only has 3 and V, the language of generalized quantifiers L(GQ) specifies no limitation of the number of primitives to express quantification.",
        "All kinds of determiners can be used.",
        "The translation of the examples of Fig. 4 to L(GQ)' is given in Fig. 5.",
        "Some special notational conventions Harwise k Cooper introduced, are left out.",
        "Fur1030",
        "An independent procedure is run to determine the probable or possible scope of the determiners.",
        "The determiners are wrapped around the initial proposition according to this scope.",
        "Formally the scope-determining procedure generates for every probable or possible reading is permutation f of {1,...,7{}.",
        "D j()( P(,v2, )v.) ) )) The remaining lacunes are filled up by adding, as shown, to every determiner Di its original domain-set S'1, and the variable vi that was introduced before to replace",
        "NL fragment that was tested extensively with the program, this procedure proved to be amazingly accurate (see Speelrnan, 1992, 85-98).",
        "The future goal, however, is that instead of one most probable reading a list of all possible readings, tagged with a degree of probability, is generated.",
        "Since the procedure is a separate module, any extension or alteration of can be made without affecting the rest of the program.",
        "What remains to be overcome, is the fact that introducing a large set of determiners in GSB, would burden the interpreters used in the database subsystem with an extra, NLP-type recognition task.",
        "This problem is solved by giving L(GQ)' a righthand neigbour (see Fig. 6 in which the determiners are replaced by what was originally the meta-level definition of their semantics (see (1)(4)).",
        "In the resulting L(GQ)' derivative, called GSR, the number of primitives (set, set intersection, set difference, set cardinality, ..,) is drastically reduced.",
        "Furthermore, the new primitives are much closer to, and even at the heart of, the procedural and semantic building blocks of traditional computer science in general, and of relational DBMSs in particular.",
        "An example of the complete procedure, going from SR1 to L(GQ)' to GSR, is given in (7) up to (9).",
        "The question is `Zijn alle werknemers gehuwd?'",
        "(Are all employees married?",
        ")."
      ]
    },
    {
      "heading": "4 FROM GSR TO SQL",
      "text": [
        "As the NLP subsystem, the database subsystem is fully implemented.",
        "However, we shall restrict ourselves to a very brief sketch of its functionality here.",
        "As can be seen in Fig. 2, a GSR expression is first translated to a formalism called DBSR.",
        "This was done for reasons of modularity, primarily for facilitating the extension of the system to different target languages.",
        "DBSR, which stands for :UataBase specific Semantic Representation, is a declarative relational database query language that is both close to GSR and easily translatable to any of the commercialized R1):14MS query languages.",
        "Apart from the treatment of quantification the formalism is very similar to relational calculus.",
        "The major effort in the step from GSR, to DI3SR lies in adapting GSR-terminology to concrete names of tabels and columns of a database.",
        "This is done using a fill-lexicon, which can be seen as an augmented ER-model of a database.",
        "The last step, from DBSB, to SQL, is extremely straightforward.",
        "Sets and cardinality expressions are translated to (sub)queries.",
        "Relations between sets or cardinality expressions are translated to conditions for (sub)queries.",
        "For completeness, an example of the database subsystem output is given.",
        "For the last example of the foregoing section a MISR expression and an SQL query are given in (10) and (11) respectively.",
        "YES contains only 'Yes'."
      ]
    },
    {
      "heading": "5 IMPLEMENTATION",
      "text": [
        "The system is written in Common Lisp (according the de facto standard Steele,90) and generates standard SQL queries (ISO).",
        "It has proved to be a perfectly portable product.",
        "Originally written on a -M.acintoE:f SE130, it has afterwards been tested on several Symbolics, Macintosh and PC platforms.",
        "The major modules of the linguistic component are a 'letter tree' tool for efficient communication with the lexicon, a transition network based morphological analysis tool, and an augmented chart parser for syntactic and semantic analysis."
      ]
    },
    {
      "heading": "6 CONCLUSION",
      "text": [
        "In some subfields of formal semantics the traditional logical apparatus for quantification, i.e. the use of and V is being abandoned in favor of 'generalized quantifiers', because the latter are both closer to natural language and richer in expressive power.",
        "In this text it has been shown how this theory can be put to use in a. natural language database interface, another held in which 3 and V had become traditional.",
        "Some modifications had to be made in order to render the theoretical 'generalized quantifier' approach"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "This paper presents the treatment of quantification as it was implemented in a prototype of a natural language relational database interface for Dutch'.",
        "It is shown how the theoretical 'generalized quantifier' apparatus introduced in formal semantics by 13arwise and Cooper can be tuned to implementational feasibility.",
        "Compared to the traditional treatment of quantification, the alternative presented here offers greater expressive power, greater similarity to natural language and, as a consequence, the possibility of a inore straightforward translation from natural language to formal representation."
      ]
    },
    {
      "heading": "1 INTRODUCTION",
      "text": [
        "In the prototype at hand, as in in database interfaces, the natural language input is translated to a conventional formal query language, viz. SQL, the most widely used and supported of these languages.",
        "The resulting SQL queries can then be passed to an already existing SQL interpreter.",
        "The translation procedure from Dutch to SQI, is split op in two consecutive major steps, using a logic-based intermediate semantic representation called General Semantic Representation (GSR.)2.",
        "The functionality of the whole database interface, including the SQL interpreter, was seen as a straightforward implementation of the formal semantic Montague-style (Montague,1973) mechanism of indirect interpretation of natural language (see Fig. 1).",
        "is 1)11"
      ]
    },
    {
      "heading": "SQ I,1111",
      "text": [
        "'Grafting' formal semantic processing steps upon an NI, database interface architecture has been propa-1In this payer the actual imidementation is not in focus (see Speehnan, 1992).",
        "2w; hin a framework of machine translation, we can say that GSti.",
        "is a kind of logic-based interlingua.",
        "gated and (succesfully) worked out before in a somewhat comparable project carried out at the university of Essex (see De Roeck, Fox, Lowden, Turner Sz Walls, [991).",
        "The main concern in that project was to clearly separate domain database) dependent semantic information from domain independent semantic information.",
        "In the project presented here a similar but more general objective was to maximize the separation of the N LP data and functionality of the system from its purely database oriented data and functionality, GSR, being the interface structure.",
        "The main topic of this paper, treated in section 3, is the application of 'generalized quantifier theory' in GSR.",
        "_Raving become classical in mathematical and some theoretical linguistic studies on quantification (see resp.",
        "Mostowski, 1957 and liarwise St Cooper, 1981), the theory is now beginning to be appreciated in Al (and N1,1)) for its richness and flexibility.",
        "Probably the best illustration of this upcoming interest is the incorporation of 'generalized quantifiers' in the popular Conceptual Graph knowledge representation formalism (sec e.g. Sowa, 1991).",
        "A somewhat differently Dutch question 1.",
        "OSII, generator CiSR expression",
        "more implementation-friendly.",
        "The major modifications were the introduction of a separate module to replace the 'quantification rule', and the shift from meta-level to logical representation of some settheoretical primitives."
      ]
    },
    {
      "heading": "References",
      "text": [
        "[1] Barwise, .1.",
        "Sz Cooper, R. (1981).",
        "'Generalized Quantifiers and Naturd Language'.",
        "Linguistics and Philosophy 4, 159-219.",
        "[2] Codd, liE.",
        "(1970).",
        "'A Data Sublanguage Founded on the Relational Calculus'.",
        "ACM SIGPIDET Workshop on Data Description, Access and Coidrol, November 1971.",
        "[3] ,De Roeck, AN., Vox, CJ., Lowden, If.",
        "CT., Turner, 13,.",
        "Az Walls, 13.1k.",
        "(1991).",
        "'A Natural Language System I3ased on Forinal Semantics'.",
        "Proceedings of the International Conference on Current Issues in Computational Linguistics.",
        "268-281.",
        "[d]lly, P.J., Ribbens, D. Rz Binot, J.L.",
        "(1990).",
        "'La quantification en Traitement du Language NatureE.",
        "[5] ISO TC97/SC21/VVC3 and ANSI X3112 (1987).",
        "ISO 907,5 Database Language SQL.",
        "[6] Kaan, N., Kas, M. k. Puhland, It.",
        "(1990).",
        "'lien procedure voor redeneren net kwantoren'.",
        "1A1111 vow Taalwelemschap 20 (4).",
        "205-221.",
        "[7] Montague, I3,.",
        "(1973).",
        "\"the Proper Treatment of Quantification in Ordinary English'.",
        "Ilintikka J., -Moravcsik J. Rz Suppes P.",
        "(eds.)",
        "Approaches to Natural Language.",
        "Dordrecht Ikeidel.",
        "221-2/.12.",
        "[8] Mostowski, A.",
        "(1957).",
        "'On a Generalization of Quantifiers'.",
        "Fund.",
        "Math.",
        "44, 12-36.",
        "[9] Sowa, I A'.",
        "(1991).",
        "\"lbwards tile Expressive Power of Natural ll,anguage'.1.F.",
        "Sowa (ed.).",
        "N'inciples of Semantic Networks.",
        "San Mateo, (1ahfornia : Morgan Kauftnann.",
        "157 -189.",
        "[10] Spedman, 1).",
        "(1992).",
        "lien prototype VOW' ern database-interface in Lisp.",
        "Eertaling van Nederlandsc vragen natty SQL-queries, Computational Linguistics 'thesis, University of Leuven (in Dutch).",
        "[11] Steele, GI,.",
        "(1992).",
        "Common Lisp : The Language.",
        "Second Edition.",
        "Digital Press : liedford MA.",
        "[12] Warren, DR. Rz Pereira, F.C.N.",
        "(1982).",
        "'An Efficient Easily Adaptable System for Interpreting Natural Language QUerieS'.",
        "American journal of Cont.",
        "putational Linguistics 8.",
        "110-119.",
        "[13] Zwarts, 10.",
        "(1983).",
        "'Determiners: a relational perspective'.",
        "'rer Widen (ed.)",
        "Studies in Modeltheoretic S'emantics.",
        "Foris : Dordrecht.",
        "37-62.",
        "thermore a relational perspective (see %warts, 1983) is3.4 GSR: an L(GQ) ' derivative usedAs a solution for these problems L(GQ)' gets two new neighbours in the translation process, as shown in Fig. 6.",
        "The denotation of L((i())' determiners is defined at a meta-level.",
        "Some examples are given in (1) to (1).",
        "these examples / stands for an interpretation function imgiping an expression on its denota,tioii.",
        "In Fig. 5 the structural similarity of the NI, expressions is reflected in that of the I,(GQ) expressions.",
        "Varthermore, all NI, examples can be expressed almost equally easily in 1(C Q) fly consequence, the formalism does not force people to be satisfied with rough translations.",
        "In short, the problems of traditional logical quantification are overcome."
      ]
    },
    {
      "heading": "3.3 L(GQ)': complications",
      "text": [
        "Unfortunately, there are two reasons fbr not consider.",
        "ing 1,(GQ)' an ideal solution.",
        "The first problem actually is not typical of L(GQ), but of the fact that liarwise ,kr, Cooper take over the 'IVIontagovian way of coping with possible ambiguity due to phenomena of quantifier scope.",
        "In these cases one reading is generated in a straightforward way by liar wise Sz.",
        "Cooper.",
        "To allow for alternative readings, they introduce extra machinery (called the 'quantification rule').",
        "The latter mechanism, however convenient Rain a theoretical point of view, is rather implementation unfriendly.",
        "it operates on complete structural descriptions (=non-trivial trees), and generates complete structural descriptions.",
        "Allowing for such a rule drastically changes the profile of the parser that is needed.",
        "The second problem is that it is undesirable for CS It, being an interface language with a coo-NIP module, to contain the set of (NI, inspired) determiners that '1(GQ)' contains.",
        "It would probably be better if' GSR had fewer primitives, preferably of a type not completely uncustorna.ry in traditional DUIVISs.",
        "In order to avoid the application of the 'quantification rule', the choice has been to first, generate an expression that is neutral with respect, to the scope of its quantifiers (SRI), and then solve the scope probletn in a second step, hereby generating an L(GQ)' expression.",
        "'I'he trick of first generating a scope-neutral expression is not new.",
        "For instance, it is used in the LOQUI system (see Gailly, Ribbens f Binot, 1990).",
        "The originality lies rather in the effort to respect well5iftnedness in the scope-neutral expressions.",
        "InIcultially speaking, SRI is a predicate-logical formalism in which the arguments of the predicates are internally structured as the NI, arguments of verbs.",
        "The nlost Unportant consequence is that determiners are located within the predicate-argmnents.",
        "'To give an example, Werken al le werknemers aan twee projekten?'",
        "(Do all employees work on two projects?)",
        "would be represented as (5).",
        "For identity and cardinality questions the formats in Fig. 3 are made superfluous by the pseudo-determiners W ft and CARD.",
        "For instance, the question 'Welke werknemers werken aan twee proiekten?'",
        "(Which employees work on two projects?)",
        "is translated to (6).",
        "zeork(a/1(4 I employre(,)1), 2({t, I project(s)))) (5) 71, A:(W IlCs: I employ ee(x))),2({x I project(3)1)) The translation of NL to SRI is a straightforward coinpositional process, comparable to the liar wise (;ooper processing of readings for which no 'quantification rule' is needed.",
        "The algorithm for going from SILL to I,(GQ)' is given in Fig. 7.",
        "IT an Sin expression contains a pseudo-determiner or CARD, the schema in Fig. 7 is adapted as follows.",
        "In the first step the arguments with real deterrniners are replaced by variables vi up to v, and the argument Wil(S0) or ( ARI)(So) is replaced by a special variable vo.",
        "Further, the result (i) of the normal second step is turned into a set expression or a numerical expression ({vo I So A) or #({vo I So A y})).",
        "The third step, which is co-internal, remains unchanged.",
        "'the essential part M Fig. 7 is the procedure that determines the possible scope-configurations.",
        "In the program only one, the most probable scope-configuration is generated.",
        "The algorithm states that the earlier some quantifier occurs in the NL expression, the larger its scope should be in the I,(GQ)' expression.",
        "in the"
      ]
    }
  ]
}
