{
  "info": {
    "authors": [
      "Hang Li",
      "Kenji Yamanishi"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P97-1006",
    "title": "Document Classification Using a Finite Mixture Model",
    "url": "https://aclweb.org/anthology/P97-1006",
    "year": 1997
  },
  "references": [
    "acl-C94-2172",
    "acl-H90-1056",
    "acl-P93-1024"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We propose a new method of classifying documents into categories.",
        "We define for each category a finite mixture model based on soft clustering of words.",
        "We treat the problem of classifying documents as that of conducting statistical hypothesis testing over finite mixture models, and employ the EM algorithm to efficiently estimate parameters in a finite mixture model.",
        "Experimental results indicate that our method outperforms existing methods."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "We are concerned here with the issue of classifying documents into categories.",
        "More precisely, we begin with a number of categories (e.g., 'tennis, soccer, skiing'), each already containing certain documents.",
        "Our goal is to determine into which categories newly given documents ought to be assigned, and to do so on the basis of the distribution of each document's words.'",
        "Many methods have been proposed to address this issue, and a number of them have proved to be quite effective (e.g.,(Apte, Damerau, and Weiss, 1994; Cohen and Singer, 1996; Lewis, 1992; Lewis and Ringuette, 1994; Lewis et al., 1996; Schütze, Hull, and Pedersen, 1995; Yang and Chute, 1994)).",
        "The simple method of conducting hypothesis testing over word-based distributions in categories (defined in Section 2) is not efficient in storage and suffers from the data sparseness problem, i.e., the number of parameters in the distributions is large and the data size is not sufficiently large for accurately estimating them.",
        "In order to address this difficulty, (Guthrie, Walker, and Guthrie, 1994) have proposed using distributions based on what we refer to as hard 'A related issue is the retrieval, from a data base, of documents which are relevant to a given query (pseudo-document) (e.g.,(Deerwester et al., 1990; Fuhr, 1989; Robertson and Jones, 1976; Salton and McGill, 1983; Wong and Yao, 1989)).",
        "clustering of words, i.e., in which a word is assigned to a single cluster and words in the same cluster are treated uniformly.",
        "The use of hard clustering might, however, degrade classification results, since the distributions it employs are not always precise enough for representing the differences between categories.",
        "We propose here to employ soft clustering', i.e., a word can be assigned to several different clusters and each cluster is characterized by a specific word probability distribution.",
        "We define for each category a finite mixture model, which is a linear combination of the word probability distributions of the clusters.",
        "We thereby treat the problem of classifying documents as that of conducting statistical hypothesis testing over finite mixture models.",
        "In order to accomplish hypothesis testing, we employ the EM algorithm to efficiently and approximately calculate from training data the maximum likelihood estimates of parameters in a finite mixture model.",
        "Our method overcomes the major drawbacks of the method using word-based distributions and the method based on hard clustering, while retaining their merits; it in fact includes those two methods as special cases.",
        "Experimental results indicate that our method outperforms them.",
        "Although the finite mixture model has already been used elsewhere in natural language processing (e.g. (Jelinek and Mercer, 1980; Pereira, Tishby, and Lee, 1993)), this is the first work, to the best of knowledge, that uses it in the context of document classification."
      ]
    },
    {
      "heading": "2 Previous Work",
      "text": []
    },
    {
      "heading": "Word-based method",
      "text": [
        "A simple approach to document classification is to view this problem as that of conducting hypothesis testing over word-based distributions.",
        "In this paper, we refer to this approach as the word-based method (hereafter, referred to as WBM).",
        "Letting W denote a vocabulary (a set of words), and w denote a random variable representing any word in it, for each category ci (i = 1, • • • , n), we define its word-based distribution P(wici) as a histogram type of distribution over W. (The number of free parameters of such a distribution is thus 1141-1).",
        "WBM then views a document as a sequence of words:",
        "and assumes that each word is generated independently according to a probability distribution of a category.",
        "It then calculates the probability of a document with respect to a category as",
        "and classifies the document into that category for which the calculated probability is the largest.",
        "We should note here that a document's probability with respect to each category is equivalent to the likelihood of each category with respect to the document, and to classify the document into the category for which it has the largest probability is equivalent to classifying it into the category having the largest likelihood with respect to it.",
        "Hereafter, we will use only the term likelihood and denote it as L(dici).",
        "Notice that in practice the parameters in a distribution must be estimated from training data.",
        "In the case of WBM, the number of parameters is large; the training data size, however, is usually not sufficiently large for accurately estimating them.",
        "This is the data .sparseness problem that so often stands in the way of reliable statistical language processing (e.g.(Gale and Church, 1990)).",
        "Moreover, the number of parameters in word-based distributions is too large to be efficiently stored."
      ]
    },
    {
      "heading": "Method based on hard clustering",
      "text": [
        "In order to address the above difficulty, Guthrie et.al.",
        "have proposed a method based on hard clustering of words (Guthrie, Walker, and Guthrie, 1994) (hereafter we will refer to this method as HCM).",
        "Let be categories.",
        "HCM first conducts hard clustering of words.",
        "Specifically, it (a) defines a vocabulary as a set of words W and defines as clusters its subsets kJ., • • , km satisfying Ur_iks W and kin k, = 0 (i j) (i.e., each word is assigned only to a single cluster); and (b) treats uniformly all the words assigned to the same cluster.",
        "HCM then defines for each category ci a distribution of the clusters P(ki lci) (j = 1, • • • , m).",
        "It replaces each word wt in the document with the cluster kt to which it belongs (t 1,- • ,N).",
        "It assumes that a cluster kt is distributed according to P(ki Ici) and calculates the likelihood of each category Ci with respect to the document by",
        "There are any number of ways to create clusters in hard clustering, but the method employed is crucial to the accuracy of document classification.",
        "Guthrie et.",
        "al.",
        "have devised a way suitable to documentation classification.",
        "Suppose that there are two categories c1=`tennis' and c2=`soccer,' and we obtain from the training data (previously classified documents) the frequencies of words in each category, such as those in Tab.",
        "1.",
        "Letting L and M be given positive integers, HCM creates three clusters: kl, k2 and k3, in which k1 contains those words which are among the L most frequent words in c1, and not among the M most frequent in c2; k2 contains those words which are among the L most frequent words in c2, and not among the M most frequent in c1; and k3 contains all remaining words (see Tab.",
        "2).",
        "HCM then counts the frequencies of clusters in each category (see Tab.",
        "3) and estimates the probabilities of clusters being in each category (see Tab.",
        "4).3 Suppose that a newly given document, like d in Fig. 1, is to be classified.",
        "HCM calculates the likelihood values",
        "where f(kIlc,) is the frequency of the cluster k, in ct, f (c,) is the total frequency of clusters in c„ and in is the total number of clusters.",
        "L(clIci) and L(dIc2) according to Eq.",
        "(3).",
        "(Tab.",
        "5 shows the logarithms of the resulting likelihood values.)",
        "It then classifies d into c2, as log2 L(dIc2) is larger than log2 L(dici)•",
        "HCM can handle the data sparseness problem quite well.",
        "By assigning words to clusters, it can drastically reduce the number of parameters to be estimated.",
        "It can also save space for storing knowledge.",
        "We argue, however, that the use of hard clustering still has the following two problems:",
        "1.",
        "HCM cannot assign a word to more than one cluster at a time.",
        "Suppose that there is another category c3 = 'skiing' in which the word 'ball'",
        "does not appear, i.e., 'ball' will be indicative of both c1 and c2, but not c3.",
        "If we could assign 'ball' to both k1 and k2, the likelihood value for classifying a document containing that word to ci or c2 would become larger, and that for classifying it into c3 would become smaller.",
        "HCM, however, cannot do that.",
        "2.",
        "HCM cannot make the best use of information about the differences among the frequencies of words assigned to an individual cluster.",
        "For example, it treats 'racket' and 'shot' uniformly because they are assigned to the same cluster ki (see Tab.",
        "5).",
        "'Racket' may, however, be more indicative of c1 than 'shot,' because it appears more frequently in Cl than 'shot.'",
        "HCM fails to utilize this information.",
        "This problem will become more serious when the values L and M in word clustering are large, which renders the clustering itself relatively meaningless.",
        "From the perspective of number of parameters, HCM employs models having very few parameters, and thus may not sometimes represent much useful information for classification."
      ]
    },
    {
      "heading": "3 Finite Mixture Model",
      "text": [
        "We propose a method of document classification based on soft clustering of words.",
        "Let cl,•• , c„ be categories.",
        "We first conduct the soft clustering.",
        "Specifically, we (a) define a vocabulary as a set W of words and define as clusters a number of its subsets /el, • ,k,„ satisfying u71k1 = W; (notice that kin kj = 0 (i j) does not necessarily hold here, i.e., a word can be assigned to several different clusters); and (b) define for each cluster kj",
        "where w denotes a random variable representing any word in the vocabulary.",
        "We then define for each category ce (i = 1, • • • , n) a distribution of the clusters P(ki Ice) , and define for each category a linear combination of P(wlki):",
        "as the distribution over its words, which is referred to as a finite mixture model(e.g., (Everitt and Hand, 1981)).",
        "We treat the problem of classifying a document as that of conducting the likelihood ratio test over finite mixture models.",
        "That is, we view a document as a sequence of words,",
        "where wt(t = 1, • , N) represents a word.",
        "We assume that each word is independently generated according to an unknown probability distribution and determine which of the finite mixture models P(wIci)(i = 1, • • , n) is more likely to be the probability distribution by observing the sequence of words.",
        "Specifically, we calculate the likelihood value for each category with respect to the document by:",
        "= n 1 ( Er_ip(kici) x P(wt Ike)) .",
        "(8) We then classify it into the category having the largest likelihood value with respect to it.",
        "Hereafter, we will refer to this method as FMM.",
        "FMM includes WBM and HCM as its special cases.",
        "If we consider the specific case (1) in which a word is assigned to a single cluster and P(wIkj) is given by",
        "where Iki I denotes the number of elements belonging to ki, then we will get the same classification result as in HCM.",
        "In such a case, the likelihood value for each category ci becomes:",
        "where kt is the cluster corresponding to wt.",
        "Since the probability P(wtIkt) does not depend on categories, we can ignore the second term ritN=1 P(wtIkt) in hypothesis testing, and thus our method essentially becomes equivalent to HCM (c.f.",
        "Eq.",
        "(3)).",
        "Further, in the specific case (2) in which m = n,",
        "the likelihood used in hypothesis testing becomes the same as that in Eq.",
        "(2), and thus our method becomes equivalent to WBM."
      ]
    },
    {
      "heading": "4 Estimation and Hypothesis Testing",
      "text": [
        "In this section, we describe how to implement our method."
      ]
    },
    {
      "heading": "Creating clusters",
      "text": [
        "There are any number of ways to create clusters on a given set of words.",
        "As in the case of hard clustering, the way that clusters are created is crucial to the reliability of document classification.",
        "Here we give one example approach to cluster creation.",
        "We let the number of clusters equal that of categories (i.e., m = n) 4 and relate each cluster ki to one category ci (i = 1, , n).",
        "We then assign individual words to those clusters in whose related categories they most frequently appear.",
        "Letting 7 (0 < y < 1) be a predetermined threshold value, if the following inequality holds:",
        "then we assign w to ki, the cluster related to where f(wIci) denotes the frequency of the word w in category c, and f(w) denotes the total frequency of w. Using the data in Tab.1, we create two clusters: k1 and k2, and relate them to e1 and c2, respectively.",
        "40ne can certainly assume that m > n. For example, when 7 = 0.4, we assign 'goal' to k2 only, as the relative frequency of 'goal' in c2 is 0.75 and that in ci is only 0.25.",
        "We ignore in document classification those words which cannot be assigned to any cluster using this method, because they are not indicative of any specific category.",
        "(For example, when 7 > 0.5 'ball' will not be assigned into any cluster.)",
        "This helps to make classification efficient and accurate.",
        "Tab.",
        "6 shows the results of creating clusters.",
        "We then consider the frequency of a word in a cluster.",
        "If a word is assigned only to one cluster, we view its total frequency as its frequency within that cluster.",
        "For example, because 'goal' is assigned only to k2, we use as its frequency within that cluster the total count of its occurrence in all categories.",
        "If a word is assigned to several different clusters, we distribute its total frequency among those clusters in proportion to the frequency with which the word appears in each of their respective related categories.",
        "For example, because 'ball' is assigned to both k1 and k2, we distribute its total frequency among the two clusters in proportion to the frequency with which 'ball' appears in ci and c2, respectively.",
        "After that, we obtain the frequencies of words in each cluster as shown in Tab.",
        "7.",
        "racket stroke shot goal kick ball k1 4 1 2 0 0 2 k2 0 0 0 4 2 2 We then estimate the probabilities of words in each cluster, obtaining the results in Tab.",
        "8.5",
        "Let us next consider the estimation of P(ki Ici).",
        "There are two common methods for statistical estimation, the maximum likelihood estimation method",
        "where f(k,lc,) is the frequency of the cluster ks, in ct, and f (c,) is the total frequency of clusters in",
        "and the Bayes estimation method.",
        "In their implementation for estimating P(ki Ici), however, both of them suffer from computational intractability.",
        "The EM algorithm (Dempster, Laird, and Rubin, 1977) can be used to efficiently approximate the maximum likelihood estimator of P(kj lci).",
        "We employ here an extended version of the EM algorithm (Helmbold et al., 1995).",
        "(We have also devised, on the basis of the Markov chain Monte Carlo (MCMC) technique (e.g. (Tanner and Wong, 1987; Yamanishi, 1996))6, an algorithm to efficiently approximate the Bayes estimator of P(ki For the sake of notational simplicity, for a fixed i, let us write P(ki lci) as 0, and P(wlki) as Pi(w).",
        "Then letting 0 = (01, • • • the finite mixture model in Eq.",
        "(6) may be written as",
        "For a given training sequence w1 • • wN, the maximum likelihood estimator of 9 is defined as the value 0 which maximizes the following log likelihood function",
        "The EM algorithm first arbitrarily sets the initial value of 0, which we denote as 0(0), and then successively calculates the values of 0 on the basis of its most recent values.",
        "Let s be a predetermined number.",
        "At the /th iteration (1= 1, • • ,․), we calculate",
        "where > 0 (when zi = 1, Hembold et al.",
        "'s version simply becomes the standard EM algorithm), and",
        "After s numbers of calculations, the EM algorithm outputs 0(3) = QS:), • • • , OW) as an approximate of O.",
        "It is theoretically guaranteed that the EM algorithm converges to a local minimum of the given likelihood (Dempster, Laird, and Rubin, 1977).",
        "For the example in Tab.",
        "1, we obtain the results as shown in Tab.",
        "9.",
        "Testing For the example in Tab.",
        "1, we can calculate according to Eq.",
        "(8) the likelihood values of the two categories with respect to the document in Fig. 1 (Tab.",
        "10 shows the logarithms of the likelihood values).",
        "We then classify the document into category C2, as log2 L(dic2) is larger than log2 L(dici)."
      ]
    },
    {
      "heading": "5 Advantages of FMM",
      "text": [
        "For a probabilistic approach to document classification, the most important thing is to determine what kind of probability model (distribution) to employ as a representation of a category.",
        "It must (1) appropriately represent a category, as well as (2) have a proper preciseness in terms of number of parameters.",
        "The goodness and badness of selection of a model directly affects classification results.",
        "The finite mixture model we propose is particularly well-suited to the representation of a category.",
        "Described in linguistic terms, a cluster corresponds to a topic and the words assigned to it are related to that topic.",
        "Though documents generally concentrate on a single topic, they may sometimes refer for a time to others, and while a document is discussing any one topic, it will naturally tend to use words strongly related to that topic.",
        "A document in the category of 'tennis' is more likely to discuss the topic of 'tennis,' i.e., to use words strongly related to 'tennis,' but it may sometimes briefly shift to the topic of 'soccer,' i.e., use words strongly related to 'soccer.'",
        "A human can follow the sequence of words in such a document, associate them with related topics, and use the distributions of topics to classify the document.",
        "Thus the use of the finite mixture model can be considered as a stochastic implementation of this process.",
        "The use of FMM is also appropriate from the viewpoint of number of parameters.",
        "Tab.",
        "11 shows the numbers of parameters in our method (FMM),",
        "HCM, and WBM, where I WI is the size of a vocabulary, lhi is the sum of the sizes of word clusters = E7-1 I), n is the number of categories, and m is the number of clusters.",
        "The number of parameters in FMM is much smaller than that in WBM, which depends on I WI, a very large number in practice (notice that lk I is always smaller than I WI when we employ the clustering method (with y > 0.5) described in Section 4.",
        "As a result, FMM requires less data for parameter estimation than WBM and thus can handle the data sparseness problem quite well.",
        "Furthermore, it can economize on the space necessary for storing knowledge.",
        "On the other hand, the number of parameters in FMM is larger than that in HCM.",
        "It is able to represent the differences between categories more precisely than HCM, and thus is able to resolve the two problems, described in Section 2, which plague HCM.",
        "Another advantage of our method may be seen in contrast to the use of latent semantic analysis (Deer-wester et al., 1990) in document classification and document retrieval.",
        "They claim that their method can solve the following problems: synonymy problem how to group synonyms, like 'stroke' and 'shot,' and make each relatively strongly indicative of a category even though some may individually appear in the category only very rarely; polysemy problem how to determine that a word like 'ball' in a document refers to a 'tennis ball' and not a 'soccer ball,' so as to classify the document more accurately; dependence problem how to use dependent words, like 'kick' and 'goal,' to make their combined appearance in a document more indicative of a category.",
        "As seen in Tab.6, our method also helps resolve all of these problems."
      ]
    },
    {
      "heading": "6 Preliminary Experimental Results",
      "text": [
        "In this section, we describe the results of the experiments we have conducted to compare the performance of our method with that of HCM and others.",
        "As a first data set, we used a subset of the Reuters newswire data prepared by Lewis, called Reuters21578 Distribution 1.0.7 We selected nine overlapping categories, i.e. in which a document may be",
        "long to several different categories.",
        "We adopted the Lewis Split in the corpus to obtain the training data and the test data.",
        "Tabs.",
        "12 and 13 give the details.",
        "We did not conduct stemming, or use stop words8.",
        "We then applied FMM, HCM, WBM , and a method based on cosine-similarity, which we denote as COS8, to conduct binary classification.",
        "In particular, we learn the distribution for each category and that for its complement category from the training data, and then determine whether or not to classify into each category the documents in the test data.",
        "When applying FMM, we used our proposed method of creating clusters in Section 4 and set y to be 0, 0.4,0.5, 0.7, because these are representative values.",
        "For HCM, we classified words in the same way as in FMM and set y to be 0.5, 0.7, 0.9, 0.95.",
        "(Notice that in HCM, y cannot be set less than 0.5.)",
        "wheat,corn,oilseed,sugar,coffee soybean,cocoa,rice,cotton",
        "Num.",
        "of doc.",
        "training data 13625 Num.",
        "of doc.",
        "in test data 6188 Num.",
        "of (type of) words 50301 Avg.",
        "num.",
        "of words per doc.",
        "181.3 As a second data set, we used the entire Reuters21578 data with the Lewis Split.",
        "Tab.",
        "14 gives the details.",
        "Again, we did not conduct stemming, or use stop words.",
        "We then applied FMM, HCM, WBM and COS to conduct binary classification.",
        "When applying FMM, we used our proposed method of creating clusters and set y to be 0, 0.4, 0.5, 0.7.",
        "For HCM, we classified words in the same way as in FMM and set 7 to be 0.5,0.7, 0.9, 0.95.",
        "We have not fully completed these experiments, however, and here we only 'Stop words' refers to a predetermined list of words containing those which are considered not useful for document classification, such as articles and prepositions.",
        "91n this method, categories and documents to be classified are viewed as vectors of word frequencies, and the cosine value between the two vectors reflects similarity (Salton and McGill, 1983).",
        "earn,acq,crude,money-fx,grain interest ,trade,ship,wheat ,corn give the results of classifying into the ten categories having the greatest numbers of documents in the test data (see Tab.",
        "15).",
        "For both data sets, we evaluated each method in terms of precision and recall by means of the so-called micro-averaging 1°.",
        "When applying WBM, HCM, and FMM, rather than use the standard likelihood ratio testing, we used the following heuristics.",
        "For simplicity, suppose that there are only two categories c1 and c2.",
        "Letting c be a given number larger than or equal 0, we assign a new document d in the following way:",
        "where N is the size of document d. (One can easily extend the method to cases with a greater number of categories.)",
        "11 For COS, we conducted classification in a similar way.",
        "Figs.",
        "2 and 3 show precision-recall curves for the first data set and those for the second data set, respectively.",
        "In these graphs, values given after FMM and HCM represent 7 in our clustering method (e.g. FMM0.5, HCM0.5,etc).",
        "We adopted the break-even point as a single measure for comparison, which is the one at which precision equals recall; a higher score for the break-even point indicates better performance.",
        "Tab.",
        "16 shows the break-even point for each method for the first data set and Tab.",
        "17 shows that for the second data set.",
        "For the first data set, FMMO attains the highest score at break-even point; for the second data set, FMM0.5 attains the highest.",
        "We considered the following questions:",
        "(1) The training data used in the experimentation may be considered sparse.",
        "Will a word-clustering-based method (FMM) outperform a word-based method (WBM) here?",
        "(2) Is it better to conduct soft clustering (FMM) than to do hard clustering (HCM)?",
        "(3) With our current method of creating clusters, as the threshold y approaches 0, FMM behaves much like WBM and it does not enjoy the effects of clustering at all (the number of parameters is as large",
        "\"In micro-averaging(Lewis and Ringuette, 1994), precision is defined as the percentage of classified documents in all categories which are correctly classified.",
        "Recall is defined as the percentage of the total documents in all categories which are correctly classified.",
        "11Notice that words which are discarded in the clustering process should not to be counted in document size.",
        "as in WBM).",
        "This is because in this case (a) a word will be assigned into all of the clusters, (b) the distribution of words in each cluster will approach that in the corresponding category in WBM, and (c) the likelihood value for each category will approach that in WBM (recall case (2) in Section 3).",
        "Since creating clusters in an optimal way is difficult, when clustering does not improve performance we can at least make FMM perform as well as WBM by choosing = 0.",
        "The question now is \"does FMM perform better than WBM when y is 0?\"",
        "In looking into these issues, we found the following:",
        "FMM does not perform better than WBM for the first data set, but it performs better than WBM for the second data set.",
        "Evaluating classification results on the basis of each individual category, we have found that for three of the nine categories in the first data set,",
        "FMM0.5 performs best, and that in two of the ten categories in the second data set FMM0.5 performs best.",
        "These results indicate that clustering sometimes does improve classification results when we use our current way of creating clusters.",
        "(Fig.",
        "4 shows the best result for each method for the category 'corn' in the first data set and Fig. 5 that for 'grain' in the second data set.)",
        "(2) When y 0, i.e., when we conduct clustering, the best of FMM almost always outperforms that of HCM.",
        "(3) When y = 0, FMM performs better than WBM for the first data set, and that it performs as well as WBM for the second data set.",
        "In summary, FMNI always outperforms HCM; in some cases it performs better than WBM; and in general it performs at least as well as WBNI.",
        "For both data sets, the best FMM results are superior to those of COS throughout.",
        "This indicates that the probabilistic approach is more suitable than the cosine approach for document classification based on word distributions.",
        "Although we have not completed our experiments on the entire Reuters data set, we found that the results with FMM on the second data set are almost as good as those obtained by the other approaches reported in (Lewis and Ringuette, 1994).",
        "(The results are not directly comparable, because (a) the results in (Lewis and Ringuette, 1994) were obtained from an older version of the Reuters data; and (b) they",
        "used stop words, but we did not.)",
        "We have also conducted experiments on the Susanne corpus data' and confirmed the effectiveness of our method.",
        "We omit an explanation of this work here due to space limitations."
      ]
    },
    {
      "heading": "7 Conclusions",
      "text": [
        "Let us conclude this paper with the following remarks:",
        "1.",
        "The primary contribution of this research is that we have proposed the use of the finite mixture model in document classification.",
        "2.",
        "Experimental results indicate that our method of using the finite mixture model outperforms the method based on hard clustering of words.",
        "3.",
        "Experimental results also indicate that in some cases our method outperforms the word-based",
        "method when we use our current method of creating clusters.",
        "Our future work is to include:",
        "1. comparing the various methods over the entire Reuters corpus and over other data bases, 2. developing better ways of creating clusters.",
        "Our proposed method is not limited to document classification; it can also be applied to other natural language processing tasks, like word sense disambiguation, in which we can view the context surrounding a ambiguous target word as a document and the word-senses to be resolved as categories."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We are grateful to Tomoyuki Fujita of NEC for his constant encouragement.",
        "We also thank Naoki Abe of NEC for his important suggestions, and Mark Petersen of Meiji Univ.",
        "for his help with the English of this text.",
        "We would like to express special appreciation to the six ACL anonymous reviewers who have provided many valuable comments and criticisms."
      ]
    }
  ]
}
