{
  "info": {
    "authors": [
      "Paramveer S. Dhillon",
      "Partha Pratim Talukdar",
      "Koby Crammer"
    ],
    "book": "Proceedings of the ACL 2010 Conference Short Papers",
    "id": "acl-P10-2069",
    "title": "Learning Better Data Representation Using Inference-Driven Metric Learning",
    "url": "https://aclweb.org/anthology/P10-2069",
    "year": 2010
  },
  "references": [
    "acl-D08-1114",
    "acl-P07-1056"
  ],
  "sections": [
    {
      "text": [
        "Learning Better Data Representation using Inference-Driven Metric",
        "Learning",
        "Paramveer S. Dhillon Partha Pratim Talukdar* Koby Crammer",
        "CIS Deptt., Univ.",
        "of Penn.",
        "Search Labs, Microsoft Research Deptt.",
        "of Electrical Engg.",
        "Philadelphia, PA, U.S.A Mountain View, CA, USA The Technion, Haifa, Israel",
        "dhillon@cis.upenn.edu partha@talukdar.net koby@ee.technion.ac.il",
        "We initiate a study comparing effectiveness of the transformed spaces learned by recently proposed supervised, and semi-supervised metric learning algorithms to those generated by previously proposed unsupervised dimensionality reduction methods (e.g., PCA).",
        "Through a variety of experiments on different real-world datasets, we find IDML-IT, a semi-supervised metric learning algorithm to be the most effective."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Because of the high-dimensional nature of NLP datasets, estimating a large number of parameters (a parameter for each dimension), often from a limited amount of labeled data, is a challenging task for statistical learners.",
        "Faced with this challenge, various unsupervised dimensionality reduction methods have been developed over the years, e.g., Principal Components Analysis (PCA).",
        "Recently, several supervised metric learning algorithms have been proposed (Davis et al., 2007; Weinberger and Saul, 2009).",
        "IDML-IT (Dhillon et al., 2010) is another such method which exploits labeled as well as unlabeled data during metric learning.",
        "These methods learn a Mahalanobis distance metric to compute distance between a pair of data instances, which can also be interpreted as learning a transformation of the input data, as we shall see in Section 2.1.",
        "In this paper, we make the following contributions:",
        "Even though different supervised and semi-supervised metric learning algorithms have recently been proposed, effectiveness of the transformed spaces learned by them in NLP",
        "* Research carried out while at the University of Pennsylvania, Philadelphia, PA, USA.",
        "datasets has not been studied before.",
        "In this paper, we address that gap: we compare effectiveness of classifiers trained on the transformed spaces learned by metric learning methods to those generated by previously proposed unsupervised dimensionality reduction methods.",
        "We find IDML-IT, a semi-supervised metric learning algorithm to be the most effective."
      ]
    },
    {
      "heading": "2. Metric Learning",
      "text": [
        "We first establish the well-known equivalence between learning a Mahalanobis distance measure and Euclidean distance in a linearly transformed space of the data (Weinberger and Saul, 2009).",
        "Let A be a d x d positive definite matrix which parameterizes the Mahalanobis distance, dA(xi, Xj), between instances xi and Xj, as shown in Equation 1.",
        "Since A is positive definite, we can decompose it as A = PT P, where P is another matrix of size d x d.",
        " – dEuclidean(Pxi) Pxj )",
        "Hence, computing Mahalanobis distance parameterized by A is equivalent to first projecting the instances into a new space using an appropriate transformation matrix P and then computing Euclidean distance in the linearly transformed space.",
        "In this paper, we are interested in learning a better representation of the data (i.e., projection matrix P), and we shall achieve that goal by learning the corresponding Mahalanobis distance parameter A.",
        "We shall now review two recently proposed metric learning algorithms.",
        "Information-Theoretic Metric Learning (ITML) (Davis et al., 2007) assumes the availability of prior knowledge about inter-instance distances.",
        "In this scheme, two instances are considered similar if the Mahalanobis distance between them is upper bounded, i.e., dy^x^Xj) < u, where u is a non-trivial upper bound.",
        "Similarly, two instances are considered dissimilar if the distance between them is larger than certain threshold l, i.e., dA(xi,Xj) > l. Similar instances are represented by set S, while dissimilar instances are represented by set D.",
        "In addition to prior knowledge about interinstance distances, sometimes prior information about the matrix A, denoted by A0, itself may also be available.",
        "For example, Euclidean distance (i.e., Ao = I) may work well in some domains.",
        "In such cases, we would like the learned matrix A to be as close as possible to the prior matrix Ao.",
        "ITML combines these two types of prior information, i.e., knowledge about inter-instance distances, and prior matrix Ao, in order to learn the matrix A by solving the optimization problem shown in (2).",
        "where Dld(A,A0 ) = tr( AA-1) – logdet(AA-1) – n, is the LogDet divergence.",
        "To handle situations where exactly solving the problem in (2) is not possible, slack variables may be introduced to the ITML objective.",
        "To solve this optimization problem, an algorithm involving repeated Bregman projections is presented in (Davis et al., 2007), which we use for the experiments reported in this paper.",
        "Notations: We first define the necessary notations.",
        "Let X be the d x n matrix of n instances in a d-dimensional space.",
        "Out of the n instances, n instances are labeled, while the remaining nu instances are unlabeled, with n = n + nu.",
        "Let S be a n x n diagonal matrix with Sii = 1 iff instance xi is labeled.",
        "m is the total number of labels.",
        "Y is the n x m matrix storing training label information, if any.",
        "Y is the n x m matrix of estimated label information, i.e., output of any classifier, with Yii denoting score of label l at node i. .",
        "The ITML metric learning algorithm, which we reviewed in Section 2.2, is supervised in nature, and hence it does not exploit widely available un-labeled data.",
        "In this section, we review Inference Driven Metric Learning (IDML) (Algorithm 1) (Dhillon et al., 2010), a recently proposed metric learning framework which combines an existing supervised metric learning algorithm (such as ITML) along with transductive graph-based label inference to learn a new distance metric from labeled as well as unlabeled data combined.",
        "In self-training styled iterations, IDML alternates between metric learning and label inference; with output of label inference used during next round of metric learning, and so on.",
        "IDML starts out with the assumption that existing supervised metric learning algorithms, such as ITML, can learn a better metric if the number of available labeled instances is increased.",
        "Since we are focusing on the semi-supervised learning (SSL) setting with n labeled and nu unlabeled instances, the idea is to automatically label the unlabeled instances using a graph based SSL algorithm, and then include instances with low assigned label entropy (i.e., high confidence label assignments) in the next round of metric learning.",
        "The number of instances added in each iteration depends on the threshold ß.",
        "This process is continued until no new instances can be added to the set of labeled instances, which can happen when either all the instances are already exhausted, or when none of the remaining unlabeled instances can be assigned labels with high confidence.",
        "The IDML framework is presented in Algorithm 1.",
        "In Line 3, any supervised metric learner, such as ITML, may be used as the MetricLearner.",
        "Using the distance metric learned in Line 3, a new k-NN graph is constructed in Line 4 , whose edge weight matrix is stored in W. In Line 5 , GraphLabelInf optimizes over the newly constructed graph, the GRF objective (Zhu et al., 2003) shown in (3).",
        "where L = D – W is the (unnormalized) LaplaAlgorithm 1: Inference Driven Metric Learning (IDML) Input: instances X, training labels Y, training instance indicator S, label entropy threshold ß, neighborhood size k Output: Mahalanobis distance parameter A",
        "MetricLearner(X, S, F) - ConstructKnnGraph(X, A, k) - GraphLabelInf(W, S Y~) cian, and D is a diagonal matrix with Dii = Ej Wij.■ SelectLowEntInst(Y ' ,S,ß)",
        "The constraint, SY = SY', in (3) makes sure that labels on training instances are not changed during inference.",
        "In Line 6, a currently unlabeled instance xi (i.e., Sii = 0) is considered a new labeled training instance, i.e., Uii = 1, for next round of metric learning if the instance has been assigned labels with high confidence in the current iteration, i.e., if its label distribution has low entropy (i.e., Entropy(Y':) < ß).",
        "Finally in Line 7, training instance label information is updated.",
        "This iterative process is continued till no new labeled instance can be added, i.e., when Uii = 0 Vi.",
        "IDML returns the learned matrix A which can be used to compute Mahalanobis distance using Equation 1."
      ]
    },
    {
      "heading": "3. Experiments 3.1 Setup",
      "text": [
        "Table 1: Description of the datasets used in Section 3.",
        "All datasets are binary with 1500 total instances in each.",
        "Description of the datasets used during experiments in Section 3 are presented in Table 1.",
        "The first four datasets - Electronics, Books, Kitchen, and DVDs - are from the sentiment domain and previously used in (Blitzer et al., 2007).",
        "WebKB is a text classification dataset derived from (Sub-ramanya and Bilmes, 2008).",
        "For details regarding features and data pre-processing, we refer the reader to the origin of these datasets cited above.",
        "One extra preprocessing that we did was that we only considered features which occurred more 20 times in the entire dataset to make the problem more computationally tractable and also since the infrequently occurring features usually contribute noise.",
        "We use classification error (lower is better) as the evaluation metric.",
        "We experiment with the following ways of estimating transformation matrix P :",
        "Original: We set P = I, where I is the d x d identity matrix.",
        "Hence, the data is not transformed in this case.",
        "RP: The data is first projected into a lower dimensional space using the Random Projection (RP) method (Bingham and Mannila, 2001).",
        "Dimensionality of the target space as prescribed in (Bingham and Mannila, 2001).",
        "We use the projection matrix constructed by RP as P. e was set to 0.25 for the experiments in Section 3, which has the effect of projecting the data into a much lower dimensional space (84 for the experiments in this section).",
        "This presents an interesting evaluation setting as we already run evaluations in much higher dimensional space (e.g., Original).",
        "PCA: Data instances are first projected into a lower dimensional space using Principal Components Analysis (PCA) (Jolliffe, 2002) .",
        "Following (Weinberger and Saul, 2009), dimensionality of the projected space was set at 250 for all experiments.",
        "In this case, we used the projection matrix generated by PCA as P.",
        "ITML: A is learned by applying ITML (see Section 2.2) on the Original space (above), and then we decompose A as A = PTP to obtain P.",
        "Dataset",
        "Dimension",
        "Balanced",
        "Electronics",
        "84816",
        "Yes",
        "Books",
        "139535",
        "Yes",
        "Kitchen",
        "73539",
        "Yes",
        "DVDs",
        "155465",
        "Yes",
        "WebKB",
        "44261",
        "Yes",
        "Table 2: Comparison of SVM % classification errors (lower is better), with 50 labeled instances (Sec.",
        "3.2).",
        "ni=50.",
        "and nu = 1450.",
        "All results are averaged over ten trials.",
        "All hyperparameters are tuned on a separate random split.",
        "Table 3: Comparison of SVM % classification errors (lower is better), with 100 labeled instances (Sec.",
        "3.2).",
        "ni=100.",
        "and nu = 1400.",
        "All results are averaged over ten trials.",
        "All hyperparameters are tuned on a separate random split.",
        "IDML-IT: A is learned by applying IDML (Algorithm 1) (see Section 2.3) on the Original space (above); with ITML used as METRICLEARNER in IDML (Line 3 in Algorithm 1).",
        "In this case, we treat the set of test instances (without their gold labels) as the unlabeled data.",
        "In other words, we essentially work in the transductive setting (Vap-nik, 2000).",
        "Once again, we decompose A as A = PTP to obtain P.",
        "We also experimented with the supervised large-margin metric learning algorithm (LMNN) presented in (Weinberger and Saul, 2009).",
        "We found ITML to be more effective in practice than LMNN, and hence we report results based on ITML only.",
        "Each input instance, x, is now projected into the transformed space as Px.",
        "We now train different classifiers on this transformed space.",
        "All results are averaged over ten random trials.",
        "We train a SVM classifier, with an RBF kernel, on the transformed space generated by the projection matrix P. SVM hyperparameter, C and RBF kernel bandwidth, were tuned on a separate development split.",
        "Experimental results with 50 and 100 labeled instances are shown in Table 2, and Table 3, respectively.",
        "From these results, we observe that IDML-IT consistently achieves the best performance across all experimental settings.",
        "We also note that in Table 3, performance difference between ITML and IDML-IT in the Electronics and Kitchen domains are statistically significant.",
        "In this section, we trained the GRF classifier (see Equation 3), a graph-based semi-supervised learning (SSL) algorithm (Zhu et al., 2003), using Gaussian kernel parameterized by A = PTP to set edge weights.",
        "During graph construction, each node was connected to its k nearest neighbors, with k treated as a hyperparameter and tuned on a separate development set.",
        "Experimental results with 50 and 100 labeled instances are shown in Table 4, and Table 5, respectively.",
        "As before, we experimented with ni = 50 and ni = 100.",
        "Once again, we observe that IDML-IT is the most effective method, with the GRF classifier trained on the data representation learned by IDML-IT achieving best performance in all settings.",
        "Here also, we observe that IDML-IT achieves the best performance across all experimental settings.",
        "Datasets",
        "Original",
        "ff ± T",
        "RP",
        "ff ± (T",
        "PCA",
        "ff ± T",
        "ITML",
        "ff ± T",
        "IDML-IT",
        "ff ± T",
        "Electronics Books",
        "Kitchen DVDs",
        "WebKB",
        "31.3 ± 0.9 37.5 ± 1.1 33.7 ± 1.0 39.0 ± 1.2",
        "31.4 ± 0.9",
        "42.5 ± 1.0 45.0 ± 1.1 43.0 ± 1.1 47.7 ± 1.2 33.0 ± 1.0",
        "46.4 ± 2.0",
        "34.8 ± 1.4 34.0 ± 1.6 36.2 ± 1.6",
        "27.9 ± 1.3",
        "33.0 ± 1.0 35.0 ± 1.1 30.9 ± 0.7 37.0 ± 0.8 28.9 ± 1.0",
        "30.7±0.7 32.0±0.9 29.0±1.0 33.9±1.0 25.5±1.0",
        "Datasets",
        "Original",
        "ff ± T",
        "RP",
        "ff ± T",
        "PCA",
        "ff ± T",
        "ITML",
        "ff ± T",
        "IDML-IT",
        "ff ± T",
        "Electronics Books",
        "Kitchen DVDs",
        "WebKB",
        "27.0 ± 0.9 31.0 ± 0.7 26.3 ± 0.5 34.7 ± 0.4 25.7 ± 0.5",
        "40.0 ± 1.0 42.9 ± 0.6 41.9 ± 0.7 46.8 ± 0.6",
        "31.1 ± 0.5",
        "41.2 ± 1.0",
        "31.3 ± 0.7 27.0 ± 0.9 32.9 ± 0.8 24.9 ± 0.6",
        "27.5 ± 0.8 29.9 ± 0.5 26.1 ± 0.8 34.0 ± 0.8",
        "25.6 ± 0.4",
        "25.3±0.8 27.7±0.7 24.8±0.9 31.8±0.9 23.9±0.4",
        "Table 4: Comparison of transductive % classification errors (lower is better) over graphs constructed using different methods (see Section 3.3), with ni = 50 and nu = 1450.",
        "All results are averaged over ten trials.",
        "All hyperparameters are tuned on a separate random split.",
        "Table 5: Comparison of transductive % classification errors (lower is better) over graphs constructed using different methods (see Section 3.3), with ni = 100 and nu = 1400.",
        "All results are averaged over ten trials.",
        "All hyperparameters are tuned on a separate random split."
      ]
    },
    {
      "heading": "4. Conclusion",
      "text": [
        "In this paper, we compared the effectiveness of the transformed spaces learned by recently proposed supervised, and semi-supervised metric learning algorithms to those generated by previously proposed unsupervised dimensionality reduction methods (e.g., PCA).",
        "To the best of our knowledge, this is the first study of its kind involving NLP datasets.",
        "Through a variety of experiments on different real-world NLP datasets, we demonstrated that supervised as well as semi-supervised classifiers trained on the space learned by IDML-IT consistently result in the lowest classification errors.",
        "Encouraged by these early results, we plan to explore further the applicability of IDML-IT in other NLP tasks (e.g., entity classification, word sense disambiguation, polarity lexicon induction, etc.)",
        "where better representation of the data is a prerequisite for effective learning."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Thanks to Kuzman Ganchev for providing detailed feedback on a draft of this paper.",
        "This work was supported in part by NSF IIS-0447972 and DARPA HRO1107-1-0029.",
        "Datasets",
        "Original",
        "ff ± T",
        "RP",
        "ff ± T",
        "PCA",
        "ff ± T",
        "ITML",
        "ff ± T",
        "IDML-IT",
        "ff ± T",
        "Electronics Books",
        "Kitchen DVDs",
        "WebKB",
        "47.9 ± 1.1",
        "50.0 ± 1.0 49.8 ± 1.1",
        "50.1 ± 0.5 33.1 ± 0.4",
        "49.0 ± 1.2 49.4 ± 1.0 49.6 ± 0.9 49.9 ± 0.7",
        "33.1 ± 0.3",
        "43.2 ± 0.9 47.9 ± 0.7 48.6 ± 0.8 49.4 ± 0.6 33.1 ± 0.3",
        "34.9 ± 0.5 42.1 ± 0.7 31.1 ± 0.5 42.1 ± 0.4 30.0 ± 0.4",
        "34.0±0.5 40.6±0.7 30.0±0.5 41.2±0.5 28.7±0.5",
        "Datasets",
        "Original",
        "ff ± T",
        "RP",
        "ff ± T",
        "PCA",
        "ff ± T",
        "ITML",
        "ff ± T",
        "IDML-IT",
        "ff ± T",
        "Electronics Books",
        "Kitchen DVDs",
        "WebKB",
        "43.5 ± 0.7 48.3 ± 0.5",
        "45.3 ± 0.6",
        "48.6 ± 0.3",
        "33.4 ± 0.4",
        "47.2 ± 0.8 48.9 ± 0.3",
        "48.2 ± 0.5",
        "49.3 ± 0.5",
        "33.4 ± 0.4",
        "39.1 ± 0.7",
        "43.3 ± 0.4 41.0 ± 0.7 45.9 ± 0.5",
        "33.4 ± 0.3",
        "31.3 ± 0.2 35.2 ± 0.5 30.7 ± 0.6 42.6 ± 0.4",
        "30.4 ± 0.5",
        "30.8±0.3 33.3±0.6 29.9±0.3 41.7±0.3 28.6±0.7"
      ]
    }
  ]
}
