{
  "info": {
    "authors": [
      "Ke Wu",
      "Xiaolin Wang",
      "Bao-Liang Lu"
    ],
    "book": "Proceedings of the Third International Joint Conference on Natural Language Processing",
    "id": "acl-I08-1022",
    "title": "Cross Language Text Categorization Using a Bilingual Lexicon",
    "url": "https://aclweb.org/anthology/I08-1022",
    "year": 2008
  },
  "references": [
    "acl-P02-1044",
    "acl-P06-1070"
  ],
  "sections": [
    {
      "text": [
        "Ke Wu, Xiaolin Wang and Bao-Liang Lu*",
        "{wuke,arthur_general,bllu}@sjtu.edu.cn",
        "With the popularity of the Internet at a phenomenal rate, an ever-increasing number of documents in languages other than English are available in the Internet.",
        "Cross language text categorization has attracted more and more attention for the organization of these heterogeneous document collections.",
        "In this paper, we focus on how to conduct effective cross language text categorization.",
        "To this end, we propose a cross language naive Bayes algorithm.",
        "The preliminary experiments on collected document collections show the effectiveness of the proposed method and verify the feasibility of achieving performance close to monolingual text categorization, using a bilingual lexicon alone.",
        "Also, our algorithm is more efficient than our baselines."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Due to the popularity of the Internet, an ever-increasing number of documents in languages other than English are available in the Internet.",
        "The organization of these heterogeneous document collections increases cost of human labor significantly.",
        "On the one hand, experts who know different languages are required to organize these collections.",
        "On the other hand, maybe there exist a large amount of labelled documents in a language (e.g. English) which are in the same class structure as the unlabelled documents in another language.",
        "As a result, how to ex* Corresponding author.",
        "ploit the existing labelled documents in some language (e.g. English) to classify the unlabelled documents other than the language in multilingual scenario has attracted more and more attention (Bel et al., 2003; Rigutini et al., 2005; Olsson et al., 2005; Fortuna and Shawe-Taylor, 2005; Li and Shawe-Taylor, 2006; Gliozzo and Strapparava, 2006).",
        "We refer to this task as cross language text categorization.",
        "It aims to extend the existing automated text categorization system from one language to other languages without additional intervention of human experts.",
        "Formally, given two document collections {De, Df} from two different languages e and f respectively, we use the labelled document collection De in the language e to deduce the labels of the document collection Df in the language f via an algorithm A and some external bilingual resources.",
        "Typically, some external bilingual lexical resources, such as machine translation system (MT), large-scale parallel corpora and multilingual ontology etc., are used to alleviate cross language text categorization.",
        "However, it is hard to obtain them for many language pairs.",
        "In this paper, we focus on using a cheap bilingual resource, e.g. bilingual lexicon without any translation information, to conduct cross language text categorization.",
        "To my knowledge, there is little research on using a bilingual lexicon alone for cross language text categorization.",
        "In this paper, we propose a novel approach for cross language text categorization via a bilingual lexicon alone.",
        "We call this approach as Cross Language Naive Bayes Classifier (CLNBC).",
        "The proposed approach consists of two main stages.",
        "The first stage is to acquire a probabilistic bilingual lexicon.",
        "The second stage is to employ naive Bayes method combined with Expectation Maximization (EM) (Dempster et al., 1977) to conduct cross language text categorization via the probabilistic bilingual lexicon.",
        "For the first step, we propose two different methods.",
        "One is a naive and direct method, that is, we convert a bilingual lexicon into a probabilistic lexicon by simply assigning equal translation probabilities to all translations of a word.",
        "Accordingly, the approach in this case is named as CLNBC-D.",
        "The other method is to employ an EM algorithm to deduce the probabilistic lexicon.",
        "In this case, the approach is called as CLNBC-EM.",
        "Our preliminary experiments on our collected data have shown that the proposed approach (CLNBC) significantly outperforms the baselines in cross language case and is close to the performance of monolingual text categorization.",
        "The remainder of this paper is organized as follows.",
        "In Section 2, we introduce the naive Bayes classifier briefly.",
        "In Section 3, we present our cross language naive Bayes algorithm.",
        "In Section 4, evaluation over our proposed algorithm is performed.",
        "Section 5 is conclusions and future work."
      ]
    },
    {
      "heading": "2. The Naive Bayes Classifier",
      "text": [
        "The naive Bayes classifier is an effective known algorithm for text categorization (Domingos and Paz-zani, 1997).",
        "When it is used for text categorization task, each document d £ D corresponds to an example.",
        "The naive Bayes classifier estimates the probability of assigning a class c £ C to a document d based on the following Bayes' theorem.",
        "Then the naive Bayes classifier makes two assumptions for text categorization.",
        "Firstly, each word in a document occurs independently.",
        "Secondly, there is no linear ordering of the word occurrences.",
        "Therefore, the naive Bayes classifier can be further formalized as follows:",
        "The estimates of P (c) and P (w|c) can be referred to (McCallum and Nigam, 1998)",
        "Some extensions to the naive Bayes classifier with EM algorithm have been proposed for various text categorization tasks.",
        "The naive Bayes classifier was combined with EM algorithm to learn the class label of the unlabelled documents by maximizing the likelihood of both labelled and unlabelled documents (Nigam et al., 2000).",
        "In addition, the similar way was adopted to handle the problem with the positive samples alone (Liu et al., 2002).",
        "Recently, transfer learning problem was tackled by applying EM algorithm along with the naive Bayes classifier (Dai et al., 2007).",
        "However, they all are monolingual text categorization tasks.",
        "In this paper, we apply a similar method to cope with cross language text categorization using bilingual lexicon alone."
      ]
    },
    {
      "heading": "3. Cross Language Naive Bayes Classifier Algorithm",
      "text": [
        "In this section, a novel cross language naive Bayes classifier algorithm is presented.",
        "The algorithm contains two main steps below.",
        "First, generate a probabilistic bilingual lexicon; second, apply an EM-based naive Bayes learning algorithm to deduce the labels of documents in another language via the probabilistic lexicon.",
        "Notations Explanations",
        "e",
        "Language of training set",
        "f",
        "Language of test set",
        "d",
        "Document",
        "Document collection in language e",
        "Df",
        "Document collection in language f",
        "Vocabulary of language e",
        "Vf",
        "Vocabulary of language f",
        "L",
        "Bilingual lexicon",
        "T C Ve X Vf",
        "Set of links in L",
        "Set of words whose translation is 7 in L",
        "E C Ve",
        "Set of words of language e in L",
        "we £ E",
        "Word in E",
        "F CVf",
        "Set of words of language f in L",
        "Wf £ F",
        "Word in F",
        "|E|",
        "Number of distinct words in set E",
        "|F|",
        "Number of distinct words in set F",
        "N (We)",
        "Word frequency in De",
        "N (wf ,d)",
        "Word frequency in d in language f",
        "Data distribution in language e",
        "For ease of description, we first define some notations in Table 1.",
        "In the next two sections, we detail the mentioned-above two steps separately.",
        "To fill the gap between different languages, there are two different ways.",
        "One is to construct the multilingual semantic space, and the other is to transform documents in one language into ones in another language.",
        "Since we concentrate on use of a bilingual lexicon, we adopt the latter method.",
        "In this paper, we focus on the probabilistic model instead of selecting the best translation.",
        "That is, we need to calculate the probability of the occurrence of word wein language e given a document d in language f, i.e. P(we|d).",
        "The estimation can be calculated as follows:",
        "Ignoring the context information in a document d, the above probability can be approximately estimated as follows:",
        "where P(w/ |d) denotes the probability of occurrence of w/ in d, which can be estimated by relative frequency of w/ in d.",
        "In order to induce P(we|d), we have to know the estimation of P (we|w/).",
        "Typically, we can obtain a probabilistic lexicon from a parallel corpus.",
        "In this paper, we concentrate on using a bilingual lexicon alone as our external bilingual resource.",
        "Therefore, we propose two different methods for cross language text categorization.",
        "First, a naive and direct method is that we assume a uniform distribution on a word's distribution.",
        "Formally, P(we|w/) = j^-, where (we, w/) £ T; otherwise P (we|w/) = 0.",
        "Second, we can apply EM algorithm to deduce the probabilistic bilingual lexicon via the bilingual lexicon L and the training document collection at hand.",
        "This idea is motivated by the work (Li and Li, 2002).",
        "We can assume that each word we in language e is independently generated by a inite mixture model as follows:",
        "Therefore we can use EM algorithm to estimate the parameters of the model.",
        "Speciically speaking, we can iterate the following two step for the purpose above.",
        "The detailed algorithm can be referred to Algorithm 1.",
        "Furthermore, the probability that each word in language e occurs in a document d in language f, P(we| d), can be calculated according to Equation (4).",
        "In this sub-section, we present an EM-based semi-supervised learning method for labelling documents in different language from the language of training document collection.",
        "Its basic model is naive Bayes model.",
        "This idea is motivated by the transfer learning work (Dai et al., 2007).",
        "For simplicity of description, we first formalize the problem.",
        "Given the labelled document set De in the source language and the unlabelled document set D/, the objective is to find the maximum a posteriori hypothesis Algorithm 1 EM-based Word Translation Probability Algorithm Input: Training document collection D(1), bilingual",
        "lexicon L and maximum times of iterations T Output: Probabilistic bilingual lexicon P(we | w/) 1: Initialize P(0)(we|w/) = j^f, where from the hypothesis space H under the data distribution of the language e, De, according to the following formula.",
        "Instead of trying to maximize P®e (h|De, D/) in Equation (10), we can work with ^(h|De, D/), that is, log (Pse(h)P(De, D/|h)) .",
        "Then, using Equation (10), we can deduce the following equation.",
        "deDf cec",
        "EM algorithm is applied to find a local maximum of ^(h|De, D/) by iterating the following two steps:",
        "Algorithm 2 Cross Language Naive Bayes Algorithm_ Input: Labelled document collection De, unlabelled document collection D/, a bilingual lexicon L from language e to language f and maximum times of iterations T. Output: the class label of each document in D/",
        "1: Generate a probabilistic bilingual lexicon; 2: Calculate P(we|d) according to Equation (4).",
        "3: Initialize P^^d) via the traditional naive Bayes model trained from the labelled collection D(1).",
        "6: Calculate (c) based on P;De-1) (c|d) according to Equation (13) 7: end for 8: for all we € E do",
        "and P(we|d) according to Equation (14) 10: end for 11: for all d €D/ do",
        "12: Calculate P^Md) based on (c) and",
        "For the ease of understanding, we directly put the details of the algorithm in cross-language text categorization algorithmin which we ignore the detail of the generation algorithm of a probabilistic lexicon.",
        "In Equation (12), P®e (d|c) can be calculated by where NSe(we,d) = |d|PSe (we|d).",
        "In Equation (13), P®e (c\\Vk) can be estimated as follows:",
        "In Equation (14), similar to section 2, we can estimate Pse(we\\c, Dk) through Laplacian smoothing as follows:",
        "In addition, in Equation (13) and (14), P®e (Dk) can be actually viewed as the trade-off parameter modulating the degree to which EM algorithm weights the unlabelled documents translated from the language f to the language e via a bilingual lexicon.",
        "In our experiments, we assume that the constraints are satisfied, i.e. P®e (De) + P®e (D/) = 1 and pd.",
        "(d \\ Dfc) = ."
      ]
    },
    {
      "heading": "4. Experiments 4.1 Data Preparation",
      "text": [
        "We chose English and Chinese as our experimental languages, since we can easily setup our experiments and they are rather different languages so that we can easily extend our algorithm to other language pairs.",
        "In addition, to evaluate the performance of our algorithm, experiments were performed over the collected data set.",
        "Standard evaluation benchmark is not available and thus we developed a test data from the Internet, containing Chinese Web pages and English Web pages.",
        "Specifically, we applied RSS reader to acquire the links to the needed content and then downloaded the Web pages.",
        "Although category information of the content can be obtained by RSS reader, we still used three Chinese-English bilingual speakers to organize these Web pages into the predefined categories.",
        "As a result, the test data containing Chinese Web pages and English Web pages from various Web sites are created.",
        "The data consists of news during December 2005.",
        "Also, 5462 English Web pages are from 18 different news Web sites and 6011 Chinese Web pages are from 8 different news Web sites.",
        "Data distribution over categories is shown in Table 2.",
        "They fall into five categories: Business, Education, Entertainment, Science and Sports.",
        "Some preprocessing steps are applied to Web pages.",
        "First we extract the pure texts of all Web pages, excluding anchor texts which introduce much noise.",
        "Then for Chinese corpus, all Chinese characters with BIG5 encoding first were converted into ones with GB2312 encoding, applied a Chinese segmenter tool by Zhibiao Wu from LDC to our Chinese corpus and removed stop words and words with one character and less than 4 occurrences; for English corpus, we used the stop words list from SMART system (Buckley, 1985) to eliminate common words.",
        "Finally, We randomly split both the English and Chinese document collection into 75% for training and 25% for testing.",
        "we compiled a large general-purpose English-Chinese lexicon, which contains 276,889 translation pairs, including 53,111 English entries and 38,517 Chinese entries.",
        "Actually we used a subset of the lexicon including 20,754 English entries and 13,471 Chinese entries , which occur in our corpus.",
        "Categories_English_Chinese",
        "To investigate the effectiveness of our algorithms on cross-language text categorization, three baseline methods are used for comparison.",
        "They are denoted by ML, MT and LSI respectively.",
        "ML (Monolingual).",
        "We conducted text categorization by training and testing the text categoriza-",
        "Sports",
        "1797",
        "2375",
        "Business",
        "951",
        "1212",
        "Science",
        "843",
        "1157",
        "Education",
        "546",
        "692",
        "Entertainment",
        "1325",
        "575",
        "Total",
        "5462",
        "6011",
        "# of training samples # of training samples",
        "Figure 2: Comparison of the best performance of different methods with various sizes of training set and the entire test set.",
        "Training is conducted over English corpus and testing is conducted over Chinese corpus in the cross language case, while both training and testing are performed over Chinese corpus in the monolingual case.",
        "tion system on document collection in the same language.",
        "MT (Machine Translation).",
        "We used Systran premium 5.0 to translate training data into the language of test data, since the machine translation system is one of the best machine translation systems.",
        "Then use the translated data to learn a model for classifying the test data.",
        "LSI (Latent Semantic Indexing).",
        "We can use the LSI or SVD technique to deduce language-independent representations through a bilingual parallel corpus.",
        "In this paper, we use SVDS command in MATLAB to acquire the eigenvectors with the first K largest eigenvalues.",
        "We take K as 400 in our experiments, where best performance is achieved.",
        "In this paper, we use SVMs as the classifier of our baselines, since SVMs has a solid theoretic foundation based on structure risk minimization and thus high generalization ability.",
        "The commonly used one-vs-all framework is used for the multi-class case.",
        "SVMs uses the SVMlight software pack-age(Joachims, 1998).",
        "In all experiments, the tradeoff parameter C is set to 1.",
        "In the experiments, all results are averaged on 5 runs.",
        "Results are measured by accuracy, which is defined as the ratio of the number of labelled correctly documents to the number of all documents.",
        "When investigating how different training data have effect on performance, we randomly select the corresponding number of training samples from the training set 5 times.",
        "The results are shown in Figure 1 and Figure 2.",
        "From the two figures, we can draw the following conclusions.",
        "First, CLNBC-EM has a stable and good performance in almost all cases.",
        "Also, it can achieve the best performance among cross language methods.",
        "In addition, we notice that CLNBC-D works surprisingly better than CLNBC-EM, when there are enough test data and few training data.",
        "This may be because the quality of the probabilistic bilingual lexicon derived from CLNBC-EM method is poor, since this bilingual lexicon is trained from insufficient training data and thus may provide biased translation probabilities.",
        "To further investigate the effect of varying the amount of test data, we randomly select the corresponding number of test samples from test set 5 times.",
        "The results are shown in Figure 3 and Figure 4, we can draw the following conclusions .",
        "First, with the increasing test data, performance of our two approaches is improved.",
        "Second, CLNBC-EM statistically significantly outperforms CLNBC-D.",
        "From figures 1 through 4, we also notice that MT and LSI always achieve some poor results.",
        "For MT,",
        "Figure 3: Comparison of the best performance of different methods with the entire training set and various sizes of test set.",
        "Training is conducted over Chinese corpus and testing is conducted over English corpus in the cross language case, while both training and testing are performed over English corpus in the monolingual case.",
        "Figure 4: Comparison of the best performance of different methods with the entire training set and various sizes of test set.",
        "Training is conducted over English corpus and testing is conducted over Chinese corpus in the cross language case, while both training and testing are performed over Chinese corpus in the monolingual case.",
        "maybe it is due to the large difference of word usage between original documents and the translated ones.",
        "For example, (Qi Shi) has two common translations, which are cavalier and knight.",
        "In sports domain, it often means a basketball team of National Basketball Association (NBA) in U.S. and should be translated into cavalier.",
        "However, the translation knight is provided by Systran translation system we use in the experiment.",
        "In term of LSI method, one possible reason is that the parallel corpus is too limited.",
        "Another possible reason is that it is out-of-domain compared with the domain of the used document collections.",
        "From Table 3, we can observe that our algorithm is more efficient than three baselines.",
        "The spent time are calculated on the machine, which has a 2.80GHz",
        "Dual Pentium CPU."
      ]
    },
    {
      "heading": "5. Conclusions and Future Work",
      "text": [
        "In this paper, we addressed the issue of how to conduct cross language text categorization using a bilingual lexicon.",
        "To this end, we have developed a cross language naive Bayes classifier, which contains two main steps.",
        "In the first step, we deduce a probabilistic bilingual lexicon.",
        "In the second step, we adopt naive Bayes method combined with EM to conduct cross language text categorization.",
        "We have proposed two different methods, namely CLNBC-D and CLNBC-EM, for cross language text categorization.",
        "The preliminary experiments on collected data collections show the effectiveness of the proposed two methods and verify the feasibility of achieving performance near to monolingual text categorization using a bilingual lexicon alone.",
        "As further work, we will collect larger comparable corpora to verify our algorithm.",
        "In addition, we will investigate whether the algorithm can be scaled to more fine-grained categories.",
        "Furthermore, we will investigate how the coverage of bilingual lexicon have effect on performance of our algorithm.",
        "Table 3: Comparison of average spent time by different methods, which are used to conduct cross-language text categorization from English to Chi-",
        "Methods Preparation Computation",
        "\"Machine Translation Cost *SVD Decomposition Cost",
        "Acknowledgements.",
        "The authors would like to thank three anonymous reviewers for their valuable suggestions.",
        "This work was partially supported by the National Natural Science Foundation of China under the grants NSFC 60375022 and",
        "NSFC 60473040, and the Microsoft Laboratory for",
        "Intelligent Computing and Intelligent Systems of Shanghai Jiao Tong University."
      ]
    }
  ]
}
