{
  "info": {
    "authors": [
      "Ahmed El Kholy",
      "Nizar Habash"
    ],
    "book": "INLG 2012 Proceedings of the Seventh International Natural Language Generation Conference",
    "id": "acl-W12-1514",
    "title": "Rich Morphology Generation Using Statistical Machine Translation",
    "url": "https://aclweb.org/anthology/W12-1514",
    "year": 2012
  },
  "references": [
    "acl-N07-1022",
    "acl-P02-1040",
    "acl-P05-1071",
    "acl-P07-1017",
    "acl-P07-2045",
    "acl-P08-1059",
    "acl-P08-2039",
    "acl-P11-1004",
    "acl-P11-2062",
    "acl-W04-3219"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present an approach for generation of morphologically rich languages using statistical machine translation.",
        "Given a sequence of lemmas and any subset of morphological features, we produce the inflected word forms.",
        "Testing on Arabic, a morphologically rich language, our models can reach 92.1% accuracy starting only with lemmas, and 98.9% accuracy if all the gold features are provided."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Many natural language processing (NLP) applications, such as summarization and machine translation (MT), require natural language generation (NLG).",
        "Generation for morphologically rich languages, which introduce a lot of challenges for NLP in general, has gained a lot of attention recently, especially in the context of statistical MT (SMT).",
        "The common wisdom for handling morphological richness is to reduce the complexity in the internal application models and then generate complex word forms in a final step.",
        "In this paper,1 we present a SMT-based approach for generation of morphologically rich languages.",
        "Given a sequence of lemmas and any subset of morphological features, we produce the inflected word forms.",
        "The SMT model parameters are derived from a parallel corpus mapping lemmas and morphological features to the inflected word forms.",
        "As a case study, we focus on Arabic, a morphologically rich language.",
        "Our models can reach 92.1% accuracy starting only with tokenized lemmas and predicting some features, up from 55.0% accuracy without inflecting the lemmas.",
        "If all of the gold morphological features are provided as input, our best model achieves 98.9% accuracy."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "In the context of morphological generation for MT, the state-of-the-art factored machine translation approach models morphology using generation factors in the translation process (Koehn et al., 2007).",
        "One of the limitations of factored models is that generation is based on the word level not the phrase level and the context is only captured through a language model.",
        "Minkov et al. (2007) and Toutanova et al.",
        "(2008) model translation and morphology independently for English-Arabic and English-Russian MT.",
        "They use a maximum entropy model to predict inflected word forms directly.",
        "Clifton and Sarkar (2011) use a similar approach for English-Finnish MT where they predict morpheme sequences.",
        "Unlike both approaches, we generate the word forms from the deeper representation of lemmas and features.",
        "As for using SMT in generation, there are many previous efforts.",
        "Wong and Mooney (2007) use SMT methods for tactical NLG.",
        "They learn through SMT to map meaning representations to natural language.",
        "Quirk et al. (2004) apply SMT tools to generate paraphrases of input sentences in the same language.",
        "Both of these efforts target English, a morphologically poor language.",
        "Our work is conceptually closer to Wong and Mooney (2007), except that we focus on the question of morphological generation and our approach includes an optional feature prediction component.",
        "In a related publication, we integrate our generation model as part of end-to-end English-Arabic SMT (El Kholy and Habash, 2012).",
        "In that work, we make use of English features in the Arabic morphology prediction component, e.g., English POS and parse trees."
      ]
    },
    {
      "heading": "3 Arabic Challenges",
      "text": [
        "Arabic is a morphologically complex language.",
        "One aspect of Arabic's complexity is its orthography which often omits short vowel diacritics.",
        "As a result, ambiguity is rampant.",
        "Another aspect is the various attachable clitics which include conjunction proclitics, e.g., +?",
        "w+ ?and?, particle proclitics, e.g., +?",
        "l+ ?to/for?, the definite article +?",
        "@ Al+ ?the?, and the class of pronominal enclitics, e.g., ?",
        "?+ +hm ?their/them?.",
        "Beyond these clitics, Arabic words inflect for person (PER), gender (GEN), number (NUM), aspect (ASP), mood (MOD), voice (VOX), state (STT) and case (CAS).",
        "Arabic inflectional features are realized as affixes as well as templatic changes, e.g., broken plurals.",
        "These three phenomena, optional diacritics, attachable clitics and the large inflectional space, lead to thousands of inflected forms per lemma and a high degree of ambiguity: about 12 analyses per word, typically corresponding to two lemmas on average (Habash, 2010).",
        "The Penn Arabic Treebank (PATB) tokenization scheme (Maamouri et al., 2004), which we use in all our experiments, separates all clitics except for the determiner clitic Al+ (DET).",
        "As such we consider the DET as an additional morphological feature.",
        "Arabic has complex morpho-syntactic agreement rules in terms of GEN, NUM and definiteness.",
        "Adjectives agree with nouns in GEN and NUM but plural irrational nouns exceptionally take feminine singular adjectives.",
        "Moreover, verbs agree with subjects in GEN only in VSO order while they agree in GEN and NUM in SVO order (Alkuhlani and Habash, 2011).",
        "The DET in Arabic is used to distinguish different syntactic constructions such as the possessive or adjectival modification.",
        "These agreement rules make the generation of correctly inflected forms in context a challenging task."
      ]
    },
    {
      "heading": "4 Approach",
      "text": [
        "In this section, we discuss our approach in gener",
        "ating Arabic words from Arabic lemmas (LEMMA) using a pipeline of three steps.",
        "1.",
        "(Optional)Morphology Prediction of linguistic features to inflect LEMMAs.",
        "+?+?",
        "w+s+yktbwn +hA ?and they will write it?.",
        "Features?",
        "order of presentation is: PER, GEN, NUM, ASP, VOX, MOD, DET, CAS, and STT.",
        "The value ?na?",
        "is for ?not-applicable?.",
        "2.",
        "Morphology Generation of inflected Arabic tokens from LEMMAs and any subset of Arabic linguistic features.",
        "3.",
        "Detokenization of inflected Arabic tokens into surface Arabic words.",
        "Morphology generation is the main contribution of this paper which in addition to detokenization represents an end-to-end inflection generator.",
        "The morphology prediction step is an optional step that complements the whole process by enriching the input of the morphology generation step with one or more predicted morphological features.",
        "We follow numerous previously published efforts on the value of tokenization for Arabic NLP tasks (Badr et al., 2008; El Kholy and Habash, 2010).",
        "We use the best performing tokenization scheme (PATB) in machine translation in all our experiments and focus on the question of how to generate Arabic inflected words from LEMMAs and features.",
        "Figure 1 shows an example of a tokenized word and its decomposition into a LEMMA and morphological features.",
        "Morphology Prediction This optional step takes a sequence of LEMMAs and tries to enrich them by predicting one or more morphological features.",
        "It is implemented using a supervised discriminative learning model, namely Conditional Random Fields (CRF) (Lafferty et al., 2001).",
        "Table 1 shows the accuracy of the CRF module on a test set of 1000 sentences compared to using the most common feature value baseline.",
        "Some features, such as CAS and STT are harder to predict but they also have very low baseline values.",
        "GEN, DET and NUM have a moderate prediction accuracy while ASP, PER, VOX and MOD have high prediction accuracy (but also very high baselines).",
        "This task is similar to POS tagging",
        "bic lemmas (LEMMA).",
        "The second column shows the baseline for prediction using the most common feature value.",
        "The third column is the prediction accuracy using CRF.",
        "except that it starts with lemmas as opposed to inflected forms (Habash and Rambow, 2005; Alkuhlani and Habash, 2012).",
        "As such, we expect it to perform worse than a comparable POS tagging task.",
        "For example, Habash and Rambow (2005) report 98.2% and 98.8% for GEN and NUM, respectively, compared to our 84.2% and 87.3%.",
        "In the context of a specific application, the performance of the prediction could be improved using information other than the context of provided LEMMAs.",
        "For example, in MT, source language lexical, syntactic and morphological information could be used in the prediction module (El Kholy and Habash, 2012).",
        "The morphology prediction step produces a lattice with all the possible feature values each having an associated confidence score.",
        "We filter out options with very low confidence scores to control the exponential size of the lattice when combining more than one feature.",
        "We tried some experiments using only one or two top values but got lower performance.",
        "The morphology generation step takes the lattice and decides on the best target inflection.",
        "Morphology Generation This step is implemented using a SMT model that translates from a deeper linguistic representation to a surface representation.",
        "The model parameters are derived from a parallel corpus mapping LEMMAs plus morphological features to Arabic inflected forms.",
        "The model is monotonic and there is neither reordering nor word deletion/addition.",
        "We plan to consider these variations in the future.",
        "The main advantage of this approach is that it only needs monolingual data which is abundant.",
        "The morphology generation step can take a sequence of LEMMAs and a subset of morphological features directly or after enriching the sequence with one or more morphological features using the morphology prediction step.",
        "Detokenization Since we work on tokenized Arabic, we use a detokenization step which simply stitches the words and clitics together as a post-processing step after morphology generation.",
        "We use the best detokenization technique presented by El Kholy and Habash (2010)."
      ]
    },
    {
      "heading": "5 Evaluation",
      "text": []
    },
    {
      "heading": "Evaluation Setup All of the training data we use",
      "text": [
        "is available from the Linguistic Data Consortium (LDC).3 For SMT training and language modeling (LM), we use 200M words from the Arabic Giga-word corpus (LDC2007T40).",
        "We use 5-grams for all LMs implemented using the SRILM toolkit (Stol-cke, 2002).",
        "MADA+TOKAN (Habash and Rambow, 2005; Habash et al., 2009) is used to preprocess the Arabic text for generation and language modeling.",
        "MADA+TOKAN tokenizes, lemmatizes and selects all morphological features in context.",
        "All generation experiments are conducted using the Moses phrase-based SMT system (Koehn et al., 2007).",
        "The decoding weight optimization is done using a set of 300 Arabic sentences from the 2004 NIST MT evaluation test set (MT04).",
        "The tuning is based on tokenized Arabic without detokenization.",
        "We use a maximum phrase length of size 4.",
        "We report results on the Arabic side of the 2005 NIST MT evaluation set (MT05), our development set.",
        "We use the Arabic side of MT06 NIST data set for blind test.",
        "We evaluate using BLEU-1 and BLEU-4 (Papineni et al., 2002).",
        "BLEU is a precision-based evaluation metric commonly used in MT research.",
        "Given the way we define our generation task to exclude reordering and word deletion/addition, BLEU",
        "that appear in the reference divided by the number of all possible n-word sequences in the test.",
        "is generally written without diacritics, we evaluate on undiacritized text only.",
        "In the future, we plan to study generation into diacritized Arabic, a more challenging goal.",
        "Baseline We conducted two baseline experiments.",
        "First, as a degenerate baseline, we only used detokenization to generate the inflected words from LEMMAs.",
        "Second, we used a generation step before detokenization to generate the inflected tokens from LEMMAs.",
        "The BLEU-1/BLEU-4 scores of the two baselines on the MT05 set are 55.04/24.51 and 91.54/82.19.",
        "We get a significant improvement (?35% BLEU-1 & ?58% BLEU-4) by using the generation step before detokenization.",
        "Generation with Gold Features We built several SMT systems translating from LEMMAs plus one or more morphological features to Arabic inflected tokens.",
        "We then use the detokenization step to recombine the tokens and produce the surface words.",
        "Table 2 shows the BLEU scores for MT05 set as LEMMAs plus different morphological features and their combinations.",
        "We greedily combined the features based on the performance of each feature separately.",
        "Features with higher performance are combined first.",
        "As expected, the more features are included the better the results.",
        "Oddly, when we add the POS to the feature combination, the performance drops.",
        "That could be explained by the redundancy in information provided by the POS given all the other features and the added sparsity.",
        "Although STT and MOD features hurt the performance when added incrementally to the feature combination, removing them from the complete feature set led to a drop in performance.",
        "We suspect that there are synergies in combining different features.",
        "We plan to investigate this point extensively in the future.",
        "BLEU scores are very high because the input is golden in terms of word order, lemma choice and features.",
        "These scores should be seen as the upper limit of our model's performance.",
        "Most of the errors are detokenization and word form underspecification errors.",
        "Generation with Predicted Features We compare results of generation with a variety of predicted features (see Table 3).",
        "The results show that using predicted features can help improve the generation quality over the baseline in some cases, e.g.,",
        "(LEMMA) plus different sets of morphological features.",
        "Results are in (BLEU-1 & BLEU-4) on our MT05 set.",
        "?++?",
        "means the feature is added to the set of features in the previous row.",
        "when the LEMMAs are enriched with CAS, ASP, PER, VOX or MOD features.",
        "Our best performer is LEMMA+MOD.",
        "Unlike gold features, greedily combining predicted features hurts the performance and the more features added the worse the performance.",
        "One explanation is that each feature is predicted independently which may lead to incompatible feature values.",
        "In the future, we plan to investigate ways of combining features that could help performance such predicting more than one feature together and filtering out bad feature combinations.",
        "The feature prediction accuracy (Table 1) does not always correlate with the generation performance, e.g., CAS has lower accuracy than GEN, but has a relatively higher BLEU score.",
        "This may be due to the fact that some features are mostly realized as diacritics (CAS) which are ignored in our evaluation.",
        "Blind Test Set To validate our results, we applied different versions of our system to a blind test set (MT06).",
        "Our results are as follows (BLEU-1/BLEU-4): detokenization without inflection (55.64/24.92), generation from LEMMAs only (86.70/72.69), generation with gold MOD feature (87.00/73.31), and generation with predicted MOD feature (86.96/73.29).",
        "These numbers are generally",
        "of predicted morphological features.",
        "Results are in (BLEU-1 & BLEU-4) on our MT05 set.",
        "?++?",
        "means the feature is added to the set of features in the previous row.",
        "lower than our development set, but the trends and conclusions are consistent."
      ]
    },
    {
      "heading": "6 Conclusion and Future Work",
      "text": [
        "We present a SMT-based approach to generation of morphologically rich languages.",
        "We evaluate our approach under a variety of settings for Arabic.",
        "In the future, we plan to improve the quality of feature prediction and test our approach on other languages."
      ]
    }
  ]
}
