{
  "info": {
    "authors": [
      "William J. Rapaport"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P85-1006",
    "title": "Meinongian Semantics for Propositional Semantic Networks",
    "url": "https://aclweb.org/anthology/P85-1006",
    "year": 1985
  },
  "references": [
    "acl-J82-1002",
    "acl-P84-1016"
  ],
  "sections": [
    {
      "heading": "MEINONG1AN SEMANTICS FOR PROPOSITIONAL SEMANTIC NETWORKS",
      "text": []
    },
    {
      "heading": "ABSTRACT",
      "text": [
        "This paper surveys several approaches to semantic-network semantics that have not previously been treated in the Al or computational linguistics literature.",
        "though there is a large phi lo.",
        "sophical literature investigating them in some detail.",
        "In particular.",
        "propositional semantic networks (exemplified by S\\ePS) .ire dis cussed.",
        "it IS argued that only a fully intensional (\"Meinongian\") semantics is appropriate or them, and several Meinongian systems ,ire presen ted."
      ]
    },
    {
      "heading": "I. SEMANTICS OF SEMANTIC NETWORKS.",
      "text": [
        "Semantic networks have prosecl to be a usetul data structure for representing int ormation.",
        "i.e.. .1 \"knowledge- representation sirs tem.",
        "(A better terminology is \"belief epI esentaliort system; cl.",
        "Rapaport and Shapiro 1984, Rapaport 198-11)).",
        "Hie idea is in old one: l nheritance networks (Fig.",
        "1 I. like those oi )uillian 196X.",
        "Bohrow and Winograd's KR1.",
        "(1977), or Ilrachman's KI (P.I.",
        "(1979), hear strong family resemblances to \"Porphyry's Free\" (1112.",
        "2) – a mediaeval device used to illustrate the Aristotelian theory 01 definition by species and differentia (cis Isretymann 1966.",
        "Ch.",
        "2: kneale and Isneale 1966: 232).",
        "It has been pointed out that there is nothing essentially \"semantic\" about semantic networks (Hendrix 1979; but cf. Woods 1975, Brachman 1979).",
        "Indeed, viewed as a data structure.",
        "it is arguable that a semantic network is a language rAK,uhlv with an associated logic or inference mechanism) for representing information about some domain, and, as such, is .1 purely .syntactic entity.",
        "They have come to he called \"semanticprimarily because of their uses as ways of representing the meanings iii linguistic items.",
        "As a notational device, a semantic network can itseil ht given a semantics.",
        "That is, the arcs, nodes, and rules ot a semantic network representational system can be given interpretations in terms oh the entities they are used to represent.",
        "Without such a semantics, a semantic network is an arbitrary notational device liable to misinterpretation (cf. Woods 1975; Brachman 1977.",
        "1983: McDermott 1981).",
        "The task ot providing a semantics for semantic networks is more akin to the task of providing a semantics for a language than for a logic, since in the latter case, hut not in the",
        "tinner, notions like argument validity must be established and connections must lie made with axioms ,Incl rules .1i inierence.",
        "culminating ideally in soundness J id completeness theorems.",
        "But underlying the logic's semantics there must he a semantics !or the logic's under( vine language.",
        "and I Ins V.11111d lie go.",
        "en in terms of such .1 notion as rilearting.",
        "I lere.",
        "typically.",
        "an interpretation fund.",
        "thin is established!",
        "between syntactical items I rorn the language I. and iintiilogical items I rom the \"world- W that the language is to describe.",
        "Flos, in turn, is usually acoimplislied by describing the in .1 not her language.",
        "I. .",
        "and showing that I. and I. ire notational variants hy showing that they are isomorphic.",
        "Recently, linguists and philosophers have argued for the importance ot intensional semantics for natural languages (cf. \\ion-agl1C 197-1, Parsons 198(1. kapanort 1981).",
        "At the same time, computational linvuists and other Al researchers have neeun to recognue the importance oi representing intensional entities (cf. Woods 1975, Brachman 1979, !Mc( 'arthy 1979, \\laida and Shapiro 1982).",
        "It seems reasonable that .1 semantics I or such a representational system should itself be an intensional semantics.",
        "In this paper, I outline several fully intensional semantics for intensional semantic networks by discussing the relations between a semanttc-network \"language- I. and several candidates for I. .",
        "For I., I focus on Shapiro's propasitional Semantic Network Processing System (SNePS: Shapiro 1979).",
        "for which Israel (1983) has offered a passible-worlds semantics.",
        "But possible-worlds semantics, while countenancing intensional entities, are not fully intensional, since they treat intensional entities extensionally.",
        "The Lws I discuss all",
        "tional network (see helov.-).",
        "It can, however.",
        "also he used to represent the inheritability of properties.",
        "either hv explicit rules or by path-based inference (Shapiro 19781.",
        "It consists of labeled nodes and labeled, directed arcs satisfying (inter alia) the following condition (cf.",
        "Militia and Shapiro 1982): S) There is a 1-1 correspondence hetween nodes and represented concepts.",
        "A concept is \"anything about which information can he stored and/or transmitted\" (Shapiro 1979: 179).",
        "When a semantic network such as SNePS is used to model \"the belief structure of a thinking.",
        "rea.soninv.",
        "language using being\" (Maida and Shapiro 1982: 296: cf. Shapiro 1971h: 513), the concepts are the oblects of mental (.1.e.„ intentiona() acts such as thinking.",
        "heliev:ng.",
        "wishing, etc.",
        "Such ohrcts are intensional (O. Rapaport 1978).",
        "It follows I root (S) that the arcs do not represent concepts.",
        "Rather.",
        "they represent binary, structural relations between concepts.",
        "if It is desired to talk about certain relations between concepts, tnen those relations must he represented by nodes, since they have then become objects oi thought, i.e.. concepts.",
        "In terms of Quote's dictum that \"to be is to be the value of a [bound] variable\" (Quine 1980: 15; cf. Shapiro 1971a: 79-80).",
        "nodes represent such values, arcs do not.",
        "That is.",
        "given a domain of discourse – including items, n arv relations among them, and propositions – SNePti nodes would he used to represent all members of the domain.",
        "The arcs :ire used to structure the items, relations.",
        "and piopositions of the domain into (other) proptisitions.",
        "As an analogy, SNePS arcs are to SNePS nodes as the svmools '-•• and are to the symbols '5', *NP', and 'VP.",
        "in the rewrite rule: S + VP.",
        "It is because no propos' tions are represented by arcs that SNePS is a \"propositional\" semantic network (ci.",
        "Maida and Shapiro 1982:292).",
        "When a semantic network such as SNePS is used to model a mind, the nodes represent only intensional items (Maida and Shapiro 1982; cf. Rapaport 1978).",
        "Similarly, if such a network were to he used as a notation for a fully intensional natural-language semantics (such as the semantics presented in Rapaport 1981), the nodes would represent only intensional items.",
        "Thus, a semantics for such a network ought itself to he fully Intensional.",
        "There are two pairs of types of nodes in SNePS: constant and variable nodes, and atomic (or individual) and molecular (or propositional) nodes.",
        "(Molecular individual nodes :ire currently being implemented: see Sect.",
        "7.",
        "8.",
        "For a discussion ill the semantics of variable nodes.",
        "see Shapiro 1985.)",
        "Except for a few predefined arcs for use by an inference package.",
        "all arc labels are chosen by the user: such labels are completely arbitrary (albeit often mnemonic) and depend on the domain being represented.",
        "The \"meanings\" of the labels are provided (by the user/ only by means of explicit rule nodes, w loch allow the retrieval or construction Ow inferencing) of propositional nodes."
      ]
    },
    {
      "heading": "3. ISRAEL'S POSSIBLE-WORLDS SEMANTICS FOR SNePS.",
      "text": [
        "David Israel's semantics (or SNel'S assumes \",the general framework of Kripke-Montague style model theoretic accounts\" (Israel 1983: 3), presumably because he takes it as \"quite clear that (Maida and Shapirol ... view their formalism is a Montague type type theoretic, intensional system\" (Israel 1983: 2).",
        "Ile introduces \"a domain /) ,a possible entities, a non empty set / ( ot possible worldsl„ind ... a distinguished element w of / to represent the real world\" (Israel 1983: .11. oldicidwd ‘sairept is ,1 ItInc• non it: : / /).",
        "Each ,:onstant individual ',Nei', node is modeled hy an ic; variable individual nodes :ire handled by 'assignments relative to such a model\".",
        "However, predicates – w:hic h. the reader should retail, are also represented in elfti by constant individual nodes – are modelled as functions \"I root / into the power set oi the set ol individual concepts.\" Propositional nodes are modelled by \"functions from / into li , El,\" although Israel (eels that a \")iyperintensional\" logic would he needed in order to handle propositional attitudes.",
        "Israel has difficulty interpreting ((ASS.",
        "and ISA arcs in this I ramework.",
        "This is to he expected for rA‘o reasons.",
        "First.",
        "it is arguably a mistake to inter prm them (rather than giving rules tor them), since they are arcs, hence arbitrary and non-conceptual.",
        "Second, a possible worlds semantics is not the best approach (nor is It \"clear\" that this is what Maida and Shapiro had in mind – indeed, they explicitly reject it: cf. Maida and Shapiro 1982: 297).",
        "Israel himself hints at the inappropriateness 01 this a ppri lac h: if one is focussing on propositional attituclekl ... it can seem like a waste tit time to introduce model-theoretic accounts of intensionalitv at all.",
        "Thus the air of desperation about the foregoing attempt ... .",
        "(Israel 1983: 5.)",
        "Moreover – and significantly – a possible-worlds approach is misguided if one wants to be able to represent impossible oh,el.ts, as ,,ne should want to if one is doing natural-language semantics (Rapaport 1978, 1981: Routley 1979).",
        "A 1.1.111V intensional semantic network demands a fully intensional semantics.",
        "The main rival to Montague-style, possible-worlds semantics (as well as to its close kin, situation semantics (lkirwise and Perry 196.10 is Meittonqian semantics."
      ]
    },
    {
      "heading": "4. MEINONG'S THEORY OF OBJECTS.",
      "text": [
        "Alexius Memong*s (1904) theory of the ohjects of psychological acts is a more appropnate foundation for a semantics of propositional semantic networks as well as for a natural-language semantics.",
        "In brief, Meinong's theory consists of the following theses (cf. Rapaport 1976, 1978): (M1) Thesis of Intentionality: livery mental act (e.g.. thinking, believing, judging, etc.)",
        "is \"directed\" towards an \"object\".",
        "There are two kinds of Memongian objects: (1) objecta.",
        "the individual-like objects of such a mental act as thinking-of, and (2)",
        "objectives, the proposition-like objects of such mental acts as believing( -that) or knowing(-that).",
        "E.g., the object of my act of thinking of a unicorn is: a unicorn; the object of my act of believing that the larth is Hat is: the Earth is flat.",
        "(M2) Not every object of thought exists (technically, \"has being\").",
        "(M3) It is not self-contradictory to deny, nor tautologous to affirm.",
        "existence of an object of thought.",
        "(M4) Thesis of Aussersein: All objects of thought are ausser-seiend (\"beyond being and non-being\").",
        "For present purposes, Aussersein is most easily explicated as a domain of quantification for non-existentially-loaded quantifiers, required by (NI2) and (M3).",
        "(M5) Fvery object of thought has properties (technically.",
        "\"Sosein\").",
        "(Mb) Principle of Independence: (M2) and (N15) are not inconsistent.",
        "(For more discussion.",
        "cf. Rapaport 1984c.)",
        "('oroBury: Even objects of thought that do not exist have properties.",
        "(N17) Principle of Et eedom of Assumption: (a) Every set of properties (Sosein) corresponds to an ohiect if thought.",
        "(b) Every object oi thought can he thought of ( relatice to certain \"performance' limitations).",
        "(N18) Some objects of ihought are incomplete (1.e.. undetermined with respect to some properties).",
        "(M9) The meaning oi every sentence and noun phrase is an object of thought.",
        "It should be obvious that there is a close relationship between Meinong's theory and a fully intensional semantic network like SNePS.",
        "SNel'S itself is much like Aussersein: Shapiro (personal communication) has said that all nodes are implicitly in the network all the time.",
        "In particular.",
        "a SNePS base (i.e.. atomic constant) node represents an objectum, and a SNePS propositional node represents an objective.",
        "'Illus.",
        "when SNel'S is used as a model of mind, propositional nodes represent the objectives of beliefs (a. Maida and Shapiro 1982.",
        "Rapzirxirt and Shapiro 1984.",
        "Rapaport 1984b): and when SN.",
        ":I'S is used in a natural-language processing system (cf. Shapiro 1982.",
        "Rapaport and Shapiro 1984), individual nodes represent the meanings of noun phrases and verb phrases, and propositional nodes represent the meanings of sentences.",
        "Meinong's theory wa.s attacked hv Bertrand Russell on grounds of inconsistency: (1) According to Meinong, the round square is both round and square (indeed, this is a tautology): vet, according to Russell, if it is round.",
        "then it is not square.",
        "(2) Simi-lar(y. the existing golden mountain must ha...e .111 three of its defining properties: being a mountain, heine -0,1clen, and existine: hut.",
        "as Russell noted.",
        "it doesn't exist.",
        "(1.1.",
        "Rapaport 1976.",
        "1978 or ref erences.)",
        "There have been several I ormalizations 01 Memongian theories in recent philosophical literature, each of which overcomes these problems.",
        "In subsequent sections, I briefly describe three of these and show their relationships to SNel'S. (Others, not described (',ere.",
        "include Routlev 1979 – cf.",
        "Rapaport 1984a – and Zalta 1983.)"
      ]
    },
    {
      "heading": "5. RAPAPORT'S THEORY.",
      "text": [
        "On my own reconstruction of Meinong's theory (Rapaport 1976, 1978 – which bears a coincidental resemblance to McCarthy 1979), there are two types of objects: M -ob jects (i.e., the objects of thought, which are intensional) and actual objects (which are extensional).",
        "There are two modes of predication of properties to these: M-objects are constituted by properties, and both N1- and actual objects can exemplify properties.",
        "For instance, the pen with which I wrote the manuscript of this paper is an actual object that exemplifies the property of being white.",
        "Right now, when I think about that pen, the object of my thought is an ..N1-object that is constituted (in part) by that property.",
        "The M-object Jan's pen can be represented as: <belonging to Jan, being a pen> (or, for short, as: <If P>).",
        "Being a pen is also a constituent of this v1-object: P c , P>; and 'Jan's pen is a pen' is true in virtue of this objective.",
        "In addition.",
        "<*.J , 1> exemplifies (ex) the property of being constituted by two properties.",
        "There might be an actual object, say.",
        "corresponding to , P >, that exemplifies the property of being a pen (a ex I') as well as (say) the property of being 6 inches long.",
        "But being 6 inches long (t el.",
        "P The M-object the round square.",
        "R S is constituted by precisely two properties: being round ( R) and being square (S1; 'The round square is round' is true in virtue of this, and 'The round square is not square' is false in virtue of it.",
        "But , > exemplifies neither of those properties.",
        "and 'The round square is not square' is true in virtue of that.",
        "I.e., 'is.",
        "is arnhieuous.",
        "An NI object 0 exists it there is an actual object ti that is \"Sem correlated witfi it: ims ft 3,4 ,,sco I irr",
        "The intensional fragment of this theory can he used to provide a semantics for SNel'S in much the same way that it can been used to provide a semantics for natural languaee (Rapaport 1981).",
        "tiNel'S base nodes can he taken to represent %I nibiecta and properties: tiNel'S propositional nodes Lan be taken to represent \\.1 objectives.",
        "Two alternatiL es ior net V■ orks representine the three ‘.1 tthiectives:"
      ]
    },
    {
      "heading": "S • R.S and RS' ex being int poS)ibie are",
      "text": [
        "show n in Figs.",
        "-I setond can be used to ,l\\ id \"Clark's Fig. 4.",
        "A SNePS representation of The round square is round', 'The round square is square', and 'The round square is impossible' on Rapaport's theory.",
        "paradox\": see Rapaport 1978.",
        "1982.1 Actual (i.e.. extensional) objects, however, should not he represented (ci.",
        "\\Lucia and Shapiro 1982: 206 98).",
        "To the extent to which such objects are essential to this Meinongian theory.",
        "the present thei■ry is perhaps an inappropriate one.",
        "(A similar remark holds, of course, for NIcCarthy 1979.)"
      ]
    },
    {
      "heading": "6. PARSONS'S THEORY.",
      "text": [
        "Terence l'arsons's theory of nonexistent objects (1980; cf. Rapaport 1976, 1978, 1985) recognizes onlv one type of object – intensional ones – and only one mode of predication.",
        "But it has two",
        "types of properties: nuclear and extranucleat.",
        "Ihe former includes all \"ordinary\" properties such as: being red, being round.",
        "etc.",
        "; the latter includes such properties as: existing, being impossible.",
        "etc.",
        "But the distinction is blurry, since for each extranuclear property, there is a corresponding nuclear one.",
        "For every set of nuclear pro perties, there is a unique ohiect that has only those properties.",
        "Existing obiects must he complete (and.",
        "of course, consistent).",
        "though not all such obiects exist.",
        "For instance.",
        "the Morning Slur and the Evening Star don't exist til these are taken to consist, roughly, of only two properties each).",
        "The t ound square.",
        "of course.",
        "is (and only is/ both round and square ,ind.",
        "so, isn't non-square; though it is.",
        "for that reason, impossible.",
        "hence not real.",
        "As lor the existing golden mountain.",
        "existence is extra nuclear, so the set ol these three properties doesn't !lace a corresponding object.",
        "There is, however.",
        "a \"watered down\".",
        "nuclear xersion ot existence, and there is an existing golden mountain that has that property; hut it doesn't have the extranuclear property oh existence, and, so it doesn't exist.",
        "Parsons's theory could pros idea semantics for SNePS.",
        "though the use of two types of properties places restrictions on the passible uses of SNePS.",
        "On the other hand.",
        "SNePS could be used to represent Parsons's theory (though a device would he needed for marking the distinction between nuclear and extranuclear properties) and, hence.",
        "together with Parsons's natural language semantics, to provide a tool for computational linguistics.",
        "Fig.",
        "b suggests how this might he done.",
        "Fig.",
        "6.",
        "A SNePS representation of 'The round square is round, square, and impossible' on Parsons's theory."
      ]
    },
    {
      "heading": "7. CASTAREDA'S THEORY.",
      "text": [
        "llector-Neri Castarrecia's theory of \"guises\" (1972.",
        "1975a-c. 1977, 1979, 1980) is a better candidate.",
        "It is a fully intensional theory with one type of object: guises (intensional items corresponding to sets of properties).",
        "and one type of property.",
        "More precisely, there are properties (e.g., being round, being square, being blue, .. .",
        "sets of these (called guise cores: e.g.. (being round, being square}).",
        "and an ontic counterpart, c, of the definite-description operator, which is used to form guises: e.g., cibeing round, being square} is the round square.",
        "Guises can be understood.",
        "roughly, as things-under-a-description, as \"facets\" of (physical and non-physical) objects.",
        "as \"roles\" that objects play, or, in general, as objects of thought.",
        "Guise theory has two modes of predication: internal and external.",
        "In general.",
        "the guise c(... F .",
        "is-internally E. F.g., the guise (named by) the round square is-internally only round and square.",
        "The two guises the tallest mountain and Mt.",
        "Everest are related by an external mode of predication called consubstantiation (C*).",
        "Consubstantiation is an equivalence relation that is used in the analyses of (1) external predication, (2) co-reference.",
        "and (3) existence: Let a = ci... F...",
        "I he a guise and let a[G]=4!",
        "F u (C I).",
        "Then I I) a is-externally G (in one sense) if C* (a .",
        "a(G D. For instance.",
        "'the Morning Star is a planet' is true because C**(ciM.",
        "S1.",
        "clM, S, PO: i.e.. the Morning Star and the Morning Star that is a planet are consubstantiated.",
        "(2)Guise a \"is the same as\" guise b if and only if (-\"ab.",
        "For instance, 'the Morning Star is the same as the [vening Star' is true because \"WM, Si.",
        "di... SR And I a exists il and only if there is a guise b suLti that ( Another external mode of predication is con.socidtion This is also an equivalence relation, hut one that holds between guises that a mind lias \"put together\".",
        "i.e... between guises in a \"belief space\".",
        "I-or instance, C\"(Ilamlet.",
        "the Prince of Iknmark and C\" correspond almost exactly to the use it the FOUR' arc in SNel'S. Mania and Shapiro (1)82: 303i I use the EQUIV case-frame to represent co reference Wind) Is what C hut.",
        "as I have suggested in Rapaport 1954b.",
        "F.QUIV more properly represents believed co•reterence – which is what l'\" is.",
        "It should he clear ho“, guise theory can provide a semantics for SNePS.",
        "[h.!.",
        "7 suggests llow this mis2ht he done.",
        "Some problems remain, how ever: in particular, the need to pro., ide SNePS correlate or inter' no) predication and the requirement ol explicating external predication in terms if relations like (\".",
        "\\ote.",
        "too, that nodes m.), m5.",
        "and m8 in Fig. 7 ;ire 'structured Indic iduals\" a sort of molecular base node."
      ]
    },
    {
      "heading": "8. CONCLUSION.",
      "text": [
        "It is possible to provide a bully intensional.",
        "non-possible-worlds semantics for SNel'S and similar semantic network formal isms.",
        "'I he most straightforward wav is to use ‘leinong's theory of objects, though this theory has the disadc antage if not being for-mah/ed.",
        "There are several extant formal Memongtan theories that can be used, tht:ogh each has certain disadvantages or problems.",
        "Two lines of research are currently hemg investigated: (1) Take SNePS as is.",
        "and provide a new, formal Meinongian theory for its semantic :.;,undation.",
        "Tilts has not been discussed here, hut the way to do this should he clear from the possibilities examined above.",
        "MY own theory (stripped if its extensional fragment) or a modiriu:.ion if ('astarteda's theory seem the most promising approaches.",
        "(2 \\load V SNel'S so that one of the extant formal ‘ieini;r”■ian theories can he so used.",
        "SNePS is, in fact, currently being modified by the SNel'S Research Group – for independent reastais .1'1 ways that make It closer to sastarieda's guise theory, by :he introduction of structured individuals--\"hase nodes\" with descending arcs for indicating their \"internal structure\"."
      ]
    },
    {
      "heading": "ACKNOWLEDGMENTS.",
      "text": []
    },
    {
      "heading": "Research Development Fund grant .150-9216-F. I am graceful to Stuart C. Shapiro, Hector-Neri Castarteda, and the members of the SNePS Research Group for comments and discussion.",
      "text": []
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
