{
  "info": {
    "authors": [
      "Makoto Nagao",
      "Jun'ichi Tsujii"
    ],
    "book": "ACL Microfiche Series 1-83, Including Computational Linguistics",
    "id": "acl-J79-1041",
    "title": "Analysis of Japanese Sentences by Using Semantic and Contextual Information",
    "url": "https://aclweb.org/anthology/J79-1041",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "heading": "Summary",
      "text": [
        "The organization of a natural language (Japanese) parser is described.",
        "The parser caa transform fairly complex sentences into abstract structures rked for case.",
        "A variation on the system developed by Woods culled an nted Transition Network\" is used as' the program for analysis.",
        "The parser utilizes detailed semantic dictionary descriptions and contextual information abstracted from sentences analyzed in sequence.",
        "It is claimed that intuitive reas.oning, which is not easily formalized by d logical operations, plays an important role in language understanding Some intuitively appealing schemes of representation for both the semantic descriptions of words and conte\\t are discussed Meanings of verbs are described by using a 'case' concept.",
        "Additional intormation is attached to case frames of each verb to indicate what changes the !case elements in the frame may undergo and what events may occur in succession, naanings of nouns are also expressed in case-frame-like descriptions.",
        "No,6ns also have relational slots which must be filled in b other words of phrases.",
        "The context is represented in a form similar to that of the semantic network of Simmons or the nodespace of Norman along with some added special lists (NS - Noun Stack, HNS - Hypothetical Noun Stack, TL - Trapping List) These lists contain objects mentioned tr previous sentences or pending problems which ma be resolved by succeeding sentences The objectsin NS are ordered according to their degrees f importance in the context.",
        "Several new techniques based on heuristically admissible operations Are presented to analyze 1) comple and long noun phrases 2) conjunf-tive phrases 3) anaphoric expression and 4) omitted words in/ phrases or sentences The result's of applying the parsing program to the sentences in a textbook of elementary chemistry are also presented."
      ]
    },
    {
      "heading": "I INTRODUCTION",
      "text": [
        "In, this paper we describe the organization of the natural language parser developed over the last two years.",
        "This foxes an important part of a question-answering system under development with natural language (Japanese) input.",
        "The parser can transform fairly complex sinto abstract structures marked for case.",
        "It utilizes detailed s dictionary descriptions and contextual information ab,;tracted from the preceding sentences.",
        "For the present,, we hove confined the domain of the system to the field of elementary chemistry where we can describe the semantic world in rather concretE terms At the same time, various complec events occur in this field For example, substances which participate in particular events may disappear, new substances may emerge, or some properties of the substances may be altered To treat these comple situations, it was necessary to formally represent relationships between events and chaiages of state and to devise an appropriate schema of representing context.",
        "In most approaches to the understanding of natural language through artificial intelligence, schemas which entail rigid logical operations are used to represent both knowledge and context Logical operations appear to be necessary for solving some kinds of problems in natural language, especially at the deep deductive level of understanding.",
        "However, intuitive reasoning is not easily formalized in terms of logical operations It is our contention that intuitive reasoning is completely based on the language activity in the human brain Associative functions relating to semantic similarities between words, semantic depth of an interpretation and probability of associative occurrence of events are inherent factors in intuitive understanding and the reasoning process.",
        "Y. Wilke (1975) in his system carries out intuitive reasoning by employing the notion of 'semantic preference'.",
        "His system seems to work well on analyzing local relationships among words.",
        "However, in order to nalyze more global relationships (e.g., in dealing with complex cases of anaphora) we require access to Agofe information than can be contained in formulas (template 8epe4laTed with the lexicon.",
        "We find Wilks' use of 'CS-inference rules' rather awkward.",
        "The system would be much improved if accompanied by an appropriate schema for representing context.",
        "'Case grammar' sentence-analysis theories such as those of Fillmore (1968) and Celce-Murcia (1972) are based on the semantic relationships between verbs and nouns -- events and concepts, R. F. Simmons (1973; 1975), D A. Norman (1973), D. E. Rumelhart (1973) and so on follow these theories to represent knowledge and context in their systems.",
        "We also adopted case a r and modified it to account for Japanese sentences.",
        "We represent context in the form of a semantic network.",
        "An input sentence is transformed into a corresponding deep case structure.",
        "This structure is assimilated with the semantic network constructed from previous sentences.",
        "Japanese is a typical SOV language.",
        "The word order is rather arLitrary except that the main verb comes last.",
        "Cases such as subjective, objective and dative are syntactically indicated by postpositions, but a postposition can be used for several deep cases ambiguously Hence the determination of underlying sentential structures rests heavily on an understanding of the semantic relations, between the main verb and nouns Moreover in Japanese the words which are essential in understanding a sentence are often omitted without pronqminal reflexes.",
        "Our system can",
        "infer from the semantic ddscriptions of words what kinds of phrases should be supplied to fill lexical gaps Ind search the contextual representation to find appropriate fillers.",
        "The final analysis produced by our parser is a semantic network."
      ]
    },
    {
      "heading": "This could be used tot the representation ntation of data in a question",
      "text": [
        "answering system or as an intermediate expression in machine translation However, it is still too early to report on the results of these projected applications.",
        "The parser consists essentiall of four fixed componeAts.",
        "1) The grammar consists of rules written in PLATON.",
        "PLATON is a new programming language which is a variant of thia s)stem developed by Woods (1970) called 'Augmented Transition Network PLATON has additional facilities for pattern matching and flexible backtracking.",
        "A grammatical rule in PLATON consists of two parts pattern rewrite which is expressed as a pair of syntactic patterns, and semantic and contextual check which is an arbitrary LISP function.",
        "When a rule is to be applied, the semantic and contextual check is employed to determine whether the rule is !,emantically and contextually feasible.",
        "For the present we have about two hundred rules for the analysis of Japanese sentences.",
        "These rules are devised to combine Various syntactic patterns in Japanese with appropriate semantic and contextual checking functions.",
        "PLATON is presented in more detail in another paper by Nagao and Tsujii (1976).",
        "2) In the dictionary are stored words along with their various semantic relationships.",
        "We express the meaning of a word in terms of how it may be related to other words.",
        "The meaning of a verb is described in the form of 'activity patterns' in the verb dictionary An activity pattern - 6-",
        "is actually the case frame of a verb and additional related information.",
        "The case frame represents what case relations the activity entails and what kind of referents will be appropriate for each case slot.",
        "Additional information provided feeds into the 'change' or 'causative' component used by Norman (1973).",
        "Such information indicates how one activity pattern may be related to another by causal re, onships and what related change may occur in the semantic network representing context.",
        "From such information we can infer what activities and change will follow the present activity.",
        "The meanings of nouns are also expressed in the case-frame-like descriptions They also halm relational slots which will be filled in by other words or phrases.",
        "3) The contextual representation is similar in form to the semantic network of R. F. Simmons (1973;1975) or the nodespace of D. A. Norman (1973).",
        "In this representation there are two kinds of nodes.",
        "The C-node corresponds to a concept typically expressed by a noun The S-node corresponds to an event.",
        "An event is a realization of an action pattern and each argument of the pattern is assigned a C-node.",
        "C-nodes are related to S-nodes by the case labled relations.",
        "These relations are bidirectional The following list shows the relations used in the network:",
        "(i) Deep Case Relations.",
        "ACT, OBJ, PLACE, TIME -- A deep case relation connects an S-node with its argument C-node.",
        "(ii) Attributive Relations: VOLUME, COLOR, MASS, SHAPE -- An attribute relation connects a C-node with its value.",
        "We can distinguish two C-nodes associated with the same lexical entry but different values of attributes.",
        "(iii) Token substitution.",
        "TOK TOK is used to connect a node with - 7 - a lexical entry.",
        "(iv) Event-Event Relation CAUSE, IMPLY -- Two S-nodes are sometimes",
        "connected by a particular relation.",
        "The relations are sometimes expressed explicitly in the surface sentence by a special conjunction such NODE (because), NARABA (if) and so on.",
        "in our system the semantic network is accompanied with lists (Noun Stack-NS, Hypothetical Noun Stack-HNS, Trapping Liht-TL), We call these lists Intermediate Term Memory.",
        "Contextual functions work en these lists to search appropriate nodes of the semantic network Orich corresvtmd to the referents of anaphoric expressions or the unexpressed elements of sentences.",
        "(4) Semantic and Contextual functions are programmed in LISP These functions are incorporated in the PLATON rules along with rewriting patterns A contextual function takes as arguments the semantic constraints a target node must satisfy and returns the node when an appropriate node is found from the semantic network A semantic function checks descriptions in the dictionary to determine whether the combination of two words is semantically permissible.",
        "For analNzing noun-noun combinations, we provide sixteen semantic functions.",
        "The whole system is written in LISP1.6 which is implemented on a minicomputer, TOSBAC-40.",
        "The minicomputer is equipped with 64KB as main memory and 512KB as secondary core memory The LISP1 6 uses the secondary memory as virtual storage The dictionary consists of about 400 nouns, 200 verbs and 100 adjectives and other categories The parser with rules and the dictionary occupies about 50K cells The LISP uses a software paging mechanism, and the main memory is rather small in comparison with the secondary memory The content of the dictionary is stored on a disc in the form of S--expressions.",
        "Consequently, the speed of execution is slow.",
        "It takes typically about 10 to 15 minutes to analyze sentences which contain 3 to S simple sentences and 10 to 15 noun phrases."
      ]
    },
    {
      "heading": "II LEXICAL DESCRIPTIONS OF WORDS 2,1 Noun Description",
      "text": [
        "Most nouns have a definite meaning by themselves.",
        "We call these Entity Nouns.",
        "An entity noun is considered to represent a set of objects, and therefore is taken as a name of the set.",
        "The vbjects belonging to the set may share the same properties By introducing another property the set may be divided into a number of subsets, each of which is expressed by another noun.",
        "We describe such set-inclusion relationships and set properties in the noun dictionary.",
        "We represent a property of a noun by an attribute-value pair expressed as (A V).",
        "For instance, the dictionat entries for the nouns material' and 'liquid' are;",
        "['he descriptions (STATE)(MASS) and so on in the definition of 'material', lack values (V) showing that 'material' may have arbitrary values of these attributes.",
        "In the definition of 'liquid', there is a $P-link to 'material', which means that 'material' is a superset concept of 'liquid', or that 'liquid' is a subset or a lower concept of 'material'.",
        "Objects belonging to a subset are considered to have the same properties as the objects of the super-set, in addition to the properties described explicitly in its definition.",
        "By the above descripticrs, we can see that the value Of the attribute STATE of ' d' is *LIQUID, and that of SHAPE is the special value N The *LIQUID is one of the primitive value markers.",
        "The value markers are indicated by the preceding The value NIL indicates that"
      ]
    },
    {
      "heading": "'licuid' can not have any value of SHAPE BY tracing up the SF-links, we can",
      "text": [
        "retrieve all the (A V) pairs of an object.",
        "We assu ue of an attribute of a lower concept has precedence over that of the upper concept For instance we can obtain the following full description of liquid'",
        "These upper-lower relationships among entity nouns ar not expressed by a tree structure Some nouns may share properties with more than one noun 'Water' is such an example \"-later' has the properties of both 'liquid' and compound' Since we permit a noun to have several upper concepts, the relationships are represented by a lattice as shown in Figure 2 1.",
        "Figure 2 1 Upper-lower relationships among nouns - 10 - metmmcl sodium chloride (salt) water solut salt solution ion liquid ammonia zinc copper Although most nouns are regarded as entity nouns, there are a few nouns which have relational functions.",
        "We call them Relational Nouns; Father' is a fa iliar example.",
        "In order to identify a person indicated by the word, we have to know whose father he is.",
        "In the chemical field we can cagily find such nouns (e.g., 'weight', 'temperature', 'color', and 'mass')"
      ]
    },
    {
      "heading": "Theric are called Attribute Nouns. Their meanings are described in a different way from that of ordinary nouns. Figure 2.2 shows some examples. Here, A-ST",
      "text": [
        "deqignates the standard attributive rel.ltion which is expressed by the word.",
        "The description (NF N-A) shows the noun belongs to the group of attribute nouns.",
        "'Liquid' is another relational noun.",
        "The Japanese word which corresponds to Tliquia is EKITAI.",
        "While 'liquid' in English can be either a noun or an adjective, EKITAI in Japanese is caLegorizcd syntaetical4 as a noun.",
        "But semantically EKITAI has two different meanings, one corresponding to the noun usage of 'liquid', the other corresponding to the adjective - 11 - usage of it.",
        "The noun EKITAI in the adjective usage is called a Value Noun with the attribute STATE.",
        "Another word AKAIRO (red color) is also a value noun of the attribute COLOR.",
        "Figure 2.3 shows the descti n of these nouns in the noun dictionary.",
        "There are other kinds of relational nouns Action, Prepositional, Anaphoric and Function nouns.",
        "An action noun is the nomanalization of a verb.",
        "For example KANSAFSU (observation) is.",
        "the nomdnalization of the verb KANSATSU-SURU (observe) We describe this in the dictionary by giving a link to the original verb and by adding other information There are not poctpositional particles in Japanese for ever\\ preposition in English.",
        "Some special nouns plg the role of English prepositions.",
        "We call such nouns Prepositional Nouns Because a prepositional noun usually has more than one meaning just as an English preposition has, we attach semantic conditions to help disambiguate them Figure 2.4 shows example of lexical descriptions of prepositional nouns",
        "Corresponding to each meaning we give a triplet The first element is the ntic condition.",
        "If the condition is satisfied, the corresponding second element is adopted as the meaning.",
        "If not, the next triplet is tried The second element of a triplet represents the whole meaning of the phrase.",
        "For example whole aning of the phrase TSUKUE [desk-entit noun] NO tofi UT ton-prepositional noun] (on the desk) is PLACE The third element of a triplet expresses the relationship tr, which the other none in the phrase"
      ]
    },
    {
      "heading": "ialize the whole meaning. 2.2 Verb Description",
      "text": [
        "Verbs, adjectives, and prepositions in English have relational meanings with nouns.",
        "A verb represents a certain activity, while the agent associated with the activity is not inherent to the meaning of the verb (neither is the object which the activity affects, nor the other co ponents) These components appear in a sentence with certain loose relations to a verb -- 13 - In our syste the meaning of a verb is described by setting up several relational slots which will be filled in by nouns.",
        "In this sense the meaning of a verb is not confined to itself,but is related to noun We describe these rel Lions by using case concept introduced by C. J. Fillmore (l968).",
        "Case WAY be looked upon as a role which yn object plays in an activity, Because several objects usuallv participate in an activity, there are several cases associated with an activitN.",
        "An oh is exOressed b) a noun phrase, and an activity by a verb, A sentence instantiates au activity b) supplying noun phrases to the cases associated with the activi We call such instantiated activity an Event.",
        "Ilse proble to decide what case a noun phrase holds in relation to a verb in an\\ particular event.",
        "Though there are usually some syntactic clues in a sentence as to how it instantiates an activity, they are not enough to decide the case relationships between noun phrases and a verb.",
        "To establish these relationships we need both syntactic and semantic information.",
        "A verb has its own special usage patterns.",
        "That is.",
        "certain cases ate necessary for the activity and certaim objects are preferable as tillers for the case.",
        "Wye call these labled patterns Case Frames for Verbs, and express them as a list of case pairs such as (CASE NOUN) A verb usually lhas more than one case frame corresponding to different usages.",
        "A typical description of a verb is shown in Figure 2.5",
        "According to this description, we understand the verb TOKASU (melt, dissolve) has two different usages.",
        "In one usage the verb takes the ACTOR case, and prefers to take the sub-concepts of the noun NINGEN (human being as the case element.",
        "In such a way case frame descriptions are closely tied to noun descriptions, especially with the upper-lower concept relation ships among nouns.",
        "There are two types of cases., Intrinsic and Ixtrinsic cases.",
        "The intrinsic eases of a verb are essential ones for the activity, but extrinsic cases are not.",
        "For example, the cases of TIME and PLACE, which express when and where an event occurs, are extrinsic for ordinary verbs.",
        "Mdst activities can be modified by these extrinsic cases, but the kinds of nouns preferred for these case elements do not strongly depend on the kinds of activities.",
        "Therefore we describe only the intrinsic cases in the verb dic0,onary.",
        "We set up fourteen cases as shown in Table 2.1 for the analysis of sentences in a textbook of elementary chemistry",
        "He puts, sulfur in a test tube In the chemical field, a chemical object is often regarded as ACTor of,an action, though it doses not exercise intention in regard to action/ tor dxample, the underlinea word in the following sentence is regarded as ACT.",
        "(b) ENSAN WA DOU 0 TOKASU.",
        "hydrochloric acid -(all cases) copper -OBJ melt Hydrochloric acid melts copper.",
        "(2) SUBJ SUBJect is the primary topic of a sentence (a) KITAI-NO TAISEKI GA FUERU.",
        "gas volume -(SUB4 increase The volume of the gas increAses",
        "(b) IOU WA KIIROI",
        "sulfur -(SUBS) yellow Sulfur is yellow.",
        "(3) OBJ OBJect is the receiping end of an activity.",
        "It s affected by the activity.",
        "(a) KARE-GA Min 0 NESSURU he-(SUBS) water -(OBJ) heat He heats the water.",
        "(b) FNSAN GA AEN 0 TOKASU",
        "ydrochloric acid -(ACT) zinc -(OBJ) melt Hydrochloric acid pelts zinc.",
        "(4) IOBJ This case is semantically the most neutral case.",
        "It is an object or concept which is affected by an activity, and which is not OBJect.",
        "This case is usually specialized by the other cases such as PLACE., TO, IN and so on, depending on the semantic interpretation of the verb itself",
        "(6) RESULT ; RESULT is to the future as FROM is to the past It describes the resultant position or state As the entailed SUBJect or OBJect of the verb.",
        "heat time -(TIME) oxygen -(SUBJ) be generated Oxygen is generated when(someone)heats (it).",
        "- 18- In order to rosolve the syntactic ambiguity of a sentence, it is also necessary to utilize dontextual information obtained from preceding sentences.",
        "When one knows a certain event has occurred, he can anticipate successive events that will occur and what changes the objects participating in the event will undergo.",
        "This kind of expectation plays an important role in understanding sentences.",
        "Various kinds of associations clucter conceptually around individual activities.",
        "One can perform contextual analysis of language by explicating these associations.",
        "We append this kind of experiential knowledge tp the case frames of verbs The following two items are described for each I VCC b in the verb dictionary",
        "(1) CON this refers to the consequent activities which are likely to follow the activity of the verb, but not necessarily.",
        "(2) NTRANS this refers to the resultant effects on objects in view of how the objects are influenced by the activity.",
        "In our system the influence on the objects is described by the following three expressions: (a) ( ADD case a-set-of-(A V)-pails ) (b) ( DELETE case a-set-of-attributes ) (c) ( CREATE lexical-name-of-an-object a-set-of-(A V)-pairs) (a) means that the object in the case indicated by the second element comes to have a set of properties indicated by the third element.",
        "(b) is for the deletion of a set of properties from the object.",
        "(c) shows that some objects will be created by the activity.",
        "A typical example using a CON expression is shown in Figure 2 6 - 19 -",
        "When we have completed the anal\\sis of the sentence IOU 0 SHIKENKAN NI IRERU sulfur -(OBJ) test tube -TIN, RESULT, etc.)",
        "put in Someone puts sulfur in a test tube each case of the case frame of the verb IRERU (put in) is instantiated by an object referred to in the sentence.",
        "Then we can instantiate the expression of CON, and the result is 'the sulfur is in the test tube Figure 2 7 shows an example using an NIKANS expresqion„",
        "In this expression one can see the verb TOKASU has two different meanings.",
        "One corresponds to 'melt', and the other to 'dissolve in'.",
        "When we analyze the sentence, DOU 0 TOKASU.",
        "copper-(OBJ) dissolve, melt Someone melts copper we adopt the first case frame of TOKASU (melt) because it gives the highest matched value against the sentence (see section 3,4).",
        "As the result of evaluating the NTRANS expression in the case frame, we conclude the copper is now in the liquid state.",
        "In the lexical description 'copper' is a lower concept of 'solid', so that copper in general behaves as a solid object."
      ]
    },
    {
      "heading": "But the copper in the above sentence comes to have the attribute value",
      "text": [
        "pair (STATE *LIQUID) and will behave as 'liquid' in the succeeding sentences.",
        "On the contrary, when we analyze the sentence SHIO 0 MIN NI TOKASU salt -(OBJ) water -(IN, PLACE, etc.)",
        "melt, dissolve Someone dissolves salt in water.",
        "the second case frame of TOKASU (dissolve in) gives the highest matched value After the sentence instantiate` the .case frame, a new object (i.e. a solution which consists of salt and water) will be created."
      ]
    },
    {
      "heading": "CON AND NTRANS are thus important in the contextual analysis of",
      "text": [
        "sentences.",
        "The detailed analysis procedure using these expressions ig described in section 4.2."
      ]
    },
    {
      "heading": "III ANALYSIS OF NOUN PHRASE",
      "text": []
    },
    {
      "heading": "3.1 Properties of a Noun Phrase",
      "text": [
        "In Japanese, two or more nouns are often concatcnatea by the postposition NO to form a noun phrase.",
        "Because there are many different semantic r tionships among nouns •oncatenatc‘i by NO, we must 'what relationships ray hold among the nouns.",
        "Typical ONt ples are shown in Figure 3.1.",
        "EKITAI NO JOUTAI NO SANSO NO TAISFKI liquid state oxygen volume the volume of the oxygen in the state of liquid HANNOU NO ATO NO 0ATORI1JMU NO TAISEKI NO ENKA reaction after sodium volume change changes of the sodium's volume after the reaction",
        "The phrase NOUN-NO can modifN, in principle, an` or all of the succeeding nouns in the extended NO construction so that many different patterns of modification relationships are syntactically permitted.",
        "We must decide which one is correct by considering semantic restrictions.",
        "We have identified sixteen semantically acceptable NOUN NO NOUN combinations.",
        "These are showm in Table 3.1.",
        "(See pgs.",
        "23-25 for this table ) Corresponding to these relationships we prepared sixteen primitive functions.",
        "These functions are applied in turn to a noun phrase to decide what relationship holds between two nouns.",
        "The order in which these functions are applied is based on the frequenc) and the tightness of the relations.",
        "Each function checks only one semantic relation In order to illustrate how these functions perform their tasks, the following example of noun + prepositional noun' - 22 - TABLE 3.1.",
        "Admissible noun-noun Combinations",
        "(1) ( value noun )+( attribute noun) (ex) KOTAI NO JOUTAI solid state (2) ( value noun)+( entttv noun) (ex) EKITAI NO IOU liquid sulfur (3) ( entity noun)+( attribute noun) (ex) EKITAI NO IRO liquid color (4) ( noun)+( prepositional noun) (ex) HANNOU NO MAE reaction before (5) ( anaphoric noun)+(noun) (ex) MOTO NO BUSSHITSU former material (6) ( attribute noun)+( entity noun)",
        "(ex) (MA I?",
        "CONDO NO EKITAI* high temperature liquid *In this usage, the attribute noun should he modified by another noun or adjective, which specifies the value of the attribute.",
        "(7) ( noun)+( action noun) (ex) SANKADOU NO KANGEN",
        "oxidized deoxid.,ization copper IRO NO HENKA color change",
        "*The noun-noun comoination, 'teactionbefore' expresses the 'time' before the tea1/4tion.",
        "'The noun-noun combination.",
        "'test tube-NO in' expresses the 'place' in the test tube.",
        "oxidization in order to br reason o *In Japanese, some nouns are used to elucidate the Lase relationships between a noun phrase and a verb Th?.",
        "noun TAME in this eN -plc expresses cases such as CAUSE or PURPOSE.",
        "(11) ( entity noun)+k entity noun) (ex) NATORIUMV NO KANUBUTSV sodium compound",
        "The first entity noun is a constituent element of the object eypressed by the second noun",
        "oxidized copper oxygen *The second noun is a constituent element of the object expressed by the first noun",
        "test tube bottom *The second noun refers to part of the object expressed by the first noun.",
        "(14) ( entity nouns)+( entity noun) (ex) KARIUMU, NAToRIUMU -NAB() NO KINZOKU* potassium, sodium etc.",
        "metal *The nouns 'potassium' and 'sodium' are lower concept nouns of the last noun 1 metal' (15) ( name)+( noun) (ex) SHITSURYOUHOZON NO HOUSOKU the conservation of mass law (lb) Others (ex) lcm2 ATARI NO CHIKARA",
        "per lcm2 pressure phrase is given.",
        "The noun MAE is a prepositional noun, and its semantic description is shown in Figure We note that this, word has two fer tont meanings"
      ]
    },
    {
      "heading": "JIKKEN NO NAE",
      "text": [
        "experiment time preceding place in front of The function for the analysis of this kind phrase checks at first whether the second noun MAF is a prepositional noun.",
        "If it is not, then this function tails and returns the value NU...",
        "In this example, because the word MAE is a prepositional noun, the checking proceeds further The description in Figure 2 4 shows that if the preceding noun is an action noun (i e, if it is a nominalization of a Nerb) then MAE has the first meaning.",
        "Because the noun JIKKEN ( yperiment)satisfies thas condition, the checking succeeds and the function returns the value T The result of the analysis is shown in Figure 3.2(a).",
        "On the other hand, if the input is TSUKUE NO MAE desk before, in tront of then the word TSUKUE (desk) satisfies the condition of the second meaning, and the result is as shown in Figure 3 2(b).",
        "In this way the sixteen checking functions not only test whether a certain semantic relationship holds among input words, but also disambiguatLs the meanings of input words"
      ]
    },
    {
      "heading": "3.2 Analysis of a noun phrase",
      "text": [
        "We analyze a noun phrase by using the above sixteen checking functions subject to the limitation that reliLed noun groups may not overlap As stated before, 'noun postposition NO' phrases and ad,jectives can modify only the succeeding nouns.",
        "We stacic in the to orary stack noun phrases and adjectives for which the nouns to be modified have not been determined.",
        "The analysis of a noun phrase is carried out by scanning words one-by-one from left to right.",
        "If we scan an adjective or a determiner, we stack they word in the temporary stack.",
        "If we scan a noun, we pick up a word from the tempciav stack and check whether it can modify the noun.",
        "This checking is done by the - 27 - above functions if the stack word is a noun.",
        "We also have the checking functions relating nouns to adjectives as determiners The dictionary content of an adjective is just the same as that at a value noun.",
        "The ntic checking function between an adjective and a noun will test whether the noun can have the attribute which is difiable by the adjective.",
        "The checking of the determinel differs and is explained in a later chapter The checking, process will stop wlien there are no voids in thy: porary stack or a word is picked up that fails to the noun being scanned.",
        "The noun is then stacked in the te or ry stack.",
        "If the temporary stack contains only one noun and there are no words to be scanned in the noun phrase, the analysis succeeds and returns the noun in the stack The returned noun is called the Head Noun of the noun phrase These processes are illustrated in Figure 3.3.",
        "(See pgs 2g-30 for this figure ) If there are no words to be scanned neNt and the temporaTy stack contains more than one word, then the analNo,is fails and backtracks to the decision points of the progr .",
        "A decision point in the analysis of a noun phrase is any point at which two words have been related sc ntically relationship between two words established during the analysis is the one determined by the function which succeeds first.",
        "Because the order of checking functions is somewhat arbitrary, in some cases a relationship which has not been checked may be preferable to the established relationship.",
        "This is illustrated in the examples below SHIKENKAN NO NAKA NO AKAIRO NO EKITAI test tube in red liquid (i) Temporary Stack = empty test tube NO in NO red NO liquid scanned word ii) TS = test tube test tube NO in NO red NO liquid scanned word *A check of the semantic relationship between 'test tube' and 'in' is performed **The phrase 'test tube NO in' is transformed into theform PLACE *test tube iii) TS place test tube NO in NO red NO liquid scanned word *A check of the semantic relationship between 'place' and 'red' is performed, but it failed to establish a new concept.",
        "Therefore, 'red' is placed on the top of TS.",
        "rest tube NO in NO red NO liquid scanned word *The next scanned word is 'liquid'.",
        "Since it is a nourf, a check of the relationship between the noun and the wrods in TS is performed.",
        "The check succeeds because the combinations (value noun)+(entity noun) and (PLACE)+ (entity noun) are semantically permissible.",
        "There are no words to be scanned, and the TS contains only one word.",
        "Hence, the analysis of this noun phrase succeeds.",
        "the result is as follow;.",
        "(The head noun of this noun phrase is 'liquid'",
        "EKITAI NO JOUTAI NO HENKA liquid state change the change of state of the liquid EKITAI NO JOUTAI NO SANSO liquid state oxygen oxygen in the liquid state In the first exa the word JOUTAI (state) designates an attribute of EKITAI (liquid) and EKITAI corresponds to a visible, teal object.",
        "JOUTAI (stated in the second exa ple ditIgnates an attribute of SANSO (oxygen), and the word EKITAI does not correspond to a real object but is used to specify the attribute 'state' of the oxygen.",
        "These examples show that the word EKITAI (liquid) has two different usages.",
        "According to these usages, there are two differen: semantic constructions of the phrase EKITAI-NO JOUTAI as shown in Figure 3.4.",
        "Because we analyze a noun phrase from left to right, we cannot determine which usage is correct until we recognize the rightmost word HENKA (change, transition) or SANSO (oxygen).",
        "Howe,,er, a semantic checking function disambiguates the multiple meanings of the word EKITAI.",
        "If the disambiguation is recognized to be .incorreqt in subsequent processing, we must be able to - 31 backtrack to the decision point at which this temporary disambiguation was made.",
        "We implemented such a process by using P1ATON's backtracking facilities.",
        "This process is illustrated in Figure 3.5.",
        "(See pgs.",
        "13-14 for this figule)."
      ]
    },
    {
      "heading": "3.3 Analysis of Conjunctive Phraseq,",
      "text": [
        "The words in Japanese which correspond to 'and' and 'or' ate categorized as special postposition; some of them are shown in Table 444",
        "structure, but semantically different constructions.",
        "Some examples are shown in Figure 3.6, On the other hand, some phrases have different surface structures but convey the same meaning as is illustrated in Figure 3 7 As there are few syntactic clues in these examples, we must analyze them using semantic information.",
        "(See pgs 35 and 36, respectively, for these figures) At the first stage of the analysis of a noun phrase, we try to find conjunctive postposit:ions If we cannot find them, the normal analisis sequence described above is applied on the noun phrase.",
        "If there is a oonjunctiue postposition, the following steps are performed",
        "*At this point, the first meaning of 'liquid' has been adopted 5ecause the checking function for (entity noun)+(attribute noun) is applied before the function for (value noun)+(attribute noun).",
        "That is, the word 'liquid' indicates a physical object.",
        "**The semantic check between 'state' and 'oxygen' fails, because the attribute noun 'state' has been linked to the liquid by the_ relation IATR-ATR and an atbtribute noun cannot be linked with two different entity nouns ***So the program will go back to step (11).",
        "- 36- Step 1.",
        "The conjunctive postposition 10 is often followed by another postposition TO in the succeeding part (Figure 3.7).",
        "Hence if we find TO in the phrase, we do the following; if not, go to step 2.",
        "We search for the second postposition in the Succeeding part.",
        "If it is found, then the noun phrase beford the first postposition and the noun phrase interposed between the first and the second poRtpositions are paralleled.",
        "We employ the normal noun phrase analysis to the interposed noun phrase, then go to step 4.",
        "If we cannot find the second postposition, we then go to step 2 Step If a conjunctive postposition is not TO, or there is no second TO we execute the following stibsteps.",
        "(Noun-1 designates the noun before the first postposition.)",
        "a.",
        "Search for a noun identical to Noun-1 it the succeeding part.",
        "If found, let it be Noun-2, and go to step 3 If Noun-1 is not an entity noun, then search for a noun which belongs to the same category as Noun-1.",
        "If found, let it be Noun-2, and go to step 3 Search for a noun which has an upper concept in common with Noun-1.",
        "If found, let it be Noun-2, and go to step 3. e phrase between the postposition and Noun-2 are analyzed by the normal noun phrase analysis.",
        "This is now the second of the two parallel phrases under consideration.",
        "Step 4.",
        "The phrase betore the postposition is analyzed by the normal noun phrase analysis Step 5.",
        "It is necessary to detertine what portion of the phrase before the postposition relates exclusively to Noun-1 To determine the left end of the Noun-1 phrase (e.g., in Figure 3.8 below), we pick words one-by-one",
        "two different determinations of the left end of the conjoined phrase Step 6.",
        "Words to the right of Noun-2 are checked to deteimihe their relation to the conjunctive phrase and its conjuncts Checking proceeds from left to right The analNsis of the following phrase is illustrated in Figure 3.'",
        "(2) Step 2c.",
        "Find from the succeeding part the noun which belongs to the same category as 'copper' In the above phrase, the noun 'sulfur' is found."
      ]
    },
    {
      "heading": "RYUKADOU NO (DOU TO IOU -NO) SHIRSURYOU NO HI",
      "text": [
        "copper sulfide copper mass ratio temporarily determined scope of twee conjuncti\\e phrase",
        "(3) Step 3 not applicable (4) Step 4 Analyze the phratse bgroikt, the postposition TO ( ',copper = TO IOU -NO) AITSURYOU NO HI",
        "sulfur mass raiio ELEMENT copper sulfide Figure 3 9 - 39 - (5) Step 5.",
        "The second noun of the conjunctive phrase, 'sulfur' i checked against the leftmost noun of the phrase before the postposition 'copper sulfide'.",
        "This noun is related to the first noun of the conjunctive phrase, 'copper'.",
        "Icoppet sulfide' is also seen to be related to 'sulfur'.",
        "This places the lett",
        "ctnjunctive phrase are checked against nouns in the portion following Noun-2 Because the noun 'mass' can be related to on1N.",
        "individual ph\\sical objects, the noun 'mass' is duplicated f;.11- 'copper' and 'sulfur fmass mass) NO HI ratio TATR-ATR IATR-ATR copper sulfu ELEI NT EL NI copper sulfide The noun 'ratio' is related to a con3unctive phrase as a whole.",
        "Hence, we obtain the following result for the entire conjoined phrase number RATIO",
        "several noun phrases -- case Olements preceding it.",
        "A relative claw,* modifying a noun may appear in the form no ht end of the scope of the clause is easily id en verb, but the left end is harder to identify.",
        "In Figure 3.10 the novo phrase NPi4.1 is a case element of verb Vi.",
        "The noun phrase i is rovermed by verb V2.",
        "Because the rule projections hold (i.e.. clauses do not overlap) in Japanese as it other langu ges, all noun phrases betNmen NTi+1 and VA are govetned by and the noun phrases before NPi are governed by NI However, boundaries as between NPi and NP1.4.1 cannot be deter*ined uniquely bby syntactic clues alone.",
        "To determine th use gemantic relationships such as case relationships between noun phrases and verbs.",
        "In English case in surface structure is generally evident in the order of phrases.",
        "In Japanese, the ordering of noun phr ses is relatively free A postposition attached to a oun phrase usuallar shows the case vhich the noun phrase plays in the sentence The postpositions usually used in Japanese and the deep cases cotrespendin.g to them are tabulated in Table TABLE 3 3 Postpositions in Japanese and case relationships",
        "From this table one can see that a postposition in surface structure does not necessarily correspond to a unique deep case.",
        "In the equIse of analysis we must assign appropriate case labels by considering the case frames of the main verb along with meanings of the head nouns of the noun phrases.",
        "A postposition also plays the role of a delimiter which shows the right boundary of a noun phrase.",
        "The outline of the analysis of a simple sentence is as follows",
        "(1) At first the program looks for a verb in the input sentence.",
        "Because there may be embedded sentences which modify nouns in the main sentence, there is usually more than one verb in the input sentence.",
        "The program picks up the leftmost verb of the sentence (2) The strinc* before the verb is segmented by locating postpositions (3) Since each segment is assumed to constitute a noun phrase, e is passed to the program which anaiyzes noun phrases.",
        "(4) When all the segments are analyzed and the head nouns ale determines, the program checks each noun phrase against the verb asking whether a case relationship will be satisfied between the noun phrase and the verb The checking is carried out right to left starting with the phrase nearest the verb (5) When there are no more noun phrases to be checked, or when a noun phrase which cannot be a case element of the verb is found, the checking is terminated.",
        "If there remains an intrinsic case slot of the verb which has not been filled, we search for an appropriate noun to fill the slot from the context This searching process will be explained in section 4.",
        "We determine whether a noun phrase can be a case eldnent cat a verb by the following syntactic and semantic clues (1) The type of postposition which tollows the noun phrase.",
        "This marks case in the surface structure.",
        "The case frames of the verb.",
        "(3) The Meaning of the head noun of the noun phrase The postposition delimits a set of posible cases by which the noun phrase WY be related to a verb.",
        ", We must choose an appropriate one f this .0or by using the second and third tNpes of information, The case s.J,ot fillers in a case frame of a verb are 9r 1 tfvelv upper concept nouns* A sentence is considered to be an instantiation of a case frame, and the nouns employed will be lower concept nouns of the nouns in the case frames.",
        "Suppose we analyze the sentence.",
        "SHOKUEN 0 MIN NI TOKASU salt (OM water (IN, RFSULT, TIME, etc.)",
        "melt, dissolve (Someone) dissolves salt in water.",
        "We can check whether the sentence matches the C3be f lame or TOKASU TOKASU ((ACT human) (013.1 matelial)(IN liquid)) melt dissolve The checking is crformed In considering whether 'salt' is a lower concept noun of 'material', anc: whether 'water' is a lower concept noun of 'liquid' Because a case fraw contains only irtrinsi•c cases of a verb, we check extrinsic ones when a noun phrase is found not to be an intrinsic case element of the verb.",
        "That is, we check whether the postposition can mark the TIME or PLACE, and whether the noun phrase is an instance of the - 44- noun 'place' or 'time'.",
        "The above process may appear straightforward But sentences can have several voisible interpretations for the following reasons",
        "(1) A verb may have more than one usage (i.e., a verb may have several case frames) (2) A postpositicn can indicate more thign one case.",
        "Some postpositions can occur with almost any case; WA is an example.",
        "(3) A no-in modified by an embedded Sentence is usually a case",
        "slot filler of the embedded senten15, But we may have no syntactic clues as to what case to assign to the noun In the event ultiple interpretations the program derives labled interpretations showing all possible case relationships between specific nouns and verbs.",
        "We choose the interpretation showing the preferable matchin of nouns and case by using an evaluation function below which has been established empirically.",
        "Cl .",
        "number of intrinsic case elements which are filled by the noun phrases in the sentence C2 * number of extrinsic case elements which are filled by the noun phrases in the sentence.",
        "C3 .",
        "number of intrinsic case elements which are filled by the noun phrases in the preceding sentences The value of this function indicates the degree of matching between a entence and the case frame of the verb in question.",
        "The trial frame which",
        "gives the highest matched value is selected We then proceed to the analysis of the remaining strings.",
        "If the selection is found to be wrong.",
        "during the succeeding analysis, control comes back to the point at which the decision was made, discards it, and chooses the pattern which gives the next highest matching value."
      ]
    },
    {
      "heading": "IV CONTEXTUAL ANAL\\SIS",
      "text": []
    },
    {
      "heading": "4.1 Basic Approach to Contextual Analvsis",
      "text": [
        "Our view of the process of sentence understanding is roughlN as follows.",
        "One reads sentences from left to right and understands them in succession.",
        "When he/she cannot understand a sentence satisfactorily, he she refers back to the preceding sentences to obtain a ke\\ to understanding If he/she cannot find what is neeed , he/she leaves the question pending and proceeds to the next sentence If a phrase or a sentence is found which seems to solve the question, then he/she checks whether it can reallN resolve the question.",
        "If so the sentence is propellN organized into the previous context and the question is dismissed In anti case the pending question is likely to be dismissed as time passes We feel this process of sentence understanding is not especially complex.",
        "It can be realized through an arEiricial intelligence approach While we recognize that some kinds of problems may be solved only by using complicated logical operations, we think most problems in language understanding can be solved b.y relatively simple operations Logical operations may only be effectively applied on a complete data base in which all the necessary axioms (corresponding to human knowledge) are declared and no contradictory axioms exist.",
        "In the course of reading sentences, one has - 46 - only partial knowledge about the context, and therefore, his knowledge is not conplete.",
        "However, he can understand the meanings of sentences before he reads through the entire set.",
        "This means that one is content with incomplete deductions for understanding sentences.",
        "For this reason, we employ rather than logical operations, heuristically admissible operations which use an intermediate term memory structure and various semantic relationships described in the dictionary.",
        "We conceive of three types of memory.",
        "Long term memory incorporates knowledge of the world, not considered here.",
        "Short term memory is for immediate recall of unanalyzed strings under consideration.",
        "Intermediate term memory is limited but contains a structured representation of recently analyzed strings and strings under analysis.",
        "We summarize our approach as follows:",
        ") Two kinds of intermediate term memory are prepared.",
        "One is for representing the current contextual content, and the other is to sustain pending questions.",
        "The former is further divided into the noun stack (NS) and the hypothetical noun stack (HNS).",
        "The latter is called the Trapping List (TL).",
        "(3) Contextual analysis is perf rmed after the processing of each syntactic unit such as a noun phrase or a sentence which conveys a unitary idea.",
        "(4) NS is organized such that theme words of sentences can be easily retrieved.",
        "Here 'theme words' mean the key subjects mentioned in the sentences.",
        "(5) Sometimes we have to refer to the succeeding sentences in order to understand a sentence.",
        "In such cases we do not immediately refer - 47",
        "to the succeeding sentences, but instead hold a pending question in TL to be resolved in the course of analyzing the ,-1!.,ceeding sentences."
      ]
    },
    {
      "heading": "4.2. Memory Structure tot Contextual Information",
      "text": [
        "The analysis of a sentence is primarilN gtounded in the semantic description -- case frame -- of a main Nerb.",
        "Conte\\tual analNsis is main1N gtounded in accumulated information about nouns.",
        "The objeets of concepts that ate the themes ,of the sentences, and what has been predicated of them 4.7 av usually be ehatactetized in terms of the nouns appearing in the sentences, md these off-et important clues tot contextual anal\\sis.",
        "We assign a different LISP atom (produced b\\ the LISP function gensym') to each noun which appears Information about each is entered on the respective property list.",
        "The flags tabulated in Table 4.1 are used.",
        "T)BLE 4 1 Information attached to a noun atom relation content link to the dictic.",
        "IN, lexical de,,etipttons SATR (A V) pair,' which specitN this objet.t CASE link to the case-frame in which the object appests PRE link to any noun atom which appears in the previous sentence, and which represents the same object as this atom POST the inverse relation of PRE SHOD link to any relative clause which modifies this object PARA link to any noun atoms which appear in a conjunctive phrase together with this object We can retrieve all the descriptions given for an object to which a noun has been assigned.",
        "We stack these LISP atoms called Noun Atoms on NS and HNS - 48 - (A) Noun Stack (NS) When we start to analyze a sentence, we stack a list of noun atoms which are assigned to the nouns in the sentence.",
        "These noun atoms are reordered according to their degrees of importance.",
        "NS has the construction shown in Figure 4.1 noun-atom-i)(- ) (- -) ) list of noun atoms corresponding to nouns which appear in the most recent sentence",
        "To, decide how important a word is, we use the following heuristics.",
        "(1) In Japanese a theme word is often omitted or expressed by a pronoun in succeeding sentences after it appears once.",
        "In other words, the word which is omitted or expressed by a pronoun is an important word for the understanding of a sentence.",
        "(2) A theme word may appear as \"subject\" in the surface structure.",
        "To emphasize a word which is OBJ-case in deep vase structure, or to",
        "mphasize a word in the ACT-case which is not worth mentioning, the passive voice may be used.",
        "This places a stressed word in the subject position of the sentence which would otherwise appear as object or indirect object",
        "(3) The importance of a head noun in a noun phrase is greater than_ that of other nouns.",
        "A simple example of ranking by importance is shown in Figure 4.2, zinc appears in all the sentences and is the theme word."
      ]
    },
    {
      "heading": "Changes of NS",
      "text": [
        "Beginning of the anal,,,,i,, of Sl: ((N4 K3 N2 N1)) End of the analvsiq ot SI ((N4 N1 N1 N2)) Beginning of the analNsis ot 52 ((N5)(N4 N1 N3 N2)) End of the analNsis of 52 ((N4 (N4 N1 N3 N2)) Beginning of the analNsis of S3 (NIL (N4 N5)(N4 N1 N3 N2)) End of the analysis of S3 ((N4)(N4 N5)(N4 N1 N3 N2))",
        "(Someone) intermixes hydrogen and oxygen in the ratio of two to one.",
        "- in this gas mixture - - - (b) SHOKUEN 5gr 0 MIZU 100cc NI TOKASU.",
        "salt five grams (OBJ) water 100cc (IN) dissolve KONO SUIYOUEKI WA the solution (Someone) dissolves 5 grams of salt in 100cc of water.",
        "The solution is In these two examples, though the demonstrative KONG (the, this) is used, the object referred to does not appear explicitly in the preceding sentence.",
        "The object referred to is produced as the result of the event which is exprellated by the preceding sentence.",
        "As mentioned before, we append to case in the verb dictionary descriptions of any objects which may be created if the verb is used.",
        "TOKASU (dissolve) has the case frame: ((ACT human)(OBJ material)(IN liquid)) and this case frame has the additional description: (NTRANS (CREATE 'solution ('solvent (X IN)) ('solute (4 OBJ)) )).",
        "The symbol g in this description is a LISP function which fills the - 51 - specific a se elements indicated in the argument from the current realization of the case frame.",
        "The sentence",
        "results.",
        "We represent this newly produced object in HNS instead of NS for the following two reasons.",
        "1.",
        "As the description is based on uncertain knowledge, ikely, but",
        "not necessarily so that the object is produced in the real world.",
        "If we find some descriptions of this derived object in the succeeding sentences, we will decide it really exists and transfer the representation from HNS to NS.",
        "Because the newly produced object is referred to in the succeeding sentences sometimes by different words or by syntactiL:_dv different forms, it is colvenient to stack them individually in HNS,"
      ]
    },
    {
      "heading": "4.3 Estimation of the Omitted Words In the analysis of a Japanese sentence it is important to supply",
      "text": [
        "omitted words drawing from preceding or succeeding sentences.",
        "To do this we must be able to;",
        "1. recognize that a word is omitted and 2. search for an appropriate word to fill the gap",
        "Our contention is that an individual syntactic unit such as a noun phrase or a simple sentence conveys a definite idea; a noun phrase may designate a certain definite object, a concept, or whatever, and a simple sentence may describe a defin teievent.",
        "In order that a simple sentence describe a definite even, each intrinsic case element of the case frame must be",
        "specified by particular objects.",
        "We can detect an omitted word by searching for unspecified case ele ents in 4 case frame.",
        "Moreover, we can guess from the case fr a twat kind of nouns ahouid be supplied to fill any gaps, In this, manner we can detect and supply omitted words by using the semantic descrip ions in the dictionary.",
        "(1) d Words in a Simple Sentence When we have finished the analysis of a simple sentence, we check whether there remain some intrinsic cases rn be specified.",
        "If there remain we search for appropriate fillers in the preceding sentences.",
        "The searching process is carried out in the following way.",
        "(i) We search through HNS first, because an object newly created by the preceding event is often the theme object of the present event.",
        "(ii) In Japanese, identical case elements in succeeding sentences are apt to be omitted.",
        "So the previous sentence is searched for elements having the s relation as the one under consideration through NS (iii) If the above processes fail, then we check the words in NS or al the words that have appeared in the three previous sentences one-by-one until we find a y=eti ntically admissible word.",
        "(iv) If we cannot find a suitable word, we set up a problem in the trapping list TL (mentioned in the next section).",
        "Some results of the processing are shown in Figure 4.3.",
        "(pgs.",
        "54-56).",
        "(2) Omitted Word in a Noun Phrase A noun is classified as either an entity word or a relational word.",
        "Most nor have definite meaning by themselves,and are regarded as entity words.",
        "However, some kinds of nouns have relational meaning.",
        "That is to say, they have slots in their meaning to be filled in by other words, in -- 53 -",
        "order that they express definite ideas.",
        "Sometimes a relational noun is used alone in a noun phrase.",
        "In this case the relational noun must be semantically connected with other words which are omitted in the presen« noun phrase.",
        "Such examples are shown in Figure 4.4 below.",
        "(1) IOU 0 NESSURU TOKI IRO GA HENKASURU.",
        "sulfur (0 OBJ) heat when color (SUBJ) change meaning: When (someone) heats sulfur, the color changes.",
        "The phrase 'IRO GA is a noun phrase but it is incomplete color (SUBJ) by itself.",
        "We can easily understand the color means 'the color of the sulfur.",
        "(2) ENSAN 0 SHIKENKAN NI hydrochloric acid (OBJ) test tube (PLACE) TIME, etc.)",
        "20cc IRERU.",
        "put in meaning: (Someone) puts 20cc of hydrochloric acid in a test tube.",
        "*The word 20cc is put in a separate position from ENSAN (hydrochloric acid) in the sentence.",
        "It, however, specifies an attribute of the acid, VOLUME.",
        "Figure 4.4 As the final step in the analysis of a noun phrase, we check whether there remain relational nouns which have no definite meaning.",
        "If found, we search through NS for words which are suitable to fill in the slots of the nouns.",
        "The searching process is the same as for omitted words in simple sentences.",
        "Sometimes the omitted words exist in succeeding sentences, so we can set up a problem in TL, if we cannot find an appropriate word in the preceAing bentences.",
        "(3) Detailed Description of the Trapping List (TL)",
        "Most anaphoric expressions and omitted words are well ,b, searching through the preceding sentences, However, d e me refer to succeeding sentences in order to analyze a sentence prop rly sentences shown in Figure 4 5 dre examples.",
        "(2) ONDO 0 ITTEI NI SHi, ATSURY0 ' O temperature constant (PLACE, RESULT, etc ) KUWAETA TORI, KITAI NO TAISEKI WA - - increase when as volume pressur )OBJ) !what' temperature is kepi constant rat 'what' pressure is increased meaning: When the temperature is kept constant and the pressure is incleased, the volume of gas - - - Figure 4.5 Examples where omitted words appear in succeeding sentences Because the preceding sentences have already been analyzed and both HNS and NS have been set up, it is easy to refer to the preceding sentences On the other hand we cannot immediately refer to the succeeding sentences if this is called for.",
        "To solve this problem we set up a trapping list TL.",
        "The basic organization of TL is shnwn in Figure 4.6.",
        "A trapping element is a triplet",
        "and corresponds to a pending problem.",
        "When we cannot find an appropriate word in the preceding sentences for an omitted word or an anaphoric expression, we put a new trapping element in IL.",
        "At this time the first of the triplet, N, is set to zero.",
        "When a noun phrase in a succeeding senTience is analyzed we pick up nouns from the noun phrase one-by-one and check whether the present noun can resolve a pending problem in TL by evaluating the function Fl in the trapping element.",
        "We have defined several LISP functions for the function Fl.",
        "These functions work as follows.",
        "(i) They check whether a noun at hani kan solve thelproblems in TL.",
        "(ii) If it can do so; they update the data (for example, if the function Fl is the function which searches tng words in TL for filling in the omitted case element, then the function will put the present noun in the case frame), and return the value 'DELETE' Then the system will delete the trapping element from TL.",
        "(iii) If it cannot do so, the system adds 1 to N, the first element of the trapping element.",
        "When N exceeds five, the trapping element is deleted from TL.",
        "That is, it is decided that the problem corresponding to the trapping",
        "element can not be solved at all.",
        "Before the deletion of a trapping element its third element, the function F2, is evaluated.",
        "Thus far F2 h s onl been used to provide default values to allow' some intexpretation lr pending problems, By using the idea of Ti., we can separate rious checking mechanis from the main program.",
        "They can be invoked autou 11Y when a noun appears in a sentencx.",
        "The idea of TL rese ales that of E. Charniak's 'demon' tc197 ).",
        "When his system encounters a certain word, for example, 'piggy bank' a demon which tries to catch from the succeeding sentences any word e.g., oney) related to the key word.",
        "We fear that unnecessary knowledge will clog the system with a lc natorial explosion resulting frok the proliferation of demons.",
        "Our trapping element is put in TL only t orarily to compensate for any missing elements to be retrieved from succeeding pans.",
        "Hence the uhuecessary proliferation of elements may be avoided.",
        "4.4 Processing of Anaphoric Expressions In Japanese anaphora is expressed bN using the articles KONO, KORE ich correspond roughlN tm 'the', 'this' and 'these in English.",
        "pronoun KORE is used to designatE a single object in tht preceding send antes, and the pronoun KORERA is used to designate plural objects.",
        "The article KONO is used as a constituent of a noun phrase.",
        "Though the articles in English modify the first succeeding noun, KONO often modifies a noun at some distance.",
        "An example is given in Figure 4.7. noun noun noun MONO SHIMENKAN NO NAKA NO DOU this test tube in copper the copper in this (inside of) the test tube (this copper in the test tube",
        "In this exa e there are three nouns following the article which can be modified by it syntactically.",
        "We must decide the preferable modifica-tipr pattern by using contextual information.",
        "In the analysis of a noun phrase, we scan the words one-by-one from left to right.",
        "When we catch the article IMO, we put it in the temporary stack.",
        "The word will then be checked to see whether it can modify a noun in the following noun phrase.",
        "When we scan the noun SHIKENKAN (test tube) in Figure 4.7, we check whether the object indicated by it was already mentioned in the preceding sentences.",
        "If it was, then the article KONO is regarded as modifying the noun 'test tube'.",
        "If not, the article is stacked again.",
        "In this way the article will be checked against the nouns in the noun phrase until the noun modified by it is found.",
        "The article KONO is used in the following two ways:",
        "(1) SANSO ARU KONO SANSO - - -",
        "oxygen (SUB ACT) exist oxygen (OBJ) There is oxygen The oxygen The noun SANSO modified by the article ONO is the same entity noun which appears in the first sentence.",
        "(2) SANSO ARU, KONO TAISEKI 0 volume (OBJ) There is oxygen.",
        "The volume of the oxygen In this case KONO alone designates the entity noun SANSO which appears in the first sentence.",
        "This usage is permitted only if the noun modified is a relational n,)ua.",
        "If the noun has only a relational meaning, the second usage appears more often than the first.",
        "The meaning descriptions of articles and pronouns like KONO are procedually expressed by LISP functions.",
        "The functions in the dictionary will - 61 - be evaluated if we find such words in a sentence.",
        "The function for KONO operates in the following way, (1) kcheck is made to see if the succeeding ndun is relational, If the noun has only a relational meaning, it is tirs he article KONG is of the second usage and ve go to step 0).",
        "go to step (2), (2) The first usage of KONO has the following three varieties.",
        "(i) SANSO GA ARU.",
        "KONO SANSO 0 There is oxygen.",
        "The oxygen - - - The noun modified by the article is the same noun which appears in the preceding sentence.",
        "(ii) SANSO GA ARU.",
        "KONO KITAI There is oxygen The gas - - - - The noun 'gas' modified by the article is an upper concept noun of the referent noun 'oxygen' (iii) SANSO TO SUISO 0 KONGOUSURU.",
        "KONO KONGOUXITAI 0 - oxygen and h)Wrogen 1113,7) mix gas mixture (OK) (Someone) mixes oxygen and hydrogen.",
        "The gas mixture - - - The article modified a nominalized form of the first sentence.",
        "The first sentence instantiates the case frame of the verb 'mix' We evaluate the NTRANS description of the case frame and obtain a new anerenced object 'mixture' whose elements are the oxygen and the hydrogen.",
        "The noun KONGOUKITAI modified by the article is a lower concept noun of the inferenced noun (mixture) in HNS.",
        "According to these three varieties, we provide the following three check routines.",
        "The order of checking in shown in Figure 4.8",
        "(check 3) Is there in the HNS list an upper concept noun of the modified noun, and are its properties consistent with those of the modified noun.",
        "If we can find a noun which satisfies one of these three conditions, we decide that it is the referent noun.",
        "If we cannot, the function for KONO returns the value NIL.",
        "(I) If the noun which follows the article has a relational meaning, the meaning description of the noun has slots which ust be filled icy by other words.",
        "What kind of nouns is preferable for the slots is described in the meaning description.",
        "We search in NS and HNS for an object which satisfies the description.",
        "For exa e suppose the input is"
      ]
    },
    {
      "heading": "SANSO ARU. KONO TAISEKI - - -",
      "text": [
        "oxygen (ACT SUBJ) exist volume The noun TAISEKI is an attribute noun.",
        "So we look for a noun which may have the attribute and recognize that oxygen is appropriate.",
        "Another example is SHIKENKAN GA ARU.",
        "KONO NAKA NI - - - test tube (ACT SUBJ) exist in (PLACE, RESULT) There is a test tube.",
        "In the (test tube)- - - -63-The noun NAKA (in) is a prepositional noun which requires a 'container' or 'liquid' We can easily recognize the test tube as a lower concept noun of 1 container.",
        "Therefore we assume the word KONO is used for the test tube.",
        "If we find no such nouns, we suppose that the article ONO is not of the second usage but of the first.",
        "So we will go to step The pronoun ORE (this, it) is used in sentences as a case e ie We can predict the kind of objects designated by the pronoun by using the case frame description of the verb in a sentence.",
        "The postposition attached to the pronoun indicates a set of possible cases.",
        "ng fro the frames the cases which belong to the set; we can obtain the semantic descriptions which are satisfied by the object designated by the pronoun So we search through HNS and NS for an object which Iatisfies the descriptions.",
        "Consider",
        "In this(water)(someone) puts in 2 grams of salt.",
        "The set of possible cases for the postposition NI is (PLACE, RESULT, TIME, BENEFICENT - - -), and the case frames of IRERU (put an) have the case PLA__.",
        "We can predict that the pronoun KORE (this, it) fills the PLACE case in the sentence.",
        "The semantic description says that a lower concept noun of container' or 'liquid' is preferable as the PLACE case of the verb IRERU (put in).",
        "The object 'water' which is a lower concept.",
        "noun of 'liquid' is found in NS, and is determined to be the object designated bN.",
        "the pronoun - 64 - We have some other pronouns and articles in Japanese which are analyzed in the same way.",
        "We provide different LISP functions for different pronouns and put them in the dictionary definitions of these words.",
        "T. Winograd treated the same problems in his excellent system SHRDLU (1971; 1972).",
        "However, the world which his system can deal with is very limited.",
        "In order to construct a system which can treat a wider range of sentences, the system should be equipped with the schema representing the relationships between events and object (an event may imply th1 occurrence of new objects or changes in the propertied of objects).",
        "In real world entences, there exists more complex phenomena about anaphoric expressions and omissions of words than those treated in SHRDLU.",
        "We do not claim that our system can treat such complex phenomena, but we hope that our system can be evolved to cover such phenomena by means of combining contextual analysis procedure with semantic descriptions of words.",
        "V ANALYSIS OF COMPLEX SENTENCES In the previous sections we described the semantic and contextual analysis procedure of our system.",
        "In this section we explicate by using xample entences how these functional units are organized in order to analyze fairly complex sentences."
      ]
    },
    {
      "heading": "(1) Suppose the input sentence is ASSHUKU-SARETE TAISEKI GA HENNA-SURU TOKI NO SANSO -NO",
      "text": [
        "be compressed volume (SUBJ ACT) change time oxygen when JOUTAI 0 KANSATSUSHI, SONO ATSURYOKTJ 0 SOKUTEISHI, state (OBJ) observe the, its pressure (OBJ) measure SORE 0 GURAFU NI ARAWASU.",
        "it (OBJ) graph (PLACE, RESULT) express (Someone) observes the state of the oxygen when it is compressed and the volume (of it) changes, measures the pressure, and expresses it by a graph.",
        "- 65 - The sentence is analyzed by the following steps."
      ]
    },
    {
      "heading": "1. The program first tries to find the leftmost verb, and analyzes",
      "text": [
        "the clause governed by the verb.",
        "The sentence ASSHUKUSARETE (be ed) is analyzed first.",
        "This sentence has an irregular struetutt in the sense that there are no explicit case elements before the verb.",
        "kll case ele-ocnts are omitted in this sentential By checking the inflection of the verb (ASSIU (to compress) ---ASSHUKUSARE (to be c pressed)), ve reeognizc that the sentence is in the passive veice.",
        "The lexieal desclipt 1 of the verb in the word dictionary indicates that it takes two intrinsic cases that is ACTOR and OBJECT.",
        "In a Japanese sentence especially in the field of chemistry, the case element ACTOR is apt to be neglected.",
        "Therefote we adopt a dummy filler for the ACTOR to represent the author of the sentence or some other human being.",
        "As there are no preceding sentences, we cannot fill in the OBJECT case immediately.",
        "So we set up the pending problem in TL which will watch the analysis of the succeeding strings to fill the gap The clause TAISEKI-GA HENKA-SURD will be analyzed next The verb HENKA-SURU (change) requires only SUBJ case The postpositien attached to the noun TAISEKI (volume) pessiblN i plies the case SUBJ.",
        "The noun TAISEKI is a lower concept noun of 'attribute' which satisfies the semantic condition for the case, element.",
        "So this sentence is analyzed in a straightforward manner.",
        "However, because the noun TAISEKI is an attribute noun, we must find the corresponding entity noun.",
        "T1,1t is, we must identi,f) the object whose volume is being referred to.",
        "As we cannot find such an object in the preceding sentences, we set up a pending problem in TL.",
        "checking the inflection of the verb HENKASURU (change) and noting that it is immediately followed by a noun, it is recognized that the sentence is an edded sentence modifying the following noun TOKI (ti when).",
        "We then - 66 - connect this sentential part wita the noon TOKI by using the relation SMOD (MODified by a Sentence).",
        "When we analyze the next clause, TOKI NO SANSO NO JOUTAI 0 KANSATSU-SURU oxygen state (OBJ) observe when we first perform the analysis of the noun phrase TOKI-NO SANSO--NO JOUTAI.",
        "The coination of tht nouns TOKI (time) and SANSO (oxygen) is semanticall) permissible because 'oxyg4n‘ is a lower concept noun of 'material' and can be modified by a word which designates a special point of time.",
        "The noun TOKI (time) is modified by the sentential part analyzed at step 2, and designates the time when the event expressed by the sentential part occurs.",
        "The combination of SANSO (oxygen) and JOUTAI (state) is also permissible.",
        "The nouns TOKI (ti SANSO (oxygen) and JOUTAI (state) in the noun phrase activate the trapping elements in TL.",
        "The noun SANSO (oxygen) satisfies the conditions of the two trapping elements set up by stepsl and 2.",
        "That i4 SANSO (oxygen) fills in the case OBJ of the first clause, TAISEKI Cy in the second clause is regarded s the volume of the oxygen in the current clause.",
        "4.",
        "The next clause ATSURYOKU-0 SOKUTEISHI presents no new problems.",
        "However a referent for the noun ATSURYOKU (pressure) must be found.",
        "'Oxygen' in the preceding sentence is easily found to satisfy the conditions _for having the quality ATSURYOKU (pressure).",
        "The remaining steps follow along similar lines, The results of the parsing of the expression are shown in Figure 5 1.",
        "(pg.",
        "68).",
        "(2) The next example shows how HNS is used.",
        "Suppose the input sentence is - 67 - 1) Input sentence: AS SHUKUSARETE, TAISEKI GA HENKASURU TOKI be compressed volume (ACT SUBJ.)",
        "change when SANSO NO MUTAT 0 KANSATSUSHI SON) AT$11170RU 0 oxygen state (OBJ) observe the pressure (OBJ)"
      ]
    },
    {
      "heading": "SOKUTEISHI SORE 0 GURAFU NI SIM!.",
      "text": [
        "measure it (OBJ) graph (1013.1 T, etc.)",
        "t meaning: (Someone) observes the state of oxygen which is pressed and whose volume changes.",
        "(SomeoneI measures the ple‘sure and represents it as a araph.",
        "result of the",
        "- 68 - SUISO SANSO 0 CONGO KONO KONGOUKITAI NI hydrogen oxygen (OBJ) mix the gas mixture TENKASURU BAKUHATSU-SHI, MIZU GA DEKIRU.",
        "fire when) explode water (SUB ACT) be made If (so tone) mixes hydrogen and oxygen, and fires the gas mixture, then (it) explodes mnd water results.",
        "The following steps are perfor When the analysis of the first clause SUISO-TO SANSO ONGOUSHI is complete, the case frames of the verb KONGOUSHI are instantiated.",
        "The NTRANS expression of the glee fra which obtains the highest matched value is determined.",
        "As the result a new object 'mixture' is created and the e e xture are hydrogen and oxygen.",
        "This newly created object is put into HNS 2.",
        "The noun phrase KONO KUNGOIJKITAI-NI (to the gas mixture) in the clause is modified by the anaphoric determiner KONO (this) which requires a referent.",
        "The noun KONGOUKITAI (gas mixture) is a lower concept noun of 'mixture' having as components gaseous objects.",
        "We search in the HNS and NS and find the object 'mixture' in HNS whose e1e nis are the hydrogen and the oxygen.",
        "The object g s mixture' is the theme of the succeeding sentences.",
        "It fills in the oittec case ACT of the third clause and FROM case of the fourth clause.",
        "Figure 5,2 shows the result of the parsing (see pg.",
        "70).",
        "Table 5.i below shows the score obtained by applying our parsing program to the sentences in a junior high school chemistry textbook,",
        "TABLE 5.1 Successes and Failures Schema VI CONCLUSION We can summarize our interpretive procedure as follows: Through the use of grammatical case we describe patterns of activity in the verb dictionary.",
        "The descriptions also contain information as to how activities are connected with each other and how activities change objects.",
        "(b) The meaning descriptions or nouns are based, upon the upper and lower concept relationships and attribute value pairs.",
        "Some kinds of nouns are regarded as having relational meanings.",
        "Their meaning descriptions are similar to those of verbs, adjectives, and prepositions.",
        "By using these descriptions we can analyze fairly complex and long noun phrases where there are few syntactic clues.",
        "(c) We do not use logical expressions to represent context Contextual information is represented in the form of what we call intermediate term memory.",
        "This in combination with the semantic descriptions of words has enabled us to perform efficient analyses dependent on contextual information.",
        "(d) We have developed a programming language which makes it easy to write grammars for natural language and to control the analysis procedure.",
        "By using this language we can incorporate naturally semantic and contextual analyses into syntactic analysis.",
        "We do not need a large and involved program which is responsible for the semantic interpretation of the output given by the syntactic analysis component.",
        "Instead, we provide many simple and small functions for semantic and contextual analyses.",
        "We have obtained fairly good results with our approach.",
        "The textual analysis program on the other hand can treat only local contexts.",
        "In order to treat more global contexts, feel the following improvements be necessary: (i) We must provide our system with an appropriate schema corresponding to human long term memory in order to represent the state of the world.",
        "The system must have frameworks to express spatial relationships among objects time relationships among events and so on.",
        "(ii) At the present stage we have only one relationship CON to connect one activity with another.",
        "However, human knowledge of the world accommodates various kinds of relationships among activities, such as cause, purpose,.",
        "reason, etc.",
        "These relationships may play an important role not only in the analysis of sentences, but also in the inference processes in answering a question.",
        "(iii) £he descriptions of verb meanings using case work rather well for analyzing verb-centered sentences.",
        "However, the results of analysis depend on what verbs are used in surface sentences Hence, the sentences which convey the same meaning but are expressed by using different verbs may be transformed into Aafferent internal representations This is a serious drawback when constructing question-answering systems or other kinds of intelligence systems.",
        "In order to avoid this drawback, we attached a set of transforming rules to each case frame similar to the descriptions used in R. F. syste (1973) We feel,however, that this method is rather awkward and that deeper structures should be employed (similar to eptaal dependency' proposed by R. C. Schank (197310973h).",
        "(iv) In order that a system be able to cumunicate Frith people in a flexible and nature able to derive inferences from incomplete data bases.",
        "Therefore we must design a procedure oother than the uniform proof procedure such as the resolution proof procedure.",
        "(v) It is necessary to apply our method in fields different from them stry and to test whether our semantic description method should be changed or not.",
        "There are many scholars who are interested in using case structures as a representation of natural language utterances.",
        "B. Bruce (1975) offers a good survey and a unified point of view in favor of case systems.",
        "We also believe that the case system is a prorsipromising approach to the representation of meanings in natural language.",
        "Further we believe that the idea of case gives us a useful tool for representing knowledge of hu n beings."
      ]
    },
    {
      "heading": "ACKNOWLEDGMENTS",
      "text": [
        "The ideas reported here came from many sources.",
        "We would especially like to thank K. Tanaka; H. Tanabe and A. Terada for discussions of cases and semantics Also our thanks to D. Smith for his valuable suggestions; special.thanks to Linda Arthur for the preparation and typing of the manuscript."
      ]
    },
    {
      "heading": "BIBLIOGRAPHY",
      "text": []
    }
  ]
}
