{
  "info": {
    "authors": [
      "Ting Liu",
      "Tomek Strzalkowski"
    ],
    "book": "EACL",
    "id": "acl-E12-1030",
    "title": "Bootstrapping Events and Relations from Text",
    "url": "https://aclweb.org/anthology/E12-1030",
    "year": 2012
  },
  "references": [
    "acl-A00-1039",
    "acl-C96-2157",
    "acl-H01-1009",
    "acl-M98-1011",
    "acl-P03-1029",
    "acl-P07-1074",
    "acl-P08-1030",
    "acl-P10-1081",
    "acl-P11-1113",
    "acl-W02-1028"
  ],
  "sections": [
    {
      "text": [
        "rules.",
        "For example, given a ?naive?",
        "rule for identifying company names in text, e.g., ?capitalized NP followed by Co.?, their system would first find a large number of (mostly) positive instances of company names, such as ?Henry Kauffman Co.?",
        "From the context surrounding each of these instances it would isolate alternative indicators, such as ?the president of?, which is noted to occur in front of many company names, as in ?The president of American Electric Automobile Co.",
        "??.",
        "Such alternative indicators give rise to new extraction rules, e.g., ?president of + CNAME?.",
        "The new rules find more entities, including company names that do not end with Co., and the process iterates until no further rules are found.",
        "The technique achieved a very high performance (95% precision and 90% recall), which encouraged more research in IE area by using bootstrapping techniques.",
        "Using a similar approach, (Thelen and Riloff, 2002) generated new syntactic patterns by exploiting the context of known seeds for learning semantic categories.",
        "In Snowball (Agichtein and Gravano, 2000 ) and Yangarber's IE system (2000), bootstrapping technique was applied for extraction of binary relations, such as Organization-Location, e.g., between Microsoft and Redmond, WA.",
        "Then, Xu (2007) extended the method for more complex relations extraction by using sentence syntactic structure and a data driven pattern generation.",
        "In this paper, we describe a different approach on building event patterns and adapting to the different structures of unseen events.",
        "3 Bootstrapping applied to event learning Our objective in this project was to expand the bootstrapping technique to learn extraction of events from text, irrespective of their form of description, a property essential for successful adaptability to new domains and text genres.",
        "The major challenge in advancing from entities and binary relations to event learning is the complexity of structures involved that not only consist of multiple elements but their linguistic context may now extend well beyond a few surrounding words, even past sentence boundaries.",
        "These considerations guided the design of the BEAR system (Bootstrapping Events And Relations), which is described in this paper.",
        "3.1 Event representation An event description can vary from very concise, newswire-style to very rich and complex as may be found in essays and other narrative forms.",
        "The system needs to recognize any of these forms and to do so we need to distill each description to a basic event pattern.",
        "This pattern will capture the heads of key phrases and their dependency structure while suppressing modifiers and certain other non-essential elements.",
        "Such skeletal representations cannot be obtained with keyword analysis or linear processing of sentences at word level (e.g., Agichtein and Gravano, 2000), because such methods cannot distinguish a phrase head from its modifier.",
        "A shallow dependency parser, such as Minipar (Lin, 1998), that recognizes dependency relations between words is quite sufficient for deriving head-modifier relations and thus for construction of event tem-plates.",
        "Event templates are obtained by stripping the parse tree of modifiers while preserving the basic dependency structure as shown in Figure 1, which is a stripped down parse tree of, ?Also Monday, Israeli soldiers fired on four diplomatic vehicles in the northern Gaza town of Beit Hanoun, said diplomats?",
        "The model proposed here represents a significant advance over the current methods for relation extraction, such as the SVO model (Yangarber, et al2000) and its extension, e.g., the chain model (Sudo, et al2001) and other related variants (Riloff, 1996) all of which lack the expressive power to accurately recognize and represent complex event descriptions and to support successful machine learning.",
        "While Sudo's subtree model (2003) overcomes some of the limitations of the chain models and is thus conceptually closer to our method, it nonetheless lacks efficiency required for practical applica-tions.",
        "We represent complex relations as treelike structures anchored at an event trigger (which is usually but not necessarily the main verb) with branches extending to the event attributes (which are usually named entities).",
        "Unlike the singular concepts (i.e., named entities such as ?person?",
        "or",
        "?location?)",
        "or linear relations (i.e., tuples such as ?Gates ?",
        "CEO ?",
        "Microsoft?",
        "), an event description consists of elements that form non-linear de-pendencies, which may not be apparent in the word order and therefore require syntactic and semantic analysis to extract.",
        "Furthermore, an arrangement of these elements in text can vary greatly from one event mention to the next, and there is usually other intervening material in-volved.",
        "Consequently, we construe event representation as a collection of paths linking the trigger to the attributes through the nodes of a parse tree1.",
        "To create an event pattern (which will be part of an extraction rule), we generalize the dependency paths that connect the event trigger with each of the event key attributes (the roles).",
        "A dependency path consists of lexical and syntactic relations (POS and phrase dependencies), as well as semantic relations, such as entity tags (e.g., Person, Company, etc.)",
        "of event roles and word sense designations (based on Wordnet senses) of event triggers.",
        "In addition to the trigger-role paths (which we shall call the sub-patterns), an event pattern also contains the following: ?",
        "Event Type and Subtype ?",
        "which is inherited from seed examples; ?",
        "Trigger class ?",
        "an instance of the trigger must be found in text before any patterns are applied; ?",
        "Confidence score ?",
        "expected accuracy of the pattern established during training process; ?",
        "Context profile ?",
        "additional features collected from the context surrounding the event description, including references of other types of events near this event, in the same sentence, same paragraph, or adjacent paragraphs.",
        "We note that the trigger-attribute sub-patterns are defined over phrase structures rather than over linear text, as shown in Figure 2.",
        "In order to compose a complete event pattern, sub-patterns are collected across multiple mentions of the same-type event.",
        "are identified and assigned to Tr1 and Tr2 (if Tr2's sense wasn't assigned before).",
        "Then go back to step 3.",
        "However, if no such path exist between Tr1 senses with other triggers senses, the first sense listed in Wordnet will be assigned to Tr1 This algorithm tries to assign the most proper sense to every trigger for one type of event.",
        "For example, the sense of fire as trigger of Conflict-Attack event is ?start firing a weapon?",
        "; while it is used in Personal-End_Position, its sense is ?ter-minate the employment of?.",
        "After the trigger sense is defined, we can expand event triggers by adding their synonyms and hyponyms during the event extraction.",
        "3.3 Deriving initial rules from seed examples Extraction rules are construed as transformations from the event patterns derived from text onto a formal representation of an event.",
        "The initial rules are derived from a manually annotated training text corpus (seed data), supplied as part of an application task.",
        "Each rule contains the type of events it extracts, trigger, a list of role sub-patterns, and the confidence score obtained through a validation process (see section 3.6).",
        "Figure 3 shows an extraction pattern for the Con-flict-Attack event derived from the training corpus (but not validated yet)3.",
        "3.4 Learning through pattern mutation Given an initial set of extraction rules, a variety of pattern mutation techniques are applied to derive new patterns and new rules.",
        "This is done by selecting elements of previously learnt patterns, based on the history of partial matches and combining them into new patterns.",
        "This form of learning, which also includes conditional rule 3 In this figure we omit the parse tree trimming step which was explained in the previous section.",
        "relaxation, is particularly useful for rapid adaptation of extraction capability to slightly altered, partly ungrammatical, or otherwise variant data.",
        "The basic idea is as follows: the patterns acquired in prior learning iterations (starting with those obtained from the seed examples) are matched against incoming text to extract new events.",
        "Along the way there will be a number of partial matches, i.e., when no existing pattern fully matches a span of text.",
        "This may simply mean that no event is present; however, depending upon the degree of the partial match we may also consider that a novel structural variant was found.",
        "BEAR would automatically test this hypothesis by attempting to construe a new pattern, out of the elements of existing patterns, in order to achieve a full match.",
        "If a match is achieved, the new ?mutated?",
        "pattern will be added to BEAR learned collection, subject to a validation step.",
        "The validation step (discussed later in this paper) is to assure that the added pattern would not introduce an unacceptable drop in overall system precision.",
        "Specific pattern mutation techniques include the following: ?",
        "Adding a role subpattern: When a pattern matches an event mention while there is a sufficient linguistic evidence (e.g., presence of certain types of named entities) that additional roles may be present in text, then appropriate role subpatterns can be \"imported\" from other, non-matching patterns (Figure 4).",
        "?",
        "Replacing a role subpattern: When a pattern matches but for one role, the system can replace this role subpattern by another subpattern for the same role taken from a different pattern for the same event type.",
        "?",
        "Adding or replacing a trigger: When a pattern matches but for the trigger, a new trigger can be added if it either is already present in another pattern for the same event type or the syno-nym/hyponym/hypernym of the trigger (found in section 3.2).",
        "We should point out that some of the same effects can be obtained by making patterns more general, i.e., adding \"optional\" attributes (i.e., optional sub-patterns), etc.",
        "Nonetheless, the pattern mutation is more efficient because it will automatically learn such generalization on an as-needed basis in an entirely data-driven fashion, while also maintaining high precision of the resulting pattern set.",
        "It is thus a more general method.",
        "Figure 4 illustrated the use of the elements combination technique.",
        "In this example,",
        "4 The X-axis is the percentage of entities coreferred between the EVMs (Event mentions) and the SEs (Sentences); while the Y-axis shows the probability that the SE contains a mention that is the same type as the EVM.",
        "5 Entity is the employer in the event entities, ?Howard G. Capek?",
        "and ?UBS?.",
        "The projected accuracy of resign_V as an End-Position trigger is 0.88.",
        "With 100% argument overlap rate, we estimate the probability that sentence R contains an event mention of the same type as sentence L (and in fact co-referential mention) at 97% (We set 80% as the threshold).",
        "Thus a new event mention is found and a new pattern for End-Position is automatically derived from R, as shown in Figure 7A.",
        "3.6 Pattern validation Extraction patterns are validated after each learning cycle against the already annotated data.",
        "In the first supervised learning step, patterns accuracy is tested against the training corpus based on the similarity between the extracted events and human annotated events: ?",
        "A Full match is achieved when the event type is correctly identified and all its roles are correctly matched.",
        "A full credit is added to the pattern score.",
        "?",
        "A Partial match is achieved when the event type is correctly identified but only a subset of roles is correctly extracted.",
        "A partial score, which is the ratio of the matched roles to the whole roles, is add-ed.",
        "?",
        "A False Alarm occurs when a wrong type of event is extracted (including when no event is present in text).",
        "No credit is added to the pattern score.",
        "In the subsequent steps, the validation is extended over parts of the unannotated corpus.",
        "In Riloff (1996) and Sudo et al(2001), the pattern accuracy is mainly dependent on its occurrences in the relevant documents6 vs. the whole corpus.",
        "However, one document may contain multiple types of events, thus we set a more restricted validation measure on new rules: ?",
        "Good Match If a new rule ?rediscovers?",
        "already extracted events of the same type, then it will be counted as either a Full Match or Partial Match based on previous rules ?",
        "Possible Match If an already extracted event of same type of a rule contains same entities and trigger as the candidate extracted by the rule.",
        "This candidate is a possible match, so it will get a partial 6 If a document contains same type of events extracted from previous steps, the document is a relevant document to the pattern.",
        "Victim pattern: <N(obj, PER): Victim> <V(kill): trigger> (Life-Die) Projected Accuracy: 0.9390243902439024 Number of negative matches: 5 Number of Positive matches: 77 Attacker pattern: <N(subj, PE/PER/ORG): Attacker> <V> <V(use): trigger> (Conflict-Attack) Projected Accuracy: 0.025210084033613446 Number of negative matches: 116 Number of positive matches: 3 Attacker pattern: <N(subj, GPE/PER): Attacker> <V(attack): trig-ger> (Conflict-Attack) Projected Accuracy: 0.4166666666666667 Number of negative matches: 7 Number of positive matches: 5 categories of positive matches: GPE: 4 GPE_Nation: 4 PER: 1 PER_Individual: 1 categories of negative matches: GPE: 1 GPE_Nation: 1 PER: 6 PER_Group: 1 PER_Individual: 5 Figure 9. sub-patterns with projected accuracy scores Event id: 27 from: sample Projected Accuracy: 0.1765 Adjusted Projected Accuracy: 0.91 Type: Justice Subtype: Arrest-Jail Trigger: capture Person sub-pattern: <N(obj, PER): Person> <V(capture): trigger> Co-occurrence ratio: {para_Conflict_Demonstrate=100%, ?}",
        "Mutually exclusive ratio: {sent_Conflict_Attack=100%, pa-ra_Conflict_Attack=96.3%, ?}",
        "Figure 8.",
        "An Arrest-Jail pattern with context profile information score based on the statistics result from Figure 6. ?",
        "False Alarm If a new rule picks up an already extracted event in different type Thus, event patterns are validated for overall expected precision by calculating the ratio of positive matches to all matches against known events.",
        "This produces pattern confidence scores, which are used to decide if a pattern is to be learned or not.",
        "Learning only the patterns with sufficiently high confidence scores helps to guard the bootstrapping process from spinning off track; nonetheless, the overall objective is to maximize the performance of the resulting set of extraction rules, particularly by expanding its recall rate.",
        "For the patterns where the projected accuracy score falls under the cutoff threshold, we may still be able to make some ?repairs?",
        "by taking into account their context profile.",
        "To do so, we applied a similar approach as (Liao, 2010), which showed that some types of events can appeared frequently with each other.",
        "We collected all the matches produced by such a failed pattern and created a list of all other events that occur in their immediate vicinity: in the same sentence, as well as the sentences before and after it7.",
        "These other events, of different types and detected by different patterns, may be seen as co-occurring near the target event: these that co-occur near positive matches of our pattern will be added to the positive context support of this pattern; conversely, events co-occurring near false alarms will be added to the negative context support for this pattern.",
        "By collecting such contextual infor-mation, we can find contextually-based indicators and non-indicators for occurrence of event mentions.",
        "When these extra constraints are included in a previously failed pattern, its projected 7 If a known event is detected in the same sentence (sent_?",
        "), the same paragraph (para_?",
        "), or an adjacent paragraph (adj_para_...) as the candidate event, it becomes an element of the pattern context support.",
        "accuracy is expected to increase, in some cases above the threshold.",
        "For example, the pattern in Figure 8 has an initially low projected accuracy score; however, we find that positive matches of this pattern show a very high (100% in fact) degree of correlation with mentions of Demonstrate events.",
        "Therefore, limiting the application of this pattern to situations where a Justice-Arrest-Jail event is mentioned in a nearby text improves its projected accuracy to 91%, which is well above the required threshold.",
        "In addition to the confidence rate of each new pattern, we also calculate projected accuracy of each of the role sub-patterns, because they may be used in the process of detecting new patterns, and it will be necessary to score partial matches, as a function confidence weights for pattern components.",
        "To validate a sub-pattern we apply it to the training corpus and calculate its projected accuracy score by dividing the number of correctly matched roles by the total number of matches returned.",
        "The projected accuracy score will tell us how well a sub-pattern can distinguish a specific event role from other infor-mation, when used independently from other elements of the complete pattern.",
        "Figure 9 shows three sub-pattern examples.",
        "The first sub-pattern extracts the Victim role in a Life-Die event with very high projected accuracy.",
        "This sub-pattern is also a good candidate for generations of additional patterns for this type of event, a process which we describe in section D. The second sub-pattern was built to extract the Attacker role in Conflict-Attack events, but it has very low projected accuracy.",
        "The third one shows another Attacker sub-pattern whose projected accuracy score is 0.417 after the first step",
        "in validation process.",
        "This is quite low; however, it can be repaired by constraining its entity type to GPE.",
        "This is because we note that with a GPE entity, the subpattern is 80% on target, while with PER entity it is 85% a false alarm.",
        "After this sub-pattern is restricted to GPE its projected accuracy becomes 0.8.",
        "Table 1 lists example sub-patterns for which the projected accuracy increases significantly after adding more constrains.",
        "When the projected accuracy of a sub-pattern is improved, all patterns containing this sub-pattern will also improve their projected accuracy.",
        "If the adjusted projected accuracy rises above the predefined threshold, the repaired pattern will be saved.",
        "In the following section, we will discuss the experiments conducted to evaluate the performance of the techniques underlying BEAR: how effectively it can learn and how accurately it can perform its extraction task.",
        "4 Evaluation We test the system learning effectiveness by comparing its performance immediately following the first iteration (i.e., using rules derived from the training data) with its performance after N cycles of unsupervised learning.",
        "We split ACE training corpus 8 randomly into 5 folders and trained BEAR on the four folders and evaluated it on the left one.",
        "Then, we did 5 fold cross vali-dation.",
        "Our experiments showed that BEAR",
        "Figure 12.",
        "Event mention extraction after learning: precision for each type of event the median threshold of 0.5 (based on the experiments conducted thus far), where the system performance improves from 42% to 66.86% F-score, which represents 83.9% precision and 55.57% recall.",
        "Figure 11 explains BEAR's learning effectiveness at what we determined empirically to be the optimal confidence threshold (0.5) for pattern acquisition.",
        "We note that the performance of the system steadily increases until it reaches a plateau after about 10 learning cycles.",
        "Figure 12 and Figure 13 show a detailed breakdown of BEAR extraction performance after 10 learning cycles for different types of events.",
        "We note that while precision holds steady across the event types, recall levels vary signifi-cantly.",
        "The main reason for low recall in some types of events is the failure to find a sufficient number of high-confidence patterns.",
        "This may point to limitations of the current pattern discovery methods and may require new ways of reaching outside of the current feature set.",
        "In the previous section we described several learning methods that BEAR uses to discover, validate and adapt new event extraction rules.",
        "Some of them work by manipulating already learnt patterns and adapting them to new data in order to create new patterns, and we shall call these pattern-mutation methods (PMM).",
        "Other described methods work by exploiting a broader linguistic context in which the events occur, or context-based methods (CBM).",
        "CB methods look for structural duality in text surrounding the events and thus discover alternative extraction patterns.",
        "In Table 2, we report the results of running BEAR with each of these two groups of learning methods separately and then in combination to see how they contribute to the end performance.",
        "Base1 and Base2 showed the result without and with adding trigger synonyms in event extrac-tion.",
        "By introducing trigger synonyms, 27% more good events were extracted at the first iteration and thus, BEAR had more resources to use in the unsupervised learning steps.",
        "The ALL is the combination of PMM and CBM, which demonstrate both methods have the contribution to the final results.",
        "Furthermore, as explained before, new extraction rules are learned in each iteration cycle based on what was learned in prior cycles and that new rules are adopted only after they are tested for their projected accuracy (confidence score), so that the overall precision of the resulting rule set is maintained at a high level relative to the base run.",
        "5 Conclusion and future work In this paper, we presented a semi-supervised method for learning new event extraction patterns from un-annotated text.",
        "The techniques described here add significant new tools that increase capabilities of information extraction technology in general, and more specifically, of systems that are built by purely supervised methods or from manually designed rules.",
        "Our evaluation using ACE dataset demonstrated that that bootstrapping can be effectively applied to learning event extraction rules for 33 different types of events and that the resulting system can outperform supervised system (base run) significant-ly.",
        "Some follow-up research issues include: ?",
        "New techniques are needed to recognize event descriptions that still evade the current pattern derivation techniques, especially for the events defined in Personnel, Business, and Transactions classes.",
        "?",
        "Adapting the bootstrapping method to extract events in a different language, e.g. Chinese or Arabic.",
        "?",
        "Expanding this method to extraction of larger ?scenarios?, i.e., groups of correlated events that form coherent ?stories?",
        "of-ten described in larger sections of text, e.g., an event and its immediate conse-quences."
      ]
    }
  ]
}
