{
  "info": {
    "authors": [
      "Michael Zock",
      "Didier Schwab"
    ],
    "book": "Coling 2008: Proceedings of the workshop on Knowledge and Reasoning for Answering Questions",
    "id": "acl-W08-1902",
    "title": "Lexical access based on underspecified input",
    "url": "https://aclweb.org/anthology/W08-1902",
    "year": 2008
  },
  "references": [
    "acl-C00-1072",
    "acl-C96-1002",
    "acl-P06-1036",
    "acl-P84-1058",
    "acl-P98-2127",
    "acl-P98-2180",
    "acl-W04-2105",
    "acl-W06-1007"
  ],
  "sections": [
    {
      "text": [
        "Lexical Access Based on Underspecified Input",
        "Michael ZOCK",
        "LIF-CNRS Équipe TALEP 163, Avenue de Luminy F-13288 Marseille Cedex 9 michael.zock@lif.univ-mrs.fr",
        "Didier SCHWAB",
        "Groupe GETALP Laboratoire d'Informatique de Grenoble 385 avenue de la Bibliothque - BP 53 F-38041 Grenoble Cedex 9 didier.schwab@imag.fr",
        "Words play a major role in language production, hence rinding them is of vital importance, be it for speaking or writing.",
        "Words are stored in a dictionary, and the general belief holds, the bigger the better.",
        "Yet, to be truly useful the resource should contain not only many entries and a lot of information concerning each one of them, but also adequate means to reveal the stored information.",
        "Information access depends crucially on the organization of the data (words) and on the navigational tools.",
        "It also depends on the grouping, ranking and indexing of the data, a factor too often overlooked.",
        "We will present here some preliminary results, showing how an existing electronic dictionary could be enhanced to support language producers to find the word they are looking for.",
        "To this end we have started to build a corpus-based association matrix, composed of target words and access keys (meaning elements, related concepts/words), the two being connected at their intersection in terms of weight and type of link, information used subsequently for grouping, ranking and navigation."
      ]
    },
    {
      "heading": "1. Context and problem",
      "text": [
        "When speaking or writing we encounter basically either of the following two situations: one where everything works automatically, somehow like magic, words popping up one after another",
        "© 2008.",
        "Some rights reserved.",
        "like spring water, and another where we look deliberately and often painstakingly for a specific, possibly known word.",
        "We will be concerned here with this latter situation: a speaker/ writer using an electronic dictionary to look for such a word.",
        "Unfortunately, alphabetically organized dictionaries are not well suited for this kind of reverse lookup where the inputs are meanings (elements of the word's definition) or conceptually related elements (collocations, associations), and the outputs the target words.",
        "Without any doubt, lexicographers have made considerable efforts to assist language users, building huge resources, composed of many words and lots of information associated with each one of them.",
        "Still, it is not unfair to say most dictionaries have been conceived from the reader's point of view.",
        "The lexicographers have hardly taken into account the language producer's perspective, considering conceptual input, incomplete as it may be, as starting point.",
        "While readers start with words, looking generally for their corresponding meanings, speakers or writers usually start with the opposite, meanings or concepts, which should be the entry points of a dictionary, which ideally is neutral in terms of access direction.",
        "The problem is that we still don't know very well what concepts are, whether they are compositional and if so, how many primitives there are (Wilks, 1977; Wierzbicka, 1996; Goddard, 1998).",
        "^oget's thesaurus (Roget, 1852), Miller and Fellbaum's WordNet (Fellbaum, 1998) and Longman's Language Activator (Summers, 1993), being notable exceptions (For more details, see next section).",
        "Neither do we know how to represent them.",
        "Yet, there are ways around this problem as we will show.",
        "Whether concepts and words are organized and accessed differently is a question we cannot answer here.",
        "We can agree though on the fact that getting information concerning words is fairly unproblematic when reading, at least in the case of most western languages.",
        "Words can generally be found easily in a dictionary, provided the user knows the spelling, the alphabet and how to build lemma starting from an inflected form.",
        "Unlike words, which are organized alphabetically (in western languages) or by form (stroke counts in Chinese), concepts are organized topically: they are clustered into functional groups according to their role in real world, or our perception of it.",
        "Psychologist have studied the difficulties people have when trying to produce or access words (Aitchinson, 2003).",
        "In particular, they have studied the tip-of-the-tongue phenomenon (Brown and McNeill, 1996) and the effects an input can have on the quality of an output (error analysis (Cutler, 1982)) and on the ease of its production: positive or negative priming effect (activation/inhibition).",
        "Obviously, these findings allow certain conclusions, and they might guide us when developing tools to help people find the needed word.",
        "In particular, they reveal two facts highly relevant for our goal:",
        "1. even if people fail to access a given word, they might know a lot about it: origin, meaning (word definition, role played in a given situation), part of speech, number of syllables, similar sounding words, etc.",
        "Yet, despite all this knowledge, they seem to lack some crucial information to be able to produce the phonetic form.",
        "The word gets blocked at the very last moment, even though it has reached the tip-of-the-tongue.",
        "This kind of nuisance is all the more likely as the target word is rare and primed by a similar sounding word.",
        "2. unlike words in printed or electronic dictionaries, words in our mind may be inexis-tent as tokens.",
        "What we seem to have in our minds are decomposed, abstract entities which need to be synthesized over time.",
        "According to Levelt (Levelt, 1996) the generation of words (synthesis) involves the following stages: conceptual preparation, lexical selection, phonological-and phonetic encoding, articulation.",
        "Bear in mind that having performed 'lexical selection' does not imply access to the phonetic form (see the experiments on the tip-of-the-tongue phenomenon).",
        "What can be concluded from these observations?",
        "It seems that underspecified input is sufficiently frequent to be considered as normal.",
        "Hence we should accept it, and make the best out of it by using whatever information is available (accessible), no matter how incomplete, since it may still contribute to find the wanted information, be it by reducing the search space.",
        "Obviously, the more information we have the better, as this reduces the number of words among which to choose."
      ]
    },
    {
      "heading": "2. Related work and goal",
      "text": [
        "While more dictionaries have been built for the reader than for the writer, there have been some onomasiological attempts as early as in the middle of the 19th century.",
        "For example, Roget's Thesaurus (Roget, 1852), L'ong's Chinese and English instructor (L'ong, 1862), or Boissiere's analogical dictionary (Boissiere, 1862).",
        "Newer work includes Mel'cuk's ECD (Mel'cuk et al., 1999), Miller and Fellbaum's WordNet (Fellbaum, 1998), Richardson and Dolan's MindNet (Richardson et al., 1998), Dong's HowNet (Dong and Dong, 2006) and Longman's Language Activator (Summers, 1993).",
        "There is also the work of",
        "into words.",
        "Put differently, we do not store words at all in our mind, at least not in the layman's or lexicographer's sense who consider word-forms and their meanings as one.",
        "If we are right, than rather continue to consider the human mind as a word store we could consider it as a word factory.",
        "Indeed, by looking at some of the work done by psychologists who try to emulate the mental lexicon (for a good survey see (Harley, 2004), pages 359-374) one gets the impression that words are synthesized rather than located and read out.",
        "Taking a look at all this work, generally connectionist models, one may conclude that, rather than having words in our mind we have a set of more or less abstract features (concepts, syntactic information, phonemes), distributed across various layers, which need to be synthesized over time.",
        "To do so we proceed from abstract meanings to concrete sounds, which at some point were also just abstract features.",
        "By propagating energy rather than data (as there is no message passing, transformation or cumulation of information, there is only activation spreading, that is, changes of energy levels, call it weights, electronic impulses, or whatever), that we propagate signals, activating ultimately certain peripheral organs (larynx, tongue, mouth, lips, hands) in such a way as to produce movements or sounds, that, not knowing better, we call words.",
        "(Fontenelle, 1997; Sierra, 2000; Moerdijk, 2008), various collocation dictionaries (BBI, OECD) and Bernstein's Reverse Dictionary.",
        "Finally, there is M. Rundell's MEDAL, a thesaurus produced with the help of Kilgariff's Sketch Engine (Kilgarriff et al., 2004).",
        "As one can see, a lot of progress has been accomplished over the last few years, yet more can be done, especially with regard to unifying linguistic and encyclopedic knowledge.",
        "Let's take an example to illustrate our point.",
        "Suppose, you were looking for a word expressing the following ideas: 'superior dark coffee made from beans from Arabia', and that you knew that the target word was neither espresso nor cappuccino.",
        "While none of this would lead you directly to the intended word, mocha, the information at hand, i.e. the word's definition or some of its elements, could certainly be used.",
        "In addition, people draw on knowledge concerning the role a concept (or word) plays in language and in real world, i.e. the associations it evokes.",
        "For example, they may know that they are looking for a noun standing for a beverage that people take under certain circumstances, that the liquid has certain properties, etc.",
        "In sum, people have in their mind an encyclopedia: all words, concepts or ideas being highly connected.",
        "Hence, any one of them has the potential to evoke the others.",
        "The likelihood for this to happen depends, of course, on factors such as frequency (associative strength), distance (direct vs. indirect access), prominence (saliency), etc.",
        "How is this supposed to work for a dictionary user?",
        "Suppose you were looking for the word mocha (target word: tw), yet the only token coming to your mind were computer (source word: sw).",
        "Taking this latter as starting point, the system would show all the connected words, for example, Java, Perl, Prolog (programing languages), mouse, printer (hardware), Mac, PC (type of machines), etc.",
        "querying the user to decide on the direction of search by choosing one of these words.",
        "After all, s/he knows best which of them comes closest to the tw.",
        "Having started from the sw 'computer', and knowing that the tw is neither some kind of software nor a type of computer, s/he would probably choose Java, which is not only a programming language but also an island.",
        "Taking this latter as the new starting point s/he might choose coffee (since s/he is looking for some kind of beverage, possibly made from an ingredient produced in lava, coffee), and finally mocha, a type of beverage made from these beans.",
        "Of course, the word Java might just as well trigger Kawa which not only rhymes with the sw, but also evokes Kawa Igen, a javanese volcano, or familiar word of coffee in French.",
        "As one can see, this approach allows word access via multiple routes: there are many ways leading to Rome.",
        "Also, while the distance covered in our example is quite unusual, it is possible to reach the goal quickly.",
        "It took us actually very few moves, four, to find an indirect link, between two, fairly remotely related terms: computer and mocha.",
        "Of course, cyber-coffee fans might be even quicker in reaching their goal."
      ]
    },
    {
      "heading": "3. The lexical matrix revisited",
      "text": [
        "The main question that we are interested in here is how, or in what terms, to index the dictionary in order to allow for quick and intuitive access to words.",
        "Access should be possible on the basis of meaning (or meaning elements), various kinds of associations (most prominently 'syntagmatic' ones) and, more generally speaking, underspecified input.",
        "To this end we have started to build an association matrix (henceforth AM), akin to, yet different from G. Miller's initial proposal of WN (Miller et al., 1990).",
        "He suggested to build a lexical matrix by putting on one axis all the forms, i.e. words of the language, and on the other, their corresponding meanings.",
        "The latter being defined in terms of synsets.",
        "The corresponding meaning-form relations are signaled via a boolean (presence/absence).",
        "Hence, looking at the intersection of meanings and forms, one can see which meanings are expressed by, or converge toward what forms, or conversely, what form expresses which meanings.",
        "Whether this is the way WN is actually implemented is not clear to us, though we believe that it is not.",
        "Anyhow, our approach is different, and we hope the reader will understand in a moment the reasons why.",
        "We will also put on one axis all the form elements, i.e. the lemmata or expressions of a given language (we refer to them as target words, henceforth tw).",
        "On the other axis we will place the triggers or access-words (henceforth aw), that is, the words or concepts capable and likely to evoke the tw.",
        "These are typically the kind of words psychologists have gathered in their association experiments (Jung and Riklin, 1906; Deese, 1965; Schvaneveldt, 1989).",
        "Note, that instead of putting a boolean value at the intersection of the tw and the aw, we will put weights and the type of link holding between the co-occurring terms.",
        "This gives us quadruplets.",
        "For example, an utterance like \"this is the key of the door\" might yield the aw (key), the iw(door), the link type Wpart of), and a weight (let's say 15).",
        "The fact that we have these two kinds of information is very important later on, as it allows the search engine to cluster by type the possible answers to be given in response to a user query (word(s) provided as input) and to rank them.",
        "Since the number of hits, i.e. words from which the user must choose, may be substantial (depending on the degree of specification of the input), it is important to group and rank them to ease navigation, allowing the user to find directly and quickly the desired word, or at least the word with which to continue search.",
        "Obviously, different word senses (homographs), require different entries (bank-money vs bank-river), but so will synonyms, as every word-form, synonym or not, is likely to be evoked by a different key-or access-word (similarity of sound).",
        "Also, we will need a new line for every different relation between a aw and a tw.",
        "Whether more than one line is needed in the case of identical links being expressed by different linguistic resources (the lock of the door vs. the door's lock vs. the door has a lock) remains an open empirical question.",
        "Let us see quickly how our AM is supposed to work.",
        "Imagine you wanted to find the word for the following concept: hat of a bishop.",
        "In such a case, any of the following concepts or words might come to your mind: church, Vatican, abbot, monk, monastery, ceremony, ribbon, and of course rhyming words like: brighter, fighter, lighter, righter, tighter, writer, as, indeed, any of them could remind us of the tw: mitre.",
        "Hence, all of them are possible aw.",
        "Once this resource is built, access is quite straightforward.",
        "The user gives as input all the words coming to his mind when thinking of a given idea or concept, and the system will display all connected words.",
        "If the user can find the item he is looking for in this list, search stops, otherwise it will continue, the user giving other words of the list, or words evoked by them.",
        "Of course, remains the question of how to build this resource, in particular, how to populate the axis devoted to the trigger words, i.e. access-keys.",
        "At present we consider three approaches: one, where we use the words occurring in word definitions (see also, (Dutoit and Nugues, 2002; Bilac et al., 2004)), the other is to mine a well-balanced corpus, to find co-occurrences within a given window (Ferret and Zock, 2006), the size depending a bit on the text type (encyclopedia) or type of corpus.",
        "Still another solution would be to draw on the association lists produced by psychologists, see for example http://www.usf.edu/, or http://www.eat.rl.ac.uk.",
        "Of course, the idea of using matrices in linguistics is not new.",
        "There are at least two authors who have proposed its use: M. Gross (Gross, 1984) used it for coding the syntactic behavior of lexical items, hence the term lexicon-grammar, and G. Miller, the father of WN (Miller et al., 1990) suggested it to support lexical access.",
        "While the former work is not relevant for us here, Miller's proposal is.",
        "What are the differences between his proposal and ours?",
        "There are basically four main differences:",
        "1. we use, collocations or access-words, i.e awsrather than synsets; Hence, any of the following aws (cat, grey, computer device, cheese, Speedy Gonzales) could point toward the tw'mouse', none of them are part of the meaning, leave alone synonyms.",
        "2. we mark explicitly the weight and the type of link between the tw and the aw (isa, part_of, etc.",
        "), whereas WN uses only a binary value.",
        "Both the weight and link are necessary information for ranking and grouping, i.e. navigation.",
        "3. our AM is corpus-sensitive (see below), hence, we can, at least in principle, accommodate the fact that a speaker is changing topics, adapting the weight of a given word or find a more adequate aw in this new context.",
        "Think of 'piano' in the contexts of a concert or moving your household.",
        "Only the latter would evoke the notion of weight.",
        "4. relying on a corpus, we can take advantage of syntagmatic associations (often encyclopedic knowledge), something which is difficult to obtain for WN."
      ]
    },
    {
      "heading": "4. Keep the set of lexical candidates small",
      "text": [
        "Here and in the next section we describe how the idea of the AM has been computationally dealt with.",
        "The goal is to reduce the number of hits, i.e. possible tws (output), as a function of the input, i.e, the number of relevant aws given by the speaker/writer.",
        "To achieve this goal we apply lexical functions to the aws, considering the intersection of the obtained sets to be the relevant tws.",
        "The usefulness of lexical functions for linguistics in general and for language production in particular has been shown by Mel'cuk (Mel'cuk, 1996).",
        "We will use them here, as they seem to fit also our needs of information extraction or lexical access.",
        "Mel'cuk has coined the term lexical functions to refer to the fact that two terms are systematically related.",
        "For example, the lexical function Gener refers to the fact that some term (let's say 'cat) can be replaced by a more general term (let's say",
        "^animal).",
        "Lexical functions encode the combinability of words.",
        "While 'big' and 'strong' express the same idea (intensity, magnitude), they cannot be combined freely with any noun: strong can be associated with fever, whereas big cannot.",
        "Of course, this kind of combinability between lexical terms is language specific, because unlike in English, in French one can say grosse fièvre or forte fièvre, both being correct (Schwab and Lafourcade, 2007).",
        "Our AM handles, of course these kind of functions.",
        "Here is a list of some of them:",
        "- paradigmatic associations: hypernymy (ccaP - 'animal), hyponymy, synonymy, or antonymy,... ;",
        "- syntagmatic associations: collocations {'fearbeing associated with 'strong or'little);",
        "- morphological relations ie.",
        "terms being derived from another part of speech: applying the change-part-of-speech lexical function",
        "- sound-related items: homophones, rhymes.",
        "4.2 Assumptions concerning search",
        "The purpose of using lexical functions is to reduce the number of possible outcomes from which the user must choose.",
        "The list contains either the twor another promising aw the user may want use to continue search.",
        "Hence, lexical functions are useful for search provided that:",
        "1. the speaker/writer is able to specify the kind of relations s/he wants to use.",
        "The problem here lies in the nature and number of the functions, some of them being very well specified, while others are not.",
        "2. the larger the number of trigger words the smaller the list of words from which to choose: the speaker/writer can add or delete words to broaden or narrow the scope of his/her query.",
        "These hypotheses are being modeled by using set properties of lexical functions.",
        "The idea is to apply all functions, or a selection of them, to the aws and to give the speaker/writer the intersection as result (see section 5.3.5 for an example)"
      ]
    },
    {
      "heading": "5. Experiment",
      "text": [
        "We have started with a simple, preliminary experiment.",
        "Only one lexical function was used: neighborhood (henceforth fneig).",
        "Let fneig be the function producing the set of co-occurring terms within a given window (sentence or a paragraph).",
        "The result produced by the system and returned to the user is the intersection of the application of fneig to the aws.",
        "In the next section we explain how this function is applied to two corpora (Wordnet and Wikipedia), to show their respective qualities and shortcomings for this specific task.",
        "WordNet (henceforth WN) is a lexical database for English developed under the guidance of G.",
        "Miller (Miller et al., 1990).",
        "One of his goals was to support lexical access akin to the human mind, association-based.",
        "Knowledge is stored in a network composed of nodes and links (nodes being words or concepts and the links are the means of connecting them) and access to knowledge, i.e. search, takes place by entering the network at some point and follow the links until one has reached the goal (unless one has given up before).",
        "This kind of navigation in a huge conceptual/lexical network can be considered equivalent to spreading activation taking place in our brain.",
        "Of course, such a network has to be built, and navigational support must be provided to find the location where knowledge or words are stored.",
        "This is what Miller and his coworkers did by building WN.",
        "The resource has been built manually, and it contains at present about 150.000 entries.",
        "The structure of the dictionary is different from conventional, alphabetical resources.",
        "Words are organized in WN in two ways.",
        "Semantically similar words, i.e. synonyms, are grouped as clusters.",
        "These sets of synonyms, called synsets, are then linked in various ways, depending on the kind of relationship they entertain with the adjacent synset.",
        "For example, their neighbors can be more general or specific (hyperonymy vs. hy-ponymy), they can be part of some reference object (meronymy: car-motor), they can be the opposite (antonymy: hot-cold), etc.",
        "While WN is a resource it can also be seen as a corpus.",
        "There are many good reasons to use WN for learning fn.",
        "For one, there are many extensions, and second, the one we are using, extended WN (Mihalcea and Moldovan, 2001) spares us the trouble of having to address issues like: (a) segmentation: we do not need to identify sentence boundaries ; (b) semantic ambiguity: words being tagged, we get good precision; (c) lemmatization: since only verbs, nouns, adjectives and adverbs are tagged, we need neither a stoplist nor a lemmatizer.",
        "Despite all these qualities, two important problems remain nevertheless for this kind of corpus: (a) size: though, all words are tagged, the corpus remains small as it contains only 63.941 different words; (b) in consequence, the corpus lacks many syntagmatic associations encoding encyclopedic knowledge.",
        "Wikipedia is a free, multilingual encyclopedia, accessible on the Web.",
        "For our experiment we have chosen the English version which of this day (12th of may 2008) contains 2,369,180 entries.",
        "Wikipedia has exactly the opposite properties of WN.",
        "While it covers well encyclopedic relations, it is only raw text.",
        "Hence problems like text segmentation, lemmatisation and stoplist definition need to be addressed.",
        "Our experiments with Wikipedia were very rudimentary, given that we considered only 1000 documents.",
        "These latter were obtained in response to the term cwine\\ by following the links obtained for about 72.000 words.",
        "5.3.1 Building the resource and using it.",
        "Building the resource requires processing a corpus and building the database.",
        "Given a corpus we apply our neighborhood function to a predetermined window (a paragraph in the case of encyclopedias).",
        "The result, i.e. the co-occurrences, will be stored in the database, together with their weight, i.e. number of times two terms appear together, and the type of link.",
        "As mentionned above, both kinds of information are needed later on for ranking and navigation.",
        "At present, cooccurences are stored as triplets (tw, aw, times), where times represents the number of times the two terms cooccur in the corpus, the scope of coccurence being here the paragraph.",
        "For each Wikipedia page, a preprocessor converts HTML pages into plain text.",
        "Next, a part-of-speech tagger (http://www.ims.uni-stuttgart.de/projekte/corplex/TreeTagger/) is used to annotate all the words of the paragraph under consideration.",
        "This allows the filtering of all irrelevant words, to keep but a bag of words, that is, the nouns, adjectives, verbs and adverbs occuring in the paragraph.",
        "These words will be used to fill the triplets of our database.",
        "We start arbitrarily from some page (for our experiment, we have chosen \"wine\" as input), apply the algorithm outlined here above and pick then randomly a noun within this page to fetch with this input a new page on Wikipedia.",
        "This process is repeated until a given sample size is obtained (in our case 1000 pages).",
        "Of course, instead of picking randomly a noun, we could have decided to process all the nouns of a given page, and to add then incrementally the nouns of the next pages.",
        "Yet, doing this would have led us to privilege a specific topic (in our case 'wine') instead of a more general one.",
        "We have developed a website in Java as a servlet.",
        "Interactions with humans are simple: people can add or delete a word from the current list (see Input in the figure on top of the next page).",
        "The example presented shows that with very few words, hence very quickly, we can obtain the desired word.",
        "Given some input, the system provides the user with a list of words cooccuring with the aws.",
        "The output is an ordered list of words, the order depending on the overall score, i.e. number of cooccurrences between the aw and the tw.",
        "For example, if the aws 'wine' and 'harvest' co-occur with the tw 'bunch' respectively 5 and 8 times, then the overall score of cooccurence of 'bunch' is 13: ((wine, harvest), bunch, 13).",
        "Hence, all words with a higher score will precede it, while those with a lower score will follow it.",
        "Here below are the examples extracted from the WN corpus (see figure-1).",
        "Our goal was to find the word 'vintage.",
        "Trigger words are 'wine and 'harvest, yielding respectively 488 and 30 hits, i.e. words.",
        "As one can see 'harvest is a better access term than 'wine.",
        "Combining the two will reduce the list to 6 items.",
        "Please note that the tw'vintage is not among them, eventhough it exists in WordNet, which illustrates nicely the fact that storage does not guarantee accessibility (Sinopal-nikova and Smrz, 2006).",
        "Looking at figure-1 you will see that the results have improved considerably with Wikipedia.",
        "The same input, 'wine evokes many more words (1845 as opposed to 488).",
        "For 'harvest we get 983 hits instead of 30 (the intersection containing 62 words).",
        "Combining the two reduces the set to 45 items among which we will find, of course, the target word.",
        "We hope that this example is clear enough to convince the reader that it makes sense to use real text as corpus to extract from it the kind of information (associations) people are likely to give when looking for a word."
      ]
    },
    {
      "heading": "6. Conclusion and perspectives",
      "text": [
        "We have addressed in this paper the problem of word finding for speakers or writers.",
        "Concluding that most dictionaries are not well suited to allow for this kind of reverse access based on meanings (or meaning related elements, associations), we looked at work done by psychologists to get some inspiration.",
        "Next we tried to clarify which of these findings could help us build the dictionary of tomorrow, that is, a tool integrating linguistic and encyclopedic knowledge, allowing navigation by taking either or as starting point.",
        "While linguistic knowledge is more prominent for analysis (reading), encyclopedic facts are more relevant for production.",
        "We've presented then our ideas of how to build a resource, allowing lexical access based",
        "Input",
        "WordNet",
        "Wikipedia",
        "488 words",
        "1845",
        "words",
        "grape",
        "sweet",
        "alcoholic",
        "country",
        "serve",
        "france",
        "god",
        "characteristics",
        "wine",
        "small",
        "fruit",
        "regulation",
        "grape",
        "dry",
        "bottle",
        "appellation",
        "system",
        "produce",
        "red",
        "bottled",
        "like",
        "bread",
        "hold",
        "christian",
        "track",
        "30 words",
        "983 words",
        "month",
        "fish",
        "produce",
        "grain",
        "grape",
        "revolutionary",
        "autumn",
        "farms",
        "calendar",
        "festival",
        "energy",
        "cut",
        "harvest",
        "butterfish",
        "dollar",
        "combine",
        "ground",
        "person",
        "make",
        "balance",
        "rain",
        "wine",
        "first",
        "amount",
        "rich",
        "6 words",
        "45 words",
        "make",
        "grape",
        "grape",
        "vintage",
        "wine",
        "fish",
        "someone",
        "bottle",
        "produce",
        "+harvest",
        "commemorate",
        "person",
        "fermentation",
        "juice",
        "Beaujolais",
        "taste",
        "viticulture",
        "France",
        "Bordeaux",
        "vineyard",
        "Welcome to the WORDFINDER webpage",
        "harvest.wine.grapes.",
        "Output ifoiuul, related word?)",
        ": 23 results",
        "E r jui -.;u:.",
        "ir..~i--i..\\ :jrj .l'ijjrv .",
        "rnvrri \"LjtjL~r.",
        "vvrll u.ii.Jv ■■■uir,.,:j- .:.",
        ":-'rli.",
        "■■iii-'r.",
        "vr;i. ;i- ■■x i, : jdv ■ 'pi i nh.",
        ":' 11--..mr. j.~m.~.",
        "^iir jJlv îuur.",
        "j-\":iitril.",
        "■■rI^•.",
        "on underspecified, i.e. imperfect input.",
        "To achieve this goal we've started building an AM composed of form elements (the words and expressions of a given language) and aws.",
        "The role of the latter being to lead to or to evoke the tw.",
        "In the last part we've described briefly the results obtained by comparing two resources (WN and Wikipedia) and various inputs.",
        "Given the fact that the project is still quite young, only preliminary results can be shown at this point.",
        "Our next steps will be to take a closer look at the following work: clustering of similar words (Lin, 1998), topic signatures (Lin and Hovy, 2000) and Kilgariff's sketch engine (Kilgarriff et al., 2004).",
        "We plan also to add other lexical functions to enrich our database with aws.",
        "We plan to experiment with corpora, trying to find out which ones are best for our purpose and we will certainly experiment with the window size to see which size is best for which text type.",
        "Finally, we plan to insert in our AM the relations holding between the aw and the tw.",
        "As these links are contained in our corpus, we should be able to identify and type them.",
        "The question is, to what extent this can be done automatically.",
        "Obviously, the success of our resource will depend on the quality of the corpus, the quality of the aws, weights and links, and the representativ-ity of all this for a given population.",
        "While we do believe in the justification of our intuitions, more work is needed to reveal the true potential of the approach.",
        "The ultimate judge being, of course, the future user."
      ]
    }
  ]
}
