{
  "info": {
    "authors": [
      "Daumé",
      "Hal III"
    ],
    "book": "ACL-IJCNLP: Short Papers",
    "id": "acl-P09-2074",
    "title": "Markov Random Topic Fields",
    "url": "https://aclweb.org/anthology/P09-2074",
    "year": 2009
  },
  "references": [
    "acl-D08-1054"
  ],
  "sections": [
    {
      "text": [
        "Hal Daumé III",
        "me@hal3.name",
        "Most approaches to topic modeling assume an independence between documents that is frequently violated.",
        "We present an topic model that makes use of one or more user-specified graphs describing relationships between documents.",
        "These graph are encoded in the form of a Markov random field over topics and serve to encourage related documents to have similar topic structures.",
        "Experiments on show upwards of a 10% improvement in modeling performance."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "One often wishes to apply topic models to large document collections.",
        "In these large collections, we usually have meta-information about how one document relates to another.",
        "Perhaps two documents share an author; perhaps one document cites another; perhaps two documents are published in the same journal or conference.",
        "We often believe that documents related in such a way should have similar topical structures.",
        "We encode this in a probabilistic fashion by imposing an (undirected) Markov random field (MRF) on top of a standard topic model (see Section 3).",
        "The edge potentials in the MRF encode the fact that \"connected\" documents should share similar topic structures, measured by some parameterized distance function.",
        "Inference in the resulting model is complicated by the addition of edge potentials in the MRF.",
        "We demonstrate that a hybrid Gibbs/Metropolis-Hastings sampler is able to efficiently explore the posterior distribution (see Section 4).",
        "In experiments (Section 5), we explore several variations on our basic model.",
        "The first is to explore the importance of being able to tune the strength of the potentials in the MRF as part of the inference procedure.",
        "This turns out to be of utmost importance.",
        "The second is to study the importance of the form of the distance metric used to specify the edge potentials.",
        "Again, this has a significant impact on performance.",
        "Finally, we consider the use of multiple graphs for a single model and find that the power of combined graphs also leads to significantly better models."
      ]
    },
    {
      "heading": "2. Background",
      "text": [
        "Probabilistic topic models propose that text can be considered as a mixture of words drawn from one or more \"topics\" (Deerwester et al., 1990; Blei et al., 2003).",
        "The model we build on is latent Dirichlet allocation (Blei et al., 2003) (henceforth, LDA).",
        "LDA stipulates the following generative model for a document collection:",
        "(a) Choose a topic mixture 9d ~ Vir{a) (b) For each word in d, n = 1... N^.",
        "i.",
        "Choose a topic Zdn ~ Mult{9d) ii.",
        "Choose a word Wdn ~ Mult{@Zdn)",
        "Here, et is a hyperparameter vector of length K, where K is the desired number of topics.",
        "Each document has a topic distribution Od over these K topics and each word is associated with precisely one topic (indicated by Zdn)- Each topic k = 1... K is a unigram distribution over words (aka, a multinomial) parameterized by a vector (3k.",
        "The associated graphical model for LDA is shown in Figure 1.",
        "Here, we have added a few additional hyperparameters: we place a Qam(a, b) prior independently on each component of a and a T%r(r],.. .,rj) prior on each of the /3s.",
        "Lhe joint distribution over all random variables specified by LDA is:",
        "Many inference methods have been developed for this model; the approach upon which we",
        "Figure 1: Graphical model for LDA.",
        "build is the collapsed Gibbs sampler (Griffiths and Steyvers, 2006).",
        "Here, the random variables (3 and 9 are analytically integrated out.",
        "The main sampling variables are the Zdn indicators (as well as the hyperparameters: rj and a, b).",
        "The conditional distribution for Zdn conditioned on all other variables in the model gives the following Gibbs sampling distribution p(zdn = k):",
        "Here, #^dra denotes the number of times event X occurs in the entire corpus, excluding word n in document d. Intuitively, the first term is a (smoothed) relative frequency of topic k occurring; the second term is a (smoothed) relative frequency of topic k giving rise to word Wdn-",
        "A Markov random field specifies a joint distribution over a collection of random variables x\\,... ,xn- An undirected graph structure stipulates how the joint distribution factorizes over these variables.",
        "Given a graph Q = (V, E), where V = {x\\,..., xn}, let C denote a subset of all the cliques of Q.",
        "Then, the MRF specifies the joint distribution as: p{x) = ELec V'cC^c)- Here, Z = J2X Yicec V'c^c) is the partition function, xc is the subset of x contained in clique c and ipcis any non-negative function that measures how \"good\" a particular configuration of variables xcis.",
        "The ips are called potential functions."
      ]
    },
    {
      "heading": "3. Markov Random Topic Fields",
      "text": [
        "Suppose that we have access to a collection of documents, but do not believe that these documents are all independent.",
        "In this case, the generative story of LDA no longer makes sense: related documents are more likely to have \"similar\" topic structures.",
        "For instance, in the scientific community, if paper A cites paper B, we would (a priori) expect the topic distributions for papers A and B to be related.",
        "Similarly, if two papers share an author, we might expect them to be topically related.",
        "Figure 2: Example Markov Random Topic Field (variables a and /3 are excluded for clarify).",
        "Of if they are both published at EMNLP.",
        "Or if they are published in the same year, or come out of the same institution, or many other possibilities.",
        "Regardless of the source of this notion of similarity, we suppose that we can represent the relationship between documents in the form of a graph Q = (V, E).",
        "The vertices in this graph are the documents and the edges indicate relatedness.",
        "Note that the resulting model will not be fully generative, but is still probabilistically well defined.",
        "There are multiple possibilities for augmenting LDA with such graph structure.",
        "We could \"link\" the topic distributions 9 over related documents; we could \"like\" the topic indicators z over related documents.",
        "We consider the former because it leads to a more natural model.",
        "The idea is to \"unroll\" the 73-plate in the graphical model for LDA (Figure 1) and connect (via undirected links) the 9 variables associated with connected documents.",
        "Figure 2 shows an example MRTF over six documents, with thick edges connecting the 9 variables of \"related\" documents.",
        "Note that each 9 still has a as a parent and each w has (3 as a parent: these are left off for figure clarity.",
        "The model is a straightforward \"integration\" of LDA and an MRF specified by the document relationships Q.",
        "We begin with the joint distribution specified by LDA (see Eq (1)) and add in edge potentials for each edge in the document graph Q that \"encourage\" the topic distributions of neighboring documents to be similar.",
        "The potentials all have the form:",
        "ipd,d' (°d, 9d>) = exp [-£d,d'p(9d, 9d>)] (3) Here, ld,d' is a \"measure of strength\" of the importance of the connection between d and d (and will be inferred as part of the model), p is a distance metric measuring the dissimilarity between 9d and 0$.",
        "For now, this is Euclidean distance (i.e., p(9d,0d>) = \\\\&d - Od'WY, later, we show that alternative distance metrics are preferable.",
        "Adding the graph structure necessitates the addition of hyperparameters £e for every edge eeB.",
        "We place an exponential prior on each l/£e with parameter A: p(£e | A) = Aexp( – X/£e).",
        "Finally, we place a vague Qam(Xa, A&) prior on A.",
        "In many applications, there may be multiple graphs that apply to the same data set, Q\\,..., Qj.",
        "In this case, we construct a single MRF based on the union of these graph structures.",
        "Each edge now has L-many parameters (one for each graph j) £e.",
        "Each graph also has its own exponential prior parameter Xj.",
        "Together, this yields:",
        "Here, the sum ranges only over those graphs that have (d, d) in their edge set."
      ]
    },
    {
      "heading": "4. Inference",
      "text": [
        "Inference in MRTFs is somewhat complicated from inference in LDA, due to the introduction of the additional potential functions.",
        "In particular, while it is possible to analytically integrate out 9 in LDA (due to multinomial/Dirichlet con-jugacy), this is no longer possible in MRTFs.",
        "This means that we must explicitly represent (and sample over) the topic distributions 9 in the MRTF",
        "This means that we must sample over the following set of variables: a, 9, z, £ and A.",
        "Sampling for a remains unchanged from the LDA case.",
        "Sampling for variables except 9 is easy:",
        "%dn – k .",
        "The latter two follow from simple conjugacy.",
        "When we use multiple graphs, we assign a separate A for each graph.",
        "For sampling 9, we resort to a Metropolis-Hastings step.",
        "Our proposal distribution is the Dirichlet posterior over 9, given all the current assignments.",
        "The acceptance probability then just depends on the graph distances.",
        "In particular, once 9d is drawn from the posterior Dirichlet, the acceptance probability becomes Yid'^j\\f{d)'lPd,d/, where J\\f(d) denotes the neighbors of d. For each",
        "# of iterations",
        "Figure 3: Held-out perplexity for different graphs.",
        "document, we run 10 Metropolis steps; the acceptance rates are roughly 25%."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "Our experiments are on a collection for 7441 document abstracts crawled from CiteSeer.",
        "The crawl was seeded with a collection of ten documents from each of: ACL, EMNLP, SIGIR, ICML, NIPS, UAI.",
        "This yields 650 thousand words of text after remove stop words.",
        "We use the following graphs (number in parens is the number of edges):",
        "auth: shared author (47k) book: shared booktitle/journal (227k) cite: one cites the other (18k) http: source file from same domain (147A;) time: published within one year (4122A;) year: published in the same year (2101A;)",
        "Other graph structures are of course possible, but these were the most straightforward to cull.",
        "The first thing we look at is convergence of the samplers for the different graphs.",
        "See Figure 3.",
        "Here, we can see that the author graph and the citation graph provide improved perplexity to the straightforward LDA model (called \"*none*\"), and that convergence occurs in a few hundred iterations.",
        "Due to their size, the final two graphs led to significantly slower inference than the first four, so results with those graphs are incomplete.",
        "Tuning Graph Parameters.",
        "The next item we investigate is whether it is important to tune the graph connectivity weights (the £ and A variables).",
        "It turns out this is incredibly important; see Figure 4.",
        "This is the same set of results as Figure 3, but without £ and A tuning.",
        "We see that the graph-based methods do not improve over the baseline.",
        "# of iterations",
        "Figure 4: Held-out perplexity for difference graph structures without graph parameter tuning.",
        "B – Bhattacharyya ■* – Hellinger Euclidean",
        "Distance Metric.",
        "Next, we investigate the use of different distance metrics.",
        "We experiments with Bhattacharyya, Hellinger, Euclidean and logistic-Euclidean.",
        "See Figure 5 (this is just for the auth graph).",
        "Here, we see that Bhattacharyya and Hellinger (well motivated distances for probability distributions) outperform the Euclidean metrics.",
        "Using Multiple Graphs Finally, we compare results using combinations of graphs.",
        "Here, we run every sampler for 500 iterations and compute standard deviations based on ten runs (year and time are excluded).",
        "The results are in Table 1.",
        "Here, we can see that adding graphs (almost) always helps and never hurts.",
        "By adding all the graphs together, we are able to achieve an absolute reduction in perplexity of 9 points (roughly 10%).",
        "As discussed, this hinges on the tuning of the graph parameters to allow different graphs to have different amounts of influence."
      ]
    },
    {
      "heading": "6. Discussion",
      "text": [
        "We have presented a graph-augmented model for topic models and shown that a simple combined Gibbs/MH sampler is efficient in these models.",
        "http book",
        "cite auth book+http cite+http auth+http book+cite auth+book auth+cite book+cite+http auth+cite+http auth+book+http auth+book+cite",
        "Table 1: Comparison of held-out perplexities for varying graph structures with two standard deviation error bars; grouped by number of graphs.",
        "Grey bars are indistinguishable from best model in previous group; blue bars are at least two stddevs better; red bars are at least four stddevs better.",
        "Using data from the scientific domain, we have shown that we can achieve significant reductions in perplexity on held-out data using these models.",
        "Our model resembles recent work on hypertext topic models (Gruber et al., 2008; Sun et al., 2008) and blog influence (Nallapati and Cohen, 2008), but is specifically tailored toward undirected models.",
        "Ours is an alternative to the recently proposed Markov Topic Models approach (Wang et al., 2009).",
        "While the goal of these two models is similar, the approaches differ fairly dramatically: we use the graph structure to inform the per-document topic distributions; they use the graph structure to inform the unigram models associated with each topic.",
        "It would be worthwhile to directly compare these two approaches."
      ]
    }
  ]
}
