{
  "info": {
    "authors": [
      "LiLi Xu",
      "Atsushi Fujii",
      "Tetsuya Ishikawa"
    ],
    "book": "Conference on Empirical Methods in Natural Language Processing",
    "id": "acl-W06-1629",
    "title": "Modeling Impression in Probabilistic Transliteration into Chinese",
    "url": "https://aclweb.org/anthology/W06-1629",
    "year": 2006
  },
  "references": [
    "acl-J98-4003",
    "acl-P04-1021",
    "acl-P98-2220"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "For transliterating foreign words into Chinese, the pronunciation of a source word is spelled out with Kanji characters.",
        "Because Kanji comprises ideograms, an individual pronunciation may be represented by more than one character.",
        "However, because different Kanji characters convey different meanings and impressions, characters must be selected carefully.",
        "In this paper, we propose a transliteration method that models both pronunciation and impression, whereas existing methods do not model impression.",
        "Given a source word and impression keywords related to the source word, our method derives possible transliteration candidates and sorts them according to their probability.",
        "We evaluate our method experimentally."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Reflecting the rapid growth of science, technology, and economies, new technical terms and product names have progressively been created.",
        "These new words have also been imported into different languages.",
        "There are three fundamental methods for importing foreign words into a language.",
        "In the first method – translation – the meaning of the source word in question is represented by an existing or new word in the target language.",
        "In the second method – transliteration – the pronunciation of the source word is represented by using the phonetic alphabet of the target language, such as Katakana in Japanese and Hangul in Korean.",
        "* This work was done when the first author was a graduate student at University of Tsukuba, who currently works for Hitachi Construction Machinery Co., Ltd.",
        "In the third method, the source word is spelled out as it is.",
        "However, the misuse of this method decreases the understandability and readability of the target language.",
        "While translation is time-consuming, requiring selection of an existing word or generation of a new word that correctly represents the meaning of the source word, transliteration can be performed rapidly.",
        "However, the situation is complicated for Chinese, where a phonetic alphabet is not used and Kanji is used to spell out both conventional Chinese words and foreign words.",
        "Because Kanji comprises ideograms, an individual pronunciation can potentially be represented by more than one character.",
        "However, if several Kanji strings are related to the same pronunciation of the source word, their meanings will be different and will therefore convey different impressions.",
        "For example, “Coca-Cola” can be represented by different Kanji strings in Chinese.",
        "The official transliteration is “ ”, which comprises “ (tasty)” and “ (pleasant)”, and is therefore associated with a positive connotation.",
        "However, there are a number of Kanji strings that represent similar pronunciations to that of “Coca-Cola”, but which are associated with inappropriate impressions for a beverage, such as “ ”.",
        "This word includes “ ”, which is associated with choking.",
        "Therefore, Kanji characters must be selected carefully during transliteration into Chinese.",
        "This is especially important when foreign companies intend to introduce their names and products into China.",
        "In this paper, we propose a method that models both impression and pronunciation for transliteration into Chinese.",
        "Section 2 surveys previous research into automatic transliteration, in order to clarify the meaning and contribution of our research.",
        "Section 3 elaborates on our transliteration method.",
        "Section 4 evaluates the effectiveness of our method."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "In a broad sense, the term “transliteration” has been used to refer to two tasks.",
        "The first task is transliteration in the strict sense, which creates new words in a target language (Haizhou et al., 2004; Wan and Verspoor, 1998).",
        "The second task is back-transliteration (Fujii and Ishikawa, 2001; Jeong et al., 1999; Knight and Graehl, 1998; Qu et al., 2003), which identifies the source word corresponding to an existing transliterated word.",
        "Back-transliteration is intended mainly for cross-lingual information retrieval and machine translation.",
        "Both transliteration tasks require methods that model pronunciation in the source and target languages.",
        "However, by definition, in back-transliteration, the word in question has already been transliterated and the meaning or impression of the source word does not have to be considered.",
        "Thus, back-transliteration is outside the scope of this paper.",
        "In the following, we use the term “transliteration” to refer to transliteration in the strict sense.",
        "Existing transliteration methods for Chinese (Haizhou et al., 2004; Wan and Verspoor, 1998) aim to spell out foreign names of people and places, and do not model impression.",
        "However, as exemplified by “Coca-Cola” in Section 1, the impression of words needs to be modeled in the transliteration of proper names, such as companies and products.",
        "The contribution of our research is to incorporate a model of impression into automatic transliteration."
      ]
    },
    {
      "heading": "3 Methodology",
      "text": []
    },
    {
      "heading": "3.1 Overview",
      "text": [
        "Figure 1 shows our transliteration method, which models both pronunciation and impression when transliterating foreign words into Chinese.",
        "We will explain the entire process of our transliteration method in terms of Figure 1.",
        "The input for our method is twofold.",
        "First, a source word to be transliterated into Chinese is requested.",
        "Second, one or more words that describe",
        "the impression of the source word, which we call “impression keywords”, are requested.",
        "Currently, impression keywords must be provided manually in Chinese.",
        "The output of our method is one or more Kanji strings.",
        "In an example scenario using our method, a user has a good command of Chinese and intends to introduce something (e.g., a company or product) into China.",
        "It is reasonable to assume that this user can provide one or more Chinese impression keywords to associate with the target object.",
        "Using the pronunciation model, the source word is converted into a set of Kanji strings whose pronunciation is similar to that of the source word.",
        "Each of these Kanji strings is a transliteration candidate.",
        "Currently, we use Japanese Katakana words as source words, because Katakana words can easily be converted into pronunciations using the Latin alphabet.",
        "However, in principle, any language that uses phonetic script can be a source language for our method.",
        "In Figure 1, the Katakana word “bitamin (vitamin)” is used as an example source word.",
        "Using the impression model, impression keywords are converted into a set of Kanji characters.",
        "A simple implementation is to segment each impression keyword into characters.",
        "However, because it is difficult for a user to provide an exhaustive list of appropriate keywords and characters, our impression model derives characters that are not included in the impression keywords.",
        "Because of the potentially large number of selected candidates, we need to rank the candidates.",
        "We model both pronunciation and impression in , , , , ,",
        "a probabilistic framework, so that transliteration candidates are sorted according to their probability score.",
        "Transliteration candidates that include many characters derived from the impression model are preferred.",
        "In other words, the Kanji characters derived via the impression model are used to re-rank the candidates derived via the pronunciation model.",
        "We elaborate on our probabilistic transliteration model in Section 3.2.",
        "We then discuss the pronunciation and impression models in Sections 3.3 and 3.4, respectively."
      ]
    },
    {
      "heading": "3.2 Probabilistic Transliteration Model",
      "text": [
        "Given a romanized Japanese Katakana word R and a set of impression keywords W, our purpose is to select the Kanji string K that maximizes P(KI R, W), which is evaluated as shown in Equation (1), using Bayes’ theorem.",
        "In the second line of Equation (1), we assume the conditional independence of R and W given K. In the third line, we omit P(R, W), which is independent of K. This does not affect the relative rank of Kanji strings, when ranked in terms of P(KIR, W).",
        "In Figure 1, R and W are “bitamin” and “ ”, respectively, and a K candidate is “ ”.",
        "If a user intends to select more than one Kanji string, those Ks associated with higher probabilities should be selected.",
        "As shown in Equation (1), P(KIR,W) can be approximated by the product of P(RI K), P(W I K), and P(K).",
        "We call these three factors the pronunciation, impression, and language models, respectively.",
        "The language model, P(K), models the probability of K irrespective of R and W. In probabilistic natural language processing, P(K) is usually realized by a word or character N-gram model, and therefore a K that appears frequently in a corpus is assigned a high probability.",
        "However, because our purpose is to generate new words, the use of statistics obtained from existing corpora is not effective.",
        "Therefore, we consider P(K) to be constant for every K. In summary, P(KI R, W) is approximated by a product of P(RI K) and P(W I K).",
        "The quality of our transliteration method will depend on the implementation of the pronunciation and impression models."
      ]
    },
    {
      "heading": "3.3 Pronunciation Model",
      "text": [
        "The pronunciation model, P(RI K), models the probability that a roman representation R is selected, given a Kanji string K. In Japanese, the Hepburn and Kunrei systems are commonly used for romanization purposes.",
        "We use the Hepburn system.",
        "We use Pinyin as a representation for Kanji characters.",
        "We decompose K into Kanji characters and associate K with R on a character-by-character basis.",
        "We calculate P(RI K) as shown in Equation (2).",
        "Y denotes the Pinyin strings representing the pronunciation of K. kz denotes a single Kanji character.",
        "rz and yz denote substrings of R and Y, respectively.",
        "R, Y, and K are decomposed into the same number of elements, namely N. We calculate P(rzIyz) and P(yzIkz) as shown in Equation (3).",
        "F(x, y) denotes the co-occurrence frequency of x and y.",
        "We need the co-occurrence frequencies of rz and yz and the co-occurrence frequencies of yz and kz in order to calculate P(RI K).",
        "We used a bilingual dictionary comprising 1 140 Katakana words, most of which are technical terms and proper nouns, and their transliterations into Chinese, which are annotated with Pinyin.",
        "We manually corresponded 151 pairs of Katakana and roman characters on a mora-by-mora basis, and romanized Katakana characters in the dictionary automatically.",
        "We obtained 1140 tuples, of the form < R, Y, K >.",
        "Because the number of tuples was",
        "manageable, we obtained the element-by-element R, Y, and K correspondences manually.",
        "Finally, we calculated F(rz, yz) and F(yz, kz).",
        "If there are many tuples, and the process of manual correspondence is expensive, we can automate the process as performed in existing transliteration methods, such as the EM algorithm (Knight and Graehl, 1998) or DP matching (Fujii and Ishikawa, 2001).",
        "The above calculations are performed off-line.",
        "In the online process, we consider all possible segmentations of a single Katakana word.",
        "For example, the romanized Katakana word “bitamin (vitamin)” corresponds to two Pinyin strings and is segmented differently, as follows:",
        "• bi-ta-min: wei-ta-ming, • bi-ta-mi-n: wei-ta-mi-an."
      ]
    },
    {
      "heading": "3.4 Impression Model",
      "text": [
        "The impression model, P(WIK), models the probability that W is selected as a set of impression keywords, given Kanji string K. As in the calculation of P(RIK) in Equation (2), we decompose W and K into elements, in calculating P(WIK).",
        "W is decomposed into a set of words, wz, and K is decomposed into a set of Kanji characters, kj .",
        "We calculate P(W I K) as a product of P(wz I kj ), which is the probability that wz is selected as an impression keyword given kj.",
        "However, unlike Equation (2), the numbers of wz and kj derived from W and K are not always the same, because users are allowed to provide an arbitrary number of impression keywords.",
        "Therefore, for each kj we select the wz that maximizes P(wzIkj) and approximate P(WIK) as shown in Equation (4).",
        "We calculate P(wz Ikj) by Equation (5).",
        "As in Equation (3), F(x, y) denotes the co-occurrence frequency of x and y.",
        "In summary, we need co-occurrences of each word and character in Chinese.",
        "These co-occurrences can potentially be collected from existing language resources, such as corpora in Chinese.",
        "However, it is desirable to collect an association between a word and a character, not simply their co-occurrence in corpora.",
        "Therefore, we used a dictionary of Kanji in Chinese, in which each Kanji character entry is explained via sentences, and often exemplified by one or more words that include that character.",
        "We selected 599 entry characters that are often used to spell out foreign words.",
        "Then we collected the frequencies with which each word is used to explain each entry character.",
        "Because Chinese sentences lack lexical segmentation, we used SuperMorpho1 to perform a morphological analysis of explanation sentences and example words.",
        "As a result, 16 943 word types were extracted.",
        "We used all of these words to calculate the co-occurrence frequencies, irrespective of the parts of speech.",
        "Table 1 shows examples of Kanji characters, Chinese words, and their co-occurrence frequencies in the dictionary.",
        "However, P (wzIkj) cannot be calculated for the Kanji characters not modeled in our method (i.e., the Kanji characters not included in the 599 entry characters).",
        "Thus, for smoothing purposes, we experimentally set P (wz I kj) at 0.001 for those kj not modeled."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": []
    },
    {
      "heading": "4.1 Method",
      "text": [
        "We evaluated our transliteration method experimentally.",
        "Because the contribution of our research is the incorporation of the impression model in a transliteration method, we used a method that uses only the pronunciation model as a control.",
        "From a Japanese–Chinese dictionary, we selected 210 Katakana words that had been transliterated into Chinese, and used these Katakana words as test words.",
        "Each test word can be classified into one of the following five categories: products, companies, places, persons, or general words.",
        "Details of the categories of test inputs are shown in Table 2.",
        "Three Chinese graduate students who had a good command of Japanese served as assessors and produced reference data.",
        "None of the assessors was an author of this paper.",
        "The assessors performed the same task for the same test words independently, in order to enhance the objectivity of the results.",
        "We produced the reference data via the following procedure.",
        "First, for each test word, each assessor provided one or more impression keywords in Chinese.",
        "We did not restrict the number of impression keywords per test word, which was determined by each assessor.",
        "If an assessor provided more than one impression keyword for a single test word, he/she was requested to sort them in order of preference, so that we could investigate the effect of the number of impression keywords on the evaluation results, by changing the number of top keywords used for transliteration purposes.",
        "We provided the assessors with the descriptions for the test words from the source dictionary, so that the assessors could understand the meaning of each test word.",
        "Second, for each test word, we applied the control method and our method independently, which produced two lists of ranked transliteration candidates.",
        "Because the impression keywords provided by the assessors were used only in our method, the",
        "ranked list produced by the control was the same for all assessors.",
        "Third, for each test word, each assessor identified one or more correct transliterations, according to their impression of the test word.",
        "It was important not to reveal to the assessors which method produced which candidates.",
        "By these means, we selected the top 100 transliteration candidates from the two ranked lists for the control and our method.",
        "We merged these candidates, removed duplications, and sorted the remaining candidates by the character code.",
        "As a result, the assessors judged the correctness of up to 200 candidates for each test word.",
        "However, for some test words, assessors were not able to find correct transliterations in the candidate list.",
        "The resultant reference data was used to evaluate the accuracy of a test method in ranking transliteration candidates.",
        "We used the average rank of correct answers in the list as the evaluation measure.",
        "If more than one correct answer was found for a single test word, we first averaged the ranks of these answers and then averaged the ranks over the test words.",
        "Although we used the top 100 candidates for judgment purposes, the entire ranked list was used to evaluate each method.",
        "Therefore, the average rank of correct answers can potentially be over 100.",
        "The average number of candidates per test word was 31779.",
        "Because our method uses the impression model to re-rank the candidates produced by the pronunciation model, the lists for the control and our method comprise the same candidates.",
        "Therefore, it is fair to compare these two methods by the average rank of the correct answers.",
        "For each test word, there is more than one type of “correct answer”, as follows: (a) transliteration candidates judged as correct by the assessors independently (translitera",
        "tion candidates judged as correct by at least one assessor);",
        "(b) transliteration candidates judged as correct by all assessors; (c) transliterations defined in the source dictionary.",
        "In (a), the coverage of correct answers is the largest, whereas the objectivity of the judgment is the lowest.",
        "In (c), the objectivity of the judgment is the largest, whereas the coverage of correct answers is the lowest.",
        "Although for each Katakana word the source dictionary gives only one transliteration that is commonly used, there are a number of appropriate out-of-dictionary transliterations.",
        "In (b), where the assessors did not disagree about the correctness, the coverage of correctness and the objectivity are both middle ranked.",
        "Because none of the above answer types is perfect, we used all three types independently."
      ]
    },
    {
      "heading": "4.2 Results and Analyses",
      "text": [
        "Tables 3–5 show the results of comparative experiments using the answer types (a)–(c) above, respectively.",
        "In Tables 3–5, the column “# of test words” denotes the number of test words for which at least one correct answer exists.",
        "While the values in the second column of Table 3 are different depending on the assessor, in Tables 4 and 5 the values of the second column are the same for all assessors.",
        "The columns “Avg.",
        "# of KW” and “Avg.",
        "# of answers” denote the number of impression keywords and the number of correct answers per test word, respectively.",
        "While the values in the fourth column of Table 3 are different depending on the assessor, in Tables 4 and 5 the values of the fourth column are the same for all assessors.",
        "In Tables 4 and 5, the average rank of correct answers for the control is the same for all assessors.",
        "However, the average rank of correct answers for our method is different depending on the assessor, because the impression keywords used depended on the assessor.",
        "The two columns in “Avg.",
        "rank” denote the average ranks of correct answers for the control and for our method, respectively.",
        "Looking at Tables 3– 5, it can be seen that our method outperformed the control in ranking transliteration candidates, irrespective of the assessor and the answer type.",
        "The average rank of correct answers for our method in Table 5 was lower than those in Tables 3 and 4.",
        "One reason is that the correct answers in the source dictionary are not always related to the impression keywords provided by the assessors.",
        "Table 6 presents the results in Table 3 on a category-by-category basis.",
        "Because the results were similar for answer types (b) and (c), we show only the answer type (a) results, for the sake of conciseness.",
        "Looking at Table 6, it can be seen that our method outperformed the control in ranking transliteration candidates, irrespective of the category of test words.",
        "Our method was effective for transliterating names of places and people, although these types of words are usually transliterated independently of their impressions, compared with the names of products and companies.",
        "One reason is that, in the dictionary of Kanji used to produce the impression model, the explanation of an entry sometimes includes a phrase, such as “this character is often used for a person’s name”.",
        "Assessors provided the word “person” in Chinese as an impression keyword for a number of person names.",
        "As a result, transliteration candidates that included characters typically used for a person’s name were highly ranked.",
        "It may be argued that, because the impression model was produced using Kanji characters that are often used for transliteration purposes, the impression model could possibly rank correct answers better than the pronunciation model.",
        "However, the pronunciation model was also produced from Kanji characters used for transliteration purposes.",
        "Figure 3 shows the distribution of correct answers for different ranges of ranks, using answer type (a).",
        "The number of correct answers in the top 10 for our method is approximately twice that of the control.",
        "In addition, by our method, most of the correct answers can be found in the top 100 candidates.",
        "Because the results were similar for answer types (b) and (c), we show only the answer type (a) results, for the sake of conciseness.",
        "As explained in Section 4.",
        "1, for each test word, the assessors were requested to sort the impression keywords in order of preference.",
        "We analyzed the relation between the number of impression keywords used for the transliteration and the average rank of correct answers, by varying the threshold for the number of top impression keywords used.",
        "Table 7 shows the average rank of correct answers for different numbers of impression keywords, on an assessor-by-assessor basis.",
        "By comparing Tables 3 and 7, we see that even if a single impression keyword was provided, the average rank of correct answers was higher than that for the control.",
        "In addition, the average rank of correct answers was generally improved by increasing the number of impression keywords.",
        "Finally, we investigated changes in the rank of correct answers caused by our method.",
        "Table 8 shows the results, in which “Higher” and “Lower” denote the number of correct answers whose ranks determined by our method were higher or lower, respectively, than those determined by the control.",
        "For approximately 30% of the correct answers, our method decreased the control’s rank.",
        "Errors were mainly caused by correct answers containing Kanji characters that were not modeled in the impression model.",
        "Although we used a smoothing technique for characters not in the model, the result was not satisfactory.",
        "To resolve this problem, the number of characters in the impression model should be increased.",
        "In summary, our method, which uses both the impression and pronunciation models, ranked correct transliterations more highly than a method that used only the pronunciation model.",
        "We conclude that the impression model is effective for transliterating foreign words into Chinese.",
        "At the same time, we concede that there is room for improvement in the impression model."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "For transliterating foreign words into Chinese, the pronunciation of a source word is spelled out with Kanji characters.",
        "Because Kanji characters are ideograms, a single pronunciation can be represented by more than one character.",
        "However, because different Kanji characters convey different meanings and impressions, characters must be selected carefully.",
        "In this paper, we proposed a transliteration method that models both pronunciation and impression, compared to existing methods that do not model impression.",
        "Given a source word and impression keywords related to the source word, our method derives possible transliteration candidates, and sorts them according to their probability.",
        "We showed the effectiveness of our method experimentally.",
        "Table 7: Relation between the number of impression keywords and average rank of correct answers with answer type (a).",
        "Future work will include collecting impression keywords automatically, and adapting the language model to the category of source words."
      ]
    }
  ]
}
