{
  "info": {
    "authors": [
      "Peter T. Corbett",
      "Colin R. Batchelor",
      "Simone Teufel"
    ],
    "book": "Biological, translational, and clinical language processing",
    "id": "acl-W07-1008",
    "title": "Annotation of Chemical Named Entities",
    "url": "https://aclweb.org/anthology/W07-1008",
    "year": 2007
  },
  "references": [
    "acl-N04-2002",
    "acl-W04-3111",
    "acl-W06-3328"
  ],
  "sections": [
    {
      "text": [
        "Peter Corbett",
        "Cambridge University Chemical Laboratory",
        "Lensfield Road Cambridge",
        "Colin Batchelor",
        "Royal Society of Chemistry Thomas Graham House Milton Road Cambridge UK CB4 0WF batchelorc@rsc.org",
        "We describe the annotation of chemical named entities in scientific text.",
        "A set of annotation guidelines defines 5 types of named entities, and provides instructions for the resolution of special cases.",
        "A corpus of full-text chemistry papers was annotated, with an inter-annotator agreement F score of 93%.",
        "An investigation of named entity recognition using LingPipe suggests that F scores of 63% are possible without customisation, and scores of 74% are possible with the addition of custom tokenisation and the use of dictionaries."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Recent efforts in applying natural language processing to natural science texts have focused on the recognition of genes and proteins in biomedical text.",
        "These large biomolecules are – mostly – conveniently described as sequences of subunits, strings written in alphabets of 4 or 20 letters.",
        "Advances in sequencing techniques have lead to a boom in genomics and proteomics, with a concomitant need for natural language processing techniques to analyse the texts in which they are discussed.",
        "However, proteins and nucleic acids provide only a part of the biochemical picture.",
        "Smaller chemical species, which are better described atom-by-atom, play their roles too, both in terms of their interactions with large biomolecules like proteins, and in the more general biomedical context.",
        "A number of resources exist to provide chemical information to the biological community.",
        "For example, the National Center For Biotechnology Information (NCBI) has added the chemical database PubChemto its collections of bioinformatics data, and the ontology ChEBI (Chemical Entities of Biological Interest) (de Matos et al., 2006) has been added to the Open Biological Ontologies (OBO) family.",
        "Small-molecule chemistry also plays a role in biomedical natural language processing.",
        "PubMed has included abstracts from medicinal chemistry journals for a long time, and is increasingly carrying other chemistry journals too.",
        "Both the GENIA corpus (Kim et al., 2003) and the BioIE cytochrome P450 corpus (Kulick et al., 2004) come with named entity annotations that include a proportion ofchem-icals, and at least a few abstracts that are recognisable as chemistry abstracts.",
        "Chemical named entity recognition enables a number of applications.",
        "Linking chemical names to chemical structures, by a mixture ofdatabase lookup and the parsing of systematic nomenclature, allows the creation of semantically enhanced articles, with benefits for readers.",
        "An example of this is shown in the Project Prospect annotations by the Royal Society of Chemistry (RSC).",
        "Linking chemical NER to chemical information retrieval techniques allows corpora to be searched for chemicals with similar structures to a query molecule, or chemicals that contain a particular structural motif (Corbett and Murray-Rust, 2006).",
        "With information extraction techniques, chemicals could be linked to their properties, applications and reactions, and with traditional gene/protein NLP techniques, it could be possible to discover new links between chemical data and bioinformatics data.",
        "A few chemical named entity recognition (Cor-bett and Murray-Rust, 2006; Townsend et al., 2005; Vasserman, 2004; Kemp and Lynch, 1998; Sun et al., 2007) or classification (Wilbur et al., 1999) systems have been published.",
        "A plugin for the GATE system will also recognise a limited range of chemical entities.",
        "Other named entity recognition or classification systems (Narayanaswamy et al., 2003; Torii et al., 2004; Torii and Vijay-Shanker, 2002; Spasic and Ananiadou, 2004) sometimes include chemicals as well as genes, proteins and other biological entities.",
        "However, due to differences in corpora and the scope of the task, it is difficult to compare them.",
        "There has been no chemical equivalent of the JNLPBA (Kim et al., 2004) or BioCreAtIvE (Yeh et al., 2005) evaluations.",
        "Therefore, a corpus and a task definition are required.",
        "To find an upper bound on the levels of performance that are available for the task, it is necessary to study the inter-annotator agreement for the manual annotation of the texts.",
        "In particular, it is useful to see to what extent the guidelines can be applied by those not involved in their development.",
        "Producing guidelines that enable a highly consistent annotation may raise the quality of the results of any machine-learning techniques that use training data applied to the guidelines, and producing guidelines that cover a broad range of subdomains is also important (Dingare et al., 2005)."
      ]
    },
    {
      "heading": "2. Annotation Guidelines",
      "text": [
        "We have prepared a set of guidelines for the annotation of the names of chemical compounds and related entities in scientific papers.",
        "These guidelines grew out of work on PubMed abstracts, and have since been developed with reference to organic chemistry journals, and later a range of journals encompassing the whole of chemistry.",
        "Our annotation guidelines focus on the chemicals themselves; we believe that these represent the major source of rare words in chemistry papers, and are of the greatest interest to end-users.",
        "Furthermore, many chemical names are formed systematically or semi-systematically, and can be interpreted without resorting to dictionaries and databases.",
        "As well as chemical names themselves, we also consider other words or phrases that are formed from chemical names.",
        "The various types are summarised in Table 1.",
        "The logic behind the classes is best explained with an example drawn from the corpus described in the next section:",
        "In addition, we have found in previous studies that the Zn2+-Tris system is also capable of efficiently hydrolyzing other /?-lactams, such as clavulanic acid, which is a typical mechanism-based inhibitor of active-site serine -lactamases (clavulanic acid is also a fairly good substrate of the zinc-/5-lactamase from B. fragilis).",
        "Here, 'clavulanic acid' is a specific chemical compound (a CM), referred to by a trivial (unsystematic) name, and ' -lactams' is a class of chemical compounds (also a CM), defined by a particular structural motif.",
        "'Zn -Tris' is another CM (a complex rather than a molecule), and despite being named in an ad hoc manner, the name is compositional and it is reasonably clear to a trained chemist what it is.",
        "'Serine' (another CM) can be used to refer to an amino acid as a whole compound, but in this case refers to it as a part of a larger biomolecule.",
        "The word 'hydrolyzing' (an RN) denotes a reaction involving the chemical 'water'. '",
        "-lactamases' (an ASE) denotes a class of enzymes that process -lactams, and 'zinc- -lactamase' (another ASE) denotes a -lactamase that uses zinc.",
        "By our guidelines, the terms 'mechanism-based inhibitor' or 'substrate' are not annotated, as they denote a chemical role, rather than giving information about the structure or composition of the chemicals.",
        "Type",
        "Description",
        "Example",
        "CM",
        "chemical compound",
        "citric acid",
        "RN",
        "chemical reaction",
        "1,3-dimethylation",
        "CJ",
        "chemical adjective",
        "pyrazolic",
        "ASE",
        "enzyme",
        "methylase",
        "CPR",
        "chemical prefix",
        "1,3-",
        "The full guidelines occupy 31 pages (including a quick reference section), and contain 93 rules.",
        "Almost all of these have examples, and many have several examples.",
        "A few distinctions need to be explained here.",
        "The classes RN, CJ and ASE do not include all reactions, adjectives or enzymes, but only those that entail specific chemicals or classes of chemicals – usually by being formed by the modification of a chemical name – for example, ' -lactamases' in the example above is formed from the name of a class of chemicals.",
        "Words derived from Greek and Latin words for 'water', such as 'aqueous' and 'hydrolysis', are included when making these annotations.",
        "The class CPR consists of prefixes, more often found in systematic chemical names, giving details of the geometry of molecules, that are attached to normal English words.",
        "For example, the chemical 1,2-diiodopentane is a 1,2-disubstituted pentane, and the '1,2-' forms the CPR in '1,2-disubstituted'.",
        "Although these contructions sometimes occur as infixes within chemical names, we have only seen these used as prefixes outside of them.",
        "We believe that identifying these prefixes will be useful in the adaptation of lexicalised parsers to chemical text.",
        "The annotation task includes a small amount of word sense disambiguation.",
        "Although most chemical names do not have non-chemical homonyms, a few do.",
        "Chemical elements, and element symbols, give particular problems.",
        "Examples of this include 'lead', 'In' (indium), 'As' (arsenic), 'Be' (beryllium), 'No' (nobelium) and 'K' (potassium – this is confusable with Kelvin).",
        "These are only annotated when they occur in their chemical sense.",
        "We know of two publicly available corpora that also include chemicals in their named-entity markup.",
        "In both of these, there are significant differences to many aspects of the annotation.",
        "In general, our guidelines tend to give more importance to concepts regarding chemical structure, and less importance to biological role, than the other corpora do.",
        "The GENIA corpus (Kim et al., 2003) includes several different classes for chemicals.",
        "Our class CM roughly corresponds to the union of GENIA's atom, inorganic, other_organic_compound, nucleotide and amino_acid_monomer classes, and also parts of lipid and carbohydrate (we exclude macromolecules such as lipoproteins and lipopolysaccharides).",
        "Occasionally terms that match our class RN are included as otherjiame.",
        "Our CM class also includes chemical names that occur within enzyme or other protein names (e.g. 'inosine-5 -monophosphate' in 'inosine-5 -monophosphate dehydrogenase') whereas the GENIA corpus (which allows nesting) typically does not.",
        "The GENIA corpus also sometimes includes qualifiers in terms, giving 'intracellular calcium' where we would only annotate 'calcium', and also includes some role/application terms such as 'antioxidant' and 'reactive intermediate'.",
        "contrast, includes chemicals, proteins and other substances such as foodstuffs in a single category called 'substance'.",
        "Again, role terms such as 'inhibitor' are included, and may be merged with chemical names to make entities such as 'fentanyl metabolites' (we would only mark up 'fentanyl').",
        "Fragments of chemicals such as 'methyl group' are not marked up; in our annotations, the 'methyl' is marked up.",
        "The BioIE corpus was produced with extensive guidelines; in the GENIA corpus, much more was left to the judgement of the annotators.",
        "These lead to inconsistencies, such as whether to annotate 'an-tioxidant' (our guidelines treat this as a biological role, and do not mark it up).",
        "We are unaware of an inter-annotator agreement study for either corpus.",
        "Both of these corpora include other classes of named entities, and additional information such as sentence boundaries."
      ]
    },
    {
      "heading": "3. Inter-annotator Agreement 3.1 Related Work",
      "text": [
        "We are unaware of any studies of inter-annotator agreement with regards to chemicals.",
        "However, a few studies of gene/protein inter-annotator agreement do exist.",
        "Demetriou and Gaizauskas (2003) report an F score of 89% between two domain experts for a task involving various aspects of protein science.",
        "Morgan et al.",
        "(2004) report an F score of 87% between a domain expert and a systems developer for D. melanogaster gene names.",
        "Vlachos and Gasperin (2006) produced a revised version of the",
        "guidelines for the task, and were able to achieve an score of 91%, and a kappa of 0.905, between a computational linguist and a domain expert.",
        "Three subjects took part in the study.",
        "Subject A was a chemist and the main author ofthe guidelines.",
        "Subject B was another chemist, highly involved in the development of the guidelines.",
        "Subject C was a PhD student with a chemistry degree.",
        "His involvement in the development ofguidelines was limited to proofreading an early version of the guidelines.",
        "C was trained by A, by being given halfan hour's training, a test paper to annotate (which satisfied A that C understood the general principles of the guidelines), and a short debriefing session before being given the papers to annotate.",
        "The study was performed on 14 papers (full papers and communications only, not review articles or other secondary publications) published by the Royal Society of Chemistry.",
        "These were taken from the journal issues from January 2004 (excluding a themed issue of one of the journals).",
        "One paper was randomly selected to represent each of the 14 journals that carried suitable papers.",
        "These 14 papers represent a diverse sample of topics, covering areas of organic, inorganic, physical, analytical and computational chemistry, and also areas where chemistry overlaps with biology, environmental science, materials and mineral science, and education.",
        "From these papers, we collected the title, section headings, abstract and paragraphs, and discarded the rest.",
        "To maximise the value of annotator effort, we also automatically discarded the experimental sections, by looking for headers such as 'Experimental'.",
        "This policy can be justified thus: In chemistry papers, a section titled \"Results and Discussion\" carries enough information about the experiments performed to follow the argument of the paper, whereas the experimental section carries precise details of the protocols that are usually only of interest to people intending to replicate or adapt the experiments performed.",
        "It is increasingly common for chemistry papers not to contain an experimental section in the paper proper, but to include one in the supporting online information.",
        "Furthermore, experimental sections are often quite long and tedious to annotate, and previous studies have shown that named-entity recognition is easier on experimental sections too (Townsend et al., 2005).",
        "A few experimental sections (or parts thereof) were not automatically detected, and instead were removed by hand.",
        "The papers were hand-annotated using our in-house annotation software.",
        "This software displays the text so as to preserve aspects of the style of the text such as subscripts and superscripts, and allows the annotators to freely select spans of text with character-level precision – the text was not tokenised prior to annotation.",
        "Spans were not allowed to overlap or to nest.",
        "Each selected span was assigned to exactly one of the five available classes.",
        "During annotation the subjects were allowed to refer to the guidelines (explained in the previous section), to reference sources such as PubChem and Wikipedia, and to use their domain knowledge as chemists.",
        "They were not allowed to confer with anyone over the annotation, nor to refer to texts annotated during development of the guidelines.",
        "The training of subject C by A was completed prior to A annotating the papers involved in the exercise.",
        "Inter-annotator agreement was measured pairwise, using the score.",
        "To calculate this, all of the exact matches were found and counted, and all of the entities annotated by one annotator but not the other (and vice versa) were counted.",
        "For an exact match, the left boundary, right boundary and type ofthe annotation had to match entirely.",
        "Thus, if one annotator had annotated 'hexane-ethyl acetate' as a single entity, and the other had annotated it as 'hexane' and 'ethyl acetate', then that would count as three cases of disagreement and no cases of agreement.",
        "We use the score as it is a standard measure in the domain – however, as a measure it has weaknesses which will be discussed in the next subsection.",
        "Given the character-level nature of the annotation task, and that the papers were not tokenised, the task cannot sensibly be cast as a classification problem, and so we have not calculated any kappa scores.",
        "Overall results were calculated using two methods.",
        "The first method was to calculate the total levels of agreement and disagreement across the whole corpus, and to calculate a total score based on that.",
        "The second method was to calculate scores for individual papers (removing a single paper that contained two named entities – neither of which were spotted by subject B – as an outlier), and to calculate an unweighted mean, standard deviation and 95% confidence intervals based on those scores.",
        "Subjects F (corpus) F (average) std.",
        "dev.",
        "The results of the analysis are shown in Table 2.",
        "The whole-corpus scores suggest that high levels of agreement (93%) are possible.",
        "This is equivalent to or better than quoted values for biomedical inter-annotator agreement.",
        "However, the poorer agreements involving C would suggest that some ofthis is due to some extra information being communicated during the development of the guidelines.",
        "A closer analysis shows that this is not the case.",
        "A single paper, containing a large number ofentities, is notable as a major source of disagreement between A and C, and B and C, but not A and B.",
        "Looking at the annotations themselves, the paper contained many repetitions of the difficult entity 'Zn2+-Tris', and also of similar entities.",
        "Ifthe offending paper is removed from consideration, the agreement between A and C exceeds the agreement between A and B.",
        "This analysis is confirmed using the per-paper F scores.",
        "Two-tailed, pairwise t-tests (excluding the outlier paper) showed that the difference in mean scores between the A-B and AC agreements was not statistically significant at the 0.05 significance level; however, the differences between BC and AB, and between BC and AC were.",
        "A breakdown of the inter-annotator agreements by type is shown in Table 3.",
        "CM and RN, at least, seem to be reliably annotated.",
        "The other classes are less easy to assess, due to their rarity, both in terms",
        "Table 3: Inter-annotator agreement, by type.",
        "scores are corpus totals, between Subjects A and C. The number is the number of entities of that class found by Subject A.",
        "of their total occurrence in the corpus and the number of papers that contain them.",
        "We speculate that the poorer BC agreement may be due to differing error rates in the annotation.",
        "In many cases, it was clear from the corpus that errors were made due to failing to spot relevant entities, or by failing to look up difficult cases in the guidelines.",
        "Although it is not possible to make a formal analysis of this, we suspect that A made fewer errors, due to a greater familiarity with the task and the guidelines.",
        "This is supported by the results, as more errors would be involved in the BC comparison than in comparisons involving A, leading to higher levels of disagreement.",
        "We have also examined the types of disagreements made.",
        "There were very few cases where two annotators had annotated an entity with the same start and end point, but a different type; there were 2 cases of this between A and C, and 3 cases in each of the other two comparisons.",
        "All of these were confusions between CM and CJ.",
        "In the A-B comparison, there were 415 entities that were annotated by either A or B that did not have a corresponding exact match.",
        "183 (44%) of those were simple cases where the two annotators did not agree as to whether the entity should be marked up or not (i.e. the other annotator had not placed any entity wholly or partially within that span).",
        "For example, some annotators failed to spot instances of 'water', or disagreed over whether 'fat' (as a synonym for 'lipid') was to be marked up.",
        "The remainder of those disagreements are due to disagreements of class, of where the boundaries should be, of how many entities there should be in a given span, and combinations of the above.",
        "In all of these cases, the fact that the annotators produce at least one entity each for a given case means that disagreements of this type are penalised harshly, and therefore are given disproportionate weight.",
        "However, it is also likely that disagreements over whether to mark an entity up are more likely to represent a simple mistake than a disagreement over how to interpret the guidelines; it is easy to miss an entity that should be marked up when scanning the text.",
        "Type",
        "F",
        "Number",
        "CM",
        "93%",
        "2751",
        "RN",
        "94%",
        "79",
        "CJ",
        "56%",
        "20",
        "ASE",
        "96%",
        "25",
        "CPR",
        "77%",
        "10",
        "A particularly interesting class of disagreement concerns whether a span of text should be annotated as one entity or two.",
        "For example, 'Zn2+-Tris' could be marked up as a single entity, or as 'Zn2+' and 'Tris'.",
        "We looked for cases where one annotator had a single entity, the left edge of which corresponded to the left edge of an entity annotated by the other annotator, and the right edge corresponded to the right edge of a different entity.",
        "We found 43 cases of this.",
        "As in each of these cases, at least three entities are involved, this pattern accounts for at least 30% of the inter-annotator disagreement.",
        "Only 17 of these cases contained whitespace – in the rest of the cases, hyphens, dashes or slashes were involved."
      ]
    },
    {
      "heading": "4. Analysis of the Corpus",
      "text": [
        "To generate a larger corpus, a further two batches of papers were selected and preprocessed in the manner described for the inter-annotator agreement study and annotated by Subject A.",
        "These were combined with the annotations made by Subject A during the agreement study, to produce a corpus of 42 papers.",
        "Table 4: Occurrence of entities in the corpus, and numbers of papers containing at least one entity of a type.",
        "From Table 4 it is clear that CM is by far the most common type of named entity in the corpus.",
        "Observation of the corpus shows that RN is common in certain genres of paper (for example organic synthesis papers), and generally absent from other genres.",
        "ASE, too, is a specialised category, and did not occur much in this corpus.",
        "A closer examination of CM showed more than 90% of these to contain no whitespace.",
        "However, this is not to say that there are not significant numbers of multi-token entities.",
        "The difficulty of tokenising the corpus is illustrated by the fact that 1114 CM entities contained hyphens or dashes, and 388 CM entities were adjacent to hyphens or dashes in the corpus.",
        "This means that any named entity recogniser will have to have a specialised tokeniser, or be good at handling multi-token entities.",
        "Tokenising the CM entities on whitespace and normalising their case revealed 1579 distinct words – of these, 1364 only occurred in one paper.",
        "There were 4301 occurrences ofthese words (out of a total of 7626).",
        "Whereas the difficulties found in gene/protein NER with complex multiword entities and polysemous words are less likely to be a problem here, the problems with tokenisation and large numbers of unknown words remain just as pressing.",
        "As with biomedical text (Yeh et al., 2005), cases of conjunctive and disjunctive nomenclature, such as 'benzoic and thiophenic acids' and 'bromo- or chlorobenzene' exist in the corpus.",
        "However, these only accounted for 27 CM entities."
      ]
    },
    {
      "heading": "5. Named-Entity Recognition",
      "text": [
        "To establish some baseline measures of performance, we applied the named-entity modules from the toolkit LingPipe, which has been successfully applied to NER of D. melanogaster genes (e.g. by Vlachos and Gasperin (2006)).",
        "Ling-Pipe uses a first-order HMM, using an enriched tagset that marks not only the positions of the named entities, but the tokens in front of and behind them.",
        "Two different strategies are employed for handling unknown tokens.",
        "The first (the TokenShapeChunker) replaces unknown or rare tokens with a morphologically-based classification.",
        "The second, newer module (the CharLmHmmChunker) estimates the probability of an observed word given a tag using language models based on character-level -grams.",
        "The LingPipe developers suggest that the TokenShapeChunker typically outperforms the",
        "Type",
        "Entities",
        "Papers",
        "CM",
        "6865 94.1%",
        "42 100%",
        "RN",
        "288 4.0%",
        "23 55%",
        "CJ",
        "60 0.8%",
        "20 48%",
        "ASE",
        "31 0.4%",
        "5 12%",
        "CPR",
        "53 0.7%",
        "9 21%",
        "CharLmHmmChunker.",
        "However, the more sophisticated handling of unknown words by the CharLmHmmChunker suggests that it might be a good fit to the domain.",
        "As well as examining the performance of Ling-Pipe out of the box, we were also able to make some customisations.",
        "We have a custom tokeniser, containing several adaptations to chemical text.",
        "For example, our tokeniser will only remove brackets from the front and back of tokens, and only if that would not cause the brackets within the token to become unbalanced.",
        "For example, no brackets would be removed from '(R)-acetoin'.",
        "Likewise, it will only tokenise on a hyphen if the hyphen is surrounded by two lower-case letters on either side (and if the letters to the left are not common prehyphen components of chemical names), or if the string to the right has been seen in the training data to be hyphenated with a chemical name (e.g. 'derived' in 'benzene-derived').",
        "By contrast, the default Ling-Pipe tokeniser is much more aggressive, and will tokenise on hyphens and brackets wherever they occur.",
        "The CharLmHmmChunker's language models can also be fed dictionaries as additional training data – we have experimented with using a list of chemical names derived from ChEBI (de Matos et al., 2006), and a list of chemical elements.",
        "We have also made an extension to LingPipe s token classifier, which adds classification based on chemically-relevant suffixes (e.g. -yl, -ate, -ic, -ase, -lysis), and membership in the aforementioned chemical lists, or in a standard English dictionary.",
        "We analysed the performance of the different LingPipe configurations by 3-fold cross-validation, using the 42-paper corpus described in the previous section.",
        "In each fold, 28 whole papers were used as training data, holding out the other 14 as test data.",
        "The results are shown in Table 5.",
        "From Table 5, we can see that the character n-gram language models offer clear advantages over the older techniques, especially when coupled to a custom tokeniser (which gives a boost to of over 7%), and trained with additional chemical names.",
        "The usefulness of character-based grams has also been demonstrated elsewhere (Wilbur et al., 1999; Vasserman, 2004; Townsend et al., 2005).",
        "Their use here in an HMM is particularly apt, as it allows the token-internal features in the language model to be",
        "Table 5: LingPipe performance using different configurations, e = custom token classifier, / = chemical name lists, i = custom tokeniser combined with the token context.",
        "The impact of custom tokenisation upon the older TokenShapeChunker is less dramatic.",
        "It is possible that tokens that contain hyphens, brackets and other special characters are more likely to be unknown or rare tokens – the TokenShapeChunker has previously been reported to make most of its mistakes on these (Vlachos and Gasperin, 2006), so tokenising them is likely to make less of an impact.",
        "It is also possible that chemical names are more distinctive as a string of subtokens rather than as one large token – this may offset the loss in accuracy from getting the start and end positions wrong.",
        "The CharLmHmmChunker already has a mechanism for spotting distinctive substrings such as 'N,N'-' and '-3-', and so the case for having long, well-formed tokens becomes much less equivocal.",
        "It is also notable that improvements in tokenisation are synergistic with other improvements – the advantage of using the CharLmHmmChunker is much more apparent when the custom tokeniser is used, as is the advantage of using word lists as additional training data.",
        "It is notable that for the unmodified TokenShapeChunker, using the custom to-keniser actually harms performance."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "We have produced annotation guidelines that enable the annotation of chemicals and related entities in scientific texts in a highly consistent manner.",
        "We have annotated a corpus using these guidelines, an analysis of which, and the results of using an offthe-shelf NER toolkit, show that finding good approaches to tokenisation and the handling of unknown words is critical in the recognition of these entities.",
        "The corpus and guidelines are available by contacting the first author.",
        "Configuration",
        "P",
        "R",
        "F",
        "TokenShape",
        "67.0%",
        "52.9%",
        "59.1%",
        "+ c",
        "71.2%",
        "62.3%",
        "66.5%",
        "+ t",
        "67.4%",
        "52.5%",
        "59.0%",
        "+ c + t",
        "73.3%",
        "62.5%",
        "67.4%",
        "CharLm",
        "62.7%",
        "63.4%",
        "63.1%",
        "+ /",
        "59.8%",
        "68.8%",
        "64.0%",
        "+ t",
        "71.1%",
        "70.0%",
        "70.5%",
        "+ l + t",
        "75.3%",
        "73.5%",
        "74.4%"
      ]
    },
    {
      "heading": "7. Acknowledgements",
      "text": [
        "We thank Ann Copestake and Peter Murray-Rust for supervision, Andreas Vlachos and Advaith Sid-dharthan for valuable discussions, and David Jessop for annotation.",
        "We thank the RSC for providing the papers, and the UK eScience Programme and EP-SRC (EP/C010035/1) for funding."
      ]
    }
  ]
}
