{
  "info": {
    "authors": [
      "Pierre Zweigenbaum"
    ],
    "book": "Proceedings of the 2009 Workshop on Knowledge and Reasoning for Answering Questions (KRAQ 2009)",
    "id": "acl-W09-2701",
    "title": "Knowledge and Reasoning for Medical Question-Answering",
    "url": "https://aclweb.org/anthology/W09-2701",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "CNRS, LIMSI Orsay, F-91403 France pz@limsi.fr",
        "Restricted domains such as medicine set a context where question-answering is more likely expected to be associated with knowledge and reasoning (Molla and Vicedo, 2007; Ferret and Zweigenbaum, 2007).",
        "On the one hand, knowledge and reasoning may be more necessary than in open-domain question-answering because of more specific or more difficult questions.",
        "On the other hand, it may also be more manageable, since by definition restricted-domain QA should not have to face the same breadth of questions as open-domain QA.",
        "It is therefore interesting to study the role of knowledge and reasoning in restricted-domain question-answering systems.",
        "We shall do so in the case of the (bio-)medical domain, which has a long tradition of investigating knowledge representation and reasoning and, more generally, artificial intelligence methods (Shortliffe et al., 1975), and which has seen a growing interest in question-answering systems (Zweigenbaum, 2003; Yu et al., 2005; Demner-Fushman and Fin, 2007; Zweigenbaum et al., 2007)."
      ]
    },
    {
      "heading": "1. Knowledge and Reasoning for Processing Medical Questions",
      "text": [
        "Medical question-answering has to address questions other than the usual factual questions of most QA evaluations.",
        "This calls for different question classifications (Ely et al., 2000; Yu et al., 2005), especially to determine whether a given question can be answered using medical knowledge backed with a sufficient level of evidence (Fin and Demner-Fushman, 2005; Kilicoglu et al., 2009).",
        "Fhis can also lead to a different representation of questions, for instance using a structured representation such as PICO (Niu et al., 2003; Huang et al., 2006; Demner-Fushman and Fin, 2007) or simple concepts and relations (Fin, 2001; Jacquemart and Zweigenbaum, 2003)."
      ]
    },
    {
      "heading": "2. Knowledge and Reasoning for Finding Medical Answers",
      "text": [
        "Answers to medical questions should be searched in the most reliable data available.",
        "When data exist in structured knowledge bases (e.g. a drug compendium), it may be more appropriate to query such knowledge bases directly.",
        "Fherefore an approach akin to that of Start/Omnibase (Fin and Katz, 2003) may be indicated.",
        "When answers are to be found in a collection of documents, as is the case in traditional question-answering systems, a representation of the information contained in these documents can be built, offline (Fleischman et al., 2003; Sang et al., 2005; Delbecque et al., 2005) or dynamically.",
        "In medical QA systems, both document analysis and question analysis nearly always rely on extensive knowledge of domain concepts and relations, e.g. as provided by the UMFS knowledge sources (McCray and Nelson, 1995).",
        "More than named entities, systems need to detect mentions of concepts (Aronson, 2001) and their relations (Rindfleschetal., 2005).",
        "Besides, taking into account the structure of documents such as scientific articles or encyclopedia entries may help focus on more relevant sections (Niu and Hirst, 2004; Sang et al., 2005).",
        "Finally, answers to complex medical questions often need to span more than one sentence.",
        "Extractive summarization is performed both from single documents (Demner-Fushman and Fin, 2007) and from multiple documents (Fiszman et al., 2008)."
      ]
    }
  ]
}
