{
  "info": {
    "authors": [
      "Kyonghee Paik",
      "Satoshi Shirai",
      "Hiromi Nakaiwa"
    ],
    "book": "Workshop on Multilingual Linguistic Resources",
    "id": "acl-W04-2204",
    "title": "Automatic Construction of a Transfer Dictionary Considering Directionality",
    "url": "https://aclweb.org/anthology/W04-2204",
    "year": 2004
  },
  "references": [
    "acl-C94-1048",
    "acl-W02-1705"
  ],
  "sections": [
    {
      "heading": "*NTT Advanced Technology Corporation 12-1, Ekimaehoncho, Kawasaki-ku, Kawasaki-shi, Japan 210-0007 Abstract",
      "text": [
        "In this paper, we show how to construct a transfer dictionary automatically.",
        "Dictionary construction, one of the most difficult tasks in developing a machine translation system, is expensive.",
        "To avoid this problem, we investigate how we build a dictionary using existing linguistic resources.",
        "Our algorithm can be applied to any language pairs, but for the present we focus on building a Korean-to-Japanese dictionary using English as a pivot.",
        "We attempt three ways of automatic construction to corroborate the effect of the directionality of dictionaries.",
        "First, we introduce “one-time look up” method using a Korean-to-English and a Japanese-to-English dictionary.",
        "Second, we show a method using “overlapping constraint” with a Korean-to-English dictionary and an English-to-Japanese dictionary.",
        "Third, we consider another alternative method rarely used for building a dictionary: an English-to-Korean dictionary and English-to-Japanese dictionary.",
        "We found that the first method is the most effective and the best result can be obtained from combining the three methods."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "There are many ways of dictionary building.",
        "For machine translation, a bilingual transfer dictionary is a most important resource.",
        "An interesting approach is the Papillon Project that focuses on building a multilingual lexical data base to construct large, detailed and principled dictionaries (Boitet et al., 2002).",
        "The main source of multilingual dictionaries is monolingual dictionaries.",
        "Each monolingual dictionary is connected to interlingual links.",
        "To make this possible, we need many contributors, ex",
        "perts and the donated data.",
        "One of the studies related to the Papillon Project tried to link the words using definitions between English and French, but the method can be extended to other language pairs (Lafourcade, 2002).",
        "Other research that focuses on the automatic building of bilingual dictionaries include Tanaka and Umemura (1994), Shirai and Yamamoto (2001), Shirai et al.",
        "(2001), Bond et al.",
        "(2001), and Paik et al.",
        "(2001).",
        "Our main concern is automatically building a bilingual dictionary, especially with different combinations of dictionaries.",
        "None of the research on building dictionaries seriously considers the characteristics of dictionaries.",
        "A dictionary has a peculiar characteristic according to its directionality.",
        "For example, we use a Japanese-to-English (henceforth, JOE) dictionary mainly used by Japanese often when they write or speak in English.",
        "Naturally, in this situation, a Japanese person knows the meaning of the Japanese word that s/he wants to translate into English.",
        "Therefore, an explanation for the word is not necessary, except for the words whose concept is hard to translate with a single word.",
        "Part-of-speech (henceforth POS) information is also secondary for a Japanese person when looking up the meaning of the corresponding equivalent to the Japanese word.",
        "On the other hand, an English-to-Japanese (henceforth E==>.J) dictionary is basically used from a Japanese point of view to discover the meaning of an English word, how it is used and so on.",
        "Therefore, explanatory descriptions, example sentences, and such grammatical information as POS are all important.",
        "As shown in (2), a long explanation is used to describe the meaning of tango, its POS and such grammatical information as singular or plural.",
        "Also, an E==>.J dictionary includes the word in plenty of examples, comparing to a JOE dictionary.",
        "The following examples clearly show the difference.",
        "(1) JOE: : dance the tango s (2) E=:>.J: tan go /(n. pl s)",
        ":a.",
        "..etc.",
        "(trans.",
        "tango “a dance of Central African aboriginals ,... etc.”)b.",
        "(trans.",
        "“its music”)Vi (“to dance the tango”).",
        "In this paper, we evaluate the effects that occur when we use different combinations of dictionaries and merge them in different ways."
      ]
    },
    {
      "heading": "2 Conventional Methods and Problems",
      "text": [
        "The basic method of generating a bilingual dictionary through an intermediate language was proposed by Tanaka and Umemura (1994).",
        "They automatically constructed a Japanese-French dictionary with English as an intermediate language and manually checked the extracted results.",
        "In this sense, their method is not completely automatic.",
        "They looked up English translations for Japanese words, and then French translations of these English translations.",
        "Then, for each French word, they looked up all of its English translations.",
        "After that, they counted the number of shared English translations (one-time inverse consultation).",
        "This was extended to “two-time inverse consultation”.",
        "They looked up all the Japanese translations of all the English translations of a given French word and counted how many times the Japanese word appears.",
        "They reported that “comparing the generated dictionary with published dictionaries showed that data obtained are useful for revising and supplementing the vocabulary of existing dictionaries.” Their method shows the basic method of building a dictionary using English as an intermediate language.",
        "We applied and extended their method in automatic dictionary building especially considering the directionality of dictionaries.",
        "Tanaka and Umemura (1994) used four dictionaries in two directions (JOE, EOJ, FOE and EOF).",
        "They first harmonized the dictionaries by combining the JOE and EOJ into a single J.<--->E and the FOE and EOF into a harmonized F.<--->E dictionary.",
        "We followed their basic method without harmonizing the dictionaries to emphasize the influence of directionality.",
        "In general, foreign word entries in a bilingual dictionary attempt to cover the entire vocabulary of the foreign language.",
        "However, foreign words that do not correspond to one’s mother tongue are not recorded in a bilingual dictionary from one’s mother tongue to the foreign language (Hartmann, 1983).",
        "A long explanatory phrase is replaced with a word that often does not perfectly correspond to the original.",
        "On the other hand, most of the index words from a foreign language to a mother tongue include many expository definitions or explanations that focus on usage.",
        "Such syntactic information as POS and number as well as example sentences are rich compared with a dictionary from mother tongue to a foreign language.",
        "These characteristics should be considered when building a dictionary automatically.",
        "Bond et al.",
        "(2001) showed how semantic classes can be used along with an intermediate language to create a Japanese-to-Malay dictionary.",
        "They used semantic classes to rank translation equivalents so that word pairs with compatible semantic classes are chosen automatically as well as using English to link pairs.",
        "However, we cannot use this method for languages with poor language resources, in this case semantic ontology.",
        "Paik et al.",
        "(2001) improved the method to generate a Korean-to-Japanese (henceforth KOJ) dictionary using multi-pivot criterion.",
        "They showed that it is useful to build dictionaries using appropriate multi-pivots.",
        "In this case, English is the intermediate language and shared Chinese characters between Korean and Japanese are used as pivots.",
        "However, none of the above methods considered the directionality of the dictionaries in their experiments.",
        "We ran three experiments to emphasize the effects of directionality.",
        "There are many approaches to building a dictionary.",
        "But our focus will be on the generality of building any pair of dictionaries automatically using English as a pivot.",
        "In addition, we want to confirm various directionalities between a mother tongue and a foreign language.",
        "'The first two experiments were reported in Shirai and Yamamoto (2001) and Shirai et al.",
        "(2001).",
        "We present new evaluations in this paper."
      ]
    },
    {
      "heading": "3 Proposed Method",
      "text": [
        "We introduce three ways of constructing a KBJ dictionary.",
        "First, we construct a KBJ dictionary using a KBE dictionary and a JBE.",
        "Second, we show another way of constructing a KBJ dictionary using an KBE dictionary and an EBJ dictionary.",
        "Third, we use a novel way of dictionary building using an EBK and EBJ to build a KBJ dictionary.",
        "However, our method is not limited to building a KBJ dictionary but can be extended to any other language pairs so long as X-to-English or English-to-X dictionaries exist.",
        "These three methods will cope with making dictionaries using any combination.",
        "We assume that the following conditions hold when building a bilingual dictionary: (1) Both the source language and the target language cannot be understood (to build a dictionary of unknown language pairs); (2) Various lexical information of the intermediate language (English) is accessible.",
        "(3) Limited information about the source and target language may be accessible."
      ]
    },
    {
      "heading": "3.1 Lexical Resources",
      "text": [
        "Our method can be extended to any other language pairs if there are X-to-English and English-to-X dictionaries.",
        "It means that there are four possible combinations such as i) X-to-English and Y-to-English, ii) X-to-English and English-to-Y, iii) English-to-X and Y-to-English and iv) English-to-X and English-to-Y to build a X-to-Y dictionary.",
        "We tested i), ii) and iv) in this paper and we used the following dictionaries in our experiment: Type # Entries Dictionary JBE 28,310 New Anchor 2 EBJ 52,369 Super Anchor3 KBE 50,826 Yahoo KBE 4 EBK 84,758 Yahoo EBK 4"
      ]
    },
    {
      "heading": "3.2 Linking KBE and JBE",
      "text": [
        "Our method is based upon a one-time inverse consultation of Tanaka and Umemura (1994)( See Section 2.)",
        "to judge the word correspondences of Korean and Japanese.",
        "Lexical Resources used here is a KBE dictionary (50,826 entries) and a JBE dictionary",
        "(28,310 entries).",
        "There is a big difference in the number of entries between the two dictionaries.",
        "This will affect the total number of extracted words.",
        "For Evaluation, we use a similarity score 51 for a Japanese word j and a Korean word k is given in Equation (1), where E(w) is the set of English translations of w. This is equivalent to the Dice coefficient.",
        "The extracted word pairs and the score are evaluated by a human to keep the accuracy at approximately 90%.",
        "The most successful case is when all the English words in the middle are shared by KBE and JBE.",
        "Figure 1 shows how the link is realized and the similarity scores are shown in Table 1.",
        "The similarity score shows how many English words are shared by the two dictionaries: the higher the score, the higher possibility of successful linking.",
        "However, as Table 1 shows, we have to sort out the inappropriately matched pairs by comparing the 51 score of equation (1) against a threshold T. The threshold allows us to exclude unfavorable results.",
        "For example, for words having one shared English translation equivalent, we have to discard the group (3) in Table 1.",
        "When the words translated from English match completely, the accuracy is high.",
        "And if the number of shared English translated words (IE(J) n E(K)I) is high, then we get a high possibility of accurate matching of Korean and Japanese.",
        "However, accuracy deteriorates when the number of the shared English translated words (shown by the threshold) decreases as in (2) and (3) of Table 1.",
        "We solved this problem by varying the threshold according to the number of shared English equivalents.",
        "The value of the threshold T was determined experimentally to achieve an accuracy rate of 90%.",
        "Result: Linking through English gives a total of 175,618 Korean-Japanese combinations.",
        "To make these combinations, 28,479 entries out of 50,826 from the KBE dictionary and 17,687 entries out of 28,310 from the JBE dictionary are used.",
        "As a result, we can extract 25,703 estimated good matches with an accuracy of 90%.",
        "Korean English Japanese"
      ]
    },
    {
      "heading": "3.3 Linking KBE and EBJ",
      "text": [
        "Method: We investigated how to improve the extraction rate of equivalent pairs using an overlapping constraint method here.",
        "To extract Korean-Japanese word pairs, we searched consecutively through a KBE dictionary and then an EBJ dictionary.",
        "We take English sets corresponding to Korean words from a Korean-English dictionary and Japanese translation sets for each English words from an EBJ dictionary.",
        "The overlap similarity score 52 for a Japanese word j and a Korean word k is given in Equation (2), where E(w) is the set of English translations of w and J(E) is the bag of Japanese translations of all translations of E.",
        "After that, we test the narrowing down of translation pairs by extracting the overlapped words in the Japanese translation sets.",
        "See Figure 2.",
        "Lexical Resources: We used a KBE dictionary (50,826 entries), the same as the one used in section 3.2 and a EBJ dictionary (52,369 entries).",
        "Compared to the resources used in our first method, the number of entries are well balanced.",
        "Evaluation: After extracting the overlapped words in the Japanese translation sets, the words were evaluated by humans.",
        "The main evaluation was to check the correlation between the overlaps and the matches of Korean and Japanese word pairs.",
        "Table 3 shows the overlapped number of shared English words and the number of index words of the KBE dictionary.",
        "Result: Entries with a 1-to-1 match have lE(K)l = lE(J)l = 1.",
        "These are generally good matches (90%).",
        "If more than two overlaps occur, then the accuracy matching rate is as high as 84.0%.",
        "It means that the number of useful entries is the sum of the 1-to-1 matches and 2 or more overlaps: 19,007 (37.4% of the KBE entries) with 87% accuracy.",
        "However, using KBE and EBJ there is a problem of polysemy in English words.",
        "For example, clean has two different POSs, adjective and verb in a KBE dictio",
        "nary.",
        "Unfortunately, this information cannot be used effectively due to the lack of POS in KBE when linking them to a EBK dictionary.",
        "On the other hand, clean using EBJ can be translated into either , an adjective or , a verb.",
        "This makes the range of overlap score widely distributed as shown in Figure 2.",
        "This is the reason using KBE and EBJ is not as good as using KBE and JBE.",
        "We will discuss this more in section 4."
      ]
    },
    {
      "heading": "3.4 Linking EBK and EBJ",
      "text": [
        "As we have discussed in earlier sections, the characteristics of dictionaries differ according to their directionality.",
        "In this section, we introduce a novel method of matching translation equivalents of Korean and Japanese.",
        "From the Korean speaker’s point of view, the EBK dictionary covers all English words, includes explanatory equivalents, and example sentences showing usage.",
        "The same thing is true for the EBJ dictionary from a Japanese speaker’s point of view.",
        "In this respect, we expect that the result of extraction is not as effective as the other combinations such as KBE +JBE and KBE +EBJ.",
        "On the other hand, we think that there must be other ways to exploit explanatory equivalents and example sentences.",
        "Method: First, we linked all the Korean and Japanese words if there is any shared English words.",
        "Then, we sorted them according to POSs to avoid the polysemous problem of POS.",
        "The left hand side of Figure 3 shows how we link Korean and Japanese pairs.",
        "Lexical Resources: We used a EBK dictionary (84,758 entries) and a EBJ dictionary (52,369 entries).",
        "Both of the dictionaries have many more entries than the ones used in the previous two methods.",
        "Evaluation: We use similarity score 53 in Equation (3) as a threshold which is used to extract good matches.",
        "I K(E) I means the number of Korean translation equivalents, and I J(E) I means the number of Japanese translation equivalents.",
        "The sum of the numbers is divided by the number of intermediate English words.",
        "It is used to reduce the polysemous problem of English words.",
        "It is because it is hard to decide which translation is appropriate, if an English word has too many translation equivalents in Korean and Japanese.",
        "The value of threshold (53) is shown in Table 4.",
        "We vary the threshold according to N = IE(j) n E(k)I to maximize the number of successful matches experimentally.",
        "N represents the number of intermediate English words.",
        "For N=1, we only count one-to-one matches, which means one Korean and one Japanese are matched through only one English.",
        "The following are examples of being counted when N is 1-to-1: e.g. -autosuggestion(n.), ( ) -billiard(a.",
        ")- , etc.",
        "We may lose many matching pairs by this threshold, but the accuracy rate for 1-to-1 is very high (96.5%).",
        "To save other matches when N=1, we need to examine further.",
        "In our experiment, #> is rejected because lovely has two Korean translations and two Japanese translations; the match #> is not 1-to-1.",
        "We postpone this part to further research.",
        "As expected, by setting this threshold we get fewer extracted words such as 10,360 words as shown in Table 4.",
        "However, the accuracy of the matched word pairs averages 92.7%.",
        "Comparison: To compare the three methods, we randomly chose 100 Korean words from a KBJ dictionary6 which could be matched through all three methods.",
        "The number of extracted matches was 28 using KBE and JBE, 34 using KBE and EBJ, and 13 using EBK and EBJ.",
        "For KBE and EBJ method, 21 out of 34 KBJ pairs were found only in KBE and EBJ method but not in KBE and JBE method.",
        "Among the 21 new KBJ word pairs, only one pair is an error (not a good match).",
        "One new pair was found in EBK and EBJ method.",
        "Therefore, combining all three methods gave 49 (28+20+1) different KBJ pairs, a better result than any single method.",
        "These results are shown in Table 5.",
        "Clearly"
      ]
    },
    {
      "heading": "4 Discussion",
      "text": [
        "We have shown the results of different matching metrics for different dictionary directions.",
        "Directionality is an important matter for building dictionaries automatically.",
        "In a KBE (or JBE) dictionary an index word contains non-conjugated forms whereas an index word in EBK (or EBJ) dictionary contains POS and conjugated forms.",
        "Therefore we expect the combination of KBE and JBE to be better than KBE and EBJ since we can avoid the mismatch of POS.",
        "On the other hand, a dictionary EBK or EBJ contains less uniform information such as long expository terms, grammatical explanations and example sentences.",
        "Especially, POS is far more detailed than the dictionaries of the other direction.",
        "These all contribute to fewer good matching words.",
        "As for the better result using KBE and JBE, we cannot overlook language similarity: Korean and Japanese are very similar with respect to their vocabularies and grammars.",
        "This must have result in sharing relatively more appropriate English translations and further matching more appropriate Korean and Japanese translation equivalents.",
        "In the combination of KBE and EBJ, the common English translations are reduced due to the characteristics of KBE and EBJ.",
        "A KBE dictionary from the Korean speaker’s point of view tends to have relatively simple English equivalents and normally POS is not shown.",
        "On the other hand, an EBJ dictionary shows such complicated equivalents as explanation of the entry a, a piece of translation equivalent b and grammatical information as shown in (2) in Section 1.",
        "Therefore, it is natural that the matching rate is far less than the combination of KBE and JBE.",
        "Considering the size of dictionaries used in KBE and JBE (estimated maximum matches: 28,310 KBJ pairs) and the one used in KBE and EBJ (estimated maximum matches: 50,826 KBJ pairs), we extrapolate from Table 5 that the method using KBE and JBE is better than the method using KBE and EBJ.",
        "We concluded that: KBE + JBE outperforms KBE + EBJ which outperforms EBK + EBJ.",
        "The following briefly summarizes the three methods.",
        "Equal characteristics of the dictionaries The meaning of the registered words tends to be translated to a typical, core meaning in English Synergy effect: Korean and Japanese are very similar, leading to more matching.",
        ".",
        "K=:>.E + E=:>.J: The combination of different characteristics of dictionaries makes automatic matching less successful.",
        ".",
        "E=:>.K + E=:>.J: There are far fewer matches.",
        "We can take advantage of example sentences, expository terms, and explanations to extract functional words.",
        " – We can improve accuracy by including English POS data.",
        "Even though we expected that the combination of dictionaries between EBK and EBJ will not provide a good result, it is worthwhile to know limits.",
        "After analyzing all of the result, we found that there is the effect of dictionary directionality.",
        "Also, we confirm that if we can use all the methods and combine them, we will get the best result since the output of the three dictionary combinations do not completely overlap.",
        ".",
        "Only the root forms are registered in an X-to-English dictionary.",
        "Also for verbs, we can get non finite forms using EBK and EBJ dictionaries.",
        "As index word, the non-conjugated forms are registered in a JBE dictionary such as meaning beautiful or clean.",
        "However, by using EBJ, we can get conjugated forms such as , and so forth.",
        "Registering all conjugated forms in a dictionary simplifies the development of a machine translation system and further second language acquisition.",
        "The direction from English-to-X contains a lot of example sentences.",
        "So far, the idea of using example sentences and idiomatic phrases for dictionary construction has not been adopted.",
        "To check the possibility of extracting functional words, we extracted example sentences and idiomatic phrases from EBJ and EBK dictionaries based upon the number of shared English words and look into the feasibility of using them to extract functional words.",
        "Future Work Our goal is not restricted to making a Korean-Japanese dictionary, but can be extended to any language pair.",
        "We assume that we do not know the source and target languages so well that it is not easy to match just the content words.",
        "Instead, we need to match automatically any kind of entries, even such functional words as particles, suffixes and prefixes.",
        "We think that it is best to extract these functional words by taking advantage of the characteristics of the EBK and EBJ dictionaries.",
        "For example, one of the merits of using EBK and EBJ is that we can get conjugated forms such as the Korean adjective which matches the English adjective beautiful; it is normally not registered in a KBE dictionary because is an adjective conjugated form of the root We extracted a total of 1,033 paraphrasing sentence pairs between Korean and Japanese with five or more shared English words.",
        "Among them, 465 sentences (45%) matched all the English exactly (=), and 373 sentences (36.1%) almost (Pz�) matched.",
        "We give examples below: _ (10) ”as for me, give me liberty or give me death.” .",
        "”as for me, give me liberty or give me death.” �(8) ”he is taller than any other boy in the class.” .",
        "”Tom is taller than any other boy in his class.” .",
        "(extracted from ELK and ELJ) The numbers in parentheses in the above examples represent how many English words are shared between ELK and ELJ.",
        "Using these paraphrasing sentences we will examine the effective way of extracting functional words.",
        "Finally we would like to apply our method to open source dictionaries, in particular EDICT (JLE, Breen (1995)) and engdic (ELK, Paik and Bond (2003)).",
        "This would make the results available to everyone, so that they can be used in comparative evaluation or further research."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "We have shown three major combination of dictionaries to build dictionaries.",
        "These methods can be applied to any pairs of language; we used a KLE dictionary, a JLE, an ELK dictionary and an ELJ to build a KLJ dictionary using English as a pivot.",
        "We applied three different methods according to different combination of dictionaries.",
        "First, a one-time look up method (Tanaka and Umemura, 1994) is tried using KLE and JLE.",
        "Second, an overlapping constraint method in one direction is applied using KLE and ELJ.",
        "Finally, a novel combination for building a dictionary is attempted using ELK and ELJ.",
        "We found that the best result is obtained by the first method.",
        "However, by combining all methods we can extract far more entries since the results from the three method do not overlap.",
        "Our result shows that 60% of word pairs in the second method are not found in the first or the third method.",
        "For the third method (using ELK and ELJ), we could not extract as many matched pairs, but it is potentially useful for extracting conjugated forms and functional words."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research was supported in part by the Ministry of Public Management, Home Affairs, Posts and Telecommunications.",
        "We would also like to thank Francis Bond for his comments and discussion."
      ]
    }
  ]
}
