{
  "info": {
    "authors": [
      "Satoru Ikehara",
      "Satoshi Shirai",
      "Hajime Uchino"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-1097",
    "title": "A Statistical Method for Extracting Uninterrupted and Interrupted Collocations from Very Large Corpora",
    "url": "https://aclweb.org/anthology/C96-1097",
    "year": 1996
  },
  "references": [
    "acl-C94-1101",
    "acl-J90-1003",
    "acl-J93-1007",
    "acl-P90-1032"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In order to extract rigid expressions with a high frequency of use, new algorithm that can efficiently extract both uninterrupted and interrupted collocations from very large corpora has been proposed.",
        "The statistical method recently proposed for calculating N-gram of arbitrary N can be applied to the extraction of uninterrupted collocations.",
        "But this method posed problems that so large volumes of fractional and unnecessary expressions are extracted that it was impossible to extract interrupted collocations combining the results.",
        "To solve this problem, this paper proposed a new algorithm that restrains extraction of unnecessary substrings.",
        "This is followed by the proposal of a method that enable to extract interrupted collocations.",
        "The new methods are applied to Japanese newspaper articles involving 8.92 million characters.",
        "In the case of uninterrupted collocations with string length of 2 or mere characters and frequency of appearance 2 or more times, there were 4.4 millions types of expressions (total frequency of 31.2 millions times) extracted by the N-gram method.",
        "In contrast, the new method has reduced this to 0.97 million types (total frequency of 2.6 million times) revealing a substantial reduction in fractional and unnecessary expressions.",
        "In the case of interrupted collocational substring extraction, combining the substring with frequency of 10 times or more extracted by the first method, 6.5 thousand types of pairs of substrings with the total frequency of 21.8 thousands were extracted."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In natural language processing, the importance of large volume corpus has been pointed out together with the need for technology of analyzing these linguistic data.",
        "For example, in machine translation, there are many expressions that are difficult to be translated literally.",
        "Phrase translations or pattern translations based on phrase or pattern dictionaries are considered very useful for the translations of these expressions.",
        "In order to realize these translation, it is required to identify phrases of high frequency and patterns of expressions from the corpora.",
        "There are many method proposed to extract rigid expressions from corpora such as a method of focusing on the binding strength of two words (Church and Hanks 1990); the distance between words (Smadja and Makeown 1990); and the number of combined words and frequency of appearance (Kita 1993, 1994).",
        "But it was not easy to identify and extract expressions of arbitrary lengths and high frequency of appearance from very large corpora.",
        "Thus, conventional methods had to introduce some kinds of restrictions such as the limitation of the kind of chains or the length of chains to be extracted (Smadja 1993, Shinnou and Isahara 1995).",
        "Recently, a new method which can calculate arbitrary number of n-gram statistics for very large corpora has been proposed (Nagao and Mori 1994).",
        "This method has made it possible to automatically and quickly extract and tabulate substrings of any length used in source texts.",
        "Unfortunately, in this method, so many fractional substrings that were grammatically and semantically inconsistent were being extracted that it was difficult to extract combinations of expressions collocated at separate locations (i.e. interrupted collocation) which requires a search of the source text by combining the strings thus extracted.",
        "Thus, the analyses had to be limited into small texts (Colier 1994).",
        "To overcome this problems, this paper first, proposes a method that can automatically extract and tabulate uninterrupted collocational substrings and without omission from the corpora in the order of substring length and frequency under the condition that fractional substrings are excluded.",
        "Second, using the results of the first method, it also proposes a method that can automatically extract and tabulate interrupted collocational substrings.",
        "2.",
        "N-gram Method and the Problem Involved (1) Conditions for Collocational Substring extraction",
        "In order to extract uninterrupted collocation without omission and to minimize extraction of fractional substrings, we will introduce the following three conditions.",
        "1st Condition: Substrings can be extracted in the order of the number of matching character (string length).",
        "2nd Condition: Substrings can be extracted in the order of frequency of use.",
        "3rd Condition: Substrings should be extracted according to the principle of the longest match."
      ]
    },
    {
      "heading": "ABC",
      "text": [
        "Here, 3rd condition means that when a string (for instance a in Fig.1) is extracted from a certain location within the source text, any substring ( r ) that is included within the string ( a ) is not subject to extraction.",
        "But should",
        "position, it is to be extracted.",
        "(2) Conventional Algorithm for N-gram Statistics",
        "Before discussing the algorithm which satisfies the previous conditions for uninterrupted collocational substring, let's consider the Nagao and Mori's algorithm propose for N-gram statistics.",
        "[Statistical Method for N-gram] Assume that the total number of characters in a source text (corpus) is N.",
        "Prepare PT – 0 (Pointer Table-0) of N records of SP (Source Pointer), with the values of 0, 1, 2,••• i,...,N – 1.",
        "Here, the value i represents the String-word i which is the substring from position i to the last character (N – 1 address) in the source text.",
        "Procedure 2: Pointer Table Sorting The records of PT – 0 are sorted in the order of corresponding String-words to obtain SPT – 0 (Sorted Pointer Table 0).",
        "Procedure 3: Counting of Matching Characters The characters of String-word i is compared with that of the next String-word i +1 from the beginning.",
        "The number of matched characters are registered in the field of a NMC (Number of Matching Character) in the record i.",
        "Procedure E: Extraction of Substrings Comparing the values of NMCs of record i and that of the record i+1 of the SPT from i=1 to i=N – 1, substrings are extracted and, their frequency are determined*l.",
        "(3) Problems of N-gram Statistics",
        "Nagao and Mori's method obviously fulfills requirements of Conditions 1 and 2, but not Condition 3.",
        "It is expected that the accurate frequency of any substring a is obtained subtracting the frequency by the frequency of the other substring which is included in substring a *2.",
        "Unfortunately, this does not satisfy Condition 3.",
        "At the time when extracted substring list has been compiled, information regarding mutual interrelationship between the extracted substrings within the original text has been lost rendering calculations impossible."
      ]
    },
    {
      "heading": "3. Extraction of Uninterrupted Collocation 3.1 Invaliditation of Extracted Substrings (1) Co-relations between Extracted Substrings",
      "text": [
        "In order to satisfy the requirement of Condition 3, consider the extraction of n-gram substring after extracting m gram substring.",
        "The problem arises when there is a certain overlap between them as shown in Fig.1.",
        "The Case of Absorbed Relation (Case 1) can be classified into three sub-cases as shown, but regardless of which situation, the m-gram substring is absorbed in the substring of n-gram and therefore there is no need to extract such a m-gram substring.",
        "Thus, when extracting n-gram strings, there is a need to invalidate the related record of the SPT so that rn-gram strings do not become involved in processes to follow.",
        "The Case of Partially Joint Relation (Case 2) can be further classified into two sub-cases.",
        "But in either situation, the m-grarn string and n-gram string merely overlapped and therefore they are need to be extracted separately.",
        "(2) Necessity of Validity Check for String-words When one substring is extracted, in order not to extract the absorbed string from the same part of source text where the substring was already extracted (Case 1), related records of SPT need to be checked if the record is valid or not before extracting the next substring.",
        "For example, the substring of 6 characters in the String word 3 shown in Fig. 3 was extracted, the substring of String-words 3,4,5,••,8 need to be set as invalid for the length equal or less than 6,5,4,••,1 characters from the beginning."
      ]
    },
    {
      "heading": "3.2 Extracting Algorithm",
      "text": [
        "Here, we propose an algorithm which satisfy Condition 3 as well as Conditions 1 and 2.",
        "The length of substrings to be extracted are decided from NMC and written in the NSC field of SPT – 0 .",
        "Procedure 5: Preparation of Augmented PT After sorting the SPT – 0 in the original order, add a VP (Validity Flag) field to obtain an PT-1.",
        "According to the method shown in 3.1(2), check the validity of the substring pointed by the records of the PT-1 in the order of the record number and write the results in the VF field.",
        "Resort the PT-1 in the order of the values of SP fields to obtain a SPT– 1.",
        "By referring to the SPT– 1, the strings to be extracted are determined and their frequencies are calculated.",
        "An example of the algorithm is shown in Fig.4.",
        "In this example, the types of substrings extracted by the conventional algorithm amounted to 24 with the total frequency of 72.",
        "In contrast, in the method proposed in this paper, these numbers have reduced to 5 and 10 respectively."
      ]
    },
    {
      "heading": "4. Extraction of Interrupted Collocation",
      "text": []
    },
    {
      "heading": "4.1 Conditions for Extraction",
      "text": [
        "Here, let's consider combinations of 2 or more uninterrupted collocational substrings in different locations within a single sentence together with a method of determining the frequency of them.",
        "In this case, boundary conditions of sentences and mutual relationship between the extracted substrings need to be considered.",
        "(1) Boundary Conditions of Sentences",
        "When considering the collocation of substrings within a sentence, combinations of expressions spread over borders of sentences need to be excluded.",
        "But when a single sentence includes other sentences, the extraction of the combinations in units of sentences poses complications.",
        "To simplify matters, we first assume that the substrings which have any kinds of punctuation mark as a part of them are not extracted in the procedure of uninterrupted collocation extraction.",
        "This can be easily performed by restraining the comparison procedure after finding a punctuation mark in Procedure 3.",
        "Second, we assume that when a left quote character is found within a sentence, all characters are ignored until the right quote character forming a pair with the former character.",
        "(2) Relationships between Extracted Substrings In extraction of interrupted collocations, substrings that are linked to or partially overlap one another are excluded from the scope of extraction.",
        "Let's consider substrings a and $ which have been extracted from the same sentence.",
        "The positioning would be one of the three cases shown in Fig.3.",
        "Case (c) in which substring a ands are separate from one another is a case of extracting interrupted collocations, and Cases (a) and (b) are not*3.",
        "(3) Order of Substring Appearance",
        "In the case of extracting interrupted collocations, the order of appearance of substrings should be considered.",
        "Hence, collocational substrings are extracted and counted taking notice of the order of the appearance of each substring.",
        "Sequential number is given to all of the substrings extracted in Chapter 3 in the order of extractions.",
        "These Number are registered in the NES (Number of Extracted Substrings) field of the respective record in SPT-1.",
        "Procedure 9: Resorting the SPT-1 The SPT-1 is sorted in the original order of the values of SP fields.",
        "Procedure 10: Numbering of the sentences SN(Sentence Number) field is added for entering the sentence number of original sentence to which one's record belongs.",
        "Procedure 11: Table condensation The table obtained is condensed by procedures shown in the following to obtain a SPT– 2*.",
        "(1) All fields other than the four, Sentence Numbers, ESN, NSC and RN are deleted.",
        "(2) All records with no values in the NES field are deleted.",
        "Procedure 12: Extraction of Interrupted Collocation",
        "Here, k is the number of substrings which compose interrupted colocational expressions.",
        "Then, all of the combinations of k NESs for every sentence are written down into a file and sorted.",
        "And the number of the same combination of NES are counted.",
        "Thus, the substring list of interrupted collocations can be obtained.",
        "If the sentence number is given to every combination list of NES, the sentences corresponding to the extracted interrupted collocation can easily be identified.",
        "The lower part of Fig.4 shows the application of this method for k=2.",
        "In this case, there are possibility of 25 combinations for 5 types of uninterrupted collocational substrings obtained by chapter 3.",
        "Out of these combinations, 7 combinations were extracted as the combinations which collocate twice or more within the same sentence.",
        "And the total frequency of these amount to 14 times."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": []
    },
    {
      "heading": "5.1 Uninterrupted Collocational Substrings",
      "text": [
        "Applying the proposed method to the newspaper articles of Nikkei Industrial News for three months (8.92 million characters), uninterrupted and interrupted collocational substrings were extracted.",
        "In this experiments, XEROX",
        "*3 In the case of (a), there would be a combination of substrings which is regarded as a interrupted collocation.",
        "However the frequency of such a pair is limitted to 1.",
        "Then there is no need to consider."
      ]
    },
    {
      "heading": "InterruptedVollocational Pairs of Former Substring",
      "text": [
        "2 0 1 3 3 3 1 6 2 0) 1 3 2 9 1 7 2 0 2 1 1 5 1 8 2 0 1 0 2 5 1 9 2 a) 1 3 3 27 20 2 0 2 2 2 2 2 1 2 0 1 1 1 6 2 2 2 1 1 1 2 6 2 3 2 CD 1 5 3 2 2 4 2 0 4 2 7 2 5 2 0 3 1 13 26 2 0 2 1 2 1 2 7 2 0 1 0 5 28 2 1 3 0 2 8 2 9 2 0 2 0 2 3 3 0 2 0 1 1 1 8 3 1 2 0 0 0 3 1 3 2"
      ]
    },
    {
      "heading": "<Sentence List>",
      "text": [
        "ARGOSS 5270 (0S4.1.3) was used.",
        "The memory capacity were 48 MB.",
        "(1) Characteristics of Extracted Substring",
        "From the view point of the length and frequency, the number of extracted substrings are compared with those of the N-gram method and summarized in Table 1 and Table 2.",
        "Some examples of extracted substrings are shown in Table 3.",
        "And the examples of substrings with high frequency are also shown in Table 4.",
        "From these results, the following observations can be obtained.",
        "CV Compared with the N-gram method, most of fractional substring has been deleted, and the types and the number of the extracted substrings have highly reduced.",
        "For example, in the extraction of substrings with the length of 2 or more and the frequency of 2 times or more, the substring type reduced to 22.2 % and total frequency of them reduced to 8.38 %.",
        "This effect increases as the increase of substring length.",
        "In the case of substrings of 20 or more characters, these number reduced to 1 %.",
        "© Most of substrings extracted by the proposed method forms expressions as syntactic or semantic units and there are few fractional substrings.",
        "(2) Processing Time It took about 40 hours to make SP7'-0*4.",
        "But successive processes were performed very quickly (within one hour)."
      ]
    },
    {
      "heading": "5.2 Interrupted Collocational Substrings",
      "text": [
        "(1) Characteristics of Extracted Substrings Interrupted collocational substrings were extracted for every two substrings which had appeared 10 or more times in the source text*5.",
        "The results are shown in Table 5.",
        "And, examples of substrings with high frequency and with much characters in total are shown in Table 6.",
        "From these results, it can also be seen that expressions typical to newspapers have been extracted.",
        "Thus, using the output results, we can easily obtain interrupted collocational expressions as well as uninterrupted ones.",
        "Table 3 Examples of Extracted Substrings (in the order of frequency) (cf.) • :Fractional substrin gram Proposed Method N-gram Statistics 5 gram LUZ-06 (436), kkj,NA Fq* (277), Li 0.",
        ")k.Y), (158), a-a `C W6 (3710), \"C. W6 M, (2827), k-_.c.7„).",
        "L, (2753), (make it that - ), (EC) , (for this purpose), (became to be - ), (be - ing but - ), (according to - ), TM rhi;h* (141), LW--)---C- 1/)17,,) (141), =E-37---- X (133), ts:.",
        ":) (/ -C. d: (2721), WC 1i\\ 6 (2334), .5 L'i LLIS (2286), (market share), (consider that - ), (motors), (speaking about -, ), (be done), L 'INli L. IL (130), cl tti\",11M Li (126), L\" 01)VX (112), i:..\": a‘-)---cr 1/ (2079), L LT (/).D (1997), If.",
        "1- 1=4-flt (1849), (enphasized that - ), (on the contrary), (subsequently - ), , (explain that - ), (57 fiscal year), [ 190,925 types Total 499,653 times ] [ 748,172 types Total 3,793,077 times ] 10 grain -4-7„:) ',:: Lk711S-D-C1/ '6 (44), M.:=.",
        "*FAM.--AM (35), L, tzr.",
        "L Li 6 k:,t ',/,.)",
        "L , (273), l',/,P7...\" Gk.",
        "L. 6 (::_ir, (223), (to be - ing), (second ), (from what - do), 4.--6 L L,'_.",
        "* ts 19 --- 5 k: (19), 8 2 ::).",
        "A, / 2 f/ H '2 7' (17), Ti ffi ki L. k L L1 6 ki (223), /PL\" Lit: L LI 6 i:i ct. 6 (222), (it seems to do - ), (82 Japan shop), ' L k. LL\" 6 ,--_ ch._,, 75L(222), M-17-YieliPifilAAJMA- (208), 1.r W6 01)-(1Wsli)ffi (16), r7 1;/ .",
        ":',/ 1 '2 - - ji, II1 =j-1,; VI (14) (according to that - was), (second research party), (wonder if - do - ), (Washington 19 ), [ 132,865 types Total 345,232 times ] [ 21,155 types Total 47,336 times ]",
        "Table 4 Examples of Substrings with High Frequency Examples of Substrings Lli 5 (586), LiLR,VL (512), L l, -C1/ ) '6 (436), tc: (325), -1C1 A 6 (324), \"-.1::A (315), (to say that), (said that), (set as), (again), (is that), (photograPhy), (frequency 200 ) L !PL., (302), LAH IL (283), IA (281), illi* (278), [ROAM* (277), L ffi 1, (274), *-f .2 b (269), (but), (said that), (Tokyo), (Price), (EC), (however), (Point), 3 L ,7:.",
        "L (264), )1.9-mi (259),, (236), LI-1,U (220),-Li 0 k 66 (204), i.j..",
        "rz.",
        "'s (201) (one word), (sell term) (mere over) (this is) (for this sake),' (yet)"
      ]
    },
    {
      "heading": "(2) Processing Time",
      "text": [
        "In the case of interrupted collocational substring extraction, processing time depend highly on the number of components of substrings.",
        "In this experiment, the turnaround time was 1 or 2 hours where components of collocations to be extracted was limited to the substrings with the frequency of 10 or more times."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "The methods of automatically identifying and extracting uninterrupted and interrupted collocations from very large corpora has been proposed.",
        "First, from the view point of collocational expression extraction, the problems of Nagao and Mori's algorithm for calculating arbitrary length of N-gram has been pointed out.",
        "And, under the condition that fractional substrings are restrained to be extract, a new method of automatically extracting and tabulating all of the uninterrupted collocational substrings has been proposed.",
        "Next, using these results, a method for automatically extracting interrupted collocational substrings has been proposed.",
        "In this method, combinations of uninterrupted collocational substrings which collocate at different positions within a sentence are extracted and counted.",
        "The method was applied to newspaper articles involving some 8.92 million characters.",
        "The results for uninterrupted collocations were compared with that of N-gram statistics.",
        "In the case of substring extraction with 2 or more characters, conventional method yielded substring of 4.4 millions types and the total frequency of them amount to 31.2 millions.",
        "In contrast, the method proposed in this paper extracted 0.97 millions types of substrings and a total frequency of them has reduced to 2.6 millions.",
        "In the case of interrupted collocational substring extraction, combining the substring with frequency of 10 times or more extracted by the first method, 6.5 thousand types of pairs of substrings with the total frequency of 21.8 thousands were extracted.",
        "From these results, it can be said that , viewed from the point of extraction of collocational expressions (as units of syntactic and semantic expressions), substrings obtained by conventional methods include a voluminous amount of fractional substrings.",
        "In contrast, the method proposed in this paper reduces many of such fractional substrings and condensed into a group of substrings that can be regarded as units of expression.",
        "As a result, it has been made possible to easily calculate interrupted collocations and together with phrase templates and other basic data regarding sentence structure.",
        "This paper used Japanese character chains to examine the algorithm.",
        "Yet this algorithm can be applied to arbitrary symbol chains.",
        "Various types of applications are possible, such as word chains, syntactic element chains obtained from results of morphological analysis or semantic attribute chains which consist of each word being converted to semantic attributes.",
        "As shown in this paper, applications for Japanese character chains still involve output of some amount of fractional stings.",
        "But when applications to word chains or syntactic element strings are concerned, further restriction of unnecessary elements are anticipated."
      ]
    },
    {
      "heading": "References:",
      "text": []
    }
  ]
}
