{
  "info": {
    "authors": [
      "Ya-Min Chou",
      "Chu-Ren Huang"
    ],
    "book": "Proceedings of OntoLex 2005 – Ontologies and Lexical Resources",
    "id": "acl-I05-7002",
    "title": "Hantology: An Ontology based on Conventionalized Conceptualization",
    "url": "https://aclweb.org/anthology/I05-7002",
    "year": 2005
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Hantology is the abbreviated name for Hanzi Ontology, an ontology based on the conventionalized conceptual orthographic system of Chinese characters (or kanji).",
        "We treat the Chinese writing system as a linguistic ontology since it represents and classifies lexical units according to semantic classes.",
        "This linguistic ontology is robust enough to endure over 3000 years of use by the most populous people, as well as adaptation by neighboring languages.",
        "In this paper, this robust and richly encoded ontology is fully and explicitly studied.",
        "We map Hantology to SUMO (Suggested Upper Merged Ontology) for systematic and theoretical discussion.",
        "In addition, the complete Hantology is fully encoded in OWL for sharability and for semantic web applications.",
        "1.",
        "Introduction: Hanzi and Conventionalized Conceptualization",
        "Can an ontology be psychologically real and be evidenced by shared human experience?",
        "This is one of the critical issues that linguistic ontologies, such as WordNet (Fellbaum, 1998), try to answer.",
        "The successful applications of WordNet in research seem to give a positive reply to this question.",
        "However, all the conceptual relations (or lexical semantic relations) of WordNet are annotated by experts, and not conventionalized.",
        "Hence there is no direct evidence of the psychological reality.",
        "We observe that there is indeed a human language writing system that has conventionalized a system of semantic classification.",
        "The system is richly structured and robust, having been used continuously for over 3000 years, and adopted by neighboring languages.",
        "This is the writing system of the Chinese characters (hanzi, or kanji in Japanese).",
        "In this paper, we focus mainly on the knowledge structure of Chinese characters' radicals.",
        "For syllabic and alphabetic writing systems, a character is a writing unit representing a phoneme or a syllable.",
        "Because the number of phonemes is finite, we only need finite phonetic symbols to represent sounds of words for a language.",
        "For the Chinese writing system, however, a Chinese character is a writing unit that represents a concept.",
        "Through over 3000 years of use, the complete Chinese writing system consists of at least 40,000 characters and perhaps has over 100,000 including variants.",
        "Each character represents one or more different concepts.",
        "Unlike alphabetic or syllabic characters, the Chinese characters not only represent concepts, they are also classified according to a set of semantic symbols.",
        "In other words, the linguistic ontology of Chinese characters is explicitly marked with logographic features.",
        "Generally speaking, each Chinese character is composed of two parts: a radical representing semantic classification, and a phonetic indicating phonological association.",
        "This generalization applies to the majority of Chinese characters, though not all.",
        "A minority estimated at less than 20% of all Chinese characters show other forms of composition.",
        "However, it is still true that these characters contain at least one semantically significant component.",
        "A small set of examples based on the radical Mj ma3 are given below to show the range of assigned meanings.",
        "In these examples, Mj ma3 is both a character and a radical denoting 'horse': #: a kind of horse A : many horses If: to ride a horse là.",
        ": a good horse % : to be scared (referring to a horse) The Chinese characters shown above suggest that radicals are indeed concept-based.",
        "However, it also showed the conceptual clustering is more complex than a simple taxonomy.",
        "We continue with the exploration of the system of conceptualization governing the constructions of Chinese characters.",
        "Any formal account of a conceptual system faces the dilemma of choosing a representational framework.",
        "Since a representational framework is itself build upon certain conceptualization, any choice is potentially an a priori distortion of the account.",
        "A possible solution to this dilemma is a shared upper ontology that is conceptually complete and yet general and robust enough to cover different conceptual systems under consideration.",
        "We adopt the Suggested Upper Merged Ontology (SUMO, Niles and Pease 2001) in this study.",
        "All concepts expressed in Chinese characters are mapped to SUMO representation in the hope that the mapping can be transformed to a specialized ontology later.",
        "One of the first implications of adopting SUMO representation is the fact that we are now able to show how knowledge inference can be achieved with the linguistic knowledge provided by radicals.",
        "Based on the linking between SUMO and WordNet (Niles and Pease, 2003) the following inference is possible whenever an English word is linked to the 'fish' node in SUMO: (subclass Fish ColdBloodedVertebrate) (disjointDecomposition ColdBloodedVertebrate Amphibian Fish Reptile) (instance ?FISH Fish) (exists (inhabits 7FISH ?",
        "WATER) (instance 7WATER Water)))) What is unique with Chinese characters is that the writing system encodes this conceptual link without any extra cost.",
        "Basically, all characters containing the 'fish' radical can be assigned to this SUMO's concept with the same knowledge inference."
      ]
    },
    {
      "heading": "2. General Framework (Chou 2005)",
      "text": [
        "In this paper, we elaborate the theoretical motivation as well overall design of Chou's (2005) dissertation.",
        "Chou (2005) proposes Hantology, a formal explicit representation of conceptualization for Chinese writing system.",
        "In this thesis, he takes Chinese characters are fundamental linguistic units and important resources for natural language processing.",
        "Although it is widely accepted that the Chinese writing system is richly encoded with semantic information, a formal account (or ontology) of this knowledge system has never been proposed.",
        "Chou (2005) focused on how to represent the knowledge structure of Chinese writing system.",
        "Hantology is proposed as a framework that is designed to give a felicitous and robust description of the knowledge structure of Chinese characters and the Chinese writing system.",
        "Hantology describes orthographic forms, phonological forms, senses, variants, variation and lexical-ization of Chinese writing system.",
        "The orthographic forms of Chinese writing system is ideographic or word-syllable characters.",
        "In general, each Chinese character is not only a writing unit but also itself a word or morpheme.",
        "The most important feature of Chinese writing system is that orthographic forms and senses are extensions of semantic symbols, so the concepts indicated by semantic symbols become the core of Chinese writing system.",
        "In this study, we use 540 radicals of ShuoWenJieZi (Xyu 121) as basic semantic symbols.",
        "To enable the conception and relation of semantic symbols to be processed by computer systems, the concepts indicated by each radical are analyzed and mapped into IEEE Suggested Upper Merged Ontology (SUMO).",
        "In addition, adopting SUMO allows Hantology to integrate and share with other ontologies like WordNet or the Academia Sinica Bilingual Ontological WordNet (Sinica BOW, Huang et al.",
        "2004).",
        "The senses represented by each Chinese character are mapped to SUMO to formally account for their conceptualization and their dependency relations.",
        "The derived lemmas are organized by their different senses in order to express the morphological context.",
        "Since some senses are dependent on their pronunciations, the relation between pronunciations and senses are described.",
        "In Chinese writing, there are lots of variants which are different orthographic forms of the same word or morpheme.",
        "A linguistic context is proposed to describe the relations of variants.",
        "To make knowledge easily shar-able, we establish a model expressed by Web Ontology Language-Description Logic (OWL-DL).",
        "This model integrates General Ontology for Linguistic Description (GOLD, Farrar and Langendoen 2003) framework to provide linguistic metaknowledge, such as orthography, morphology, and syntax, for natural language processing.",
        "Lastly, a knowledge-based solution to the problems of missing characters encoding and interpretation, as well as robust information retrieval of character variants are given to exemplify Hantology's application in NLP.",
        "We propose an interchange framework and Missing Characters Description Language (MCDL) for describing missing characters.",
        "Experiment results show that the missing characters and variants retrieval problems can be solved successfully by Hantology and interchange framework proposed in this thesis.",
        "In sum, Chou (2005) made substantial contributions in the following areas: First, the proposal and construction of a new linguistic ontology describes the knowledge structure of Chinese writing system.",
        "Hantology is the first linguistic ontology of ideographic writing systems.",
        "This approach significantly augments knowledge available to the Glyph-based Chinese encoding systems.",
        "It also allows this systemic knowledge to be applied to facilitate natural language processing.",
        "Second, we propose a linguistic context for describing the relation of character variants (Huang et al.",
        "2005).",
        "Chinese character variants are an important characteristic of Chinese texts.",
        "Unfortunately, so far, the relations of variants have not been properly represented.",
        "For this, we proposed a linguistic context for describing the relation of variants.",
        "Evaluation results show that this linguistic context provide significant improvement over previous counterpart schemes.",
        "Third, we propose a knowledge-based framework to describe language variation.",
        "Language always changes over time.",
        "Any linguistic ontology should not ignore the variation of language.",
        "Hantology is the first linguistic ontology describing the variation of languages.",
        "The aspects of variation described by Hantology include orthographic form, pronunciation, sense, lexicalization and variants relation.",
        "This approach can systematically illustrate the development of Chinese writing system.",
        "Lastly, the missing characters and variants retrieval problems are solved.",
        "It is an essential requirement to properly represent characters and symbols for any information processing.",
        "However, current Chinese computer systems fail to meet this requirement for decades.",
        "Consequently, users always have to face the missing characters and variants retrieval problem.",
        "We propose to change the representation of Hanzi to increase the knowledge owned by computers.",
        "By integrating missing characters with Hantology, the missing characters and variants problem are solved successfully.",
        "3.",
        "Conceptualization and Classification of the Radicals System",
        "Since the invention of the Chinese characters is the beginning of conventionalization of the Chinese language, there is no documentation of the principles governing the construction.",
        "Fortunately, we do have a classical text that is reasonably close to the origin of the Chinese characters.",
        "This is 'The Explanation of Words and the Parsing of Characters' ShuoWenJieZi (Xyu, 121).",
        "ShuoWenJieZi identifies 540 radicals (bu4shou3, literally 'head of classification') for Hanzi.",
        "Although later studies, including of excavated data, necessitate revisions of the ShuoWenJieZi system and interpretation, it is still the most widely accepted system that also happens to be the closest to the original interpretation.",
        "In order to faithfully show the original conceptualization of Chinese characters, we take the complete set of radicals of the ShuoWenJieZi as semantic symbols.",
        "For formal representation as well as ease of comparative study, they are mapped to the SUMO upper ontology.",
        "The conceptual classification of each radical is determined based on two sources of information.",
        "The first is the dictionary explanation given in ShuoWenJieZi.",
        "However, this source may contain errors caused by the author's idiosyncratic interpretation or the lack of data.",
        "For instance, ShuoWenJieZi give distinctive account of the two bird-related radicals.",
        "It is said that % (114 derived characters) refers to long-tailed birds, while #.",
        "(38 derived characters).",
        "However, when these 152 bird-related characters are examined, the generalization cannot be attested.",
        "Hence we conclude that the concept for both radicals is simply 'bird'.",
        "The second, and in fact the more authentic and reliable, piece of evidence we use is the shared meaning of the family of derived characters sharing that radical.",
        "That is, the most reliable evidence to identify the semantic class is to look at the shared semantics of the class members.",
        "The most productive radical among the 540 radicals is 7jc 'water', which has 467 characters derived from it.",
        "In is important to note that some radicals may represent more than one concept and hence require multiple inheritance, as allowed by SUMO.",
        "An example is SI) 'rain', which will be linked both to the ontology node of 'water' and 'WeatherProcess.'",
        "Sinica BOW (Huang et al., 2004) is used when looking up for the SUMO correspondences for some characters.",
        "Most mapping tasks rely on human analysis."
      ]
    },
    {
      "heading": "4. The Ontology of a Semantic Radical",
      "text": [
        "One illuminating discovery that we made while trying to map radicals to ontology nodes is that each radical actually represents a cluster of concepts that can be associated to the core meaning by a set of rules.",
        "We take the ¥ï cao3 'grass' radical for instance.",
        "It is generally accepted that ^ represents the concept 'plants'.",
        "Of the 444 characters containing the semantic symbol j^, there is no doubt that they are all related to the concept 'plant'.",
        "But what is surprising is that the conceptual clustering is not simply of taxonomy classification.",
        "As seem in figure 1, there are four productive relations described by the radical: being a kind of plant (e.g. orchid), being a part of a plant (e.g. leaves), being a description of a plant (e.g. fallen (leaves)), and being the usage of a plant (e.g. medicine).",
        "The concepts of most radicals that represent concrete objects can be classified into name, part, description and usage.",
        "For example, the concepts represented by radical Mj (horse), -^-(goat) and 4 (cow) also could be divided into the same four classes.",
        "We observe that this is similar with theory of generative lexicon (Pustejovsky 1995), where formal, constitutive, telic and agentive constitute the qualia structure of a word and provide the motivations for semantic changes and coercions.",
        "It is interesting to note that all except the Agentive aspect were attested with the conceptual clustering of Chinese characters derived from the grass radical.",
        "Since Pustejovsky's Agentive aspect is strongly associated with artifacts and other human creations, it is not unreasonable that the radicals based on natural objects lack any obvious semantic extension on how it was created.",
        "In addition, the descriptive attributes can be subsumed by the formal aspect of the qualia structure.",
        "Indeed, the Agentive aspect is attested by a different radical that is conceptually associated with man-made objects.",
        "The radical that we take as example is 4r jinl 'metal'.",
        "Since metals are not useful to human in its natural form, they are shaped by human to become different tools.",
        "In the conceptual clusters classified according to the 4r radical, there is a substantial subset defined by how a metal object was made, as in Figure 2.",
        "It is also interesting to observe that there is no instantiation of the Constitutive aspect for the 4r metal radical.",
        "This can be easily explained since metal in its natural form is a mass and does not have any components.",
        "Hence we show that the seeming idiosyncrasies in the conceptual clustering under each radical is actually dependent on real world knowledge.",
        "Hence we find the conceptual structure of encoded by radicals in the Chinese writing system supports Pustejovesky's theory of Generative Lexicon and Qualia structure.",
        "These are the same principles used for deriving Chinese characters 3000 years ago suggests that there is cognitive validity."
      ]
    },
    {
      "heading": "5. The Architecture of Hantology",
      "text": []
    },
    {
      "heading": "6. Formal Representation of Hantology",
      "text": [
        "The Semantic Web initiative not only underlines the need for automatic semantic processing by the web and highlights the crucial role of ontology as the infrastructure of knowledge representation.",
        "Hence, the fact that there is a widely used linguistic ontology with overt encoding of semantic classes is significant.",
        "It is worthwhile to see covert this linguistic ontology to a formal representation that can be accessed in the Semantic Web.",
        "Since OWL (Web Ontology Language) has been designated as the Web Ontology Language for W3C, we adopt OWL-DL to formally represent Hantology.",
        "The successful implementation is significant in two ways (see Figure 6).",
        "First, it will facilitate exchange and processing of knowledge represented in Chinese texts ad well as allow web-based applications.",
        "For instance, since Japanese texts are also encoded in Chinese characters (i.e. kanji), Hantology can serve as an infrastructure for exchanging Japanese to Chinese information.",
        "Second, converting the Hantology to formal representation allow us to check the consistency of the ontology.",
        "cm......... Unicode differentiates many characters which only have micro difference at glyph level.",
        "Actually, they are only variants of the same characters.",
        "This glyph-based design may cause many problems.",
        "For instance, these variants may be treated differently even though they should have the same semantic content.",
        "This problem cannot be solved with encoding systems.",
        "It would be necessary to explicitly describe the relations among these characters.",
        "Adopting OWL-DL can solve this problem.",
        "OWL-DL has inference function that will allow computers to identify Chinese characters properly the character variants: If hasGlyphInUnicode(Gk,Unicodei) and has-GlyphInUnicode(Gk, Unicodek) then Unicodei=Unicodej for examples : if hasGlyphyInUnicode(Gi, t£) and hasGlyphylnif hasGlyphyInUnicode(Gj, fif) and hasGlyphyln-Unicode(Gj, -sff) then %ff = sft if hasGlyphyInUnicode(Gk, and hasGlyphyln-Unicode(Gk, then fc=$t In addition, because Chinese characters have been used for thousands years, the glyph of each character is different on different period.",
        "These relationships are described in Hantology.",
        "The descriptions of glyphs include kaishu, lesser-seal, bronze and oraclebone scripts.",
        "If two glyphs have evolution relationships, then, hasAncientGlyph and isAncientGlyphOf predicates are used.",
        "hasAncientGlyph and isAncientGlyphOf predicates both have inversed and transitive features that are able to infer evolution relationships.",
        "The statements of hasAncientGlyph is shown as follows (also see Figure 7): if hasAncientGlyph(Gi, Gj ) then isAncientGlyphOf(Gj, G;) if hasAncientGlyph(Gi, Gj ) and hasAncientGlyph(Gj, Gk ) then hasAncientGlyph(Gi, Gk ) hasAncientGlyph .''",
        "hasAncientGlyph^/' isAncientGlyphOf H hasAncientGlyph The name space of Hantology on the web is http://www.ntu.edu.tw/2005/Hantology.owl# .",
        "We give a semantic model of the part of Hantology that describes Glyph as an example in figure 6."
      ]
    },
    {
      "heading": "7. Results",
      "text": [
        "The knowledge structure of Chinese radicals has been built.",
        "There are 3000 high frequent characters described in Hantology, including their orthographic forms, senses, variants and generated words.",
        "The whole knowledge structure formed by radicals is large, so only a part of results are shown in this paper.",
        "Figure 8 shows the knowledge structure of radicals about animals.",
        "This draft ontology can be pruned and rearranged later to show more faithfully the system of conceptualization as encoded when Chinese characters were invented.",
        "Si.",
        "ri m invertebrate^ animal arthropoj},« \\ worm blooded 5jf Vertebrate vertebrate /* rold blooded vertebrate AJirXTM, camne feline aquatic /homi?id mammal ig ^primate^ ^um^n^^^■monkey, hoofed; ià As a knowledge base that has a rich time-depth as well as glyph representations, we designed an interface such that the many-layered Hantology knowledge can be effectively accessed.",
        "With this interface, a user can browse by form, including the semantic components of a character, by meaning, or by variants.",
        "A web-based version is being constructed now for wide access.",
        "pobnf ■ niiLir;£ Hflr In the above figure, we show one of the features of our interface system.",
        "For this application, a user can identify all radicals according to an ontological concept as defined in SUMO.",
        "A possible application, of course, is for a web-based user to execute a meaning-based web-search without having to know the Chinese language and also achieve much higher conceptual recall without having to list all related lemmas."
      ]
    }
  ]
}
