{
  "info": {
    "authors": [
      "Eduardo Blanco",
      "Hakki C. Cankaya",
      "Dan Moldovan"
    ],
    "book": "COLING – POSTERS",
    "id": "acl-C10-2009",
    "title": "Composition of Semantic Relations: Model and Applications",
    "url": "https://aclweb.org/anthology/C10-2009",
    "year": 2010
  },
  "references": [
    "acl-J05-1004",
    "acl-J06-1005",
    "acl-J08-2001",
    "acl-L08-1018",
    "acl-P01-1019",
    "acl-P04-1055",
    "acl-P05-2006",
    "acl-P06-1040",
    "acl-P07-2040",
    "acl-P08-1027",
    "acl-P98-1013",
    "acl-W04-2609",
    "acl-W07-1401",
    "acl-W07-1404",
    "acl-W07-2003",
    "acl-W07-2045"
  ],
  "sections": [
    {
      "text": [
        "Eduardo Blanco, Hakki C. Cankaya and Dan Moldovan",
        "Human Language Technology Research Institute The University of Texas at Dallas",
        "This paper presents a framework for combining semantic relations extracted from text to reveal even more semantics that otherwise would be missed.",
        "A set of 26 relations is introduced, with their arguments defined on an ontology of sorts.",
        "A semantic parser is used to extract these relations from noun phrases and verb argument structures.",
        "The method was successfully used in two applications: rapid customization of semantic relations to arbitrary domains and recognizing entailments."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Semantic representation of text facilitates inferences, reasoning, and greatly improves the performance of Question Answering, Information Extraction, Machine Translation and other NLP applications.",
        "Broadly speaking, semantic relations are unidirectional underlying connections between concepts.",
        "For example, the noun phrase the car engine encodes a part-whole relation: the engine is a part of the car.",
        "Semantic relations are the building blocks for creating a semantic structure of a sentence.",
        "There is a growing interest in text semantics fueled by the new wave of semantic technologies and ontologies that aim at transforming unstructured text into structured knowledge.",
        "More and more enterprises and academic organizations have adopted the World Wide Web Consortium (W3C) Resource Description Framework (RDF) specification as a standard representation of text knowledge.",
        "This is based on semantic triples, which can be used to represent semantic relations.",
        "The work reported in this paper aims at extracting as many semantic relations from text as possible.",
        "Semantic parsers (SP) extract semantic relations from text.",
        "Typically they detect relations between adjacent concepts or verb argument structures, leaving considerable semantics unrevealed.",
        "For example, given John is a rich man, a typical SP extracts John is a man and man is rich, but not John is rich.",
        "The third relation can be extracted by combining the two relations detected by the parser.",
        "The observation that combining elementary semantic relations yields more relations is the starting point and the motivation for this work."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "In Computational Linguistics, WordNet (Miller, 1995), FrameNet (Baker et al., 1998) and Prop-Bank (Palmer et al., 2005) are probably the most used semantic resources.",
        "Like our approach and unlike PropBank, FrameNet annotates semantics between concepts regardless of their position in a parse tree.",
        "Unlike us, they use a predefined set of frames to be filled.",
        "PropBank adds semantic annotation on top of the Penn TreeBank and it contains only annotations between a verb and its arguments.",
        "Moreover, the semantics of a given label depends on the verb.",
        "For example, arg2 is used for instrument and value.",
        "Copious work has been done lately on semantic roles (Marquez et al., 2008).",
        "Approaches to detect semantic relations usually focus on particular lexical and syntactic patterns or kind of arguments.",
        "There are both unsupervised (Turney, 2006) and supervised approaches.",
        "The SemEval-2007 Task 4 (Girju et al., 2007) focused on relations between nominals.",
        "Work has been done on detecting relations between noun phrases (Davi-dov and Rappoport, 2008; Moldovan et al., 2004), named entities (Hirano et al., 2007), and clauses (Szpakowicz et al., 1995).",
        "There have been proposals to detect a particular relation, e.g., CAUSE part-whole (Girju et al., 2006).",
        "Researchers have also worked on combining semantic relations.",
        "Harabagiu and Moldovan (1998) combine WordNet relations and Helbig (2005) transforms chains of relations into theoretical axioms.",
        "Some use logic as the underlying formalism (Lakoff, 1970; Sanchez Valencia, 1991), more ideas can be found in (Copestake etal., 2001)."
      ]
    },
    {
      "heading": "3. Approach",
      "text": [
        "In contrast to First Order Logic used in AI to represent text knowledge, we believe text semantics should be represented using a fixed set of relations.",
        "This facilitates a more standard representation and extraction automation which in turn allows reasoning.",
        "The fewer the relation types, the easier it is to reason and perform inferences.",
        "Thus, a compromise has to be made between having enough relation types to adequately represent text knowledge and yet keeping the number small for making the extraction and manipulation feasible.",
        "The main contributions of this paper are: (i) an extended definition of a set of 26 semantic relations resulted after many iterations and pragmatic considerations; (ii) definition of a semantic calculus, a framework to manipulate and compose semantic relations (CSR); (iii) use of CSRto rapidly customize a set of semantic relations; and (iv) use of CSR to detect entailments.",
        "The adoption of CSR to other semantic projects does not require any modification of existing tools while being able to detect relations ignored by such tools."
      ]
    },
    {
      "heading": "4. Semantic Relations",
      "text": [
        "Formally, a semantic relation is represented as R(x, y), where R is the relation type and x and y the first and second argument.",
        "R(x, y) should be read as xis R of y.",
        "The sentence \"John painted his truck\" yields AGENT(John, painted), THEME(his truck, painted) and POSSESSiON(truck, John).",
        "Extended definition Given a semantic relation R, Domain(r) and Range(r) are defined as the set of sorts of concepts that can be part of the first and second argument.",
        "A semantic relation R(x, y) is defined by its: (i) relation type R; (ii) Domain(r); and (iii) Range(r).",
        "Stating restrictions for DOMAIN and RANGE has several advantages: it (i) helps distinguishing between relations, e.g., [tall]ql and [John]aco can be linked through VALUE, but not POSSESSION; (ii) helps discarding potential relations that do not hold, e.g., abstract objects do not have INTENT; and (iii) helps combining semantic relations (Section 5).",
        "Ontology of Sorts In order to define Domain(r) and RANGE(R), we use a customized ontology of sorts (Figure 1) modified from (Helbig, 2005).",
        "The root corresponds to entities, which refers to all things about which something can be said.",
        "Objects can be either concrete or abstract.",
        "The former occupy space, are touchable and tangible.",
        "The latter are intangible; they are somehow a product of human reasoning.",
        "Concrete objects are further divided into animate or inanimate.",
        "The former have life, vigor or spirit; the later are dull, without life.",
        "Abstract objects are divided into temporal or non temporal.",
        "The first corresponds to abstractions regarding points or periods of time (e.g. July, last week); the second to any other abstraction (e.g. disease, justice).",
        "Abstract objects can be sensually perceived, e.g., pain, odor.",
        "Situations are anything that happens at a time and place.",
        "Simply put, if one can think of the time and location of an entity, it is a situation.",
        "Events (e.g. mix, grow) imply a change in the status of other entities, states (e.g. standing next to the door) do not.",
        "Situations can be expressed by verbs (e.g. move, print) or nouns (e.g. party, hurricane).",
        "Descriptors complement entities by stating properties about their spatial or temporal context.",
        "They are composed of an optional non-content word signaling the local or temporal context and another entity.",
        "Local descriptors are further composed of a concrete object or situation, e.g., [above]prep [the roof]co; temporal descriptors by a temporal abstract object or situation, e.g., [during]prep [the party]ev.",
        "The non-content word signaling the local or temporal context is usually present, but not always, e.g., \"The [birthplace] ev of his mother is [Ankara])oc \".",
        "Qualities represent characteristics than can be assigned to entities.",
        "They can be quantifiable like tall and heavy, or unquantifiable like difficult and sleepy.",
        "Quantities represent quantitative characteristics of concepts, e.g., a few pounds, 22 yards.",
        "Entity [ent]",
        "Situation [si]",
        "Quantity [qn]",
        "State [st]",
        "Event [ev]",
        "Concrete [co]",
        "Abstract [ao]",
        "Temporal [tmp] Local [loc]",
        "Animate [aco]",
        "Table 1 : The set of 26 relations clustered and classified with their properties (reflexive, symmetric, transitive) and examples.",
        "An asterisk indicates that the property holds under certain conditions.",
        "This work focuses on the set of 26 semantic relations depicted in Table 1.",
        "We found this set specific enough to capture the most frequent semantics of text without bringing unnecessary overspe-cialization.",
        "The set is inspired by several previous proposals.",
        "Fillmore introduced the notion of case frames and proposed a set of nine roles:",
        "agent, experiencer, instrument, object, source, goal, location, time and path (Fillmore, 1971).",
        "Fillmore's work was extended to FrameNet (Baker et al., 1998).",
        "PropBank (Palmer et al., 2005) annotates a set of 17 semantic roles in a per-verb basis.",
        "We aim to encode relations not only between a verb and its arguments, but also between and within noun phrases and adjective phrases.",
        "Therefore, more relations are added to the set.",
        "It includes relations present in WordNet (Miller, 1995), such as is-a, part-whole and cause.",
        "Szpakowicz et al.",
        "(1995) proposed a set of nine relations and Turney (2006) a set of five.",
        "Rosario and Hearst (2004) proposed a set of 38 relations including standard case roles and a set of specific relations for medical domain.",
        "Helbig (2005) proposed a set of 89 relations, including antonym y and several temporal relations, e.g. succession, extension, end.",
        "Our set clusters some of the previous proposals (e.g. we only consider at-time) and discards relations proposed elsewhere when they did not occur frequently enough in our experiments.",
        "For example, even though antonymy and entailment are semantically grounded, they are very infrequent and we do not deal with them.",
        "Our pragmatic goal is to capture as many semantics as possible with as few relations as possible.",
        "However, we show (Section 7.1) that our set can be easily customized to a specific domain.",
        "Object [o]",
        "Quality [ql]",
        "Descriptor [des]",
        "Cluster",
        "Relation type Abr.",
        "Class.",
        "Properties",
        "Example",
        "r s t Domain x Range",
        "Reason",
        "cause cau justification jst influence ifl",
        "iv iv iv",
        "V [si] x [si]",
        "~y [si U ntao] x [si]",
        "V [si] x [si]",
        "CAU(earthquake, tsunami) JST(i£ is forbidden, don't smoke) lFL(missing classes, poor grade)",
        "Goal",
        "intent int purpose prp",
        "v",
        "[si] x [aco] y [si U ntao] x [si U co U ntao]",
        "lNT(£each, professor) prp(storage, garage)",
        "Object modifiers",
        "value val source src",
        "v",
        "ii",
        "[ql] x [o U si] *j [loc U ql U ntao U ico] x [o]",
        "VAL(smart, kids) SRC(Mexican, students)",
        "Syntactic subjects",
        "agent agt experiencer exp instrument ins",
        "iii iii iii",
        "[aco] x [si] - - - [o] x [si]",
        "[co U ntao] x [si]",
        "AGT (John, bought) EXP(John, heard) lNS(£fre hammer, broke)",
        "Direct objects",
        "theme thm topic tpc stimulus sti",
        "iii iii iii",
        "[o] x [ev] [o U si] x [ev] [o] x [ev]",
        "THM(a car, bought) TPC(ßowers, gave) STl(£he train, heard)",
        "Association",
        "association aso kinship kin",
        "v",
        "ii",
        "V V V [ent] x [ent]",
        "V V V [aco] x [aco]",
        "ASO(fork, knife) kin(John, his wife)",
        "None",
        "is-a isa part-whole pw make mak possession pos manner mnr recipient rcp synonymy syn at-location at-l at-time at-t property pro quantification qnt",
        "ii ii ii ii iii iii",
        "v v v v v",
        "- - V [o] x [0]",
        "- - * [0] x [o] U [1] x [1] U [t] x [t]",
        "[co U ntao] x [co U ntao] V [co] x [co]",
        "[ql U st U ntao] x [si]",
        "[co] x [ev] V V V [ent] x [ent] v - * [o U si] x [loc] sj - * [o U si] x [tmp]",
        "[ntao] x [o U si]",
        "[qn] x [si U o]",
        "lSA(gas guzzler, car) PW(engine, car) MAK(cars, BMW) pos([Ford F-150, John) M~NR(quick, delivery) RCP(Mary, gave) SYN(a dozen, twelve) AT-L (party, John's house) AT-l(party, last Saturday) PRO(height, John) QNT(a dozen, eggs)",
        "The 26 relations are clustered such that relations belonging to the same cluster are close in meaning.",
        "Working with clusters is useful because it allows us to: (i) map to other proposed relations, justifying the chosen set of relations; (ii) work with different levels of specificity; and (iii) reason with the relations in a per cluster basis.",
        "The reason cluster includes relations between a concept having a direct impact on another.",
        "CAU(x, y) holds if y would not hold if x did not happen.",
        "jst(x, y) encodes a moral cause, motive or socially convened norm.",
        "If IFL(x, y), x affects the intensity of y, but it does not affect its occurrence.",
        "The goal cluster includes INT and PRP.",
        "INT(x, y) encodes intended consequences, which are volitional.",
        "PRP(x, y) is a broader relation and can be defined for inanimate objects.",
        "The object modifiers cluster encodes descriptions of objects and situations: SRC(x, y) holds if x expresses the origin of y. VAL(x, y) holds for any other attribute, e.g. heavy, handsome.",
        "The syntactic subjects cluster includes relations linking a syntactic subject and a situation.",
        "The differences rely on the characteristics of the subject and the connection per se.",
        "AGT(x, y) encodes an intentional doer, x must be volitional.",
        "If EXP(x, y), x does not change the situation, it only experiences y; it does not participate intentionally in y either.",
        "If INS(x, y), x is used to perform y, x is a tool or device that facilitates y.",
        "The direct objects cluster includes relations encoding syntactic direct objects.",
        "THM(x, y) holds if x is affected or directly involved by y. TPC(x, y) holds if y is a communication verb, like talk and argue.",
        "STl(x, y) holds if y is a perception verb and x a stimulus that makes y happen.",
        "The association cluster includes ASO and KIN.",
        "ASO is a broad relation between any pair of entities; KIN encodes a relation between relatives.",
        "The rest of the relations do not fall into any cluster.",
        "ISA, pw, syn, at-l and at-t have been widely studied in the literature.",
        "MAK(x, y) holds if y makes or produces x; POS(x, y) holds if y owns x; MNR encodes the way a situation occurs.",
        "RCP captures the connection between an event and an object which is the receiver of the event.",
        "PRO describes links between a situation or object and its characteristics, e.g., height, age.",
        "Values to the characteristics are given through VAL.",
        "QNT(x, y) holds if y is quantitatively determined by x.",
        "Relations can also be classified depending on the kind of concepts they describe and their intra or inter nature into: (i) Intra-Object; (ii) Inter-Objects; (iii) Intra-Situation; (iv) Inter-Situations; and (v) for Object and Situation description.",
        "Relations are extracted by an in-house SP from a wide variety of syntactic realizations.",
        "For example, the compound nominal steel knife contains PW(steel, knife), whereas carving knife contains PRP(carving, knife); the genitive Mary's toy contains POS(toy, Mary), whereas Mary's brother contains KIN(brother, Mary), and eyes ofthe baby contains a PW(eyes, baby).",
        "Relations are also extracted from a verb and its arguments (NP verb, verb NP, verb PP, verb ADVP and verb S), adjective phrases and adjective clauses.",
        "The SP first uses a combination of state-of-the-art text processing tools, namely, part-of-speech tagging, named entity recognition, syntactic parsing and word sense disambiguation.",
        "After a candidate syntactic pattern has been found, a series of machine learning classifiers are applied to decide if a relation holds.",
        "Four different algorithms are used: decision trees, Naive Bayes, SVM and Semantic Scattering combined in a hybrid approach.",
        "Some algorithms use a per-relation approach (i.e., decide whether or not a given relation holds) and others aper-pattern approach (i.e., which relation, if any, holds for a particular pattern).",
        "Additionally, human-coded rules are used for a few unambiguous cases.",
        "The SP participated in the SemEval 2007 Task 4 (Badulescu and Srikanth, 2007)."
      ]
    },
    {
      "heading": "5. Composition of Semantic Relations",
      "text": [
        "The goal of semantic calculus (SC) is to provide a formal framework for manipulating semantic relations.",
        "CSR is a part of this, its goal is to apply inference axioms over already identified relations in text in order to infer more relations.",
        "Semantic Calculus: Operators and Properties",
        "The composition operator is represented by the",
        "R-1 inherits all the properties of R",
        "R is reflexive iff Vx: R(x, x)",
        "Ri M Rj O Ri-1 M Rj-1",
        "If Ri is symmetric and Ri M Rj, Ri-1 M Rj",
        "If Rj is symmetric and Ri rxi Rj, Ri rxi Rj-1",
        "symbol o.",
        "It combines two relations and yields a third one.",
        "Formally, we denote ri o r2 – r3.",
        "The inverse of r is denoted rand can be obtained by simply switching its arguments.",
        "Given r(x, y), r-1(y, x) always holds.",
        "The easiest way to read r-1(y, x) is x is r of y.",
        "r1 left dominates r2, denoted by r1 > r2, iff the composition of r1 and r2 yields r1, i.e., r1 > r2 iff r1 o r2 – r1.",
        "r1 right dominates r2, denoted by r1 < r2, iff the composition of r2 and r1 yields r1, i.e., r1 < r2 iff r2 o r1 – r1.",
        "r1completely dominates r2, denoted by r1 x r2, iff r1 > r2 and r1 < r2, i.e., r1 x r2 iff r1 o r2 – r1 and r2 o r1 – r1.",
        "An other (_L) relation holds between x and y if no relation from the given set holds.",
        "Formally, _L(x,y) iff -Grj such that rj(x,y).",
        "Using the notation above, the properties depicted in Table 2 follow.",
        "Necessary conditions for Combining Relations Axioms can be defined only for compatible relations as premises.",
        "r1 and r2 are compatible if it is possible, from a theoretical point of view, to apply the composition operator to them.",
        "Formally, Range(r1) n Domain(r2) = 0",
        "If r1 and r2 are compatible but not equal a restriction occurs.",
        "Let us denote Range(r1) n Domain(r2) = I .A backward restriction takes place if Range(r1) = I and a forward restriction if Domain(r2) = I.",
        "In the former case Range(r1 ) is reduced; in the later Domain(r2) is reduced.",
        "A forward and backward restriction can be found with the same pair of relations.",
        "It is important to note that two compatible relations may not be the premises for a valid axiom.",
        "For example, kin and at-l are compatible but do not yield any valid inference.",
        "Another necessary condition for combining two relations r1(x, y) and r2(y, z) is that they have to have a common argument, y.",
        "An axiom is defined as a set of relations called premises and a conclusion.",
        "Given the premises it unequivocally yields a relation that holds as conclusion.",
        "The composition operator is the basic way of combining two relations to form an axiom.",
        "In general, for n relations there are (!J) = n(-n~1\"1 different pairs.",
        "For each pair, taking into account the two relations and their inverses, there are 4 x 4 = 16 different possible combinations.",
        "Applying property rj o rj = (rj- o rj only 10 combinations are unique: (i) 4 combine r1, r2 and their inverses; (ii) 3 combine r1 and r1-1; and (iii) 3 combine r2 and r2-1.",
        "The most interesting axioms fall into category (i), since the other two can be resolved by the transitivity property of a relation and its inverse.",
        "For n relations there are 2n + n potential axioms: (™) x4+3n = 2xn(n-1)+3n = 2n +n.",
        "For n = 26, there are 1300 potential axioms in (i), 820 of which are compatible.",
        "The number can be further reduced.",
        "After manual examination of combinations of aso and kin with other relations, we conclude that they do not yield any valid inferences, invalidating 150 potential axioms.",
        "This is due to the broad meaning of these relations.",
        "qnt can be discarded as well, invalidating 45 more potential axioms.",
        "Some axioms can be easily validated.",
        "Because synonymous concepts are interchangeable, syn is easily combined with any other relation: syn(x, y) o r(y, z) – r(x, z) and r(x, y) o syn(y, z) – r(x, z).",
        "Because hyponyms inherit relations from their hypernyms, isa(x, y) o r(y, z) – r(x, z) and r(x, y) o isa-1 (y, z) – r(x, z) hold.",
        "These observations allow us to validate 138 of the 625 potential axioms left, still leaving 487.",
        "As noted before, relations belonging to the same cluster tend to behave similarly.",
        "This is especially true for the reason and goal clusters due to their semantic motivation.",
        "Working with these two clusters instead of the relations brings the",
        "Table 3: The four axioms taking as premises reason and goal clusters.",
        "Diagonal arrows indicate inferred relations.",
        "number of axioms to be examined down to 370.",
        "Out of the 370 axioms left, we have extensively analyzed and defined the 35 involving AT-L, the 43 involving reason and the 58 involving goal.",
        "Because of space constraints, in this paper we only fully introduce the axioms for reason and goal (Section 6), as well as a variety of axioms useful to recognize textual entailments (Section 7.2)."
      ]
    },
    {
      "heading": "6. Case Study: Reason and Goal",
      "text": [
        "In this section, we present the four unique axioms for reason and goal relations (Table 3).",
        "(1) REA(x, y) o GOA(y, z) – IFL(x, z): an event is influenced by the reason of its goal.",
        "For example: Bill saves money because he is unemployed; he spends far less than he used to.",
        "Therefore, being unemployed can lead to spend far less.",
        "P RE A(be unemployed, save money)",
        "GOA(save money, spend far less) C IFL(beunemployed, spend farless)",
        "(2) REA-1(x, y) o GOA(y, z) – PRP(x, z): events have as their purpose the effects of their goals.",
        "This is a strong relation.",
        "For example: Since they have a better view, they can see the mountain range.",
        "They cut the tree to have a better view.",
        "Therefore, they cut the tree to see the mountain range.",
        "P REA-1(see the mountain range, better view)",
        "GOA(better view, cut the tree) C PRP(seethemountain range, cut thetree)",
        "Note that possible unintended effects of cutting the tree (e.g. homeowners' association complains) are caused by the event cut the tree, not by its effect get a better view.",
        "(3) GOA(x, y) o REA(y, z) – IFL(x, z): the goal of an action influences its effects.",
        "For example: John crossed the street carelessly to get there faster.",
        "He got run over by a propane truck.",
        "Therefore, John got run over by a propane truck influenced by (having the goal of) getting there faster.",
        "P GOA(get there faster, crossed carelessly)",
        "REA(crossed carelessly, got run over ) C I FL(getthere faster, got runover)",
        "(4) GOA(x, y) o REA-1(y, z) – IFL-1(x, z).",
        "Events influence the goals of its effects.",
        "For example: Jane exercises to lose weight.",
        "She exercised because ofthe good weather.",
        "Therefore, good weather helps to lose weight.",
        "P GOA(lose weight, exercise)",
        "REA_1(exerc/se, good weather) C IFL-1(loseweight, good weather)",
        "The axioms have been evaluated using manually annotated data.",
        "PropBank CAU and PNC are used as reason and goal.",
        "Reason annotation is further collected from a corpus which adds causal annotation to the Penn TreeBank (Bethard et al., 2008).",
        "A total of 5 and 29 instances for axioms 3 and 4 were found.",
        "For all of them, the axioms yield a valid inference.",
        "For example, Buick [approached]y American express about [a joint promotion]x because [its card holders generally have a good credit history]z. PropBank annotation states GOA(x, y) and REA-1(y, z), axiom 4 makes the implicit relation I FL-1 (x, z) explicit."
      ]
    },
    {
      "heading": "7. Applications and Results",
      "text": [
        "Problem There is no agreement on a set of relations that best represent text semantics.",
        "This is rightfully so since different applications and domains call for different relations.",
        "CSR can be used to rapidly customize a set of relations without having to train a new SP or modify any other tool.",
        "Given a text, the SP extracts 26 elementary semantic relations.",
        "Axioms within the framework of CSR yield n new relations, resulting in a richer semantic representation (Figure 2).",
        "CSR axioms Two ways to get new relations are:",
        "(i) Direct mapping.",
        "This is the easiest case and it is equivalent to rename a relation.",
        "For example, we can map POS to BELONG or IS-OWNER-OF.",
        "(1) reason o goal",
        "(2) reason o goal",
        "reason X -5> ?",
        "J",
        "goal",
        "reason X ~s- ?",
        "J",
        "goal",
        "(3) goal o reason",
        "(4) goal o reason",
        "x",
        "goal",
        "N",
        "y",
        "c",
        "1 3 Z",
        "reason",
        "a",
        "goal",
        "y",
        "1 ~e-z",
        "reason",
        "Table 5: RTE3 examples and their elementary semantic relations (i.e., the ones the SP detects).",
        "Only relevant semantic relations for entailment detection are shown for T.",
        "the following axiom: AGENT(x, y) o THEME-1 (y, z) – ARRESTED(x, z) provided that y is an arrested concept.",
        "A simple way of checking if a given concept is of a certain kind is to check WordNet.",
        "Collecting all the words belonging the the synset arrest.v.",
        "1, we get the following list of arrested concepts: collar, nail, apprehend, pick up, nab and cop.",
        "Using lexical chains the list could be further improved.",
        "More examples of axioms for generating customized semantic relations are shown in Table 4.",
        "Results Virtually any domain could be covered by applying customization over the set of 26 relations.",
        "The set has been successfully customized to a law enforcement domain.",
        "Ax-",
        "Semantic Parser Inference axioms"
      ]
    },
    {
      "heading": "26. relations",
      "text": [
        "CSR s.",
        "(ii) Combinations of two elementary relations yield new specialized relations.",
        "In this case, restrictions on the arguments must be fulfilled.",
        "Consider we need the new relation AR-RESTED(x, y), which encodes the relation between two animate concrete objects x and y, where x arrested y.",
        "We can infer this relation by using ioms for a total of 37 new relations were defined and implemented.",
        "Among others, axioms to infer is-employer, is-coworker, is-paramour, is-interpreter, was-assassin, attends-school-at, jailed-at, cohabits-with, affiliated-to, married-to, rented-by, kidnapped-by and the relations in Table 4 were defined.",
        "Note that a relation can be inferred by several axioms.",
        "This customization effort to add 37 new specialized relations took a person only a few days and without modifying the SP.",
        "Axiom",
        "Rest, on y",
        "Example",
        "agt(x, y) ° thm~X(y, z) – y arreste d(x, z) THM(x, y) o AT-L(y, z) – y arrested AT(x, z) agt(x, y) o at-L(y, z) – y banks-at(x, z) pos(x, y) o at-L(y, z) – y banks-at(x, z)",
        "arrested concept arrested concept banking activity account concept",
        "[Policejx [apprehendedjy 51 [football fans]z.",
        "Police [apprehendedjy 51 [fans]x [near the Dome]z.",
        "[Johnjx [withdrewjy $20 [at the nearest Chase]z.",
        "[Johnjx got a [checkbookjy at [Chase]z.",
        "Pair",
        "TextT",
        "Hypothesis H",
        "Belknap married and lost his first two wives, Cora LeRoy and Carrie",
        "Belknap was married to Carrie Tomlinson.",
        "Tomlinson, and married Mrs. John Bower, his second wife's sister.",
        "113",
        "Tl T2 T3 T4",
        "AGT(Belknap, married) THM(wives, married) QNT(firsf two, wives) ISA(Carrie Tomlinson, wives)",
        "HI H2",
        "AGJ(Belknap, was married)",
        "THM(Carrie Tomlinson, was married )",
        "India's yearly pilgrimage to the Ganges river, worshiped by Hindus as",
        "Ganga is a Hindu goddess.",
        "429",
        "the goddess Ganga, is the world's largest gathering of people, ...",
        "Tl T2 T3",
        "AGT(Hindus, worship) THM(Ganga, worship) ISA(Ganga, goddess)",
        "HI H2",
        "ISA(Ganga, goddess) \\AL(Hindu, goddess)",
        "[... ] At present day YouTube represents the most popular site sharing",
        "YouTube is a video website.",
        "on-line video.",
        "445",
        "Tl T2 T3",
        "ISA(YouTube, site) EXP(s/fe, sharing) THM(video, sharing)",
        "HI H2",
        "lSA(YouTube, website) VAL(video, website)",
        "The Czech and Slovak republics have been unable to agree a political",
        "The Czech and Slovak republics do not agree to coexist in one country.",
        "716",
        "basis for their future coexistence in one country.",
        "Tl",
        "T2 T3",
        "AGT(The Czech and Slovak republics, have been unable to agree)",
        "JHM(political basis, have been unable to agree) PRP(tf]e/r future coexistence in one country, political basis)",
        "HI H2",
        "AGJ(The Czech and Slovak republics, do not agree)",
        "PRP(coexist in one country, do not agree)",
        "In 2003, Yunus brought the microcredit revolution to the streets of",
        "Yunus supported more than 50,000 Struggling Members.",
        "Bangladesh to support more than 50,000 beggars, whom the Grameen",
        "Bank respectfully calls Struggling Members.",
        "771",
        "Tl T2 T3 T4 T5",
        "AGT(Yunus, brought) PRP(support, brought) RCP(beggars, support) QNT(more than 50,000, beggars) SYN(beggars, Struggling Members)",
        "HI",
        "H2 H3",
        "AGJ(Yunus, supported)",
        "RCP(Struggling Members, support) QNT(more than 50,000, Struggling Members)",
        "Text",
        "Problem An application of CSR is recognizing entailments.",
        "Given text T and hypothesis H, the task consists on determining whether or not H can be inferred by T (Giampiccolo et al., 2007).",
        "CSR axioms Several examples of the RTE3 challenge can be solved by applying CSR (Table 5).",
        "The rest of this section depicts the axioms involved in detecting entailment for each pair.",
        "Pair 113 is a simple one.",
        "A perfect match for H in T can be obtained by an axiom reading all concepts inherit the semantic relations oftheir hypernyms.",
        "Formally, isa(x, y) o thm(y, z) – thm(x, z), T2 and T4 are the premises and the conclusion matches H2.",
        "T1 matches H1.",
        "Pair 429 can be solved by an axiom reading agents are values for their themes.",
        "Formally, agt(x, y) o thm-1(y, z) – val(x, z); T1 and T2 yield val(Hindu, Ganga), which combined with T3 results in a match between T and H.",
        "Pair 445 follows a similar pattern, but the way an exp combines with its thm differs from the way an agt does.",
        "The theme is a value ofthe experiencer, thm(x, y) o exp-1(y, z) – val(x, val(video, site).",
        "Assuming that syn(site, website), T1 and T4 match H.",
        "Pair 716 also requires only one inference step.",
        "Using T3 and T2, an axiom reading situations have as their purpose the purpose ofits theme infers H2, yielding a perfect match between T and H. Formally, prp(x, y) o thm(y, z) – prp(x, z).",
        "Pair 771 Using as premises T1 and T2, an axiom reading an agent performs the purposes ofits actions infers H1.",
        "Using T3 and T5, and T4 and T5 as premises, an axiom reading synony- mous concepts are interchangeable infers H2 and H3, resulting in a perfect match between T and H. Formally, agt(x, y) o prp-1 (y, z) – agt(x, z), rcp-1(x, y) o syn(y, z) – rcp-1(x, z) and qnt(x, y) o syn(y, z) – qnt(x, z).",
        "Results We conducted two experiments to quantify the impact of CSR in detecting entailments.",
        "First, 60 pairs were randomly selected from the RTE3 challenge and parsed with the SP.",
        "14 of them (23%) could be solved by simply matching the elementary relations in T and H. After applying CSR, 21 more pairs (35%) were solved.",
        "Thus, adding CSR on top of the SP clearly improves entailment detection.",
        "Out of the 25 pairs not solved, 5 (8%) need coreference resolution and 20 (34%) require commonsense knowledge or fairly complicated reasoning methods (e.g. a shipwreck is a ship that sank).",
        "CSR has also been added to a state of the art system for detecting textual entailment (Tatu and Moldovan, 2007).",
        "Prior to the addition, the system made 222 errors consisting of 46 false negatives (examples in Table 5) and 176 false positives.",
        "CSR was able to correctly solve 18 (39%) of the 46 false negatives."
      ]
    },
    {
      "heading": "8. Conclusions",
      "text": [
        "Although the idea of chaining semantic relations has been proposed before, this paper provides a formal framework establishing necessary conditions for composition of semantic relations.",
        "The CSR presented here can be used to rapidly customize a set of relations to any arbitrary domain.",
        "In addition to the customization of an information extraction tool and recognizing textual entailments, CSR has the potential to contribute to other applications.",
        "For example, it can help improve a semantic parser, it can be used to acquire com-monsense knowledge axioms and more.",
        "When an axiom that results from combining two relations does not always hold, it may be possible to add constraints that limit the arguments of the premises to only some concepts.",
        "This work stems from the need to automate the extraction of deep semantics from text and representing text as semantic triples.",
        "The paper demonstrates that CSR is able to extract more relations than a normal semantic parser would."
      ]
    }
  ]
}
