{
  "info": {
    "authors": [
      "Yufang Hou",
      "Katja Markert",
      "Michael Strube"
    ],
    "book": "EMNLP",
    "id": "acl-D13-1077",
    "title": "Cascading Collective Classification for Bridging Anaphora Recognition using a Rich Linguistic Feature Set",
    "url": "https://aclweb.org/anthology/D13-1077",
    "year": 2013
  },
  "references": [
    "acl-C96-1084",
    "acl-E12-1081",
    "acl-J00-4003",
    "acl-J04-3003",
    "acl-J08-1001",
    "acl-J95-2003",
    "acl-J98-2001",
    "acl-N13-1099",
    "acl-N13-1111",
    "acl-P04-1019",
    "acl-P10-1005",
    "acl-P12-1084",
    "acl-T75-2034",
    "acl-W03-1023",
    "acl-W06-1612",
    "acl-W12-1632"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Recognizing bridging anaphora is difficult due to the wide variation within the phenomenon, the resulting lack of easily identifiable surface markers and their relative rarity.",
        "We develop linguistically motivated discourse structure, lexico-semantic and genericity detection features and integrate these into a cascaded minority preference algorithm that models bridging recognition as a subtask of learning fine-grained information status (IS).",
        "We substantially improve bridging recognition without impairing performance on other IS classes."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In bridging or associative anaphora (Clark, 1975; Prince, 1981; Gundel et al., 1993), the antecedent and anaphor are not coreferent but are linked via a variety of contiguity relations.1 In Example 1, the phrases a resident, the stairs and the lobby are bridging anaphors with the antecedent One building.2",
        "(1) One building was upgraded to red status while peo",
        "ple were taking things out, and a resident called up the stairs to his girlfriend, telling her to keep sending things down to the lobby.",
        "Bridging is an important problem as it affects linguistic theory and applications alike.",
        "For example, without bridging resolution, entity coherence between the first and second coordinated clause in 1We exclude comparative anaphora where anaphor and antecedent are in a similarity/exclusion relation, indicated by anaphor modifiers such as other or similar (Modjeska et al., 2003).",
        "2Examples are from OntoNotes (Weischedel et al., 2011).",
        "Bridging anaphora are set in boldface; antecedents in italics.",
        "Example 1 cannot be established.",
        "This is a problem both for coherence theories such as Centering (Grosz et al., 1995) (where bridging is therefore incorporated as an indirect realization of previous entities) as well as applications relying on entity coherence modelling, such as readability assessment or sentence ordering (Barzilay and Lapata, 2008).",
        "Full bridging resolution needs (i) recognition that a bridging anaphor is present and (ii) identification of the antecedent and contiguity relation.",
        "In recent work, these two tasks have been tackled separately, with bridging recognition handled as part of information status (IS) classification (Markert et al., 2012; Cahill and Riester, 2012; Rahman and Ng, 2012).",
        "Each mention in a text gets assigned one IS class that describes its accessibility to the reader at a given point in a text, bridging being one possible class.",
        "We stay within this framework.",
        "Bridging recognition is a difficult task, so that we had to report very low results on this IS class in previous work (Markert et al., 2012).",
        "This is due to the phenomenon's variety, leading to a lack of clear surface features for recognition.",
        "Instead, we formulate in this paper novel discourse structure and lexico-semantic features as well as features that distinguish bridging from generics (see Section 3).",
        "In addition, making up between 5% and 20% of definite descriptions (Gardent and Manue?lian, 2005; Caselli and Prodanof, 2006) and around 6% of all NPs (Markert et al., 2012), bridging is still less frequent than many other IS classes and recognition of minority classes is well known to be more difficult.",
        "We therefore use a cascaded classification algorithm to address this problem (Omuya et al., 2013)."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Most bridging research concentrates on antecedent selection only (Poesio and Vieira, 1998; Poesio et al., 2004a; Markert et al., 2003; Lassalle and Denis, 2011; Hou et al., 2013), assuming that bridging recognition has already been performed.",
        "Previous work on recognition is either limited to definite NPs based on heuristics evaluated on small datasets (Hahn et al., 1996; Vieira and Poesio, 2000), or models it as a subtask of learning fine-grained IS (Rahman and Ng, 2012; Markert et al., 2012; Cahill and Riester, 2012).",
        "Results within this latter framework for bridging have been mixed: We reported in Markert et al. (2012) low results for bridging in written news text whereas Rahman and Ng (2012) report high results for the four subcategories of bridging annotated in the Switchboard dialogue corpus by Nissim et al. (2004).",
        "We believe this discrepancy to be due to differences in corpus size and genre as well as in bridging definition.",
        "Bridging in Switchboard includes non-anaphoric, syntactically linked part-of and set-member relationships (such as the building's lobby), as well as comparative anaphora, the latter being marked by surface indicators such as other, another etc.",
        "Both types are much easier to identify than anaphoric bridging cases.3 In addition, many non-anaphoric lexical cohesion cases have been annotated as bridging in Switchbard as well.",
        "We also separate bridging recognition and antecedent selection.",
        "One could argue that a joint model is more attractive as potential antecedents such as building ?trigger?",
        "subsequent bridging cases such as stairs (Example 1).",
        "However, bridging can be indicated by referential patterns without world knowledge about the anaphor/antecedent NPs, as the nonsense example 2 shows: the wug is clearly a bridging anaphor although we do not know the antecedent.4 (2) The blicket couldn't be connected to the dax.",
        "The wug failed.",
        "Similarly, Clark (1975) distinguishes between bridging via necessary, probable and inducible parts/roles and argues that only in the first and",
        "bridging anaphor in the sense that we already spontaneously think of the anaphor when we read the antecedent.",
        "Also, bridging recognition on its own can be valuable for applications: for example, prosody is influenced by IS status without needing antecedent knowledge (Baumann and Riester, 2013)."
      ]
    },
    {
      "heading": "3 Characterizing Bridging Anaphora for",
      "text": []
    },
    {
      "heading": "Automatic Recognition 3.1 Properties of bridging anaphora",
      "text": [
        "Bridging anaphors are rarely marked by surface features.",
        "Indeed, even the common practice (Vieira and Poesio, 2000; Lassalle and Denis, 2011; Cahill and Riester, 2012) to limit bridging to definite NPs does not seem to be correct: We report in previous work (Hou et al., 2013) that less than 40% of the bridging anaphora in our corpus are definites.",
        "Instead, bridging is diverse with regard to syntactic form and function: bridging anaphora can be definite NPs (Examples 4 and 6), indefinite NPs (Example 5) or bare NPs (Examples 3, 8 and 9).",
        "The only frequent syntactic property shared is that bridging NPs tend to have a simple internal structure with regards to modification.",
        "Bridging is also easily confused with generics: friends is used as bridging anaphor in Example 9 but generically in Example 10.",
        "(3) .",
        ".",
        ".",
        "meat .",
        ".",
        ".",
        "The Communists froze prices instead.",
        "(4) .",
        ".",
        ".",
        "the fund's building .",
        ".",
        ".",
        "The budget was only $400,000.",
        "(5) .",
        ".",
        ".",
        "employees .",
        ".",
        ".",
        "A food caterer stashed stones in the false bottom of a milk pail.",
        "(6) .",
        ".",
        ".",
        "his truck .",
        ".",
        ".",
        "The farmer at the next truck shouts, ?Wheat!?",
        "(7) .",
        ".",
        ".",
        "the firms .",
        ".",
        ".",
        "Crime was the reason that 26% reported difficulty recruiting personnel and that 19% said they were considering moving.",
        "(8) .",
        ".",
        ".",
        "the company .",
        ".",
        ".",
        "His father was chairman and chief executive until his death in an accident five years ago.",
        "(9) .",
        ".",
        ".",
        "Josephine Baker .",
        ".",
        ".",
        "Friends pitched in.",
        "(10) Friends are part of the glue that holds life and faith together.",
        "Bridging anaphora can have almost limitless variation.",
        "However, we observe that bridging anaphors are often licensed because of discourse structure",
        "cates binary, n nominal, r relational features.",
        "and/or lexical or world knowledge.",
        "With regard to discourse structure, Grosz et al. (1995) observe that bridging is often needed to establish entity coherence between two adjacent sentences (Examples 1, 2, 4, 5, 6, 7 and 9).",
        "With regard to lexical and world knowledge, relational noun phrases (Examples 3, 4, 8 and 9), building parts (Example 1), set membership elements (Example 7), or, more rarely, temporal/spatial modification (Example 6) may favor a bridging reading.",
        "Motivated by these observations, we develop discourse structure and lexico-semantic features indicating bridging anaphora as well as features designed to separate genericity from bridging."
      ]
    },
    {
      "heading": "3.2 Features",
      "text": [
        "In Markert et al. (2012) we classify eight fine-grained IS categories for NPs in written text: old, new and 6 mediated categories (syntactic, world-Knowledge, bridging, comparative, aggregate and function).",
        "This feature set (Table 1, f1-f13) works well to identify old, new and several mediated categories.",
        "However, it fails to recognize most bridging anaphora which we try to remedy in this work by including more diverse features.",
        "Discourse structure features (Table 2, f1-f3).",
        "Bridging occurs frequently in sentences where otherwise there would no entity coherence to previous sentences/clauses (see Grosz et al. (1995) and Poesio et al. (2004b) for discussions about bridging, entity coherence and centering transitions in the Centering framework).",
        "This is especially true for topic NPs (Halliday and Hasan, 1976) in such sentences.",
        "We follow these insights by identifying coherence gap sentences (see Examples 1, 4, 5, 6, 7, 9 and also 2): a sentence has a coherence gap (f1) if it has none",
        "of the following three coherence elements: (1) entity coreference to previous sentences, as approximated via string match or presence of pronouns, (2) comparative anaphora approximated by mentions modified via a small set of comparative markers (see also Table 1, f10 PreModByCompMarker), or (3) proper names.",
        "We approximate the topic of a sentence via the first mention (f2).",
        "f3 models that bridging anaphors do not appear at the beginning of a text.",
        "Semantic features (Table 2, f4-f10).",
        "In contrast to generic patterns, our semantic features capture lexical properties of nouns that make them more likely to be the head of a bridging NP.",
        "We create f4-f8 to capture four kinds of bridging anaphora.",
        "Lo?bner (1985) distinguishes between relational nouns that take on at least one obligatory semantic role (such as friend) and sortal nouns.",
        "It is likely that relational nouns are more frequently used as bridging than sortal nouns (see Examples 3, 4, 8 and 9).",
        "We extract a list containing around 4,000 relational nouns from WordNet and a list containing around 500 nouns that specify professional roles from the General Inquirer lexicon (Stone et al., 1966), then determine whether the NP head appears in these lists",
        "or not (f4 and f5).",
        "The obligatory semantic role for a relational noun can of course also be filled NP internally instead of anaphorically and we use the features f10 (for instances such as the Egyptian president) and f18 (for complex NPs that are likely to fill needed roles NP internally) to address this.",
        "Because part-of relations are typical bridging relations (see Example 1 and Clark (1975)), we use f6 to determine whether the NP is a part of the building or not, using again a list extracted from Inquirer.",
        "f7 is used to identify set membership bridging cases (see Example 7), by checking whether the NP head is a number or indefinite pronoun (such as none, one, some) or modified by each, one.",
        "However, not all numbers are bridging cases (such as 1976) and we use f9 to exclude such cases.",
        "Lassalle and Denis (2011) note that some bridging anaphors are indicated by spatial or temporal modifications (see Example 6).",
        "We use f8 to detect this by compiling 20 such adjectives from Inquirer.",
        "Features to detect generic nouns (Table 2, f11f15).",
        "Generic NPs (Example 10) are easily confused with bridging anaphora.",
        "Inspired by Reiter and Frank (2010) who build on linguistic research, we develop features (f11-f15) to exclude generics.",
        "First, hypothetical entities are likely to refer to generic entities (Mitchell et al., 2002), We approximate this by determining whether the NP appears in an if-clause (f11).",
        "Also the clause tense and mood may play a role to decide genericity (Reiter and Frank, 2010).",
        "This is often reflected by the main verb of a clause, so we extract its POS tag (f12).",
        "Some NPs are commonly used generically, such as children, men, or the dollar.",
        "The ACE-2 corpus (distinct from our corpus) contains generic annotation .",
        "We collect all NPs from ACE-2 that are always used generically (f13).",
        "We also try to learn NPs that are uniquely identifiable without further description or anaphoric links such as the sun or the pope.",
        "We do this by extracting common nouns which are annotated as worldKnowledge from the training part of our corpus5 and use these as lexical features (f14).",
        "Finally, motivated by the ACE-2 annotation guidelines, we identify six quantifiers that may indicate genericity, such as all, no, neither (f15).",
        "Other features for bridging (Table 2, f16-f18).",
        "Following Rahman and Ng (2012), we use unigrams (f16).",
        "We also extract heads of bridging anaphors from the training data as lexical features (f17) to learn typical nouns used for bridging that we did not cover in lexicon extraction (f4 to f6).",
        "Feature f18 models that bridging anaphora most often have a simple internal structure and usually do not contain any other NPs.",
        "Features for other IS categories (Table 2, f19f21).",
        "We propose three features to improve other IS categories.",
        "In the relational feature f19, we separate coordination parent-child from other parent-child relations to help with the class aggregate.",
        "f20 determines whether a number is the object of an increase/decrease verb (using a list extracted from Inquirer) and therefore likely to be the IS class function.",
        "Frequent proper names are more likely to be hearer old and hence of the class worldKnowledge.",
        "f21 extracts proper names that occur in at least 100 documents in the Tipster corpus to approximate this."
      ]
    },
    {
      "heading": "4 Experiments and Results",
      "text": [
        "Experimental setup.",
        "We perform experiments on the corpus provided in Markert et al. (2012)6.",
        "It consists of 50 texts taken from the WSJ portion of the OntoNotes corpus (Weischedel et al., 2011) with almost 11,000 NPs annotated for information status including 663 bridging NPs and their antecedents.",
        "All experiments are performed via 10-fold cross-validation on documents.",
        "We use gold standard mentions and the OntoNotes named entity and syntactic annotation layers for feature extraction.",
        "Reimplemented baseline system (rbls).",
        "rbls uses the same features as Markert et al. (2012) (Table 1) but replaces the local decision tree classifier with LibSVM as we will need to include lexical features.",
        "rbls + Table 2 feature set (rbls+newfeat).",
        "Based on rbls, all the new features from Table 2 are added.",
        "Cascading minority preference system (cmps).",
        "Minority classes such as bridging suffer during standard multi-class classification.",
        "Inspired by Omuya",
        "et al (2013), we develop a cascading minority preference system for fine-grained IS classification.",
        "For the five minority classes (function, aggregate, comparative, bridging and worldKnowledge) that each make up less than the expected 18 of the data set, we develop five binary classifiers with LibSVM7 using all features from Tables 1 and 2 and apply them in order from rarest to more frequent category.",
        "Whenever a minority classifier predicts true, this class is assigned.",
        "When all minority classifiers say false, we back off to the multiclass rbls+newfeat system.",
        "cmps ?",
        "Table 2 feature set (cmps?newfeat).",
        "To test the effect of using the minority preference system without additional features, we employ a cmps system with baseline features from Table 1 only."
      ]
    },
    {
      "heading": "Results and Discussion (Table 3). Our novel",
      "text": [
        "features in rbls+newfeat show improvements for worldKnowledge, aggregate and function as well as bridging categories compared to both baseline systems, although the performance for bridging is still low.",
        "In addition, the overall accuracy is significantly better than the two baseline systems (at the level of 1% using McNemar's test).",
        "Using the cascaded minority preference system cmps in addition improves bridging results substantially while the performance on other categories does not worsen.",
        "The algorithm needs both our novel feature classes as well as cascaded modelling to achieve this improvement as the comparison to cmps?newfeat shows: the latter lowers overall accuracy as it tends to overgenerate rare 7Parameter against data imbalance is set according to the ratio between positive and negative instances in the training set.",
        "classes (including bridging) with low precision if the features are not strong enough.",
        "Our novel features (addressing linguistic properties of bridging) and the cascaded algorithm (addressing data sparseness) appear to be complementary.",
        "To look at the impact of features in our best system, we performed an ablation study.",
        "Lexical features as well as semantic ones have the most impact.",
        "Discourse structure and genericity information features have less of an impact.",
        "We believe the latter to be due to noise involved in extracting these features (such as approximating coreference for the coherence gap feature) as well as genericity recognition still being in its infancy (Reiter and Frank, 2010)."
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "This paper aims to recognize bridging anaphora in written text.",
        "We develop discourse structure, lexico-semantic and genericity features based on linguistic intuition and corpus research.",
        "By using a cascading minority preference system, we show that our approach outperforms the bridging recognition in Markert et al. (2012) by a large margin without impairing the performance on other IS classes.",
        "Acknowledgements.",
        "Yufang Hou is funded by a PhD scholarship from the Research Training Group Coherence in Language Processing at Heidelberg University.",
        "Katja Markert receives a Fellowship for Experienced Researchers by the Alexander-von-Humboldt Foundation.",
        "We thank HITS gGmbH for hosting Katja Markert and funding the annotation."
      ]
    }
  ]
}
