{
  "info": {
    "authors": [
      "Abhishek Arun",
      "Barry Haddow",
      "Philipp Koehn"
    ],
    "book": "Proceedings of the Joint Fifth Workshop on Statistical Machine Translation and MetricsMATR",
    "id": "acl-W10-1756",
    "title": "A Unified Approach to Minimum Risk Training and Decoding",
    "url": "https://aclweb.org/anthology/W10-1756",
    "year": 2010
  },
  "references": [
    "acl-D07-1055",
    "acl-D07-1103",
    "acl-D08-1023",
    "acl-D08-1024",
    "acl-D08-1064",
    "acl-D08-1065",
    "acl-D09-1005",
    "acl-D09-1147",
    "acl-J07-2003",
    "acl-N04-1022",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P06-2101",
    "acl-P07-2045",
    "acl-P08-1024",
    "acl-P09-1019",
    "acl-P09-1064",
    "acl-P09-1067",
    "acl-W09-1114"
  ],
  "sections": [
    {
      "text": [
        "Abhishek Arun, Barry Haddow and Philipp Koehn",
        "We present a unified approach to performing minimum risk training and minimum Bayes risk (MBR) decoding with BLEU in a phrase-based model.",
        "Key to our approach is the use of a Gibbs sampler that allows us to explore the entire probability distribution and maintain a strict probabilistic formulation across the pipeline.",
        "We also describe a new sampling algorithm called corpus sampling which allows us at training time to use BLEU instead of an approximation thereof.",
        "Our approach is theoretically sound and gives better (up to +0.6%bleu) and more stable results than the standard MERT optimization algorithm.",
        "By comparing our approach to lattice MBR, we are also able to gain crucial insights about both methods."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "According to statistical decision theory, the optimal decision rule for any statistical model is the solution that minimizes its risk (expected loss).",
        "This solution is often referred to as the Minimum Bayes Risk (MBR) solution (Kumar and Byrne, 2004).",
        "Since machine translation (MT) models are typically evaluated by BLEU (Papineni et al., 2002), a loss function which rewards partial matches, the MBR solution is to be preferred to the Maximum A Posteriori (MAP) solution.",
        "In most statistical MT (SMT) systems, MBR is implemented as a reranker of a list of translations generated by a first-pass decoder.",
        "This decoder typically assigns unnormalised log probabilities (known as scores) to each translation hypoth-",
        "!We use the term list to denote any enumerable representation of translation hypotheses e.g n-best list, translation lattice or forest.",
        "esis, so these scores must be converted to probabilities in order to apply MBR.",
        "In order to perform this conversion, it is first necessary to compute the normalization function Z.",
        "Since Z is defined as an intractable sum over all possible translations, it is approximated by summing over the translations in the list.",
        "The second step is to find the correct scale factor for the scores using a hyper-parameter search over held-out data.",
        "This is needed because the model parameters for the first-pass decoder are normally learnt using MERT (Och, 2003), which is invariant under scaling of the scores.",
        "Both these steps are theoretically unsatisfactory methods of estimating the posterior probability distribution since the approximation to Z is an unbounded term and the scaling factor is an artificial way of inducing a probability distribution.",
        "Recently, (Tromble et al., 2008; Kumar et al., 2009) have shown that using a search lattice to improve the estimation of the true probability distribution can lead to improved MBR performance.",
        "However, these approaches still rely on MERT for training the base model, and in fact introduce several extra parameters which must also be estimated using either grid search or a second MERT run.",
        "The lattice pruning required to make these techniques tractable is quite drastic, and is in addition to the pruning already performed during the search.",
        "Such extensive pruning is liable to render any probability estimates heavily biased (Blunsom and Osborne, 2008; Bouchard-Cote et al., 2009).",
        "Here, we present a unified approach to training and decoding in a phrase-based translation model (Koehn et al., 2003) which keeps the objective constant across the translation pipeline and so obviates the need for any extra hyper-parameter fitting.",
        "We use the phrase-based Gibbs sampler of Arun et al.",
        "(2009) at training time to compute the gradient of our minimum risk training objective in order to apply first-order optimization techniques, and at test time we use it to estimate the posterior distribution required by MBR (Section 3).",
        "We experimented with two different objective functions for training (Section 4).",
        "First, following (Arun et al., 2009), we define our objective at the sentence-level using a sentence-level variant of bleu.",
        "Then, in order to reduce the mismatch between training and test loss functions, we also tried directly optimising the expected corpus level b le u, where we introduce a novel sampling technique, which we call corpus sampling to calculate the required expectations.",
        "The methods presented in this paper are theoretically sound.",
        "Moreover, experimental evidence on three language pairs shows that our training regime is more stable than MERT, able to generalize better and generally leads to improvement in translation when used with sampling based MBR (Section 5).",
        "An added benefit is that the trained weights also lead to better performance when used with a beam-search based decoder."
      ]
    },
    {
      "heading": "2. Inference methods for MT",
      "text": [
        "We assume a phrase-based machine translation model, defined with a log-linear form, with feature function vector h and parametrized by weight vector 0, as described in Koehn et al.",
        "(2003).",
        "The input sentence, f, is segmented into phrases, which are sequences of adjacent words.",
        "Each source phrase is translated into the target language, to produce an output sentence e and an alignment a representing the mapping from source to target phrases.",
        "Phrases are allowed to be reordered.",
        "MAP decoding under this model consists of finding the most likely output string, e* :",
        "where A(e, f ) is the set of all derivations of output string e given source string f.",
        "Summing over all the derivations is intractable, making approximations necessary.",
        "The most common of these approximations is the Viterbi approximation, which simply chooses the most likely derivation (e*, a* ).",
        "This approximation can be computed in polynomial time via dynamic programming (DP).",
        "Though fast and effective for many problems, it has two serious drawbacks for probabilistic inference.",
        "First, the error incurred by the Viterbi maximum with respect to the true model maximum is unbounded.",
        "Second, the DP solution requires substantial pruning and restricts the use of non-local features.",
        "The latter problem persists even in the variational approximations of Li et al.",
        "(2009), which attempt to solve the former.",
        "An alternate approximate inference method for phrase-based MT without any of the previously mentioned drawbacks is the Gibbs sampler (Gewhich draws samples from the posterior distribution of the translation model.",
        "For the work presented in this paper, we use this sampler.",
        "The sampler produces a sequence of samples, SN = (ei, ai)... (eN, aN), that are drawn from the distribution p(e, a|f ).",
        "These samples can be used to estimate the expectation of a function h(e, a, f ) as follows:",
        "In this work, we are interested in performing MBR decoding with bleu.",
        "We define the MBR decision rule following Tromble et al.",
        "(2008):",
        "where eH refers to the hypothesis space from which translations are chosen, eE refers to the evidence space used for calculating risk and bleue(e') is a gain function that indicates the reward of hypothesising e' when the reference solution is e.",
        "To perform MBR decoding using the sampler, let the function h in Equation 3 be the indicator function h = ö(a, â)£(e, ê).",
        "Then, Equation 3 provides an estimate of p(â, ê|f ), and using h = ö(e, ê) marginalizes over all derivations a', yielding an estimate of p(ê|f ).",
        "MBR is computed at the sentence-level while bleu is a corpus-level metric, so instead we use a sentence-level approximation of bleu.",
        "The sampler can be used to perform two other decoding tasks: the mode of the estimated distribution p(â,êf) is the maximum derivation (MaxDeriv) solution while the mode of p(ê|f ) is the maximum translation (MaxTrans) solution."
      ]
    },
    {
      "heading": "4. Minimum Risk Training",
      "text": [
        "In order to train models suitable for use with MaxTrans or MBR decoding, we need to employ a training method which takes account of the whole distribution.",
        "To this end, we employ minimum risk training to find weights 6 for Equation 1 that minimize the expected loss on the training set.",
        "We consider two variants of minimum risk training: sentence sampling optimizes an objective defined at the sentence level and corpus sampling a corpus-based objective.",
        "Since bleu, the metric we care about, is a gain function, our objective function maximizes the expected gain of our model.",
        "The expected gain, G of a probabilistic translation model on a corpus D, defined with respect to the gain function bleue(e) is given by where eâ is the reference translation, e is a hypothesis translation and bleu refers to the sentence-level approximation of the metric.",
        "Using the probabilistic formulation of Equation 1, the optimization of the objective in (5) is facilitated by the fact that it is continuous and differentiable with respect to the model parameters 6 to",
        "Since the gradient is expressed in terms of expectations of feature values, it can easily be calculated using the sampler and then first-order optimization techniques can be applied to find optimal values of 6.",
        "Because of the noise introduced by the sampler, we used stochastic gradient descent (SGD), with a learning rate that gets updated after each step proportionally to difference in successive gradients (Schraudolph, 1999).",
        "While our initial formulation of minimum risk training is similar to that of Arun et al.",
        "(2009), in preliminary experiments we observed a tendency for translation performance on held-out data to quickly increase to a maximum and then plateau.",
        "Hypothesizing that we were being trapped in local maxima as G is non-convex, we decided to employ deterministic annealing (Rose, 1998) to smooth the objective function to ensure that the optimizer explored as large a region as possible of the space before it settled on an optimal weight set.",
        "Our instantiation of deterministic annealing (DA) is based on the work of Smith and Eisner (2006), and involves the addition of an entropic prior to the objective in Equation 5 to give where H(p) is the entropy of the probability distribution p(e, a|f ), and T > 0 is a temperature paramater which is gradually lowered as the optimization progresses according to some annealing schedule.",
        "Differentiating with respect to 6k then shows that the annealed gradient is given by the following expression:",
        "A high value of T leads the optimizer to find weights which describe a fairly flat distribution, whereas a lower value of T pushes the optimizer towards a more peaked distribution.",
        "We perform 10 to 20 iterations of SGD at each temperature.",
        "In their deterministic annealing formulation, (Smith and Eisner, 2006; Li and Eisner, 2009), express the parameterization of the distribution 0 as y0 (where 7 is the scaling factor) and perform optimization in two steps, the first optimizing 0 and the second optimizing 7.",
        "We experimented with this two stage optimization process, but found that simply performing an unconstrained optimization on 0 gave better results.",
        "While the objective functions in Equations 5 and 4.1 use a sentence-level variant of bleu, the model's test-time performance is evaluated with corpus level bleu.",
        "The lack of correlation between sentence-level bleu and corpus bleu is well-known (Chiang et al., 2008a).",
        "Therefore, in an effort to address this issue, we tried maximizing expected corpus bleu directly.",
        "In other words, given a training corpus of the form (CF, Ce) where CF is a set of source sentences and Ce its corresponding reference translations, we consider a gain function defined on the hypothesized translation CE of the input CF with respect to Cg.",
        "The objective in equation 5 therefore becomes:",
        "The pair (CE, CF) is denoted as a corpus sample corresponding to a sequence (e, a ),..., (eN, aN) of derivations of the corresponding source strings f ,...,fN of source corpus CF.",
        "Although the sampler described in Section 2 generates samples at the sentence level, we can use it to generate corpus samples by applying the following procedure (see Figure 1).",
        "For each source sentence fi in the corpus, we generate a sequence of samples (ei, ai),..., (e^, a^) using the sampler.",
        "From each ofthese sequences ofsamples, we then resample new sequences of derivation samples, one for each source sentence in the corpus.",
        "The first corpus sample is then obtained by iterating through the source sentences and taking the first resampled derivation for each sentence, then the second corpus sample by taking the second re-sampled derivation, and so on.",
        "The resampling step is necessary to eliminate any biases due to the order of the generated samples.",
        "The corpus sampling procedure invariably generates a set of samples which are all distinct and so would give us a uniform estimate of the probability distribution P(CE|CF).",
        "However this is not a problem since we are not interested in evaluating the actual distribution; we just need to calculate expectations of feature values and BLEU scores over the distribution.",
        "The feature values of a corpus sample are the average of the feature values of its constituting derivations and its BLEU score is computed based on the yield of its derivations.",
        "When training using corpus sampling we process the training corpus in batches (CF, Ce ), treating each batch as a corpus in its own right, and updating the weights after each batch.",
        "The gradient for the objective function in (7) is:",
        "where hc is the k-th component of a corpus sample feature vector.",
        "During deterministic annealing for sentence sampling, the entropy term is computed over the",
        "Extract Corpus Samples",
        "Figure 1: Example illustrating the extraction of 2 corpus samples for a corpus of source sentences f1, f2, f3.",
        "In the first step, we sample 5 derivations for each source sentence.",
        "We then resample 2 derivations from the empirical distributions of each source sentence.",
        "distribution p(e, a| f) of each individual sentence.",
        "While corpus sampling, we are considering the distribution P(CE|CF) but the estimated distribution is always uniform.",
        "So we define the entropic prior term over the distribution p(e, a| f) of the sentences making up the corpus sample.",
        "The annealed corpus sampling objective is therefore:",
        "The gradient of this objective is of similar form to the sentence sampling gradient in Equation (6)."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "The experiments in this section were performed using the Europarl section of the French-English and German-English parallel corpora from the WMT09 shared translation task (Callison-Burchet al., 2009), as well as 300k parallel Arabic-English sentences from the NIST MT evaluation training data.",
        "For all language pairs, we constructed a phrase-based translation model as described in Koehn et al.",
        "(2003), limiting the phrase length to 5.",
        "The target side of the parallel corpus was used to train 3-gram language models.",
        "For the German and French systems, the DEV2006 set was used for model tuning and the first half of TEST2007 (in-domain) for heldout testing.",
        "Final testing was performed on NEWS-DEV2009B (out-of-domain) and the first half of TEST2008 (in-domain).",
        "For the Arabic system, the MT02 set (10 reference translations) was used for tuning and MT03 and MT05 (4 reference translations, each) were used for held-out testing and final testing respectively.",
        "To reduce the size of the phrase table, we used the association-score technique suggested by Johnson et al.",
        "(2007).",
        "Translation quality is reported using case-insensitive BLEU.",
        "Corpus Sample 1",
        "{A, F, L }",
        "Corpus Sample 2",
        "{B, E, L }",
        "Our baseline system is phrase-based Moses (Koehn et al., 2007) with feature weights trained using MERT.",
        "Moses and the Gibbs sampler use identical feature sets.",
        "The MERT optimization algorithm uses multiple random restarts to avoid getting stuck in a poor local optima.",
        "Therefore, every time MERT is run, it produces a slightly different final weight vector leading to varying test set results.",
        "While this characteristic of MERT is typically ignored, we account for it by performing MERT training 10 times for each of the 3 language pairs, decoding the test sets with each of the 10 optimized weight sets.",
        "We present the best and the worst test set results along with the mean and the standard deviation (<r) of these results in Table 1.",
        "We report results using the Moses implementation of Viterbi, nbest MBR and lattice MBR decoding (Kumar et al., 2009).",
        "For both nbest and lattice MBR decoding, the hypothesis set was composed of the top 1000 unique translations produced by the Viterbi decoder, and the same 1000 translations were used as evidence set for nbest MBR.",
        "As Table 1 shows, translation results using MERT optimized weights vary markedly from one sentences with confidence c > 0.995 in the ISI automatically extracted web parallel corpus (LDC2006T02).",
        "tuning run to the other, with results varying from a range of 0.3% bleu to 1.3% bleu when using Viterbi decoding.",
        "We also see that, bar in-domain German to English, MBR decoding gives a small improvement on all other datasets.",
        "Surprisingly, lattice MBR only gives improvements on two datasets and actually leads to a drop in performance on the other 3 datasets.",
        "We discuss possible reasons for this in Section 6.",
        "At training time, the optimization algorithm is initialized with zero weights and the sampler is initialized with a random derivation from Moses.",
        "To get rid of any initialization biases, the first 100 samples are discarded.",
        "We then run the sampler for 1000 iterations after which we perform reheating whereby the distribution is progressively flattened.",
        "Samples are not collected during this period.",
        "Reheating allows the sampler more mobility around the search space thus possibly escaping any local optima it might be trapped in.",
        "We subsequently run the sampler for 1000 more iterations.",
        "We denote this procedure as running 2 chains of the sampler.",
        "We use batch sizes of 96 randomly selected sentences for SGD optimization.",
        "During DA, our cooling schedule is an exponentially decaying one with decay rate set to 0.9, performing 20 iterations of SGD optimization at each temperature setting.",
        "Five training runs were performed and the bleu scores averaged.",
        "The feature weights were output every 50 iterations and performance measured on the heldout set by running the sampler as a decoder.",
        "At decode time, we use the same sampler configurations as during training but run 2 chains each for 5000 iterations.",
        "For MBR decoding, we use the entirety of this sample set as our evidence set and use the top 1000 most probable translations as the hypothesis set.",
        "For our corpus sampling experiments, we sample using the same procedure as in sentence sampling but using 2 chains of 2000 iterations.",
        "We then resample 2000 corpus samples from the empirical distribution estimated from the first 4000 samples.",
        "For Arabic-English training, we used batch sizes of 100 randomly selected sentences for experiments without DA and batches of 400 random",
        "Table 1: Baseline results - MERT trained models decoded using Viterbi, nbest MBR (nMBR) and lattice MBR (lMBR).",
        "MERT was run 10 times for each language pair.",
        "We report minimum, maximum, mean and standard deviation of test set BLEU scores across the 10 runs.",
        "Sentence Sampling, Without DA Sentence Sampling, With DA Corpus Sampling, Without DA Corpus Sampling, With DA",
        "Figure 2: Heldout performance for German-English training averaged across 5 minimum risk training runs.",
        "Best scores achieved are indicated by dotted line.",
        "sentences with DA.",
        "The size of the batches corresponds to the number of sentences that form a corpus sample.",
        "For German/French to English experiments, we used batches of 100 random sentences for training with and without DA.",
        "We perform 10 optimizations at each temperature setting during deterministic annealing.",
        "Test time conditions are identical to the sentence sampling ones and we measure performance on a held-out set after every 20 iterations of the learner.",
        "Figures 2 and 3 show the scores on the German-English and Arabic-English held-out sets respectively comparing all four training regimes: corpus vs sentence sampling, DA vs without DA.",
        "Results for French-English training are similar.",
        "We focus our analysis on the Arabic-English experimental setup.",
        "Without deterministic annealing, the learner converges quickly, usually after just 20 iterations, after which performance degrades steadily.",
        "The magnitudes of the weights are large, sharpening the distribution.",
        "There is not much diversity amongst the sampled derivations, i.e. the entropy of the sample set is low.",
        "Therefore, all 3 decoding regimes give very similar results.",
        "With the addition of the entropic prior, the model is slow to converge before the so-called phase transition occurs (usually after around 50 iterations), after which performance goes up to reach a peak (45.2 bleu) higher than that without the prior (44.2 BLEU), before steadily declining.",
        "The entropic prior encourages diversity among the sample set, especially at high temperature settings.",
        "In the presence of diversity, the benefits of marginalization over derivations is clear: MaxTrans does better than MaxDeriv and MBR does best, confirm recent findings of (Blunsom et al., 2008; Arun et al., 2009) that MaxTrans improves over MaxDeriv decoding for models trained to account for multiple derivations.",
        "As the temperature decreases to zero, the model sharpens, effectively intent on maximizing one-best performance and thus voiding the benefits of MaxTrans and MBR.",
        "Figures 2 and 3 also show that corpus sampling improves over sentence sampling, although not by much (+ 0.3 BLEU).",
        "Having established the superiority of the pipeline of expected corpus BLEU training with DA followed by MBR decoding over other alternatives considered, we compare it to the best results obtained with MERT optimized Moses (bold scores from Table 1).",
        "To account for sampler variance during both training and decoding, we average scores across 50 runs; 10 decoding runs each using the best weight set from 5 training runs.",
        "Results",
        "Viterbi",
        "nMBR",
        "lMBR",
        "min",
        "max",
        "mean",
        "a",
        "min",
        "max",
        "mean",
        "a",
        "min",
        "max",
        "mean",
        "a",
        "AR-EN MT05",
        "43.7",
        "44.3",
        "44.0",
        "0.17",
        "44.2",
        "44.5",
        "44.4",
        "0.13",
        "44.2",
        "44.6",
        "44.5",
        "0.12",
        "FR-EN In",
        "33.1",
        "33.4",
        "33.3",
        "0.10",
        "33.2",
        "33.6",
        "33.4",
        "0.12",
        "32.3",
        "32.7",
        "32.6",
        "0.13",
        "FR-EN Out",
        "19.1",
        "19.6",
        "19.4",
        "0.18",
        "19.3",
        "19.7",
        "19.5",
        "0.12",
        "19.1",
        "19.4",
        "19.3",
        "0.12",
        "DE-EN In",
        "27.6",
        "27.9",
        "27.8",
        "0.10",
        "27.6",
        "27.9",
        "27.7",
        "0.10",
        "27.2",
        "27.5",
        "27.4",
        "0.10",
        "DE-EN Out",
        "14.9",
        "16.2",
        "15.7",
        "0.33",
        "15.0",
        "16.3",
        "15.7",
        "0.33",
        "15.3",
        "16.4",
        "16.0",
        "0.30",
        "Corpus Sampling, Without DA Corpus Sampling, With DA Sentence Sampling, Without DA Sentence Sampling With DA",
        "Figure 3: Heldout performance for Arabic-English training averaged across 5 minimum risk training runs.",
        "Best scores achieved are indicated by dotted line.",
        "are shown in Table 2.",
        "We observe that on 3 out of 5 datasets, the sampler results are much more stable than MERT and as stable on the other 2 datasets.",
        "We attribute the improved stability to the more powerful optimization algorithm used by the sampler which uses gradient information to steer the model towards better weights.",
        "MERT, alternatively, optimizes one feature at a time using line search and therefore does not explore the full feature space as thoroughly.",
        "Translation results with the sampler are better than with MERT on 2 datasets, are equal on another 2 and worse in one case.",
        "The improvements withe the sampler are obtained in the case of out-of-domain data suggesting that the minimum risk training objective generalizes better than the 1-best objective of MERT.",
        "Table 2: Final results comparing MERT/Moses pipeline with unified sampler pipeline.",
        "Sampler uses corpus sampling during training and MBR decoding at test time.",
        "Moses results are averaged across decoding runs using weights from 10 MERT runs and sampler results are averaged across 10 decoding runs for each of 5 different training runs.",
        "We report BLEU scores and standard deviation (<r).",
        "nbest MBR (nMBR) and lattice MBR (lMBR) decoding scores vs best sampler MBR decoding performance.",
        "We selected the best weight set based on performance on heldout data.",
        "In a final set of experiments, we reran the Moses decoder this time using weights obtained through expected BLEU optimization.",
        "Here, for each language pair, we picked the weight set that gave the best results on held-out data.",
        "Note that the results which we show in Table 3 are over one run only, so are not strictly comparable to those in Table 2 which are averaged over several training and decoding runs.",
        "We also report the best results obtained with the sampler MBR decoder using these weights.",
        "In contrast to Table 1, here we see a consistent improvement across all test-sets when going from Viterbi decoding to n-best then to lattice MBR.",
        "Except for in-domain French-English, the translation results are superior to the best scores shown (in bold) in Table 1, confirming that the minimum risk training objective is able to find good weight sets.",
        "Interestingly, we also observe that sampler MBR gets the same exact results for all test sets as lattice MBR.",
        "-■- MaxDenv",
        " – • – MaxTrans",
        "Viterbi",
        "nMBR",
        "lMBR",
        "Sampler MBR",
        "AR-EN MT05",
        "44.2",
        "44.4",
        "44.8",
        "44.8",
        "FR-EN In",
        "33.1",
        "33.2",
        "33.3",
        "33.3",
        "FR-EN Out",
        "19.6",
        "19.8",
        "19.9",
        "19.9",
        "DE-EN In",
        "27.7",
        "27.9",
        "28.0",
        "28.0",
        "DE-EN Out",
        "16.0",
        "16.3",
        "16.6",
        "16.6",
        "MERT/Moses",
        "Sampler",
        "Test set",
        "Best",
        "a",
        "MBR",
        "a",
        "AR-EN MT05",
        "44.5 (lMBR)",
        "0.12",
        "44.5",
        "0.14",
        "FR-EN In",
        "33.4 (nMBR)",
        "0.12",
        "33.2",
        "0.06",
        "FR-EN Out",
        "19.5 (nMBR)",
        "0.12",
        "19.8",
        "0.05",
        "DE-EN In",
        "27.8 (Viterbi)",
        "0.10",
        "27.8",
        "0.11",
        "DE-EN Out",
        "16.0 (lMBR)",
        "0.30",
        "16.6",
        "0.12"
      ]
    },
    {
      "heading": "6. Discussion",
      "text": [
        "We have shown that the sampler of Arun et al.",
        "(2009) can be used to perform minimum risk training over an unpruned search space.",
        "Our proposed corpus sampling technique, like MERT, is able to optimize corpus bleu directly whereas alternate parameter estimation techniques usually employed in SMT optimize approximations of bleu.",
        "Chiang et al.",
        "(2008b) accounts for the online nature of the MIRA optimization algorithm by smoothing the sentence-level bleu precision counts of a translation with a weighted average of the precision counts of previously decoded sentences, thus approximating corpus bleu.",
        "As for minimum risk training, prior implementations have either used sentence-level bleu (Zens et al., 2007) or a linear approximation to bleu (Smith and Eisner, 2006; Li and Eisner, 2009).",
        "At test time, the sampler works best as an MBR decoder, but also allows us to verify past claims about the benefits of marginalizing over alignments during decoding.",
        "We compare the sampler MBR decoder's performance against MERT-optimized Moses run under three different decoding regimes, finding that the sampler does as well or better on 4 out of 5 datasets.",
        "Our training and testing pipeline has the advantage of being able to handle a large number of both local and global features so we expect in the future to outperform the standard MERT and dynamic programming-based search pipeline further.",
        "As shown in Section 5.2, lattice MBR in some cases leads to a marked drop in performance.",
        "(Kumar et al., 2009) mention that the linear approximation to bleu used in their lattice MBR algorithm is not guaranteed to match corpus bleu, especially on unseen test sets.",
        "To account for these cases, they allow their algorithm to back-offto the MAP solution.",
        "One possible reason for the drop in performance in our lattice MBR experiments is that the implementation we use does not employ this back-off strategy.",
        "Table 3 provides valuable insights as to the merits of the lattice MBR approach versus our own sampling based pipeline.",
        "Firstly, whereas with MERT optimized weights, the benefits of lattice MBR are debatable (Table 1), running Moses with minimum risk trained weights gives results that are in line with what we would expect - lattice MBR does systematically better than competing decoding algorithms.",
        "This suggests that the unbiased minimum risk training criterion used by the sampler is a better fit for lattice MBR than the MERT criterion, and also that the mismatch between linear and corpus bleu mentioned before might not be the reason for the results in Table 1.",
        "Secondly, we find that sampling MBR matches lattice MBR on the minimum risk trained weights.",
        "The MBR sampler uses samples drawn from the distribution as hypothesis and evidence sets, typically 1000 samples for the former and 10000 samples for the latter.",
        "In the lattice MBR experiments of Tromble et al.",
        "(2008), it is shown that this size of hypothesis set is sufficient.",
        "Their evidence set, however, is significantly larger than ours.Table 3 suggests that, since it is not biased by heuristic pruning, the sampler's limited evidence set is enough to give a good estimate of the probability distribution whereas beam-search based MBR needs to scale from using n-best lists to lattices to get equivalent results.",
        "Sampling the phrase-based model is expensive, meaning that lattice MBR is still faster (around 4x) to run than sampler MBR.",
        "However, due to the unified nature of the training and decoding criterion in our approach, the minimum risk trained weights can be plugged directly into the sampler MBR decoder, whereas lattice MBR requires an additional expensive step of tuning the model hyper-parameters (Kumar et al., 2009).",
        "In future work, we also intend to look at more efficient ways of generating samples.",
        "One possibility is to interleave Gibbs sampling steps using low order ngram language model distributions with Metropolis-Hasting steps that use higher order language model distributions."
      ]
    },
    {
      "heading": "7. Related Work",
      "text": [
        "Expected bleu training for phrase-based models has been successfully attempted by (Smith and Eisner, 2006; Zens et al., 2007), however they both used biased n-best lists to approximate the posterior distribution.",
        "Li and Eisner (2009) present work on performing expected bleu training with deterministic annealing on translation forests generated by Hiero (Chiang, 2007).",
        "Since bleu does not factorize over the search graph, they use the linear approximation of Tromble et al.",
        "(2008) instead.",
        "Pauls et al.",
        "(2009) present an alternate training criterion over translation forests called CoBLEU, similar in spirit to expected BLEU training, but aimed to maximize the expected counts ofn-grams appearing in reference translations.",
        "This training criterion is used in conjunction with consensus decoding (DeNero et al., 2009), a linear-time approximation of MBR.",
        "In contrast to the approaches above, the algorithms presented in this paper are able to explore an unpruned search space.",
        "By using corpus sampling, we can perform minimum risk training with corpus BLEU rather than any approximations of this metric.",
        "Also, since we maintain a probabilistic formulation across training and decoding, our approach does not require a grid-search for a scaling factor as in Tromble et al.",
        "(2008)."
      ]
    },
    {
      "heading": "8. Conclusions",
      "text": [
        "We have presented a unified approach to the task of parameter estimation and decoding for a phrase-based system using the standard translation evaluation metric, bleu.",
        "Using a Gibbs sampler to explore the entire probability distribution allows us to implement two probabilistic sound algorithms, minimum risk training and its equivalent, MBR decoding, in an unbiased way.",
        "The probabilistic formulation also allows us to use gradient based optimization techniques which produce stable model parameters.",
        "At decoding time, we show the benefits of marginalizing over derivations and that MBR gives better results than other decoding criteria.",
        "Since our optimization algorithm can cope with a large number of features, in future work, we plan to incorporate more expressive features in the model.",
        "We use a Gibbs sampler for inference so there is scope for exploring non-local features which might not easily be added to dynamic programming based models."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research was supported in part by the GALE program of the Defense Advanced Research Projects Agency, Contract No.",
        "HR0011-06-2-001; and by the EuroMatrix project funded by the European Commission (6th Framework Programme).",
        "The project made use of the resources provided by the Edinburgh Compute and Data Facility (http://www.ecdf.ed.ac.uk/).",
        "The ECDF is partially supported by the eDIKT initiative (http://www.edikt.org.uk/)."
      ]
    }
  ]
}
