{
  "info": {
    "authors": [
      "Chikara Hashimoto",
      "Sadao Kurohashi"
    ],
    "book": "45th Annual Meeting of the Association for Computational Linguistics Companion Volume Proceedings of the Demo and Poster Sessions",
    "id": "acl-P07-2035",
    "title": "Construction of Domain Dictionary for Fundamental Vocabulary",
    "url": "https://aclweb.org/anthology/P07-2035",
    "year": 2007
  },
  "references": [
    "acl-P91-1019"
  ],
  "sections": [
    {
      "text": [
        "Chikara Hashimoto Sadao Kurohashi",
        "Faculty of Engineering, Graduate School of Informatics,",
        "Yamagata University Kyoto University",
        "4-3-16 Jonan, Yonezawa-shi, Yamagata, 36-1 Yoshida-Honmachi, Sakyo-ku, Kyoto, 992-8510 Japan 606-8501 Japan"
      ]
    },
    {
      "heading": "2. Two Issues",
      "text": [
        "For natural language understanding, it is essential to reveal semantic relations between words.",
        "To date, only the IS-A relation has been publicly available.",
        "Toward deeper natural language understanding, we semi-automatically constructed the domain dictionary that represents the domain relation between Japanese fundamental words.",
        "This is the first Japanese domain resource that is fully available.",
        "Besides, our method does not require a document collection, which is indispensable for keyword extraction techniques but is hard to obtain.",
        "As a task-based evaluation, we performed blog categorization.",
        "Also, we developed a technique for estimating the domain of unknown words."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "We constructed a lexical resource that represents the domain relation among Japanese fundamental words (JFWs), and we call it the domain dictionary.",
        "It associates JFWs with domains in which they are typically used.",
        "For example, /ft ~ -l* V y home run is associated with the domain sports.",
        "That is, we aim to make explicit the horizontal relation between words, the domain relation, while thesauri indicate the vertical relation called IS-A.",
        "You have to address two issues.",
        "One is what domains to assume, and the other is how to associate words with domains without document collections.",
        "The former is paraphrased as how people categorize the real world, which is really a hard problem.",
        "In this study, we avoid being too involved in the problem and adopt a simple domain system that most people can agree on, which is as follows:",
        "culture recreation sports health living diet",
        "TRANSPORTATION education business government",
        "It has been created based on web directories such as Open Directory Project with some adjustments.",
        "In addition, nodomain was prepared for those words that do not belong to any particular domain.",
        "As for the latter issue, you might use keyword extraction techniques; identifying words that represent a domain from the document collection using statistical measures like TF*IDF and matching between extracted words and JFWs.",
        "However, you will find that document collections of common domains such as those assumed here are hard to obtain.",
        "Hence, we had to develop a method that does not require document collections.",
        "The next section details it.",
        "'in fact, there have been a few domain resources in Japanese like Yoshimoto et al.",
        "(1997).",
        "But they are not publicly available.",
        "Initially, we tried collecting web pages in Yahoo!",
        "JAPAN.",
        "However, we found that most of them were index pages with a few text contents, from which you cannot extract reliable keywords.",
        "Though we further tried following links in those index pages to acquire enough texts, extracted words turned out to be site-specific rather than domain-specific since many pages were collected from a particular web site."
      ]
    },
    {
      "heading": "3. Domain Dictionary Construction",
      "text": [
        "To identify which domain a JFW is associated with, we use manually-prepared keywords for each domain rather than document collections.",
        "The construction process is as follows: © Preparing keywords for each domain (§3.1).",
        "© Associating JFWs with domains (§3.2).",
        "® Reassociating JFWs with NODOMAIN (§3.3).",
        "@ Manual correction (§3.5).",
        "About 20 keywords for each domain were collected manually from words that appear most frequently in the Web.",
        "Table 1 shows examples of the keywords.",
        "A JFW is associated with a domain of the highest Ad score.",
        "An Ad score of domain is calculated by summing up the top five Ak scores of the domain.",
        "Then, an Ak score, which is defined between a JFW and a keyword of a domain, is a measure that shows how strongly the JFW and the keyword are related (Figure 1).",
        "Assuming that two words are related if they cooccur more often than chance in a corpus, we adopt the % statistics to calculate an Akscore and use web pages as a corpus.",
        "The number of co-occurrences is approximated by the number of search engine hits when the two words are used as queries.",
        "Among various alternatives, the combination of the % statistics and web pages is adopted following Sasaki et al.",
        "(2006).",
        "Based on Sasaki et al.",
        "(2006), Ak score between",
        "kwia kwib",
        "Ak scores",
        "a JFW (jw) and a keyword (kw) is given as below.",
        "where n is the total number of Japanese web pages, a = hits(jw & kw), b = hits(jw) – a, c = hits(kw) – a, d = n – (a + b + c).",
        "Note that hits(q) represents the number of search engine hits when q is used as a query.",
        "JFWs that do not belong to any particular domain, i.e. whose highest Ad score is low should be re-associated with nodomain.",
        "Thus, a threshold for determining if a JFW's highest Ad score is low is required.",
        "The threshold for a JFW (jw) needs to be changed according to hits(jw); the greater hits(jw) is, the higher the threshold should be.",
        "To establish a function that takes jw and returns the appropriate threshold for it, the following semiautomatic process is required after all JFWs are associated with domains: (i) Sort all tuples of the form < jw, hits(jw), the highest Ad of the jw > by hits(jw).",
        "(ii) Segment the tuples.",
        "(iii) For each segment, extract manually tuples whose jw should be associated with one of the 12 domains and those whose jw should be deemed as nodomain.",
        "Note that the former tuples usually have higher Ad scores than the latter tuples.",
        "(iv) For each segment, identify a threshold that distinguishes between the former tuples and the latter tuples by their Ad scores.",
        "At this point, pairs of the number of hits (represented by each segment) and the appropriate threshold for it are obtained.",
        "(v) Approximate the relation between the number of hits and its threshold by a linear function using least-square method.",
        "Finally, this function indicates the appropriate threshold for each jw.",
        "Domain",
        "Examples of Keywords",
        "culture",
        "j!fc|Ù| movie, iï^tS music",
        "recreation",
        "tourism, ^c'X.firework",
        "sports",
        "'M-f player, Wi$ baseball",
        "health",
        "-p-Wi surgery, M?W\\ diagnosis",
        "living",
        "WjtL childcare, furniture",
        "diet",
        "chopsticks, lunch",
        "TRANSPORTATION",
        "station, road",
        "education",
        "teacher, arithmetic",
        "science",
        "W5u research, Urn theory",
        "business",
        "import, market",
        "media",
        "broadcast, reporter",
        "government",
        "judicatory, tax",
        "We applied the method to JFWs installed on JU-MAN (Kurohashi et al., 1994), which are 26,658 words consisting of commonly used nouns and verbs.",
        "As an evaluation, we sampled 380 pairs of a JFW and its domain, and measured accuracy.",
        "As a result, the proposed method attained the accuracy of 81.3% (309/380).",
        "Our policy is that simpler is better.",
        "Thus, as one of our guidelines for manual correction, we avoid associating a JFW with multiple domains as far as possible.",
        "JFWs to associate with multiple domains are restricted to those that are EQUALLY relevant to more than one domain."
      ]
    },
    {
      "heading": "4. Blog Categorization",
      "text": [
        "As a task-based evaluation, we categorized blog articles into the domains assumed here.",
        "(i) Extract JFWs from the article.",
        "(ii) Classify the extracted JFWs into the domains using the domain dictionary.",
        "(iii) Sort the domains by the number of JFWs classified in descending order.",
        "(iv) Categorize the article as the top domain.",
        "If the top domain is nodomain, the article is categorized as the second domain under the condition below.",
        "where \\ W (d) \\ is the number of JFWs classified into the domain d.",
        "We prepared two blog collections; Bcmitroiied and Brandom.",
        "As Bcontroiied, 39 blog articles were collected (3 articles for each domain including nodomain) by the following procedure: (i) Query the Web using a keyword of the domain.",
        "(ii) From",
        "culture 4~~ diet 4 recreation 1 business 12 sports 3 nodomain 5",
        "the top of the search result, collect 3 articles that meet the following conditions; there are enough text contents in it, and people can confidently make a judgment about which domain it is categorized as.",
        "As Brandom, 30 articles were randomly sampled from the Web.",
        "Table 2 shows its breakdown.",
        "Note that we manually removed peripheral contents like author profiles or banner advertisements from the articles in both Bcontroiied and Brandom.",
        "We measured the accuracy of blog categorization.",
        "As a result, the accuracy of 89.7% (35/39) was attained in categorizing Bcontro ed, while Brandom was categorized with 76.6% (23/30) accuracy."
      ]
    },
    {
      "heading": "5. Domain Estimation for Unknown Words",
      "text": [
        "We developed an automatic way of estimating the domain of unknown word (uw) using the dictionary.",
        "(i) Search the Web by using uw as a query.",
        "(ii) Retrieve the top 30 documents of the search result.",
        "(iii) Categorize the documents as one of the domains by the method described in §4.1.",
        "(iv) Sort the domains by the number of documents in descending order.",
        "(v) Associate uw with the top domain.",
        "(i) Select 10 words from the domain dictionary for each domain.",
        "(ii) For each word, estimate its domain by the method in §5.1 after removing the word from the dictionary so that the word is unknown.",
        "Table 3 shows the number of correctly domain-estimated words (out of 10) for each domain.",
        "Accordingly, the total accuracy is 67.5% (81/120).",
        "Table 3: # of Correctly Domain-estimated Words",
        "As for the poor accuracy for recreation, living, and media, we found that it was due to either the ambiguous nature of the words of domain or a characteristic of the estimation method.",
        "The former brought about the poor accuracy for media.",
        "That is, some words of media are often used in other contexts.",
        "For example, i!!",
        "live coverage is often used in the sports context.",
        "On the other hand, the method worked poorly for recreation and living for the latter reason; the method exploits the Web.",
        "Namely, some words of the domains, such as Sl)t tourism and v'-'r y~f -~~ shampoo, are often used in the web sites of companies (business) that provide services or goods related to recreation or living.",
        "As a result, the method tends to wrongly associate those words with business."
      ]
    },
    {
      "heading": "6. Related Work",
      "text": [
        "HowNet (Dong and Dong, 2006) and WordNet provide domain information for Chinese and English, but there has been no domain resource for Japanese that are publicly available.",
        "Domain dictionary construction methods that have been developed so far are all based on highly structured lexical resources like LDOCE or WordNet (Guthrie et al., 1991; Agirre et al., 2001) and hence not applicable to languages for which such highly structured lexical resources are not available.",
        "Accordingly, contributions of this study are twofold: (i) We constructed the first Japanese domain dictionary that is fully available.",
        "(ii) We developed the domain dictionary construction method that requires neither document collections nor highly structured lexical resources.",
        "Some human-oriented dictionaries provide domain information.",
        "However, domains they cover are all technical ones rather than common domains such as those assumed here."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "Toward deeper natural language understanding, we constructed the first Japanese domain dictionary that contains 26,658 JFWs.",
        "Our method requires neither document collections nor structured lexical resources.",
        "The domain dictionary can satisfactorily classify blog articles into the 12 domains assumed in this study.",
        "Also, the dictionary can reliably estimate the domain of unknown words except for words that are ambiguous in terms of domains and those that appear frequently in web sites of companies.",
        "Among our future work is to deal with domain information of multiword expressions.",
        "For example,",
        "fount and collection constitute tax deduction at source.",
        "Note that while itself belongs to nodomain, iKJifflX should be associated with government.",
        "Also, we will install the domain dictionary on JU-MAN (Kurohashi et al., 1994) to make the domain information fully and easily available.",
        "Domain",
        "#",
        "Domain",
        "#",
        "culture",
        "7",
        "transportation",
        "7",
        "recreation",
        "4",
        "education",
        "9",
        "sports",
        "9",
        "science",
        "6",
        "health",
        "9",
        "business",
        "9",
        "living",
        "3",
        "media",
        "2",
        "diet",
        "7",
        "government",
        "9"
      ]
    }
  ]
}
