{
  "info": {
    "authors": [
      "Satoshi Sekine",
      "Yoshio Eriguchi"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-2167",
    "title": "Japanese Named Entity Extraction Evaluation - Analysis of Results -",
    "url": "https://aclweb.org/anthology/C00-2167",
    "year": 2000
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We will report on one of the two tasks in the IREX (Information Retrieval and Extraction Exercise) project, an evaluation-based project for Information Retrieval and Information Extraction in Japanese (Sekine and Isahara, 2000) (IREX Committee, 1999).",
        "The project started in 1998 and concluded in September 1999 with many participants and collaborators (45 groups in total from Japan and the US).",
        "In this paper, the Named Entity (NE) task is reported.",
        "It is a task to extract NE's, such as names of organizations, persons, locations and artifacts, time expressions and numeric expressions from newspaper articles.",
        "First, we will explain the task and the definition, as well as the data we created and the results.",
        "Second, the analyses of the results will be described, which include analysis of task difficulty across the NE types and system types, analysis of domain dependency and comparison to human performance."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The need for IR and IE technologies is getting larger because of the improvements in computer technology and the appearance of the Internet.",
        "Many researchers in the field feel that the evaluation based projects in the USA, MUC (MUC Homepage, 1999) and TREC (TREC Homepage, 2000), have played a very important role in each field.",
        "In Japan, however, while there has been good research, we have had some difficulties comparing systems based on the same platform, since our research is conducted at many different universities, companies, and laboratories using different data and evaluation measures.",
        "Our goal is to have a common platform in order to evaluate systems with the same standard.",
        "We believe such projects are useful not only for comparing system performance but also to address the following issues:",
        "1) To share and exchange problems among researchers, 2) To accumulate large quantities of data, 3) To let other people know the importance and the quality of IR and IE techniques.",
        "Finishing the project, we believe we achieved these goals.",
        "In this paper we will describe one of the two tasks in the IREX project, the Named Entity task."
      ]
    },
    {
      "heading": "2 IREX NE",
      "text": []
    },
    {
      "heading": "2.1 Task",
      "text": [
        "Named Entity extraction involves finding Named Entities, such as names of organizations, persons, locations, and artifacts, time expressions, and numeric expressions, such as money and percentage expressions.",
        "It is one of the basic techniques used in IR and IE.",
        "At the evaluation, participants were asked to identify NE expressions as correctly as possible.",
        "In order to avoid a copyright problem, we made a tool to convert a tagged text to a set of tag offset information and we only exchanged tag offset information."
      ]
    },
    {
      "heading": "2.2 Definition",
      "text": [
        "The definition of NE's is given in an 18-page document , which is available through the IBEX homepage (IREX Homepage, 1999).",
        "There are 8 kinds of NE's shown in Table 1.",
        "In order to avoid requiring a unique decision for ambiguous cases where even a human could not tag unambiguously, we introduced a tag \"OPTIONAL\" 1.",
        "If a system tags an expression",
        "within the OPTIONAL tag, it is just ignored for the scoring.",
        "The definition was created based on the MUC/MET definition; however, the process of making the definition was not easy.",
        "In particular, the definition of the newly introduced NE type \"artifact\" was controversial.",
        "We admit that more consideration is needed to make a clearer definition of the NE types.",
        "Comparing the NE task in.",
        "Japanese to that in English, one of the difficulties conies from the fact that there is no word delimiter in Japanese.",
        "Systems have to identify the boundaries of expressions.",
        "This will become complicated when we want to tag a substring of what is generally considered a Japanese word.",
        "For example, in Japanese there is a word \"Rainichi\" which means \"Visit ;Japan\" and consists of two Chinese characters, \"Rai\" (Visit) and \"Ni chi\" (abbreviation of Japan).",
        "Although many word segmenters identify it as a single word, we expect to extract only \"Nichi\" as a location.",
        "This is a tricky problem, as opposed to the case in English where a word is the unit of NE candidates."
      ]
    },
    {
      "heading": "2.3 Runs and Data",
      "text": [
        "There were three kinds of NE exercises, the dry run, a restricted domain formal run, and a general domain formal run, which will be explained later.",
        "Also we created three kinds of training data: the dry run training data, the CRL_NE data and the formal run domain restricted training data.",
        "Table 2 shows the size of each data set.",
        "Note that CRL_NE data belongs to the Communication Research Laboratory (CRL), but it is Fences in the general domain evaluation and 2.1% in the restricted domain evaluation (the types of the evaluation will be explained later).",
        "included in the table, because the data was created by 1R.EX participants, using the definition of IREX-NE, and distributed through IR.EX.",
        "In order to ensure the fairness of the exercise in the formal run, we used newspaper articles which no one had ever seen.",
        "We set the date to freeze the system development (April 13, 1999).",
        "The date for the evaluation was set one month after that date (May 13 to 17, 1999) so that we could select the test articles from the period between those dates.",
        "We thank the Mainichi Newspaper Corporation for providing this data for us free of charge."
      ]
    },
    {
      "heading": "2.4 Restricted domain",
      "text": [
        "In the formal run, in order to study system portability and the effect of domains on NE performance, we, had two kinds of evaluation: restricted domain and general domain.",
        "In the general domain evaluation, we selected articles regardless of domain.",
        "The domain of the restricted domain evaluation was announced one month before the development freeze date.",
        "It was an \"arrest\" domain defined as follows and all the articles in the restricted domain are selected based on the definition."
      ]
    },
    {
      "heading": "2.5 Results",
      "text": [
        "8 groups and 11 systems participated in the dry run, and 14 groups and 15 systems participated in the formal rune.",
        "The evaluation results were made public anonymously using system ID's.",
        "Table 3 shows the evaluation results (F-measure) of the formal run.",
        "F-measure is calculated from recall and precision (IBEX Committee, 1999).",
        "It ranges from 0 to 100, and the larger the better"
      ]
    },
    {
      "heading": "3 Analyses of the results",
      "text": []
    },
    {
      "heading": "3.1 Difficulty across NE type",
      "text": [
        "In Table 4, the F-measure of the best performing system is shown in the \"Best\" column; the average F-measures are shown in the \"Average\" column for each NE type on the formal runs.",
        "It can be observed that identifying time and numeric expressions is relatively easy, as the average F-measures are more than 80%.",
        "In contrast, the accuracy of the other types of NE is not so good.",
        "In particular, artifacts are quite difficult to identify.",
        "It is interesting to see that tagging artifacts in the general domain is much harder than in the restricted domain.",
        "This is because of the limited types of artifacts in the restricted domain.",
        "Most of the artifacts in the 2 The participation to the dry run was not obligatory.",
        "This is why the number of participants is smaller in the dry run than that in the formal run.",
        "restricted domain are the names of laws, as the domain is the arrest domain.",
        "Systems might be able to find such types of names easily because they could be recognized by a small number of simple patterns or by a short list.",
        "The types of the artifacts in the general domain are quite diverse, including names of prizes, novels, ships, or paintings.",
        "It might be difficult to build patterns for these items, or systems may need very complicated rules or large dictionaries."
      ]
    },
    {
      "heading": "3.2 Three types of systems",
      "text": [
        "Based on the questionnaire for the participants we gathered after the formal runs, we found that there are three types of systems.",
        "• Hand created pattern based",
        "These are pattern based systems where the patterns are created by hand.",
        "A typical system used prefix, suffix and proper noun dictionaries.",
        "Patterns in these systems look like \"If proper nouns are followed by a suffix of person name (for example, a common suffix like \"San\", which is almost equivalent to Mr. and Ms.) then the proper nouns are a person name\".",
        "This type of system was very common; there were 8 systems in this category.",
        "• Automatically created pattern based These are pattern based systems where some or all of the patterns are created automatically using a training corpus.",
        "There were three systems in this category, and these systems used quite different methods.",
        "One of them used the \"error driven method\", in which hand created patterns were applied to tagged training data and the system learned from the mistakes.",
        "Another system learned patterns for a wide range of information, including, syntax, verb frame and discourse information from training data.",
        "The last system used the local context of training data and several filters were applied to get more accurate patterns.",
        "• Fully automatic",
        "Systems in this category created their knowledge automatically from a training corpus.",
        "There were four systems in this category.",
        "These systems basically tried to assign one of the four tags, beginning, middle or ending of an NE, or out-of-NE, to",
        "each word or each character.",
        "The source information for the training was typically character type, POS, dictionary information or lexical information.",
        "As the learning mechanism, Maximum Entropy models, decision trees, and IIMMs were used.",
        "it is interesting to see that the top three systems came from each category; the best system was a hand created pattern based system, the second system was an automatically created pattern based system and the third system was a fully automatic system.",
        "So we believe we can not conclude which type is superior to the others.",
        "Analyzing the results of the top three systems, we observed the importance of the dictionaries.",
        "The best hand created pattern based system seems to have a wide coverage dictionary for person, organization and location names and achieved very good accuracy for those categories.",
        "However, the hand created pattern based system failed to capture the evaluation specific patterns like \"the middle of April\".",
        "Systems were required to extract the entire expression as a date expression, hut the system only extracted \"April\".",
        "The best hand created rule based system, as well as the best automatically created pattern based system also missed other specific patterns which include abbreviations (\"Rai-Nichi\" = Visit-Japan), conjunctions of locations (\"Nichi-Bei\" = Japan-US), and street addresses (\"Meguro-ku, Ookayama 2-12-1\").",
        "The best frilly automatic system was successful in extracting most of these specific patterns.",
        "However, the fully automatic system has a problem in its coverage.",
        "In particular, the training data was newspaper articles published in 1994 and the test data was from 1999, so there are several new names, e.g. the prime minister's name which is not so common (Obuchi) and a location name like \"Kosovo\", which were rarely mentioned in 1994 but appeared a lot in 1999.",
        "The system missed many of them."
      ]
    },
    {
      "heading": "3.3 Domain dependency",
      "text": [
        "In Table 3, the differences in performance between the general domain and the restricted domain are shown in the column \"cliff\".",
        "Many systems performed better in the restricted domain, although a small number of systems performed better in the general domain.",
        "There were two systems which intentionally tuned their systems towards the restricted domain, which are shown in bold in the table.",
        "Both of these were among the systems which performed much better (more than 7%) in the restricted domain.",
        "The system which achieved the largest improvement was a fully automatic system, and it only replaced the training data for the domain restricted task (so this is an intentionally tuned system).",
        "It shows the domain dependency of the task, although further investigation is needed to see why some other systems can perform much better even without domain tuning."
      ]
    },
    {
      "heading": "3.4 Comparison to human performance",
      "text": [
        "In Table 4, human performance is shown in the \"Novice\" and \"Expert\" columns.",
        "\"Novice\" means the average F-measure of three graduate students and \"Expert\" means the average F.-measure of the two people who were most re",
        "sponsible for creating the definition and created the answer.",
        "They first created two answers independently and checked them by themselves.",
        "The results after the checking are shown in the table, so many careless mistakes were deleted at this time.",
        "We can say that 98-99 F-measure is the performance of experts who create them very carefully, and 94 is a usual person's performance.",
        "We can find a similar pattern of performance among different NEs.",
        "Humans also performed more poorly for artifacts and very well for time and numeric expressions.",
        "The difference between the best system performance and human performance is 7 or more F-measure, as opposed to the case in English where the top systems perform at a level comparable or superior to human performance.",
        "There could be several reasons for this.",
        "One obvious reason is that we introduced a difficult NE type, artifact, which degrades the overall performance more for the system side than the human side.",
        "Also, the difficulty of identifying the expression boundaries may contribute to the difference.",
        "Finally, we believe that the systems can possibly improve, as IREX was the first evaluation based project in Japanese, whereas in English there have been 7 MUC's and the technology may have matured by now."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "We reported on the NE task of the IREX project.",
        "We first explained the task and the definition, as well as the data we created and the results.",
        "The analyses of the result were described, winch include analysis of task difficulty across the NE types and system types, analysis of domain dependency and comparison to human performance.",
        "As this is one of the first projects of this type in Japan, we may have a lot to do in the future and hopefully the results of the project will be beneficial for future projects.",
        "As the next step, IREX will be merged with a similar project NTCIR, (NTCIR, Homepage, 2000) which places more emphasis on IR, with a newly created project for summarization, TSC (TSC Homepage, 2000), and continue this kind of effort for the future."
      ]
    },
    {
      "heading": "5 Acknowledgment",
      "text": [
        "We would like to thank all the participants of IREX projects.",
        "The project would never have been as successful as it was without the participants, all of whom were very cooperative and constructive."
      ]
    }
  ]
}
