{
  "info": {
    "authors": [
      "Merley Conrado",
      "Thiago Pardo",
      "Solange Rezende"
    ],
    "book": "NAACL",
    "id": "acl-N13-2003",
    "title": "A Machine Learning Approach to Automatic Term Extraction using a Rich Feature Set",
    "url": "https://aclweb.org/anthology/N13-2003",
    "year": 2013
  },
  "references": [
    "acl-L08-1281",
    "acl-W96-0213"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper we propose an automatic term extraction approach that uses machine learning incorporating varied and rich features of candidate terms.",
        "In our preliminary experiments, we also tested different attribute selection methods to verify which features are more relevant for automatic term extraction.",
        "We achieved state of the art results for uni-gram extraction in Brazilian Portuguese."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Terms are terminological units from specialised texts (Castellv??",
        "et al, 2001).",
        "A term may be: (i) simple1 (a single element), such as ?biodiversity?, or (ii) complex (more than one element), such as ?aquatic ecosystem?",
        "and ?natural resource management?.",
        "Automatic term extraction (ATE) methods aim to identify terminological units in specific domain corpora (Castellv??",
        "et al, 2001).",
        "Such information is extremely useful for several tasks, from the linguistic perspective of building dictionaries, taxonomies and ontologies, to computational applications as information retrieval, extraction, and summarisation.",
        "Although ATE has been researched for more than 20 years, there is still room for improvement.",
        "There are four major ATE problems.",
        "The first one is that the ATE approaches may extract terms that are not actual terms (?noise?)",
        "or do not extract actual terms (?silence?).",
        "Considering the ecology domain, an example of silence is when a term (e.g., pollination), ?This research was supported by FAPESP (Proc.",
        "No.",
        "2009/16142-3 and 2012/09375-4), Brazil.",
        "1When we refer to unigrams, we mean simple terms.",
        "with low frequency, is not considered a candidate term (CT), and, therefore, it will not appear in the extracted term list if we consider its frequency.",
        "Regarding noise, if we consider that nouns may be terms and that adjectives may not, if an adjective (e.g., ecological) is mistakenly tagged as a noun, it will be wrongly extracted as a term.",
        "The second problem is the difficulty in dealing with extremely high number of candidates (called the high dimensionality of candidate representation) that requires time to process them.",
        "Since the ATE approaches generate large lists of TCs, we have the third problem that is the time and human effort spent for validating the TCs, which usually is manually performed.",
        "The fourth problem is that the results are still not satisfactory and there is a natural ATE challenge since the difficulty in obtaining a consensus among the experts about which words are terms of a specific domain (Vivaldi and Rodr?",
        "?guez, 2007).",
        "Our proposed ATE approach uses machine learning (ML), since it has been achieving high precision values (Zhang et al., 2008; Foo and Merkel, 2010; Zhang et al., 2010; Loukachevitch, 2012).",
        "Although ML may also generate noise and silence, it facilitates the use of a large number of TCs and their features, since ML techniques learn by themselves how to recognize a term and then they save time extracting them.",
        "Our approach differs from others because we adopt a rich feature set using varied knowledge levels.",
        "With this, it is possible to decrease the silence and noise and, consequently, to improve the ATE results.",
        "Our features range from simple statistical (e.g., term frequency) and linguistic (e.g., part of",
        "speech - POS) knowledge to more sophisticated hybrid knowledge, such as the analysis of the term context.",
        "As far as we know, the combined use of this specific knowledge has not been applied before.",
        "Another difference is that we apply 3 statistical features (Term Variance (Liu et al., 2005), Term Variance Quality (Dhillon et al., 2003), and Term Contribution (Liu et al., 2003)) that to date have only been used for attribute selection and not for term extraction.",
        "As far as we know, the combined use of this specific knowledge and feature feedback has not been applied before.",
        "We also propose 4 new linguistic features for ATE.",
        "All these features are detailed in Section 4.",
        "Finally, for the first time, ML is being applied in the task of ATE in Brazilian Portuguese (BP) corpora.",
        "Our approach may also be easily adapted to other languages.",
        "We focus on extracting only unigram terms, since this is already a complex task.",
        "We run our experiments on 3 different corpora.",
        "Our main contribution is the improvement of precision (in the best case, we improve the results 11 times) and F-measure (in the best case, we improve 2 times).",
        "Section 2 presents the main related work.",
        "Section 3 describes our ATE approach.",
        "Section 4 details the experiments, and Section 5 reports the results.",
        "Conclusions and future work are presented in Section 6."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "There are several recent and interesting studies that are not focused on extracting unigrams (Estopa` et al., 2000; Almeida and Vale, 2008; Zhang et al., 2008; Zhang et al., 2010; Nazar, 2011; Vivaldi et al., 2012; Lopes, 2012).",
        "Normally, ATE studies use corpora of different domain and language and, in some cases, the authors use different evaluation measures.",
        "Regardless of variation (e.g., the size of the test corpora), we mention studies that have highlighted results for unigrams2.",
        "When possible, we show the best precision (P) of the related work and its recall (R).",
        "(Ventura and Silva, 2008) extracted terms using statistical measures that consider the predecessors and successors of TCs.",
        "They achieved, for English,",
        "complex terms.",
        "and R=60.8%.",
        "For Spanish, the Greek forms of a candidate and their prefix may help to extract terms (e.g., the Greek formant laring that belongs to the term laringoespasm in the medical domain) (Vivaldi and Rodr?",
        "?guez, 2007), achieving about P=55.4% and R=58.1%.",
        "For Spanish, (Gelbukh et al., 2010) compared TCs of a domain with words of a general corpus using Likelihood ratio based distance.",
        "They achieved P=92.5%.",
        "For Brazilian Portuguese, the ExPorTer methods are the only previous work that uniquely extract unigrams (Zavaglia et al., 2007).",
        "Therefore, they are the state of the art for unigrams extraction for BP.",
        "The linguistic ExPorTer considers terms that belong to some POS patterns and uses indicative phrases (such as is defined as) that may identify where terms are.",
        "It achieved P=2.74% and R=89.18%.",
        "The hybrid ExPorTer used these linguistic features with frequency and Likelihood ratio.",
        "The latter one obtained P=12.76% and R=23.25%."
      ]
    },
    {
      "heading": "3 Term Extraction Approach based on",
      "text": []
    },
    {
      "heading": "Machine Learning",
      "text": [
        "In order to model the ATE task as a machine learning solution, we consider each word in the input texts3 of a specific domain (except the stopwords) as a learning instance (candidate term).",
        "For each instance, we identify a set of features over which the classification is performed.",
        "The classification predicts which words are terms (unigrams) of a specific domain.",
        "We test different attribute selection methods in order to verify which features are more relevant to classify a term.",
        "We start by preprocessing the input texts, as shown in Figure 1.",
        "This step consists of POS tagging the corpora and normalizing4 the words of the texts.",
        "The normalization minimizes the second ATE problem because it allows working with a lower CT representation dimensionality.",
        "When working with a lower dimensionality, the words that do not help identify terms are eliminated.",
        "Consequently, fewer candidates should to be validated or refuted as terms (it would minimize the third ATE problem).",
        "When",
        "lem), and, definitely, it spends less time and fewer resources to carry out the experiments.",
        "By improving the results, consequently, we minimize silence and noise, which handles the first ATE problem.",
        "Afterwards, we remove stopwords.",
        "In order to identify a set of features over which the classification is performed, we studied and tested several measures.",
        "The feature identification is the most important step of our approach.",
        "We divide the features into two types: (i) the features that obtain statistical, linguistic, and hybrid knowledge from the input corpus, such as TFIDF and POS, and (ii) the features that obtain these knowledge from measures that use other corpora besides the input corpus.",
        "The corpora belong to another domain that is different of the input corpus domain (called contrastive corpora) or not belong to any specific domain (called general corpora).",
        "Our hypothesis is that, with the joining of features of different levels of knowledge, it is possible to improve the ATE."
      ]
    },
    {
      "heading": "4 Experimental Setup",
      "text": [
        "At this point, for obtaining the knowledge in order to extract terms, we tested 17 features that do not depend on general or contrastive corpora and 2 features that depend on these corpora.",
        "We intend to explore more features (and we will possibly propose new measures) that use contrastive or general corpora or any taxonomic structure.",
        "The experiments that expand the number of features are ongoing now.",
        "We used 3 corpora of different domains in the Portuguese language.",
        "The EaD corpus (Souza and Di Felippo, 2010) has 347 texts about distance education and has a gold standard with 118 terms5 (Gi5(Gianoti and Di Felippo, 2011) stated that the EaD unigram gold standard has 59 terms, but in this paper we used 118 unigrams that the authors provided us prior to their work.",
        "anoti and Di Felippo, 2011).",
        "The second one is the ECO6 corpus (Zavaglia et al., 2007).",
        "It contains 390 texts of ecology domain and its gold standard has 322 unigrams.",
        "The latter is the Nanoscience and Nanotechnology (N&N) corpus (Coleti et al., 2008) that contains 1,057 texts.",
        "Its gold standard has 1,794 unigrams (Coleti et al., 2008; Coleti et al., 2009).",
        "In order to preprocess these corpora, we POS tagged them using the PALAVRAS parser (Bick, 2000) and normalized their words using a stemming7 technique.",
        "Stemming was chosen because of its capacity to group similar word meanings, and its use decreases representation dimensionality of candidate terms, which minimizes the second and third ATE problems.",
        "Afterwards, we removed the stopwords8, the conjugation of the verb ?to be?, punctuation, numbers, accents, and the words composed of only one character are removed.",
        "We identify and calculate 19 features in which 11 features are used for ATE in the literature, 3 features are normally applied to the attribute selection tasks (identified by *), 1 normally used for Named Entity Recognition (identified by **), and we created 4 new features (identified by ?).",
        "These features are shown in Table 1, accompanied by the hypotheses that underlie their use.",
        "They are also divided into 3 levels of knowledge: statistical, linguistic, and hybrid.",
        "For the S feature, we removed stopwords at the beginning and at the end of these phrases.",
        "For POS, we assumed that terms may also be adjectives (Almeida and Vale, 2008), besides nouns and verbs.",
        "For GC and Freq GC, we used the NILC Corpus9 as a general corpus, which contains 40 million words.",
        "We created and used 40 indicative phrases (NPs).",
        "For example, considering are composed of as an IP in All organisms are composed of one or more cells, we would consider organisms and cells as TCs.",
        "For features related to CT stem, we analyzed, e.g., the words educative, educators, education and educate that came from the stem educ.",
        "Therefore, educ may",
        "C-value the potential of a CT to be a term (Frantzi et al., 1998) the C-value helps to extract terms NC-value CT context (Frantzi et al., 1998) candidate context helps to extract terms have as features N Noun = 2 (educators and education), N Adj = 1 educative, N Verb = 1 (educate), and N PO = 4 (total number of words).",
        "Our hypothesis is that stemmed candidates that were originated from a higher number of nouns than adjectives or verbs will be terms.",
        "Finally, we used NC-Value adapted to unigrams (Barro?n-Ceden?o et al., 2009).",
        "After calculating the features for each unigram (candidate term), the CT representation has high dimensionality (it is the second ATE problem) and, hence, the experiments may take a considerable amount of time to be executed.",
        "To decrease this dimensionality and, consequently, the number of TCs (which corresponds to the second and third ATE problems, respectively), we tested two different cut-offs, which preserve only TCs that occur in at least two documents in the corpus.",
        "The first cut-off is called C1.",
        "In the second one (called C2), the candidates must be noun and prepositional phrases and also follow some of these POS: nouns, proper nouns, verbs, and adjectives.",
        "The number of obtained candidates (stems) was 10,524, 14,385, and 46,203, for the ECO, EaD, and N&N corpora, respectively.",
        "When using the C1 cut-off, we decreased to 55,15%, 45,82%, and 57,04%, and C2 decreased 63.10%, 63.18%, 66.94% in relation to the number of all the obtained candidates (without cutt-offs)."
      ]
    },
    {
      "heading": "5 Experimental Evaluation and Results",
      "text": [
        "The first evaluation aimed to identify which features must be used for ATE (see Section 3).",
        "For that, we applied 2 methods that select attributes by evaluating the attribute subsets.",
        "Their evaluation is based on consistency (CBF) and correlation (CFS).",
        "We also tested search methods.",
        "The combination of these methods, available in WEKA (Hall et al., 2009), is: CFS SubsetEval using the RankSearch Filter as search method (CFS R), CFS SubsetEval using the BestFirst as search method (CFS BF), CBF SubsetEval using the Ranking Filter (C R), and CBF SubsetEval using the Greedy Stepwise (C G).",
        "These methods return feature sets that are considered the most representative for the term classification (Table 2).",
        "For the EaD corpus, the CG attribute selection method did not select any feature.",
        "For our experiments, we also considered all the features (referred by All).",
        "Additionally, we compared the use of two cut-off types for each feature set, C1 and C2, detailed in Section 4.",
        "For both evaluations8, we chose largely known inductors in the machine learning area.",
        "They represent different learning paradigms: JRip (Rule Induction), Na?",
        "?ve Bayes (Probabilistic), J48 (Decision Tree) with confidence factor of 25%, and SMO (Statistical Learning).",
        "All of these algorithms are avail",
        "not select any TV, TVQ, GC, IP, TV, TVQ, TCo, IP, feature.",
        "N S, NCvalue, NCvalue, N S, POS, S, N Noun, POS, GC, N Noun, N PO, N Adj, N PO N Verb, N Adj able in WEKA and described in (Witten and Frank, 2005).",
        "We run the experiments on a 10 fold cross-validation and calculated the precision, recall, and F-measure scores of term classification according to the gold standard of unigrams of each corpus.",
        "Using default parameter values for SMO, the results were lower than the other inductors.",
        "Due to this fact and the lack of space in the paper, we do not present the SMO results here.",
        "The best precision obtained for the EaD corpus using the term classification, 66.66%, was achieved by the C R attribute selection method with the C2 cut-off (C R-C2) using the JRIP inductor.",
        "The best recall score, 20.96%, was obtained using Na?",
        "?ve Bayes with the CFS R-C1 method.",
        "The best F-measure was 17.58% using the J48 inductor with C R-C2.",
        "For the ECO corpus, the best precision was 60% obtained with the J48 inductor with confidence factor of 25% and the C R-C1 method.",
        "The best recall was 21.40% with JRIP and the C G-C1 method.",
        "Our best F-measure was 24.26% obtained with Na?",
        "?ve Bayes using the CFS R-C1 method.",
        "For the N&N corpus, the best precision score was 61.03% using JRIP.",
        "The best recall was 52.53% and the best F-measure score was 54.04%, both using J48 inductor with confidence factor of 25%.",
        "The three results used the All-C2 method.",
        "Table 3 shows the comparison of our best results with 2 baselines, which are the well-known term frequency and TFIDF, using our stoplist.",
        "We also considered all the stemmed words of these corpora as CT, except the stopwords, and we calculated the precision, recall, and F-measure scores for these words as well.",
        "Finally, we compared our results with the third baseline, which is the only previous work that uniquely extracts unigrams (Zavaglia et al., 2007), described in Section 2.",
        "Therefore, this is the state of the art for unigrams extraction for Portuguese.",
        "In order to compare this work with our results of the EaD and N&N corpora, we implemented the ATE method of Zavaglia et al. We have to mention that this method uses the normalization technique called lemmatization instead of stemming, which we used in our method.",
        "The only difference between our implementation descriptions and the original method is that we POS tagged and lemmatizated the texts using the same parser (PALAVRAS10 (Bick, 2000)) used in our experiments instead of the MXPOST tagger (Ratnaparkhi, 1996).",
        "For all used corpora, we obtained better results of precision and F-measure comparing with the baselines.",
        "In general, we improve the ATE precision scores, for the EaD corpus, eleven times (from 6.1% to 66.66%) and, for the N&N corpus, one and a half times (from 35.4% to 61.03%), both comparing our results with the use of TFIDF.",
        "For the ECO corpus, we improve four and a half times (from 12.9% to 60%), by comparing with the use of frequency.",
        "We improve the ATE F-measure scores, for the EaD corpus, one and a half times (from 10.93% to 17.58%); for the ECO corpus, we slightly improve the results (from 20.64% to 24.26%); and, for the N&N corpus, two times (from 28.12% to 54.04%).",
        "The last three cases are based on the best F-measure values obtained using TFIDF.",
        "Regarding recall, on the one hand, the linguistic ExPorTer method (detailed in Section 2), to which we also compare our results, achieved better recall for all used corpora, about 89%.",
        "On the other hand, its precision (about 2%) and F-measure (about 4%) were significantly lower than our results.",
        "Finally, if we compare our results with the results of all stemmed words, with the exception of the stopwords, the recall values of the latter are high (about 76%) for all used corpora.",
        "However, the precision scores are extremely low (about 1.26%), because it used almost all words of the texts.",
        "10As all NLP tools for general domains, PALAVRAS is not excellent for specific domains.",
        "However, as it would be expensive (time and manual work) to customize it for each specific domain that we presented in this paper, we decided use it, even though there are error tagging."
      ]
    },
    {
      "heading": "6 Conclusions and Future Work",
      "text": [
        "This paper described ongoing experiments about unigrams extraction usingML.",
        "Our first contribution regarding the experiments was to create 4 features and to test 4 features that normally are applied to other tasks and not for automatic term extraction.",
        "Our second contribution is related to the first and fourth ATE problems, which are the existence of silence and noise and low ATE results, respectively.",
        "We achieved state of art results for unigrams in Brazilian Portuguese.",
        "We improved, for all used corpora, precision (in the best case, we improve the results 11 times using the EaD corpus) and F-measure (in the best case, 2 times using the N&N corpus) and, consequently, we minimized silence and noise.",
        "The third contribution is about the features that are better for extracting domain terms.",
        "All the tested attribute selection methods indicated the TFIDF as an essential feature for ATE.",
        "90.9% of the methods selected N Noun and TVQ, and 81.81% selected TV, IP, N adj, and POS as relevant features.",
        "However, only one of these methods chose Freq GC, and none of them chose the SG feature.",
        "Regarding the levels of knowledge - statistical, linguistic, and hybrid - in which each feature was classified, at least 45.45% of the methods chose 6 statistical, 5 linguistic, and 3 hybrid features.",
        "We also observed that the best F-measures (see Tables 2 and 3) were obtained when using at least linguistic and statistical features together.",
        "This fact proves that our main hypothesis is true, because we improved the ATE results by joining features of different levels of knowledge.",
        "Additionally, we allow the user to choose the features that are better for term extraction.",
        "As the fourth contribution, we minimized the problem of high dimensionality (as mentioned, the second ATE problem) by means of the use of two different cut-offs (C1 and C2).",
        "By reducing the number of TCs, fewer candidates were validated or refuted as terms and, consequently, we minimized the third ATE problem, which is the time and human effort for validating the TCs.",
        "However, we still perceived the need to reduce more the number of candidates.",
        "Therefore, for future work, we intend to use instance selection techniques to reduce the term representation.",
        "We believe to have achieved significant results for the experiments realized to date.",
        "Experiments using more features that dependent on general corpus are ongoing.",
        "We will also possibly propose new features and will use taxonomic structure in order to improve more the results.",
        "For using the taxonomic structure, we intend to create a conventional taxonomy (Mi-iller and Dorre, 1999) is created using the input corpus.",
        "Therefore, we may identify more features for the instances considering this taxonomy.",
        "For example, normally in a taxonomy's leaf specific words of a domain happen, consequently, terms should appear there.",
        "Additionally, we are encouraged to adapt these features for bigram and trigram terms as well."
      ]
    }
  ]
}
