{
  "info": {
    "authors": [
      "Alan W. Black",
      "Paul Taylor"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2158",
    "title": "CHATR: A Generic Speech Synthesis System",
    "url": "https://aclweb.org/anthology/C94-2158",
    "year": 1994
  },
  "references": [],
  "sections": [
    {
      "text": [
        "A hstract This paper describes a generic speech synthesis sy-stent called (31 A'I'R, which is being developed at CII ATR is designed in a 'nodular way so that module parameters and even which modules are actually used may he set, awl selected at runtime.",
        "Although some interdependencies exist between modules, CI IA'l'It, offers a useful research tool in which functionally equivalent, modules may be easily compared.",
        "It also acts as a simple system for those less interested in the internals of speech synthesis but just wish their computer to talk.",
        "1.",
        "'opic: speech synthesis, generic systems."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "There are many requirements for a speech synthesis system.",
        "En addition to high quality natural sounding speech output, the system should be flexible and not simply he hard-wired to particular algorithms.",
        "For example it should at least he the case that new words can he added to the lexicon.",
        "Other snore general changes should also be possible e.g. specification of HMV intonational ',Hiles, Varying of output voices, choice of phoneme set, to He Bused (e.g. if a different lexicon is to he used), and even the choice of language 'wing spoken.",
        "A rose archer requires access to iiiternal structures, ability to mix and match techniques, graphical display of utterances mid conmatihility with other systems.",
        "Rut those who are uninterested in the internals of speech synthesis just want their computer to talk.",
        "To them the requirements of a synthesis system arc different.",
        "Although they still want, a, degree of control over synthesis, it is real-time production of speech, machine independence, and ease of use that, are the factors that, are most important.",
        "As a well-engineered system CI I AIR 'Heels these requirements.",
        "1 3ecause A'1.1.i.",
        "'s main speech project is in the area of speech translation systems, input to CI1A']'Ii.can Ise much richer than simple plain During translation, utterances are represented in a rich structure including syntactic, semantic and speech act information.",
        "Unlike a conventional text-1)Tiesent address I 1(!,1(, liniversity of (Aiiihurgh 2 Iluccicitteli ['lace, l'Alinlinitigh li:11 I 01,W, Hiciotheid.",
        "to-speech system which needs to reconstruct this information from raw text., (.,l1 Afli, call use this explicit information directly and hence produce more accurate synthesis.",
        "Although does also support text-to-speech, current, development has concentrated on the use of labelled input rather than raw text.",
        "CII Ant is designed in a modular way so that, functionally equivalent, modules may exist, within the system.",
        "Flow of control Inv he selected at run time, without recompilation.",
        "Within a speech synthesis research environment, this is useful as it allows close comparison of components to identify differences.",
        "Thus equivalent modules may be tested within exactly the same enviroimtent interactively.",
        "Tor example, CI I ATIt currently supports a, number of different low-level (waveform) synthesizers.",
        "This process is quite independent of intonation Or duration modules.",
        "CI IATR's modularity allows synthesis of exactly same utterance through different waveform synthesizers.",
        "next section discusses the internal representation of utterances within CI I ATR.",
        "Then the overall structure of the system is discussed with some typical modules described.",
        "Finally the current configuration of CI I Alit is described detailing its actual modules.",
        "Also some discussion is given about the shortcomings of the system and how we would like to see it improved."
      ]
    },
    {
      "heading": "Utterance representation",
      "text": [
        "In conventional speech synthesis systems (such as M !Talk [2]) a \"pipeline\" architecture is of'tell used.",
        "nforn inlion is passed through a. pipeline of modules.",
        "10,ach module defines what information is passed on to succeeding modules.",
        "13nt, if au earlier component does not, pass on information which is later found to be needed down stream, all inter-niediate modules will need to he rewritten to pass ou that, information.",
        "In contrast, Cl IATli, uses a single \"blackboard\" representation for all aspects of an utterance.",
        "All modules have access to all parts.",
        "Although global, more than one utterance object, 'nay exist.",
        "in the system at, anytime.",
        "There are effectively two types of modulo winch act, On utterance objects.",
        "Synthesis modules will typically modify the contents of all utterance based on its current content (and other parameters).",
        "Other modules exist which are more general in tt",
        "ture, which, for instance, display an utterance, save its contents or play the synthesized waveform.",
        "An 'utterance object consists of a number of streams.",
        "Each stream consists of an ordered list of cells.",
        "The number of streams can easily be changed in CLIATIL and not all streams need exist in all utterances.",
        "Typical streams are: words, syllables, and phonemes.",
        "Relations may be set between stream cells and so, for example, it is possible to find which word a syllable is in.",
        "The following diagram shows a typical stream structure for part of an utterance object.",
        "Word (cleattei) Syllable unstressed Phoneme ) Each stream cell is linked to its preceding and succeeding cells.",
        "Cells contain all the appropriate information for that type of stream.",
        "For example our phoneme cell contains a name, phonetic features, a duration etc.",
        "Note that although there will be hierarchical structure between streams this is not mandatory (e.g. the silence `#' phoneme above is not part of any syllable or word).",
        "For example in a. treatment of intonation implemented within CHA'I'R, (based on [6]) the cells in the intonation stream are linked to syllables but no direct hierarchical relationship exists between intonation cells and phonemes.",
        "The existing streams could even he ignored and others introduced if the current ones are inappropriate to some synthesis task.",
        "tom example a different intonation model may require quite different streams from the Taylor model currently implemented.",
        "Streams must be defined at compile time but may be selected per utterance at synthesis time--that is, defining many different, streams does not impinge on the size or efficiency of the utterance structures built.",
        "Levels of input CIIATR offers input an many levels.",
        "At the most abstract it can accept linguistic descriptions of utterances from which it can generate prosodic phrasing and intonational tune through a mile driven process (described in [3]).",
        "Alternatively, input may explicitly include prosodic phrasing and intonational features specifying time.",
        "This second level allows much more explicit control over phrasing and intonation.",
        "A third level allows even inore degree of control specifying individual phonemes, durations and lib target values (or a slightly higher symbolic description of F0).",
        "At the lowest, level, waveforms themselves can be specified allowing CHATR, to generate any arbitrary sound.",
        "These differing levels of input allow a user of CEI Ain to specify the form of an utterance in as much detail as is desired.",
        "Multiple levels of input are useful in synthesis research.",
        "For example, naturally occurring dura-Clouts and/or pitch may be explicitly specified in the input, allowing exact control over parts of the synthesis, thus emphasizing the other parts under investigation.",
        "There is currently a fixed number of input types.",
        "Although new levels can easily be added, it would be better if an utterance could he specified at any level of precision in any stream and synthesis modules could be used to fill in missing parts.",
        "This has not yet beeir added to the system but some discussion is given below.",
        "Overall structure A command language based on Lisp is provided so the user can execute commands such as synthesize, play, set intonation statistics, define a phoneme set etc.",
        "'The Lisp, although a full language, is designed merely for control rather than encoding speech synthesis algorithms.",
        "Lisp list structures are used to represent most of the ASCII data in the system (e.g. duration statistics, lexicons, phoneme set de-['tuitions etc.).",
        "This means brat data.",
        "can easily be changed and (re)loaded into the system.",
        "As all these files are s-expressions no new file i/o routines are required.",
        "Flow of control, i.e. which modules are called, can also be specified in Lisp, thus, functionally equivalent modules may be selected between interactively at run time.",
        "The system consists of' one large executable which includes a. number of different modules.",
        "Modules may he written in Col' C-P (or in Fact any other language if an interface to the stream and utterance structures is provided for that language).",
        "may have been possible to write the whole GlIA'F.R, system in Lisp (or Prolog or sonic other language designed for symbolic manipulation).",
        "ibis however was specifically decided against as in addition to the symbolic: aspect of CHNI: we also wish the signal processing aspects of speech syntlies to be efficient (and many such algorithms already exist, in C).",
        "Although most Lisp systems support, C interfaces they are typically non-standard and portability of the whole system was an important.",
        "criterion."
      ]
    },
    {
      "heading": "Modules",
      "text": [
        "A number of' modules exist, in the system but not, all are used for the synthesis of' all utterances.",
        "utterance modules are those functions that are given a single utterance object as an argument,.",
        "Typically they will access a number of streams and create (or",
        "modify) another stream.",
        "Selection of which ino-doles get called is based on the input type of the utterance, global Options and the specified path.",
        "Let us look at, one typical 'nodule: the lexicon inodule.",
        "Our current, lexicon module allows the construction and use or lexicons whose entries specify syllables, stress and phonemes for a given word (which is identified by a character string plus optional features).",
        "When the lexicon module is called the desired words are already set up in the word stream.",
        "lexicon module looks up each word in the lexicon and creates the syllable and phoneme streams with the information found in the lexical entry (words not, found can optionally be treated by letter-to-sound rules, be ignored or cause synthesis to abort).",
        "Some modules offer choices between functionally equivalent modules by simply setting global parameters.",
        "For example we have two modules which predict durations for phonemes.",
        "One is based on the Klatt duration rules in [2, Ch.",
        "9], while the second is based on Campbell's work [4].",
        "Selection between them is simply by a cormnancl of the form"
      ]
    },
    {
      "heading": "chatr> (Parameter Duration_Method KLATT)",
      "text": [
        "Another section where selection of equivalent modules is common is the low-level synthesis methods.",
        "We wish to allow comparison of different forms of waveform synthesis based on the sane utterance.",
        "Currently, offers a umnbe• of synthesis methods: Klat, forrnant synthesis, I,PC based di-phone synthesis, and a. number of concatenative synthesis methods (each with its own internal options to choose between different unit selection strategies).",
        "'Plc same utterance (with the same segments, durations and intonation) can be resynthesized with a different, waveform generation module allowing direct comparison between methods.",
        "New low-level synthesis methods can be easily added tam king an utterance structure as a. parameter and generating a waveform on return.",
        "Certain other modules in CHATI.t.",
        "are not directly part, of the synthesis process.",
        "Audio output, is provided for through a general module that.",
        "plays the waveform stream of an utterance.",
        "We provide a number of mechanisms to do this.",
        "We wish CI !NFU, to he independent of hardware so we offer support for audio ,securers.",
        "These are network transparent systems that, allow access to audio hardware.",
        "In the same paradigm as A windows for graphics, audio servers offer a. uniform access method for various audio devices such that waveforms (which internally describe their encoding, byte order and sampling frequency) can lie easily be played.",
        "We also older command driven play routines to ensure CHATli, will work on any machine with audio output.",
        "Similarly a display module is offered that can graphically display an utterance's waveform, phonemes, words, syllables, intonation etc.",
        "Rather than incorporate a full graphical display mechanism in CHATR, itself we offer interfaces to other systems with graphics capability.",
        "Currently we support two systems: Naropic's waves-I-system and Xing, a, free-software speech graphics package.",
        "IFixarnple synthesis As stated above CI I ATH, oilers many levels of synthesis but here we will discuss one particular configuration.",
        "One of the uses CIIA'I'li, is put to is in a. speech translation system.",
        "The translation part, of the system generates syntactic and semantic: trees (represented as feature structures) of the utterance to be spoken.",
        "'Phis is used in-; the input to one of ClIA'InIrs input inodes.",
        "The following diagram sketches the information flow",
        "'Pile input specifies speech act information and topic/focus information.",
        "A rule driven system translates this input to a. lower level -form.",
        "Prosodic phrasing is generated from syntactic structure and special features in the input.",
        "Intonation tone generated based on speech act and topic markers.",
        "The result, held in the.",
        "Phonological Word stream is then passed to lower levels.",
        "The lexicon is used to find a word's syllable structure and default pronunciation.",
        "Au intonation module generates lea target, points based on the generated intonation features (and speaker specific intonation parameters).",
        "A duration module generates phoneme durations based on 1)11011(11w context and intonational features.",
        "All this low-level information is brought together in the scgmcnt sircam.",
        "Depending on selection, one low-level synthesis /nodule is then called to generate a waveform based on the information in the segment stream.",
        "Using paranniter settings to select, the form of synthesis required means that, (Th/V.Illd call easily be used for multi-speaker synthesis, and also we hope for 1111116-lauguage synthesis."
      ]
    },
    {
      "heading": "Implementation",
      "text": [
        "CEIATII.",
        "is written in a mixture of ANSI C and C++.",
        "The core architecture is written in C, but perhaps C would be more suitable as the core objects (utterances and streams) fit well into the object-oriented paradigm.",
        "Other modules are written in C or C I for reasons related to history as well as appropriateness.",
        "The Lisp command system is in fact a small Scheme interpreter written specially for An interactive coital-land line interface offers command line editing, history and completion for commands, their a.rgurnents, variables and file names.",
        "This interface makes the system sigitificantly easier to use, though CHAIR may also be used in batch mode.",
        "'Elie system runs on a number of different architectures (including those with different byte order) including Sun SPARes, I1Ps, DECstations and 386113S1D.",
        "It should port to any system with an ANSI C and C++ compiler."
      ]
    },
    {
      "heading": "Discussion",
      "text": [
        "One enhancement to the system currently being discussed is a. much more formal definition of modules.",
        "A module has prerequisites and provides some result.",
        "It should be possible to explicitly declare these so that a. niodule will only be invoked when the necessary prerequisites are met.",
        "A much clearer way of dumping an utterance in a form which can be easily reloaded is also required.",
        "As we wish to allow CHATR to interface with other existing speed' synthesis systems this may involve communication with a completely separate program.",
        "Being able to dump the full utterance structure and convert it to some alternative form for another program to operate on and then convert it back, reload and continue is something that would make CHATII touch more useful in cooperating with other synthesis programs.",
        "Complete freedom of development can somet.i.MOS be too genera].",
        "Although as a system, Clilnut does not.",
        "restrict how modules interact,, if we are to be able to compare similar subsystems it is necessary that those subsystems act on the same data.",
        "Hence most of our low-level synthesis methods actually work from the information in the segment stream.",
        "That is they Lake exactly the same input.",
        "Even when existing synthesizers are integrated into CHATR we encourage use of the segment stream as a colninon intermediate stage between high-level synthesis and low-level waveform generation.",
        "Other laboratories are also aware of the problems of multiple synthesizers and require a common environment for their development.",
        "COMPOST [1] is one such system.",
        "Unlike CHATE.",
        "it introduces a new language for high-level synthesis specification but like CHAIR it offers a choice of low-level synthesizers that can be selected for each utterance.",
        "ClIA'r It's currently implemented features include: a well defined architecture, multiple types of input, choice of waveform synthesis methods, para.meterized intonation features, two duration modules, abstract phoneme sets, a text-to-speech module, graphical displays and an utterance object inspector.",
        "Current, expansion includes improving unit selection for concatenative synthesis and integrating f)-TALK [5] a. Japanese non-uniform unit concatenative synthesis system, making CHAR'll into a multi-language synthesis system.'",
        "Thus CHAIR may be used at, ninny levels.",
        "First, simply as a. black box speech synthesizer.",
        "Simple control of voice is possible and the text-to-speech component.",
        "is a.clequate for many purposes.",
        "At a. deeper level, ClIATB.",
        "can be used interactively, allowing experimentation with intonational features and rules, resynthesizing existing utterances with modified durations and pitch, building new unit databases, all without nioclification of C sources.",
        "At.",
        "the deepest, level CHAIR].",
        "may be used to develop new synthesis algorithms: unit selection strategies, new intonation modules etc, may easily be added, building cleanly on the existing architecture.",
        "In summary CLEATII.",
        "goes a fair way to meet, our original criteria.",
        "Acknowledgements: The authors wish to acknowledge the help and comments by Nick_ Campbell and Norio lliguchi and the members of Department 2."
      ]
    }
  ]
}
