{
  "info": {
    "authors": [
      "Diego Burgos"
    ],
    "book": "Proceedings of the NAACL HLT 2010 Young Investigators Workshop on Computational Approaches to Languages of the Americas",
    "id": "acl-W10-1611",
    "title": "Combining CBIR and NLP for Multilingual Terminology Alignment and Cross-Language Image Indexing",
    "url": "https://aclweb.org/anthology/W10-1611",
    "year": 2010
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Combining CBIR and NLP for Multilingual Terminology Alignment",
        "and Cross-Language Image Indexing",
        "Diego A. Burgos Herrera",
        "Translation and New Technologies Group University of Antioquia Calle 67 No.",
        "In this paper, an overview of an approach for cross-language image indexing and multilingual terminology alignment is presented.",
        "Content-Based Image Retrieval (CBIR) is proposed as a means to find similar images in target language documents in the web and natural language processing is used to reduce the search space and find the image index.",
        "As the experiments are carried out in specialized domains, a systematic and recursive use of the approach is used to align multilingual terminology by creating repositories of images with their respective cross-language indices."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Images, as representation of real world entities, constitute a sine qua non prerequisite for a number of language tasks.",
        "For instance, children as well as foreign language learners often resort to images in order to concretize lexical learning through associative processes (cf. Bloom, 2000: 57).",
        "Likewise, human translators particularly benefit a lot from images when dealing with specialized texts.",
        "For example, a word-based image search is a very useful technique to enhance understanding of the source text and achieve precision in the target text.",
        "In the context of online resources, a site with the image of a device provides the translator not only with an illustration of the object, but also with hyperlinks to websites containing relevant information.",
        "However, for an integral usage of images as a supportive resource for automated language processes, comprehensive indexed image databases as well as wide-coverage lists of suitable index terms are required.",
        "The availability of such lists and the material to index images are language dependent.",
        "For instance, for English, considerably more resources are available than for Spanish.",
        "A study carried out by Burgos (2006) with bilingual Spanish-English terminological dictionaries revealed that the average of retrieved Spanish documents per term from the web was dramatically lower (7,860) than the average of retrieved English documents (246,575).",
        "One explanation to this is the huge size of the web search space for English and the little search space for Spanish.",
        "However, another reason is that Spanish terms found in traditional terminological dictionaries could not be of conventional usage among experts and do not represent what is actually contained in the search space.",
        "Therefore, more suitable index terms must be looked for.",
        "In the present work, content-based image retrieval (CBIR) is proposed as a means for multilingual terminology retrieval from the web with the purpose of aligning a multilingual glossary and building up an image index.",
        "The main goal of this research is to exploit the co-occurrence of images and terms in specialized texts which has been called the bimodal co-occurrence (BC).",
        "Experiments have been done so far for English and Spanish with a few observations in other languages, e.g., Portuguese.",
        "Figure 1 shows a forecast of the whole system.",
        "The following section provides references on previous work and suggests that the use of terminology for indexing specialized domain images in a bilingual or multilingual setting has not been discussed in previous literature.",
        "Section 3 describes the bimodal co-occurrence (BC) hypothesis with more detail.",
        "Section 4 provides an overview of how CBIR supports image indexing and term alignment and includes an outline of the procedure to select candidate indices through concrete / abstract discrimination.",
        "Section 5 presents the current appeals and needs of this research and section 6 sketches the future work.",
        "Figure 1.",
        "Forecast of the system.",
        "A spider is launch to the Internet.",
        "Websites fulfilling predefined criteria are temporarily saved and their images analyzed by DORIS.",
        "If an image in the website presents feature values within a threshold determined by the example image features, nouns are extracted and classified from the surrounding text to make up a list of candidate target terms which could designate the object in the website's image.",
        "Finally, index-image alignment is carried out."
      ]
    },
    {
      "heading": "2. Related Research",
      "text": [
        "The particular nature of this research where linguistic and visual representations converge to make up a bimodal co-occurrence which is intended to be exploited for multilingual term retrieval from the web requires the support of diverse specialized knowledge to be applied along the image-based multilingual term retrieval proposed here.",
        "As a consequence, the required processes will be framed within or related to the fields and sub-fields of cross-language information retrieval, cross-language retrieval from image collections, image-term alignment, image annotation and content-based image retrieval.",
        "Many of the latest contributions on the above mentioned fields have been presented in widely known events such as the Text Retrieval Conference (TREC), the Cross-Language Evaluation Forum (CLEF), the Language Resource Evaluation Conference (LREC), the Special Interest Group in Information Retrieval (SIGIR) Conference or the Symposium on String Processing and Information Retrieval (SPIRE), among others.",
        "For work related to cross-language image retrieval which deals with the problem of retrieving images from multilingual collections, see Clough et al.",
        "(2006), Clough et al.",
        "(2005), Clough (2005), Bansal et al.",
        "(2005), Daumke et al.",
        "(2006), Iz-quierdo-Beviâ et al.",
        "(2005) or Peinado et al.",
        "(2005).",
        "Likewise, for standard and alternatives proposals for Content-Based Image Retrieval systems, the reader can check DORIS (Jaramillo and Branch, 2009b), CIRES (Iqbal and Aggarwal, 2003), QBIC (Flickner et al., 1995), PHOTOBOOK(Pentland et al., 1996), IMATCH and Visual-SEEk (Smith and Chang, 1996), Nakazato et al.",
        "hand, for a detailed description of the CBIR standard technology, see Urcid Pliego (2003), Geradts (2003) or Rui et al.",
        "(1999) who present concrete information on the main features for CBIR as well as on some related systems and research.",
        "For web-based CBIR related work, see Carson et al.",
        "(2002), Yi et al., (2000), Chang et al.",
        "(1997), Tollmar et al.",
        "(2004) or Drelie et al.",
        "(2007).",
        "An updated review, compilation of CBIR techniques, real world applications, evaluation techniques and interesting references can be found in Datta et al.",
        "(2008).",
        "Content and Text-Based Cross-Language Image Retrieval works can be found in Alvarez et al.",
        "http://www.ctr.columbia.edu/~jrsmith/html/pubs/acmmm96/ac mfin.html",
        "let (2006), Chang and Chen (2006) or Deselaers et al.",
        "(2006).",
        "Image Annotation contributions can be reviewed in Barnard et al.",
        "(2003), Cheng et al.",
        "(2005), Liu et al.",
        "(2006), Qiu et al.",
        "(2006), Rahman et al.",
        "(2005), Florea et al., (2006), Güld et al.",
        "(2006), Petkova and Ballesteros (2005), Müller et al.",
        "(2006) or Li and Wang (2003).",
        "Finally, some image-term alignment work has been presented in Burgos and Wanner (2006), Dec-lerck and Alcantara (2006); Li and Wang (2003); Barnard and Forsyth (2001); Pastra (2006) and Wang et al.",
        "(2004)."
      ]
    },
    {
      "heading": "3. BC Hypothesis",
      "text": [
        "The starting point of this proposal is the BC hypothesis which can be defined as follows.",
        "We assume language independent bimodal cooccurrence of images and their index terms in the corpus.",
        "This implies that if an image occurs in a document of the corpus, the corresponding index term will also occur in the same document (see Figure 2).",
        "Figure 2 also suggests the BC in a bilingual setting.",
        "That is, when there is an image of an object in the source language corpus along with its index term there should also be an image of the same object along with its index term in the target language corpus.",
        "This means that matching both images would get the two equivalent terms closer.",
        "Table 1 shows an example of the bilingual setting of the BC.",
        "Both bimodal pairs (image and term) were extracted from manually tracked websites.",
        "It is an example of two manually matched images taken from two different language websites which also serve to illustrate how cross-language equivalences between index terms can be established.",
        "In order to prove this BC assumption with some more representative data, a preliminary empirical study (carried out initially for English) was carried out.",
        "A sub-corpus of 20 noun phrases designating concrete entities from the automotive industry was extracted from an issue of the Automotive Engineering International Online journal's Tech Briefs section and used to retrieve documents from the web.",
        "The first 10 results (i.e., web pages) for each term were stored.",
        "Each of the web pages was manually analyzed to check the BC.",
        "The result was that the 20 terms confirmed the BC-hypothesis in 145 sites (out of 200) which means a 72.5% of positive cases."
      ]
    },
    {
      "heading": "4. CBIR-Based Image indexing",
      "text": [
        "In order to make the most of the BC, it is necessary to automate the process of image matching and image indexing.",
        "The fact of matching two images coming from different language documents generates comparable corpora (i.e., topic related) and increases the probability of aligning two equivalent terms by reducing the search space.",
        "To do so, we use DORIS, a Domain-ORiented Image Searcher (Jaramillo and Branch, 2009a).",
        "DORIS is a JAVA application to retrieve visual information which uses both geometric and Zernike moments based on texture and shape information contained in images.",
        "DORIS performance reaches a 90% of precision (Jaramillo and Branch, 2009b).",
        "For the image indexing, we first start from a source language indexed image.",
        "An internet segment in the target language is delimited as the search space whose images are compared with the source language image using DORIS.",
        "When a positive image matching occurs, the target language document containing the matched image is marked as a potential location of the target language index term.",
        "1 Mill d.f",
        "1 neLp\\",
        "Slip-Ring FD 3G Colrefor Fond 3G U3 nmn",
        "Given that more noise results from a large search space, the size of the image database is usually one of the major concerns in CBIR applications.",
        "In our work, we observed that the first problem to tackle is the appropriate definition of the web segment that will constitute the search space.",
        "Therefore, scalability and quality issues will be initially addressed by systematically predefining the websites which could contain the image and therefore the target term.",
        "In this regard, and as a starting point, the Open Directory Project is used to define our search space.",
        "This way, not only categories but also languages can be filtered.",
        "For example, the url http : //www.dmoz .org/Business/Automotive/ leads to the automotive category which contains subcategories and sites in English.",
        "On the other hand, following the url http : //www.dmoz .org/World/Espanol/Negocios/Ind ustrias/Automotriz/ which specifies the language, the user finds subcategories and sites of the category automotriz for Spanish.",
        "The image database size and quality will depend on this definition.",
        "Uniformity is more likely, for example, within the photographs of the same site than between the images of two or more sites.",
        "Likewise, there will be greater variance of image characteristics between the images of two different domains than within the images of the same domain, and so on.",
        "Current results were achieved using DORIS.",
        "The observations made so far with respect to matching of images on the web suggest that some positive matches in rather homogeneous search spaces provided enough target index term locations to pursue index candidate selection.",
        "As it has been suggested, BC can be used for monolingual or bilingual indexing.",
        "Once this setting has been decided and the target image has been located as described in the previous section, the index candidate selection can be carried out but, before, it is possible to reduce even more the search space for the index term location by parsing the text surrounding the target image and extracting the noun phrases (NP).",
        "We distinguish NPs from other sort of phrases by means of a chunker.",
        "Once all NPs have been extracted, some normalization is done in order to optimize the coming noun classification stage.",
        "The cleaning consists of removing determiners at the beginning of the phrase; lemmatization (if appropriate); discarding NPs whose head noun is an acronym; splitting Saxon possessives, and deleting proper nouns and numbers:",
        "three development objectives --> development objective FSE 's single direct injector --> single direct injector",
        "Given the nature of the association, we are focusing, that is image-term alignment, the list of remaining NPs can be additionally pruned by classifying nouns intro concrete and abstract.",
        "Classifying nouns as denoting an abstractum or a concretum is not a trivial task and cannot be widely covered in this paper because of the limited space.",
        "It can be said, however, that for noun classification, some approaches have been considered here.",
        "For example, remarkable contributions were made particularly by Bullinaria (2008), Katrenko and Adriaans (2008), Peirsman et al.",
        "(2008), and Versley (2008).",
        "They use word space and syntactic models which, in some cases, behave very well.",
        "As for the present study experimentation concerning noun classification, three approaches were tested.",
        "The number one used non-linguistic variables, the number two was based on syntactic patterns and the number three used lexical semantics information taken from WordNet (Fellbaum, 1998).",
        "The automatic semantic annotation was done by the SuperSenseTagger (Ciaramita, 2006).",
        "In fact, it is the latter approach the one that yielded the best results with a precision of 88.6% (for detailed information, see Burgos, 2009).",
        "Concrete Abstract",
        "Concrete 81",
        "Abstract 14",
        "Table 2.",
        "Results of noun classification for 100 concrete nouns and 100 abstract nouns.",
        "The first two columns/rows show the confusion matrix",
        "These figures suggest that out of 95 concrete nouns, 81 were correctly annotated, and that out of 98 abstract nouns, 90 were annotated with the right sense.",
        "With a 90% of precision in image matching and an 88.6% of precision in the noun classification task, we assume a high probability of having the right image with a reduced list of index candidates.",
        "Now, the indexing process can be simplified if the image file name matches any of the candidates.",
        "For cases where such matching does not occur, the following procedure is proposed.",
        "For indexing the target image, each candidate is used to query the image database (e.g., Google) for images.",
        "For each candidate, the 20 first retrieved images are compared with the target image using DORIS.",
        "When a positive image match occurs, the original image is indexed with the candidate that was used to retrieve from the web the image that yielded the positive image match.",
        "Table 4 illustrates this procedure by an example.",
        "In the example, the images retrieved by steering wheel and air filter did not match with the original image, but one of the images retrieved by cylinder head did.",
        "Therefore, the original image is indexed as cylinder head."
      ]
    },
    {
      "heading": "5. Discussion",
      "text": [
        "The approach shows that image indices can be assigned taking into account usage, specificity and geographical variants.",
        "The fact of indexing the image with a term retrieved from its context assures that the index term is being used.",
        "Moreover, this technique tries to retrieve the appropriate degree of specificity that the index of a specific domain image is expected to present – which is often determined by the number of modifiers of multiword expressions.",
        "Likewise, even for specialized discourse, indices should respond to geographical variants.",
        "This aspect can be controlled by specifying country domains."
      ]
    },
    {
      "heading": "6. Appeals and needs",
      "text": [
        "This work could be incorporated with projects dealing with the access to existing information bases by providing multilingual and multimodal extensions to them.",
        "For instance, assistive technology databases (e.g. EASTIN) or patent retrieval engines (cf. Codina et al., 2008) which contain a great deal of visual content.",
        "Content-Based Image Retrieval (CBIR) is an important contribution to multimodal information retrieval.",
        "In addition, pairing images with equivalent multilingual terminology has become a matter of interest, particularly in specialized domains.",
        "This work could integrate CBIR and natural language processing (NLP) techniques so that images can be used as language independent representations to help in finding documents of textual or ontology descriptions.",
        "Our approach can be especially useful for web users who do not know the structure of the classification system to successfully search or when they do not know the language and special terminology of the information base.",
        "Thus, this work can be integrated to other systems in order to provide cross-lingual retrieval and machine translation for both queries and documents and to enable visualization support for query formulation and document content presentation.",
        "Given the nature of this research's products, they can be included into the scope of multilingual-ity by combining CBIR and cross-language information retrieval technology.",
        "A link to terminological databases can also be established so they can be automatically fed with entries and visual content.",
        "No",
        "annotation",
        "No analysis",
        "1",
        "4",
        "0",
        "2",
        "NP",
        "Google Images",
        "Original image",
        "Matching",
        "(+/-)",
        "New index",
        "steering wheel",
        "# – ",
        "# -",
        "t",
        " – ",
        "cylinder head",
        "a – ",
        "t – ",
        "OBJ; – y",
        "t",
        "+",
        "t",
        "cylinder head",
        "air filter",
        "0 – ",
        "0 – ",
        "t",
        " – ",
        "As for this research needs, an adaptation of the SST to Spanish would be really valuable.",
        "The SST has already been ported to Italian which represents an interesting experience to take into account.",
        "On the other hand, optimization and integration of the research modules such as a web crawler and an interface for CBIR and noun classification are still pending."
      ]
    },
    {
      "heading": "7. Future work",
      "text": [
        "Given that not all process stages of the proposal presented in this paper have been completely integrated and automated, an overall evaluation has not been possible so far.",
        "Future work aims at integrating DORIS in modules for index candidate selection and index-image alignment.",
        "The goal is to be able to compile multilingual specialized glossaries after systematic and recursive exploration of well delimited web segments and storage of images with their respective cross-language indices.",
        "Likewise, some other methods to improve discrimination between concrete and abstract nouns will be researched.",
        "The above cited related works in this line have not been tested yet for our proposal, but, for future work, they will be taken into account provided that these models rely on local information and it certainly represents an advantage for this specific task.",
        "Even if linguistic specific features are hard to find in both classes of nouns, they are not completely discarded.",
        "Finally, further experiments will be carried out with other domains than automotive engineering."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This study is part of a wider research work being carried out by the author within the framework of his PhD thesis at the IULA, Universitat Pompeu Fabra, Barcelona, Spain.",
        "It was partially supported by a grant from the Government of Catalonia according to resolution UNI/772/2003 of the Depar-tament d'Universitats, Recerca i Societat de la Informaciö dated March 10th, 2003.",
        "The author is very grateful with the anonymous reviewers of this paper as well as with Leo Wanner and Stefanos Vrochidis for their valuable comments."
      ]
    }
  ]
}
