{
  "info": {
    "authors": [
      "Ergun Bicici",
      "Josef van Genabith"
    ],
    "book": "*SEM",
    "id": "acl-S13-2098",
    "title": "CNGL: Grading Student Answers by Acts of Translation",
    "url": "https://aclweb.org/anthology/S13-2098",
    "year": 2013
  },
  "references": [
    "acl-J93-2003",
    "acl-N12-1021",
    "acl-P02-1040",
    "acl-S12-1059",
    "acl-S13-1034",
    "acl-S13-2045",
    "acl-W11-2131",
    "acl-W11-2137",
    "acl-W12-3102"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We invent referential translation machines (RTMs), a computational model for identifying the translation acts between any two data sets with respect to a reference corpus selected in the same domain, which can be used for automatically grading student answers.",
        "RTMs make quality and semantic similarity judgments possible by using retrieved relevant training data as interpretants for reaching shared semantics.",
        "An MTPP (machine translation performance predictor) model derives features measuring the closeness of the test sentences to the training data, the difficulty of translating them, and the presence of acts of translation involved.",
        "We view question answering as translation from the question to the answer, from the question to the reference answer, from the answer to the reference answer, or from the question and the answer to the reference answer.",
        "Each view is modeled by an RTM model, giving us a new perspective on the ternary relationship between the question, the answer, and the reference answer.",
        "We show that all RTM models contribute and a prediction model based on all four perspectives performs the best.",
        "Our prediction model is the 2nd best system on some tasks according to the official results of the Student Response Analysis (SRA 2013) challenge."
      ]
    },
    {
      "heading": "1 Automatically Grading Student Answers",
      "text": [
        "We introduce a fully automated student answer grader that performs well in the student response analysis (SRA) task (Dzikovska et al., 2013) and especially well in tasks with unseen answers.",
        "Automatic grading can be used for assessing the level of competency for students and estimating the required tutoring effort in e-learning platforms.",
        "It can also be used to adapt questions according to the average student performance.",
        "Low scored topics can be discussed further in classrooms, enhancing the overall coverage of the course material.",
        "The quality estimation task (QET) (Callison-Burch et al., 2012) aims to develop quality indicators for translations at the sentence-level and predictors without access to the reference.",
        "Bicici et al.",
        "(2013) develop a top performing machine translation performance predictor (MTPP), which uses machine learning models over features measuring how well the test set matches the training set relying on extrinsic and language independent features.",
        "The student response analysis (SRA) task (Dzikovska et al., 2013) addresses the following problem.",
        "Given a question, a known correct reference answer, and a student answer, assess the correctness of the student's answer.",
        "The student answers are categorized as correct, partially correct incomplete, contradictory, irrelevant, or non domain, in the 5-way task; as correct, contradictory, or incorrect in the 3-way task; and as correct or incorrect in the 2-way task.",
        "The student answer correctness prediction problem involves finding a function f approximating the student answer correctness given the question (Q), the answer (A), and the reference answer (R): f(Q,A,R) ?",
        "q(A,R).",
        "(1) We approach f as a supervised learning problem with (Q, A, R, q(A,R)) tuples being the training",
        "data and q(A,R) being the target correctness score.",
        "We model the problem as a translation task where one possible interpretation is translating Q (source to translate, S) to R (target translation, T) and evaluating with A (as reference target, RT) (QRA).",
        "Since the information appearing in the question may be repeated in the reference answer or may be omitted in the student answer, it also makes sense to concatenate Q and A when translating to R (QARQA).",
        "We obtain 4 different perspectives on the ternary relationship between Q, A, and R depending on how we model their relationship as an instance of translation:",
        "In machine translation (MT), pairs of source and target sentences are used for training statistical MT (SMT) models.",
        "SMT system performance is affected by the amount of training data used as well as the closeness of the test set to the training set.",
        "MTPP (Bic?ici et al., 2013) is a top performing machine translation performance predictor, which uses machine learning models over features measuring how well the test set matches the training set to predict the quality of a translation without using a reference translation.",
        "MTPP measures the coverage of individual test sentence features and syntactic structures found in the training set and derives feature functions measuring the closeness of test sentences to the available training data, the difficulty of translating the sentence, and the presence of acts of translation involved."
      ]
    },
    {
      "heading": "Features for Translation Acts",
      "text": [
        "MTPP uses n-gram features defined over text or common cover link (CCL) (Seginer, 2007) structures as the basic units of information over which similarity calculations are made.",
        "Unsupervised parsing with CCL extracts links from base words to head words, which allow us to obtain structures representing the grammatical information instantiated in the training and test data.",
        "Feature functions use statistics involving the training set and the test sentences to determine their closeness.",
        "Since they are language independent, MTPP allows quality estimation to be performed extrinsically.",
        "Categories for the 283 features used are listed below and their detailed descriptions are presented in (Bic?ici et al., 2013) where the number of features are given in {#}.",
        "?",
        "Coverage {110}: Measures the degree to which the test features are found in the training set for both S ({56}) and T ({54}).",
        "?",
        "Synthetic Translation Performance {6}: Calculates translation scores achievable according to the n-gram coverage.",
        "?",
        "Length {4}: Calculates the number of words and characters for S and T and their ratios.",
        "?",
        "Feature Vector Similarity {16}: Calculates the similarities between vector representations.",
        "?",
        "Perplexity {90}: Measures the fluency of the sentences according to language models (LM).",
        "We use both forward ({30}) and backward",
        "({15}) LM based features for S and T. ?",
        "Entropy {4}: Calculates the distributional similarity of test sentences to the training set.",
        "?",
        "Retrieval Closeness {24}: Measures the degree to which sentences close to the test set are found in the training set.",
        "?",
        "Diversity {6}: Measures the diversity of co-occurring features in the training set.",
        "?",
        "IBM1 Translation Probability {16}: Calculates the translation probability of test sentences using the training set (Brown et al., 1993).",
        "?",
        "Minimum Bayes Retrieval Risk {4}: Calculates the translation probability for the translation having the minimum Bayes risk among the retrieved training instances.",
        "?",
        "Sentence Translation Performance {3}: Calcu",
        "lates translation scores obtained according to q(T,R) using BLEU (Papineni et al., 2002), NIST (Doddington, 2002), or F1 (Bic?ici and Yuret, 2011b) for q."
      ]
    },
    {
      "heading": "3 Referential Translation Machine (RTM)",
      "text": [
        "Referential translation machines (RTMs) we develop provide a computational model for quality and semantic similarity judgments using retrieval of relevant training data (Bic?ici and Yuret, 2011a; Bic?ici, 2011) as interpretants for reaching shared semantics (Bic?ici, 2008).",
        "We show that RTM achieves",
        "very good performance in judging the semantic similarity of sentences (Bic?ici and van Genabith, 2013) and we can also use RTM to automatically assess the correctness of student answers to obtain better results than the baselines proposed by (Dzikovska et al., 2012), which achieve the best performance on some tasks (Dzikovska et al., 2013).",
        "RTM is a computational model for identifying the acts of translation for translating between any given two data sets with respect to a reference corpus selected in the same domain.",
        "RTM can be used for automatically grading student answers.",
        "An RTM model is based on the selection of common training data relevant and close to both the training set and the test set where the selected relevant set of instances are called the interpretants.",
        "Interpretants allow shared semantics to be possible by behaving as a reference point for similarity judgments and providing the context.",
        "In semiotics, an interpretant I interprets the signs used to refer to the real objects (Bic?ici, 2008).",
        "RTMs provide a model for computational semantics using interpretants as a reference according to which semantic judgments with translation acts are made.",
        "Each RTM model is a data translation model between the instances in the training set and the test set.",
        "We use the FDA (Feature Decay Algorithms) instance selection model for selecting the interpretants (Bic?ici and Yuret, 2011a) from a given corpus, which can be monolingual when mod-eling paraphrasing acts, in which case the MTPP model is built using the interpretants themselves as both the source and the target side of the parallel corpus.",
        "RTMs map the training and test data to a space where translation acts can be identified.",
        "We view that acts of translation are ubiquitously used during communication: Every act of communication is an act of translation (Bliss, 2012).",
        "Translation need not be between different languages and paraphrasing or communication also contain acts of translation.",
        "When creating sentences, we use our background knowledge and translate information content according to the current context.",
        "Given a training set train, a test set test, and some monolingual corpus C, preferably in the same domain as the training and test sets, the RTM steps",
        "are: 1.",
        "T = train ?",
        "test.",
        "2. select(T, C)?",
        "I 3.",
        "MTPP(I,train)?",
        "Ftrain 4.",
        "MTPP(I,test)?",
        "Ftest",
        "Step 2 selects the interpretants, I, relevant to the instances in the combined training and test data.",
        "Steps 3 and 4 use I to map train and test to a new space where similarities between the translation acts can be derived more easily.",
        "RTM relies on the representativeness of I as a medium for building translation models for translating between train and test.",
        "Our encouraging results in the SRA task provides a greater understanding of the acts of translation we ubiquitously use when communicating and how they can be used to predict the performance of translation, judging the semantic similarity of text, and evaluating the quality of student answers.",
        "RTM and MTPP models are not data or language specific and their modeling power and good performance are applicable across different domains and tasks.",
        "RTM expands the applicability of MTPP by making it feasible when making monolingual quality and similarity judgments and it enhances the computational scalability by building models over smaller but more relevant training data as interpretants."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "SRA involves the prediction on Beetle (student interactions when learning conceptual knowledge in the basic electricity and electronics domain) and SciEntsBank (science assessment questions) datasets.",
        "SciEntsBank is harder due to containing questions from multiple domains (Dzikovska et al., 2012).",
        "SRA challenge results are evaluated with the weighted average F1, Fw1 =",
        "The lexical baseline system is based on measures of lexical overlap using 4 features: the number of overlapping words, F1, Lesk (Lesk, 1986), and cosine scores over the words when comparing A and",
        "2/(|A||R|), where M contains the maximal overlapping phrases that match in",
        "A and R and |p |is the length of a phrase 1.",
        "This lexical baseline is highly competitive: no submission performed better in the 2-way Beetle unseen questions task."
      ]
    },
    {
      "heading": "4.1 RTM Models",
      "text": [
        "We obtain CNGL results for the SRA task as follows.",
        "For each perspective described in Section 1, we build an RTM model.",
        "Each RTM model views the SRA task from a different perspective using the 283 features extracted dependent on the interpretants using MTPP.",
        "We extract the features both on the training set of 4155 and the test set of 1258 (Q, A, R) sentence triples for the Beetle task and the training set of 5251 and the test set of 5835 (Q, A, R) sentence triples for the SciEntsBank task.",
        "The addition of lexical overlap baseline features slightly helps.",
        "We use the best reference answer if the reference answer is not identified in the training set.",
        "The training corpus used is the English side of an out-of-domain corpus on European parliamentary discussions, Europarl (Callison-Burch et al., 2012) 2, to which we also add the unique sentences from R. In-domain corpora are likely to improve the performance.",
        "We do not perform any linguistic processing or use other external resources.",
        "We use only extrinsic features, or features that are ignorant of any information intrinsic to, and dependent on, a given language or domain.",
        "We use the training corpus to build a 5-gram target LM.",
        "We use ridge regression (RR) and support vector regression (SVR) with RBF kernel (Smola and Scho?lkopf, 2004).",
        "Both of these models learn a regression function using the features to estimate a numerical target value.",
        "The parameters that govern the behavior of RR and SVR are the regularization ?",
        "for RR and the C, , and ?",
        "parameters for SVR.",
        "At testing time, the predictions are bound so as to have scores in the range [0, 1], [0, 2], or [0, 4] and rounded for finding the predicted category."
      ]
    },
    {
      "heading": "4.2 Training Results",
      "text": [
        "Table 1 lists the 10-fold cross-validation (CV) results on the training set for RR and SVR for different RTM systems without the parameter optimization.",
        "As we combine different perspectives, the performance improves and we use the",
        "sions using RR for run 1, SVR for run 2.",
        "ARA performs the best among individual perspectives.",
        "Each additional perspective adds another 283 features to the representation.",
        "We perform tuning on a subset of the Beetle and SciEntsBank datasets separately after including the baseline lexical overlap features and optimize against the performance evaluated withR2, the coefficient of determination.",
        "SVR performance is given in Table 2.",
        "The CNGL system significantly outperforms the lexical overlap baseline in all tasks for Beetle and in the 2-way task for SciEntsBank.",
        "For"
      ]
    },
    {
      "heading": "4.3 SRA Challenge Results",
      "text": [
        "The SRA task test set alo contains instances that belong to unseen questions (uQ) and unseen domains (uD), which make it harder to predict.",
        "The training data provided for the task correspond to learning with unseen answers (uA).",
        "Table 3 presents the SRA challenge results containing the lexical overlap, our CNGL SVR submission (RR is slightly worse), and the maximum and mean results 3.",
        "According to the official results, CNGL SVR is the 2nd best system based on 5-way evaluation (4th",
        "the lexical overlap baseline, and the maximum and mean results for 2-way, 3-way, or 5-way tasks.",
        "uA, uQ, and uD correspond to unseen answers, questions, and domains.",
        "result overall) and the 3rd best system based on 2 way and 3-way evaluation (5th result overall) on the uQ Beetle task.",
        "The SVR model performs better than the lexical baseline and the mean result in the Beetle task but performs worse in the SciEntsBank.",
        "The lower performance is likely to be due to using an out-of-domain training corpus for building the RTM models and on the uQ and uD tasks, it may also be due to optimizing on the uA task only.",
        "The lower performance in SciEntsBank is also due to multiple question domains (Dzikovska et al., 2012).",
        "with tuning for 2-way, 3-way, or 5-way tasks."
      ]
    },
    {
      "heading": "4.4 Improved RTM Models",
      "text": [
        "We improve the RTM model with the expansion of our representation by adding the following features: ?",
        "Character n-grams {4}: Calculates the cosine between the character n-grams (for n=2,3,4,5) obtained for S and T (Ba?r et al., 2012).",
        "?",
        "LIX {2}: Calculates the LIX readability score (Wikipedia, 2013; Bjo?rnsson, 1968) for S and T. 4 Table 4 lists the improved results on the training set after tuning, which shows about 0.04 increase in all scores when compared with Table 1 and Table 2.",
        "Table 5 presents the improved SVR results on the SRA task test set, which shows about 0.03 increase in all scores when compared with Table 3.",
        "SVR becomes the 2nd best system and 2nd best result in 2-way evaluation and the 3rd best system from the top based on 2-way and 3-way evaluation (5th result overall) on the uQ Beetle task.",
        "A , where A is the number of words, C is words longer than 6 characters, B is words that start or end with any of ?.",
        "?, ?",
        ":?, ?!",
        "?, ???",
        "similar to (Hagstro?m, 2012).",
        "We observe that decision tree regression (Hastie et al., 2009) (TREE) generalizes to uQ and uD domains better than the RR or SVR models especially in the SciEntsBank corpus.",
        "Table 6 presents TREE results on the SRA SciEntsBank test set, which shows significant increase in uQ and uD tasks when compared with Table 5."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "Referential translation machines provide a clean and intuitive computational model for automatically grading student answers by measuring the acts of translation involved and achieve to be the 2nd best system on some tasks in the SRA challenge.",
        "RTMs make quality and semantic similarity judgments possible based on the retrieval of relevant training data as interpretants for reaching shared semantics."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work is supported in part by SFI (07/CE/I1142) as part of the Centre for Next Generation Localisation (www.cngl.ie) at Dublin City University and in part by the European Commission through the QTLaunchPad FP7 project (No: 296347).",
        "We also thank the SFI/HEA Irish Centre for High-End Computing (ICHEC) for the provision of computational facilities and support."
      ]
    }
  ]
}
