{
  "info": {
    "authors": [
      "Regina Barzilay",
      "Lillian Lee"
    ],
    "book": "Human Language Technology Conference and Meeting of the North American Association for Computational Linguistics",
    "id": "acl-N04-1015",
    "title": "Catching the Drift: Probabilistic Content Models, With Applications to Generation and Summarization",
    "url": "https://aclweb.org/anthology/N04-1015",
    "year": 2004
  },
  "references": [
    "acl-A97-1004",
    "acl-H01-1054",
    "acl-J98-3005",
    "acl-N03-1003",
    "acl-N03-1030",
    "acl-P03-1069",
    "acl-P94-1002",
    "acl-P97-1013",
    "acl-P99-1022",
    "acl-W03-0418",
    "acl-W03-1016",
    "acl-W90-0112",
    "acl-W97-0304"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We consider the problem of modeling the content structure of texts within a specific domain, in terms of the topics the texts address and the order in which these topics appear.",
        "We first present an effective knowledge-lean method for learning content models from unannotated documents, utilizing a novel adaptation of algorithms for Hidden Markov Models.",
        "We then apply our method to two complementary tasks: information ordering and extractive summarization.",
        "Our experiments show that incorporating content models in these applications yields substantial improvement over previously-proposed methods."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The development and application of computational models of text structure is a central concern in natural language processing.",
        "Document-level analysis of text structure is an important instance of such work.",
        "Previous research has sought to characterize texts in terms of domain-independent rhetorical elements, such as schema items (McKeown, 1985) or rhetorical relations (Mann and Thompson, 1988; Marcu, 1997).",
        "The focus of our work, however, is on an equally fundamental but domain dependent dimension of the structure of text: content.",
        "Our use of the term content corresponds roughly to the notions of topic and topic change.",
        "We desire models that can specify, for example, that articles about earthquakes typically contain information about quake strength, location, and casualties, and that descriptions of casualties usually precede those of rescue efforts.",
        "But rather than manually determine the topics for a given domain, we take a distributional view, learning them directly from unannotated texts via analysis of word distribution patterns.",
        "This idea dates back at least to Harris (1982), who claimed that various types of recurrence patterns seem to characterize various types of discourse.",
        "Advantages of a distributional perspective include both drastic reduction in human effort and recognition of topics that might not occur to a human expert and yet, when explicitly modeled, aid in applications.",
        "Of course, the success of the distributional approach depends on the existence of recurrent patterns.",
        "In arbitrary document collections, such patterns might be too variable to be easily detected by statistical means.",
        "However, research has shown that texts from the same domain tend to exhibit high similarity (Wray, 2002).",
        "Cognitive psychologists have long posited that this similarity is not accidental, arguing that formulaic text structure facilitates readers comprehension and recall (Bartlett, 1932).1 In this paper, we investigate the utility of domain specific content models for representing topics and topic shifts.",
        "Content models are Hidden Markov Models (HMMs) wherein states correspond to types of information characteristic to the domain of interest (e.g., earthquake magnitude or previous earthquake occurrences), and state transitions capture possible information-presentation orderings within that domain.",
        "We first describe an efficient, knowledge-lean method for learning both a set of topics and the relations between topics directly from unannotated documents.",
        "Our technique incorporates a novel adaptation of the standard HMM induction algorithm that is tailored to the task of modeling content.",
        "Then, we apply techniques based on content models to two complex text-processing tasks.",
        "First, we consider information ordering, that is, choosing a sequence in which to present a preselected set of items; this is an essential step in concept-to-text generation, multi-document summarization, and other text-synthesis problems.",
        "In our experiments, content models outperform Lapatas (2003) state-of-the-art ordering method by a wide margin for one domain and performance metric, the gap was 78 percentage points.",
        "Second, we consider extractive summa-'But formulaic is not necessarily equivalent to simple, so automated approaches still offer advantages over manual techniques, especially if one needs to model several domains.",
        "rization: the compression of a document by choosing a subsequence of its sentences.",
        "For this task, we develop a new content-model-based learning algorithm for sentence selection.",
        "The resulting summaries yield 88% match with human-written output, which compares favorably to the 69% achieved by the standard leading sentences baseline.",
        "The success of content models in these two complementary tasks demonstrates their flexibility and effectiveness, and indicates that they are sufficiently expressive to represent important text properties.",
        "These observations, taken together with the fact that content models are conceptually intuitive and efficiently learnable from raw document collections, suggest that the formalism can prove useful in an even broader range of applications than we have considered here; exploring the options is an appealing line of future research."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Knowledge-rich methods Models employing manual crafting of (typically complex) representations of content have generally captured one of three types of knowledge (Rambow, 1990; Kittredge et al., 1991): domain knowledge .",
        "Formalisms exemplifying each of these knowledge types are DeJongs (1982) scripts, McKeowns (1985) schemas, and Rambows (1990) domain-specific schemas, respectively.",
        "In contrast, because our models are based on a distributional view of content, they will freely incorporate information from all three categories as long as such information is manifested as a recurrent pattern.",
        "Also, in comparison to the formalisms mentioned above, content models constitute a relatively impoverished representation; but this actually contributes to the ease with which they can be learned, and our empirical results show that they are quite effective despite their simplicity.",
        "In recent work, Duboue and McKeown (2003) propose a method for learning a content planner from a collection of texts together with a domain-specific knowledge base, but our method applies to domains in which no such knowledge base has been supplied.",
        "Knowledge-lean approaches Distributional models of content have appeared with some frequency in research on text segmentation and topic-based language modeling (Hearst, 1994; Beeferman et al., 1997; Chen et al., 1998; Florian and Yarowsky,1999; Gildea and Hofmann, 1999; 2 This does not qualify as domain knowledge because it is not about earthquakes per se.",
        "Iyer and Ostendorf, 1996; Wu and Khudanpur, 2002).",
        "In fact, the methods we employ for learning content models are quite closely related to techniques proposed in that literature (see Section 3 for more details).",
        "However, language-modeling research whose goal is to predict text probabilities tends to treat topic as a useful auxiliary variable rather than a central concern; for example, topic-based distributional information is generally interpolated with standard, non-topic-based gram models to improve probability estimates.",
        "Our work, in contrast, treats content as a primary entity.",
        "In particular, our induction algorithms are designed with the explicit goal of modeling document content, which is why they differ from the standard Baum-Welch (or EM) algorithm for learning Hidden Markov Models even though content models are instances of HMMs."
      ]
    },
    {
      "heading": "3 Model Construction",
      "text": [
        "We employ an iterative re-estimation procedure that alternates between (1) creating clusters of text spans with similar word distributions to serve as representatives of within-document topics, and (2) computing models of word distributions and topic changes from the clusters so derived.3 Formalism preliminaries We treat texts as sequences of predefined text spans, each presumed to convey information about a single topic.",
        "Specifying text-span length thus defines the granularity of the induced topics.",
        "For concreteness, in what follows we will refer to sentences rather than text spans since that is what we used in our experiments, but paragraphs or clauses could potentially have been employed instead.",
        "Our working assumption is that all texts from a given domain are generated by a single content model.",
        "A content model is an HMM in which each state corresponds to a distinct topic and generates sentences relevant to that topic according to a state-specific language model note that standard gram language models can therefore be considered to be degenerate (single-state) content models.",
        "State transition probabilities give the probability of changing from a given topic to another, thereby capturing constraints on topic shifts.",
        "We can use the forward algorithm to efficiently compute the generation probability assigned to a document by a content model and the Viterbi algorithm to quickly find the most likely content model state sequence to have generated a given document; see Rabiner (1989) for details.",
        "In our implementation, we use bigram language models, so that the probability of an word sentence being generated by a state is 3 For clarity, we omit minor technical details, such as the use of dummy initial and final states.",
        "Section 5.2 describes how the free parameters , , , and are chosen.",
        "The Athens seismological institute said the temblors epicenter was located 380 kilometers (238 miles) south of the capital.",
        "Seismologists in Pakistans Northwest Frontier Province said the temblors epicenter was about 250 kilometers (155 miles) north of the provincial capital Peshawar.",
        "The temblor was centered 60 kilometers (35 miles) northwest of the provincial capital of Kunming, about 2,200 kilometers (1,300 miles) southwest of Beijing, a bureau seismologist said.",
        "Note that the contents of the etcetera cluster are ignored at this stage.",
        "Our state-transition probability estimates arise from considering how sentences from the same article are distributed across the clusters.",
        "More specifically, for two clusters and , let be the number of documents in which a sentence from immediately precedes one from , and let be the number of documents containing sentences from .",
        "Then, for any two states and ,, we use the following smoothed estimate of the probability of transitioning from to : .",
        "Estimating the state bigram probabilitiesis described below.",
        "Initial topic induction As in previous work (Florian and Yarowsky, 1999; Iyer and Ostendorf, 1996; Wu and Khudanpur, 2002), we initialize the set of topics, distributionally construed, by partitioning all of the sentences from the documents in a given domain-specific collection into clusters.",
        "First, we create clusters via complete-link clustering, measuring sentence similarity by the cosine metric using word bigrams as features (Figure 1 shows example output).4 Then, given our knowledge that documents may sometimes discuss new and/or irrelevant content as well, we create an etcetera cluster by merging together all clusters containing fewer than sentences, on the assumption that such clusters consist of outlier sentences.",
        "We use to denote the number of clusters that results.",
        "Determining states, emission probabilities, and transition probabilities Given a setof clusters, whereis the etcetera cluster, we construct a content model with corresponding states; we refer toas the insertion state.",
        "For each state ,, bigram probabilities (which induce the states sentence-emission probabilities) are estimated using smoothed counts from the corresponding cluster: where is the frequency with which word sequence occurs within the sentences in cluster , and is the vocabulary.",
        "But because we want the insertion state to model digressions or unseen topics, we take the novel step of forcing its language model to be complementary to those of the other states by setting 4Following Barzilay and Lee (2003), proper names, numbers and dates are (temporarily) replaced with generic tokens to help ensure that clusters contain sentences describing the same event type, rather than same actual event.",
        "Viterbi re-estimation Our initial clustering ignores sentence order; however, contextual clues may indicate that sentences with high lexical similarity are actually on different topics.",
        "For instance, Reuters articles about earthquakes frequently finish by mentioning previous quakes.",
        "This means that while the sentence The temblor injured dozens at the beginning of a report is probably highly salient and should be included in a summary of it, the same sentence at the end of the piece probably refers to a different event, and so should be omitted.",
        "A natural way to incorporate ordering information is iterative re-estimation of the model parameters, since the content model itself provides such information through its transition structure.",
        "We take an EM-like Viterbi approach (Iyer and Ostendorf, 1996): we re-cluster the sentences by placing each one in the (new) cluster , , that corresponds to the state most likely to have generated it according to the Viterbi decoding of the training data.",
        "We then use this new clustering as the input to the procedure for estimating HMM parameters described above.",
        "The cluster/estimate cycle is repeated until the clusterings stabilize or we reach a predefined number of iterations."
      ]
    },
    {
      "heading": "4 Evaluation Tasks",
      "text": [
        "We apply the techniques just described to two tasks that stand to benefit from models of content and changes in topic: information ordering for text generation and information selection for single-document summarization.",
        "These are two complementary tasks that rely on disjoint model functionalities: the ability to order a set of preselected information-bearing items, and the ability to do the selection itself, extracting from an ordered sequence of information-bearing items a representative subsequence."
      ]
    },
    {
      "heading": "4.1 Information Ordering",
      "text": [
        "The information-ordering task is essential to many text synthesis applications, including concept-to-text generation and multi-document summarization; While accounting for the full range of discourse and stylistic factors that influence the ordering process is infeasible in many domains, probabilistic content models provide a means for handling important aspects of this problem.",
        "We demonstrate this point by utilizing content models to select appropriate sentence orderings: we simply use a content model trained on documents from the domain of interest, selecting the ordering among all the presented candidates that the content model assigns the highest probability to."
      ]
    },
    {
      "heading": "4.2 Extractive Summarization",
      "text": [
        "Content models can also be used for single-document summarization.",
        "Because ordering is not an issue in this application5, this task tests the ability of content models to adequately represent domain topics independently of whether they do well at ordering these topics.",
        "The usual strategy employed by domain-specific summarizers is for humans to determine a priori what types of information from the originating documents should be included (e.g., in stories about earthquakes, the number of victims) (Radev and McKeown, 1998; White et al., 2001).",
        "Some systems avoid the need for manual analysis by learning content-selection rules from a collection of articles paired with human-authored summaries, but their learning algorithms typically focus on within sentence features or very coarse structural features (such as position within a paragraph) (Kupiec et al., 1999).",
        "Our content-model-based summarization algorithm combines the advantages of both approaches; on the one hand, it learns all required information from unannotated document-summary pairs; on the other hand, it operates on a more abstract and global level, making use of the topical structure of the entire document.",
        "Our algorithm is trained as follows.",
        "Given a content model acquired from the full articles using the method described in Section 3, we need to learn which topics (represented by the content models states) should appear in our summaries.",
        "Our first step is to employ the Viterbi algorithm to tag all of the summary sentences and all of the sentences from the original articles with a Viterbi topic label, or V-topic the name of the state most likely to have generated them.",
        "Next, for each state such that at least three full training-set articles contained V-topic , we compute the probability that the state generates sentences that should appear in a summary.",
        "This probability is estimated by simply (1) counting the number of document-summary pairs in the parallel training data such that both the originating document and the summary contain sentences assigned V-topic , and then (2) normalizing this count by the number of full articles containing sentences with V-topic .",
        "5Typically, sentences in a single-document summary follow the order of appearance in the original document.",
        "To produce a length summary of a new article, the algorithm first uses the content model and Viterbi decoding to assign each of the articles sentences a V-topic.",
        "Next, the algorithm selects those states, chosen from among those that appear as the V-topic of one of the articles sentences, that have the highest probability of generating a summary sentence, as estimated above.",
        "Sentences from the input article corresponding to these states are placed in the output summary.6"
      ]
    },
    {
      "heading": "5 Evaluation Experiments",
      "text": []
    },
    {
      "heading": "5.1 Data",
      "text": [
        "For evaluation purposes, we created corpora from five domains: earthquakes, clashes between armies and rebel groups, drug-related criminal offenses, financial reports, and summaries of aviation accidents.7 Specifically, the first four collections consist of AP articles from the North American News Corpus gathered via a TDT-style document clustering system.",
        "The fifth consists of narratives from the National Transportation Safety Boards database previously employed by Jones and Thompson (2003) for event-identification experiments.",
        "For each such set, 100 articles were used for training a content model, 100 articles for testing, and 20 for the development set used for parameter tuning.",
        "Table 1 presents information about article length (measured in sentences, as determined by the sentence separator of Reynar and Ratnaparkhi (1997)), vocabulary size, and token/type ratio for each domain."
      ]
    },
    {
      "heading": "5.2 Parameter Estimation",
      "text": [
        "Our training algorithm has four free parameters: two that indirectly control the number of states in the induced content model, and two parameters for smoothing bigram probabilities.",
        "All were tuned separately for each domain on the corresponding held-out development set using Powells grid search (Press et al., 1997).",
        "The parameter values were selected to optimize system performance"
      ]
    },
    {
      "heading": "5.3 Ordering Experiments 5.3.1 Metrics",
      "text": [
        "The intent behind our ordering experiments is to test whether content models assign high probability to acceptable sentence arrangements.",
        "However, one stumbling block to performing this kind of evaluation is that we do not have data on ordering quality: the set of sentences from an sentence document can be sequenced in different ways, which even for a single text of moderate length is too many to ask humans to evaluate.",
        "Fortunately, we do know that at least the original sentence order (OSO) in the source document must be acceptable, and so we should prefer algorithms that assign it high probability relative to the bulk of all the other possible permutations.",
        "This observation motivates our first evaluation metric: the rank received by the OSO when all permutations of a given documents sentences are sorted by the probabilities that the model under consideration assigns to them.",
        "The best possible rank is 0, and the worst is .",
        "An additional difficulty we encountered in setting up our evaluation is that while we wanted to compare our algorithms against Lapatas (2003) state-of-the-art system, her method doesnt consider all permutations (see below), and so the rank metric cannot be computed for it.",
        "To compensate, we report the OSO prediction rate, which measures the percentage of test cases in which the model under consideration gives highest probability to the OSO from among all possible permutations; we expect that a good model should predict the OSO a fair fraction of the time.",
        "Furthermore, to provide some assessment of the quality of the predicted orderings themselves, we follow Lapata (2003) in employing Kendalls , which is a measure of how much an ordering differs from the OSO the underlying assumption is that most reasonable sentence orderings should be fairly similar to it.",
        "Specifically, for a permutation of the sentences in an sentence document, is computed as whereis the number of swaps of adjacent sentences necessary to rearrange into the OSO.",
        "The metric ranges from 1 (inverse orders) to 1 (identical orders)."
      ]
    },
    {
      "heading": "5.3.2 Results",
      "text": [
        "For each of the 500 unseen test texts, we exhaustively enumerated all sentence permutations and ranked them using a content model from the corresponding domain.",
        "We compared our results against those of a bigram language model (the baseline) and an improved version of the state-of-the-art probabilistic ordering method of Lapata (2003), both trained on the same data we used.",
        "Lapatas method first learns a set of pairwise sentence ordering preferences based on features such as noun-verb dependencies.",
        "Given a new set of sentences, the latest version of her method applies a Viterbi-style approximation algorithm to choose a permutation satisfying many preferences (Lapata, personal communication).9 Table 2 gives the results of our ordering-test comparison experiments.",
        "Content models outperform the alternatives almost universally, and often by a very wide margin.",
        "We conjecture that this difference in performance stems from the ability of content models to capture global document structure.",
        "In contrast, the other two algorithms are local, taking into account only the relationships between adjacent word pairs and adjacent sentence pairs, respectively.",
        "It is interesting to observe that our method achieves better results despite not having access to the linguistic information incorporated by Lapatas method.",
        "To be fair, though, her techniques were designed for a larger corpus than ours, which may aggravate data sparseness problems for such a feature-rich method.",
        "Table 3 gives further details on the rank results for our content models, showing how the rank scores were distributed; for instance, we see that on the Earthquakes domain, the OSO was one of the top five permutations in 95% of the test documents.",
        "Even in Drugs and Accidents the domains that proved relatively challenging to our method in more than 55% of the cases the OSOs rank did not exceed ten.",
        "Given that the maximal possible rank in these domains exceeds three million, we believe that our model has done a good job in the ordering task.",
        "We also computed learning curves for the different domains; these are shown in Figure 2.",
        "Not surprisingly, performance improves with the size of the training set for all domains.",
        "The figure also shows that the relative difficulty (from the content-model point of view) of the different domains remains mostly constant across varying training set sizes.",
        "Interestingly, the two easiest domains, Finance and Earthquakes, can be thought of as being more formulaic or at least more redundant, in that they have the highest token/type ratios (see Table 1) that is, in these domains, words are repeated much more frequently on average."
      ]
    },
    {
      "heading": "5.4 Summarization Experiments",
      "text": [
        "The evaluation of our summarization algorithm was driven by two questions: (1) Are the summaries produced of acceptable quality, in terms of selected content?",
        "and (2) Does the content-model representation provide additional advantages over more locally-focused methods?",
        "To address the first question, we compare summaries created by our system against the lead baseline, which extracts the first sentences of the original text despite its simplicity, the results from the annual Document Understanding Conference (DUC) evaluation suggest that most single-document summarization systems cannot beat this baseline.",
        "To address question (2), we consider a summarization system that learns extraction rules directly from a parallel corpus of full texts and their summaries (Kupiec et al., 1999).",
        "In this system, summarization is framed as a sentence-level binary classification problem: each sentence is labeled by the publicly available BoosTexter system (Schapire and Singer, 2000) as being either in or out of the summary.",
        "The features considered for each sentence are its unigrams and",
        "its location within the text, namely beginning third, middle third and end third.",
        "10 Hence, relationships between sentences are not explicitly modeled, making this system a good basis for comparison.",
        "We evaluated our summarization system on the Earthquakes domain, since for some of the texts in this domain there is a condensed version written by AP journalists.",
        "These summaries are mostly extractive11; consequently, they can be easily aligned with sentences in the original articles.",
        "From sixty document-summary pairs, half were randomly selected to be used for training and the other half for testing.",
        "(While thirty documents may not seem like a large number, it is comparable to the size of the training corpora used in the competitive summarization- system evaluations mentioned above.)",
        "The average number of sentences in the full texts and summaries was 15 and 6, respectively, for a total of 450 sentences in each of the test and (full documents of the) training sets.",
        "At runtime, we provided the systems with a full document and the desired output length, namely, the length in sentences of the corresponding shortened version.",
        "The resulting summaries were judged as a whole by the fraction of their component sentences that appeared in the human-written summary of the input text.",
        "The results in Table 4 confirm our hypothesis about the benefits of content models for text summarization our model outperforms both the sentence-level, locally focused classifier and the lead baseline.",
        "Furthermore, as the learning curves shown in Figure 3 indicate, our method achieves good performance on a small subset of parallel training data: in fact, the accuracy of our method on one third of the training data is higher than that of the 10 This feature set yielded the best results among the several possibilities we tried.",
        "11Occasionally, one or two phrases or, more rarely, a clause were dropped.",
        "sentence-level classifier on the full training set.",
        "Clearly, this performance gain demonstrates the effectiveness of content models for the summarization task."
      ]
    },
    {
      "heading": "5.5 Relation Between Ordering and Summarization Methods",
      "text": [
        "Since we used two somewhat orthogonal tasks, ordering and summarization, to evaluate the quality of the content model paradigm, it is interesting to ask whether the same parameterization of the model does well in both cases.",
        "Specifically, we looked at the results for different model topologies, induced by varying the number of content model states.",
        "For these tests, we experimented with the Earthquakes data (the only domain for which we could evaluate summarization performance), and exerted direct control over the number of states, rather than utilizing the cluster-size threshold; that is, in order to create exactly states for a specific value of , we merged the smallest clusters until clusters remained.",
        "Table 5 shows the performance of the different-sized content models with respect to the summarization task and the ordering task (using OSO prediction rate).",
        "While the ordering results seem to be more sensitive to the number of states, both metrics induce similar ranking on the models.",
        "In fact, the same-size model yields top performance on both tasks.",
        "While our experiments are limited to only one domain, the correlation in results is encouraging: optimizing parameters on one task promises to yield"
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "In this paper, we present an unsupervised method for the induction of content models, which capture constraints on topic selection and organization for texts in a particular domain.",
        "Incorporation of these models in ordering and summarization applications yields substantial improvement over previously-proposed methods.",
        "These results indicate that distributional approaches widely used to model various inter-sentential phenomena can be successfully applied to capture text-level relations, empirically validating the long-standing hypothesis that word distribution patterns strongly correlate with discourse patterns within a text, at least within specific domains.",
        "An important future direction lies in studying the correspondence between our domain-specific model and domain-independent formalisms, such as RST.",
        "By automatically annotating a large corpus of texts with discourse relations via a rhetorical parser (Marcu, 1997; Soricut and Marcu, 2003), we may be able to incorporate domain-independent relationships into the transition structure of our content models.",
        "This study could uncover interesting connections between domain-specific stylistic constraints and generic principles of text organization.",
        "In the literature, discourse is frequently modeled using a hierarchical structure, which suggests that probabilistic context-free grammars or hierarchical Hidden Markov Models (Fine et al., 1998) may also be applied for modeling content structure.",
        "In the future, we plan to investigate how to bootstrap the induction of hierarchical models using labeled data derived from our content models.",
        "We would also like to explore how domain-independent discourse constraints can be used to guide the construction of the hierarchical models."
      ]
    }
  ]
}
