{
  "info": {
    "authors": [
      "Maja Popovic"
    ],
    "book": "Proceedings of the Seventh Workshop on Statistical Machine Translation",
    "id": "acl-W12-3106",
    "title": "Class error rates for evaluation of machine translation output",
    "url": "https://aclweb.org/anthology/W12-3106",
    "year": 2012
  },
  "references": [
    "acl-J11-4002",
    "acl-W07-1709",
    "acl-W08-0309",
    "acl-W09-0401",
    "acl-W10-1703",
    "acl-W11-2103"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 7th Workshop on Statistical Machine Translation, pages 71?75, Montre?al, Canada, June 7-8, 2012. c?2012 Association for Computational Linguistics Class error rates for evaluation of machine translation output"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "We investigate the use of error classification results for automatic evaluation of machine translation output.",
        "Five basic error classes are taken into account: morphological errors, syntactic (reordering) errors, missing words, extra words and lexical errors.",
        "In addition, linear combinations of these categories are investigated.",
        "Correlations between the class error rates and human judgments are calculated on the data of the third, fourth, fifth and sixth shared tasks of the Statistical Machine Translation Workshop.",
        "Machine translation outputs in five different European languages are used: English, Spanish, French, German and Czech.",
        "The results show that the following combinations are the most promising: the sum of all class error rates, the weighted sum optimised for translation into English and the weighted sum optimised for translation from English."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Recent investigations have shown that it is possible to carry out a reliable automatic error analysis of a given translation output in order to get more information about actual errors and details about particular strengthnesses and weaknesses of a sys-teml (Popovic?",
        "and Ney, 2011).",
        "The obtained results correlate very well with the human error classification results.",
        "The question we try to answer is: how the class error rates correlate with the human evaluation (ranking) results?",
        "As a first step, we investigate the correlations of five basic class error rates with human rankings.",
        "In the next step, linear combinations (sums) of basic class error rates are investigated.",
        "Spearman's rank correlation coefficients on the document (system) level between all the metrics and the human ranking are computed on the English, French, Spanish, German and Czech texts generated by various translation systems in the framework of the third (Callison-Burch et al., 2008), fourth (Callison-Burch et al., 2009), fifth (Callison-Burch et al., 2010) and sixth (Callison-Burch et al., 2011) shared translation tasks."
      ]
    },
    {
      "heading": "2 Class error rates",
      "text": [
        "In this work, the method proposed in (Popovic?",
        "and Ney, 2011) is used, i.e. classification of the translation errors into five basic categories based on the Word Error Rate (WER) (Levenshtein, 1966) together with the recall-and precision-based Position-independent Error Rates called Reference PER (RPER) and Hypothesis PER (HPER).",
        "As a result of an error classification, two values are usually of interest: raw error counts for each error class, and error rates for each class, i.e. raw error counts normalised over the total number of running words.",
        "Which of the values is preferred depends of the exact task.",
        "For example, if only a distribution of error types within a translation output is of interest, the raw error counts are sufficient.",
        "On the other hand, if we want to compare different translation outputs, normalised values i.e. error rates are more suitable.",
        "Therefore they are appropriate candidates to be used for the evaluation task.",
        "In this work, we explore the error rates calculated on the word level as well as on the block level, where",
        "a group of consecutive words labelled with the same error category is called a block.",
        "The normalisation in both cases is carried out over the total number of running words.",
        "Therefore the block level error rate for a particular error class is always less or equal than the corresponding word level error rate."
      ]
    },
    {
      "heading": "2.1 Basic class error rates",
      "text": [
        "The following five basic class error rates are explored: INFER (inflectional error rate): Number of words translated into correct base form but into incorrect full form, normalised over the hypothesis length.",
        "RER (reordering error rate): Number of incorrectly positioned words normalised over the hypothesis length.",
        "MISER (missing word error rate): Number of words which should appear in the translation hypothesis but do not, normalised over the reference length.",
        "EXTER (extra word error rate): Number of words which appear in the translation hypothesis but should not, normalised over the hypothesis length.",
        "LEXER (lexical error rate): Number of words translated into an incorrect lexical choice in the target language (false disambiguation, unknown/untranslated word, incorrect terminology, etc.)",
        "normalised over the hypothesis length.",
        "Table 1 presents an example of word and block level class error rates.",
        "Each erroneous word is labelled with the corresponding error category, and the blocks are marked within the parentheses { and }.",
        "The error rates on the block level are marked with a letter ?b?",
        "at the beginning.",
        "It should be noted that the used method at its current stage does not enable assigning multiple error tags to one word."
      ]
    },
    {
      "heading": "2.2 Combined error rates (sums)",
      "text": [
        "The following linear combinations (sums) of the basic class error rates are investigated: reference: The famous journalist Gustav Chalupa , born in C?eske?",
        "Bude?jovice , also confirms this .",
        "hypothesis containing 14 running words: The also confirms the famous Austrian journalist Gustav Chalupa , from Budweis Lamborghini .",
        "hypothesis labelled with error classes:",
        "rates: the word groups within the parentheses { and } are considered as blocks; all error rates are normalised over the hypothesis length, i.e. 14 running words.",
        "W?ER (sum of word level error rates)1 : Sum of all basic class error rates on the word level; B?ER (sum of block level error rates): Sum of all basic class error rates on the block level; WB?ER (sum of word and block level error rates): Arithmetic mean of W?ER and B?ER.",
        "1This error rate has already been introduced in (Popovic?",
        "and Ney, 2011) and called ?ER; however, for the sake of clarity, in this work we will call it W?ER, i.e. word level ?ER.",
        "level class error rates optimised for translation from English.",
        "For the example sentence shown in Table 1, W?ER = 84.7%, B?ER = 46.2% and WB?ER = 65.4%.",
        "XEN?ER and ENX?ER are weighted sums which will be explained in the next section.",
        "The prerequisite for the use of the described metrics is availability of an appropriate morphological analyser for the target language which provides base forms of the words."
      ]
    },
    {
      "heading": "3 Experiments on WMT 2008, 2009, 2010",
      "text": [
        "and 2011 test data"
      ]
    },
    {
      "heading": "3.1 Experimental set-up",
      "text": [
        "The class error rates described in Section 2 were produced for outputs of translations from Spanish, French, German and Czech into English and vice versa using Hjerson (Popovic?, 2011), an open-source tool for automatic error classification.",
        "Spanish, French, German and English base forms were produced using the TreeTagger2, and the Czech base forms using Morc?e (Spoustova?",
        "et al, 2007).",
        "In this way, all references and hypotheses were provided with the base forms of the words.",
        "For each error rate, the system level Spearman correlation coefficients ?",
        "with human ranking were calculated for each document.",
        "In total, 40 correlation coefficients were obtained for each error rate ?",
        "twelve English outputs from the WMT 2011, 2010 and 2009 task and eight from the WMT 2008 task, together with twenty outputs in other four target languages.",
        "For further analysis, the obtained correlation results were summarised into the following three values:",
        "percentage of documents where the particular error rate has better correlation than the other error rates; ?",
        "rank?",
        "percentage of documents where the particular error rate has better or equal correlation than the other error rates."
      ]
    },
    {
      "heading": "3.2 Comparison of basic class error rates",
      "text": [
        "Our first experiment was to compare correlations for the basic set of class error rates in order to investigate a general behaviour of each class error rate and to see if some of the error categories are particularly (in)convenient for the evaluation task.",
        "Since certain differences between English and non-English translation outputs are observed for some error classes, the values described in the previous section were also calculated separately.",
        "Table 2 presents the results of this experiment.",
        "The mean values over all documents, over the English documents and over the non-English documents are shown.",
        "According to the overall mean values, the most promising error categories are lexical and reordering errors.",
        "However, the mean values for English outputs are significantly different than those for non-English outputs: the best error classes for English are in deed lexical and reordering errors, however for the non-English outputs the inflectional errors and missing words have higher correlations.",
        "On the other hand, for the English outputs missing words have even negative correlations, whereas correlations for inflectional errors are relatively low.",
        "The extra word class seems to be the least convenient in general, especially for non-English outputs.",
        "Therefore, the rank?",
        "values were calculated only separately for English and non-English outputs, and the previous observations were confirmed: for the English outputs lexical and reordering errors are the most relevant, whereas for the non-English outputs all classes except extra words are almost equally important.",
        "Apart from this, it can be noticed that the grouping of words into blocks significantly improves correlation for reordering errors.",
        "The reason for this is ambiguity of tagging words as reordering errors.",
        "and block level error rate over all documents, over English documents and over non-English documents.",
        "For example, if the translation reference is ?a very good translation?, and the obtained hypothesis is ?a translation very good?",
        ", one possibility is to mark the word ?translation?",
        "as reordering error, another possibility is to mark the words ?very good?",
        "as reordering errors, and it is also possible to mark all the words as reordering errors.",
        "In such cases, the grouping of consecutive word level errors into blocks is beneficial."
      ]
    },
    {
      "heading": "3.3 Comparison of error rate sums",
      "text": [
        "A first step towards combining the basic class error rates was investigation of simple sums, i.e. W?ER, B?ER as well as WB?ER as arithmetic mean of previous two.",
        "The overall average correlation coefficients of the sums were shown to be higher than those of the basic class error rates.",
        "Further experiments have been carried out taking into account the results described in the previous section.",
        "Firstly, extra word class was removed from all sums, however no improvement of correlation coefficients was observed.",
        "Then the sums containing only the most promising error categories separately for English and non-English output were investigated, but this also resulted in no improvements.",
        "Finally, we introduced weights for each translation direction according to the rank?",
        "value for each of the basic class error rates (see Table 2), and this approach was promising.",
        "In this way, the specialised sums XEN?ER and ENX?ER were introduced.",
        "In Table 3 the results for all five error rate sums are presented.",
        "mean, rank> and rank?",
        "values are presented over all translation outputs, over English outputs and over non-English outputs.",
        "As already mentioned, the overall correlation coefficients of the sums are higher than those of the basic class error rates.",
        "This could be expected, since summing class error rates is oriented towards the overall quality of the translation output whereas the class error rates are giving more information about details.",
        "According to the overall values, the best error rate is combination of all word and block level class error rates, i.e. WB?ER followed by the block sum B?ER, whereas the W?ER and the specialised sums XEN?ER and ENX?ER have lower correlations.",
        "For the translation into English, this error rate is also very promising, followed by the specialised sum XEN?ER.",
        "On the other hand, for the translation from English, the most promising error rates are the block sum B?ER and the corresponding specialised sum ENX?ER.",
        "Following these observations, we decided to submit WB?ER scores for all translation outputs together with XEN?ER and ENX?ER scores, each one for the corresponding translation direction.",
        "In addition, we submitted B?ER scores since this error rate also showed rather good results, especially for the translation out of English."
      ]
    },
    {
      "heading": "4 Conclusions",
      "text": [
        "The presented results show that the error classification results can be used for evaluation and ranking of machine translation outputs.",
        "The most promising way to do it is to sum all word level and block level error rates, i.e. to produce the WB?ER error rate.",
        "This error rate has eventually been submitted to the WMT 2012 evaluation task.",
        "In addition, the next best metrics have been submitted, i.e. the block level sum B?ER for all translation directions, and the specialised sums XEN?ER and ENX?ER each for the corresponding translation outputs.",
        "The experiments described in this work are still at early stage: promising directions for future work are better optimisation of weights3, further investigation of each language pair and also of each non-English 3First steps have already been made in this direction using an SVM classifier, and the resulting evaluation metric has also been submitted to the WMT 2012.",
        "and over non-English documents.",
        "target language separately, filtering error categories by POS classes, etc."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work has partly been developed within the TARAXU?",
        "project4 financed by TSB Technologies-tiftung Berlin ?",
        "Zukunftsfonds Berlin, co-financed by the European Union ?",
        "European fund for regional development.",
        "Special thanks to Mark Fishel and Ondr?ej Bojar."
      ]
    }
  ]
}
