{
  "info": {
    "authors": [
      "Masaya Yamaguchi",
      "Takeyuki Kojima",
      "Nobuo Inui",
      "Yoshiyuki Kotani",
      "Hirohiko Nisimura"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-2232",
    "title": "Combination of an Automatic and an Interactive Disambiguation Method",
    "url": "https://aclweb.org/anthology/P98-2232",
    "year": 1998
  },
  "references": [
    "acl-C90-1025",
    "acl-C90-2045",
    "acl-C90-3008",
    "acl-C94-2136"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In natural language processing, many methods have been proposed to solve the ambiguity problems.",
        "In this paper, we propose a. technique to combine a method of interactive disambiguation and automatic one for ambiguous words.",
        "The characteristic of our method is that the accuracy of the interactive disambiguation is considered.",
        "The method solves the two following problems when combining those disambiguation methods: (1) when should the interactive disambiguation be executed?",
        "(2) which ambiguous word should be disambiguated when more than one ambiguous words exist in a sentence?",
        "Our method defines the condition of executing the interaction with users and the order of disambiguation based on the strategy where the accuracy of the result is maximized, considering the accuracy of the interactive disambiguation and automatic one.",
        "Using this method, user interaction can be controlled while holding the accuracy of results."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In natural language processing, many methods have been proposed to solve the ambiguity prob-lems(Na.gao and Maruyama, 1992).",
        "One of those technique uses interactions with users, because it is difficult, to make all the knowledge for disambiguation beforehand.",
        "That technique is classified into two types according to the condition of executing user interaction.",
        "One type(TypeA) is that the disambiguation system executes interactions(Blanchon et al., 1995), (Maruyama and Watanabe, 1990), (Ya.maguchi et al., 1995).",
        "Another type(TypeB) is that users executes interactions(D.Brawn and Niren-burg, 1990), (Muraki et al., 1994).",
        "In this paper, TypeA will be adopted because TypeB gives users more trouble than TypeA does.",
        "• For example, in TypeB, a user may have to find where is wrongly analyzed in input sentences.",
        "In TypeA, the two following conditions must be determined: (1) when should interactive disambiguation be executed?",
        "(2) which ambiguous words should be disambiguated when more than one ambiguous word exist in a sentence?",
        "Considering the accuracy of the analyzed result, they should be decided by both the accuracy of the interactive disa.mbiguation and that of the automatic disambiguation.",
        "The traditional methods did not.",
        "considered the accuracy of the interactive disambiguation.",
        "For instance, the accuracy of the analyzed result may decrease in spite of executing the user interaction if the accuracy of the interactive disambiguation is low.",
        "In this paper, we propose the method to combine the interactive disambiguation and the automatic one, considering each accuracy.",
        "The method allows the disambiguation system to maximize the accuracy of the analyzed result.",
        "This paper focuses on the ambiguity caused by ambiguous words that, have more than one meaning.",
        "Section 2 represents preconditions for disambiguation.",
        "In Section 3, we describe the condition of executing the interactive disambiguation.",
        "Section 4 shows the procedure that.",
        "decides the order of disambiguation.",
        "The performance of the method is discussed by the result of the simulation under assuming the both accuracy of the interactive disambiguation and the automatic one."
      ]
    },
    {
      "heading": "2 Preconditions for Disambiguation",
      "text": [
        "This section describes preconditions for disambiguation and methods of the disambiguation.",
        "In this paper, the disambiguation for ambiguous words means that all ambiguous ones in an input.",
        "sentence are disambiguated.",
        "Describing it.",
        "formally, the disambiguation is to decide one element of the following MS.",
        "where an input sentence contains / ambiguous words.",
        "Mj means the set of meanings in the ambiguous word Each disambiguation method has preconditions as follows:"
      ]
    },
    {
      "heading": "Interactive Disambiguation",
      "text": [
        "• In the interaction, the system shows explanations for each meaning of an ambiguous word to a user, who selects one explanation from them.",
        "• The system can calculate the probability where • a user selects the right explanation."
      ]
    },
    {
      "heading": "Automatic Disambiguation",
      "text": [
        "• The occurrence probabilities for each candidate can be calculated for preference.",
        "• The result is the candidate with the maximum occurrence probability.",
        "To show the information mentioned above, candidates are expressed by the tree in Figure 1.",
        "This tree is an example in the case that an input sentence is \"I saw a star.\", which contains two ambiguous words 'see' and 'star' and each word has two meanings.",
        "The accuracy of the interactive disambiguation Pint, and that of the automatic disambiguation Panto are defined as follows:",
        "The depth of the tree expresses the order of disambiguation.",
        "In Figure 1, the ambiguities are resolved in the order from 'see' to 'star'.",
        "The occurrence probability is calculated at each leaf node by the automatic disambiguation method.",
        "For example, pll expresses the probability for the candidate star_11.",
        "Furthermore, the accuracy of interaction is also calculated at the leaf node by the interactive disambiguation method.",
        "pd21 is the probability where the meaning of 'star' is `star_1' and the system shows explanations of `star_1', `star_2' for 'star' to a user and (s)he selects the explanation of `star_2'.",
        "At Nodes besides leaf ones, only the accuracy of interaction is calculated."
      ]
    },
    {
      "heading": "3 The Condition of Executing the Interactive Disambiguation",
      "text": []
    },
    {
      "heading": "3.1 Basic Idea",
      "text": [
        "At each node besides leaf ones, the disambiguation system decides which disambiguation method is used.",
        "Basically, the interactive disambiguation is executed when its accuracy is higher than the accuracy of the automatic disambiguation.",
        "First of all, let us consider the case where an input sentence contains one ambiguous word that has n. meanings.",
        "Figure 2 shows the tree of candidates for this case.",
        "The interactive disambiguation is executed, when the following condition is satisfied."
      ]
    },
    {
      "heading": "Pintr > Panto",
      "text": [
        "Considering the condition more carefully, the accuracy of the interactive disambiguation is influenced by the explanations that.",
        "are shown to users.",
        "Thus the accuracy may be improved by limiting to show some explanations to users.",
        "For example, this may be caused when the accuracy of mi i is very low and a. user may select.",
        "mil wrongly by the higher similarity of the explanation for /nil to other explanations.",
        "The automatic disambiguation corresponds to showing only one explanation to users in the interactive disambiguation.",
        "Therefore the condition of executing the interactive disambiguation can be defined as the exceptional case of the limitation."
      ]
    },
    {
      "heading": "3.2 The Accuracy at a Node",
      "text": [
        "In the case that, the number of ambiguous words is one as Figure 2, the accuracy of the deeper nodes below the root node needs not to be decided because they are leaf nodes.",
        "When more than two ambiguous words exist in an input sentence, a node may often have one that is not a leaf one.",
        "To calculate the accuracy of such a node, it is necessary to determine what kind of disambiguation will be executed at the deeper nodes.",
        "For instance, the disambiguation system has to fix each accuracy of node `see_1' and `see_2' in Figure 1 to calculate the accuracy of the root node.",
        "Therefore, the definition of the accuracy at any node i is the recursive one.",
        "The accuracy of the interactive disambiguation Pintr(i) and that of the automatic disambiguation Pauto(0 at node i is defined as follows:",
        "where M is the set of the node directly under node pd(m1M) is the accuracy of the interactive disambiguation at node in, that is, the probability that a user selects In provided that the system shows explanations for all the elements of Al to him(her).",
        "Pr(m) is the accuracy at node in and the definition is as follows:",
        "where pc,„„,( m) is the occurrence probability of the candidate that includes nodes between the root node and node m. When the following condition is satisfied, the interactive disambiguation is executed at node i."
      ]
    },
    {
      "heading": "3.3 The Limitation of Explanations",
      "text": [
        "In user interaction, the presentation of many explanations gives users trouble to select one explanation.",
        "So it is desirable that the disambiguation system shows fewer explanation to users, if possible.",
        "In this section, we describe the condition where the number of explanations is limited without losing the accuracy of the analyzed result.",
        "By formula (1), the accuracy of the interactive disambiguation Pi' in the case of limiting the set of explanations AP is defined as follows:",
        "Furthermore, if 1M – API = 1, then the automatic disambiguation is executed at node i.",
        "Therefore, formula (4) implies formula (3)."
      ]
    },
    {
      "heading": "4 Determination of the Order of Disambiguation",
      "text": []
    },
    {
      "heading": "4.1 Procedure",
      "text": [
        "UP to here, we have discussed Pintr and Pauto under a certain order of disambiguation.",
        "In this section, we describe a procedure to decide the order of disambiguation where the accuracy is maximum.",
        "The accuracy of the analyzed result may be different in each order of disambiguation.",
        "This is the reason that the disambiguation of one ambiguous word leads to constrain the meaning of other ambiguous ones.",
        "Therefore, the contents of the interaction may differ from each order of disambiguation.",
        "The order with the maximum accuracy is obtained in the following procedure:",
        "1.",
        "Calculating each occurrence probability of candidate for the analyzed result by the automatic disambiguation method.",
        "2.",
        "Obtaining the accuracy in each order of disambiguation based on the method described in the previous sections.",
        "3.",
        "Disambiguating by the order with the maximum accuracy."
      ]
    },
    {
      "heading": "4.2 Example",
      "text": [
        "In this section, we illustrate the determination of executing the interactive disambiguation and the order of disambiguation.",
        "The values at leaf nodes are the occurrence probabilities.",
        "The accuracy of the interactive disambiguation is 0.9 at the any nodes.",
        "Since the number of ambiguous words is two, the number of the order of disambiguation is 2!",
        "as shown in Figure 3, 4. root see_l see_2 star_l star_2 star_l star_2 0.10 0.10 0.05 0.75",
        "To begin with, we intend to calculate what kind of disambiguation is executed at node `star_1' and star_2', in Figure 3.",
        "By formula (1), (2), Pi„tr(see_1) and Pauto(see_i) are as follows (since both ambiguous words have two meanings,",
        "that of Figure 4.",
        "Thus the system interacts with users against 'see' in the first place.",
        "star_l star_2",
        "Therefore, the interactive disambiguation is executed at.",
        "the root node because of tr(root) > Pauto(root), and Pr(root) = 0.837.",
        "Next, let us explain the case of Figure 4.",
        "Calculating the same way as Figure 3, the.",
        "interactive disambiguation is executed in any node besides leaf ones, and Pintr(root.",
        "), Pa„to(root) are as follows: Pin tr (r00i) • 0.9(Pr(star_1)-F Pr(star-2))",
        "• 0.9(Pintr (St ar-1) + Pi n tr (Star _2)) • 0.9(0.765 + 0.135) = 0.81"
      ]
    },
    {
      "heading": "5 Experiments",
      "text": [
        "We applied the proposed method (abbreviated as MP) to the disambiguation of trees of candidates that are made for experiments, and compared it with the method (abbreviated as MA) that executes interaction in all nodes.",
        "We set the following properties to the tree of candidates.",
        "• the number of ambiguous words included in an input sentence • the number of meanings in an ambiguous word • the occurrence probability of candidates",
        "To assign an occurrence probability to each candidate, a random value is given to each candidate above all, and each value is divided by the sum of values given to all candidates.",
        "Figure 5, 6 show the accuracy at the root node and the number of interaction, respectively.",
        "In these figures, a mark '+' indicates results of MP.",
        "Each of them is the average of 300 trees.",
        "A mark '*' indicates results of MA.",
        "Because MA does not prescribe the order of disambiguation, the result.",
        "of each tree is the average of all the orders.",
        "The horizontal axis means the property of the tree.",
        "Each Alphabet in the value of the horizontal axis stands for the number of ambiguous words in a tree and the number of meanings of a word as follows:",
        "For instance, '2 x 4' shows that there are two ambiguous words in a tree and one ambiguous word has two meanings and another word has four meanings.",
        "The number in the value of the x-axis represents the number of the candidate whose occurrence probability is not zero.",
        "Two marks, '+' and '-' mean that the accuracy of interaction is 0.9, 0.85 respectively."
      ]
    },
    {
      "heading": "6 Discussion",
      "text": []
    },
    {
      "heading": "6.1 The Accuracy of Disambiguation",
      "text": [
        "The effect of the proposed method on the accuracy is expressed by the difference of distributions of two marks, '+' and in Figure 5.",
        "This shows that.",
        "the accuracy of the proposed method is better than that of MA in any property of tree.",
        "Table 1 (the line of 'Accuracy') shows the minimum, maximum, and average values of the ratio of improved accuracy (RIA).",
        "The definition of RIA is shown a.s follows:",
        "where (ter, (Ica is the accuracy the result by MP and MA respectively."
      ]
    },
    {
      "heading": "6.2 The Number of Interaction",
      "text": [
        "The number of interaction may increase on the condition that the accuracy of the analyzed result is maximized.",
        "In this section, the degree of the increase will be estimated by comparing the number of interaction of MP with that of MA.",
        "For this purpose, 'Rif is defined as follows:",
        "where np, lla is the number of interaction by MP and MA respectively, nu, is the number of ambiguous words in an input sentence.",
        "Rh I represents the ratio of the increase in the number of interaction per ambiguous word.",
        "Table 1(the line of 'Interaction') shows the minimum, maximum, and average of RI!.",
        "To reduce the number of interaction, the automatic disambiguation is executed instead of executing the interactive disambiguation, estimating the loss of the accuracy L(i) in node i. L(i) is defined as follows: = 132.",
        "(0 – Patao(i) The proposed method will allow the system to reduce the number of interaction, by considering L(i) in each node."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "NW have proposed the method of combining the interactive disambiguation and the automatic one.",
        "The characteristic of our method is that it considers the accuracy of the interactive disambiguation.",
        "This method makes three following things possible:",
        "• selecting the disambiguation method that obtains higher accuracy • limiting explanations shown to users • obtaining the order of disambiguation where the accuracy of the analyzed results is maximized."
      ]
    }
  ]
}
