{
  "info": {
    "authors": [
      "Satoshi Sato",
      "Makoto Nagao"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C90-3044",
    "title": "Toward Memory-Based Translation",
    "url": "https://aclweb.org/anthology/C90-3044",
    "year": 1990
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "An essential problem of example-based translation is how to utilize more than one translation example for translating one source sentence.",
        "This paper proposes a method to solve this problem.",
        "We introduce the representation, called matching expression, which represents the combination of fragments of translation examples.",
        "The translation process consists of three steps: (1) Make the source matching expression from the source sentence.",
        "(2) Transfer the source matching expression into the target matching expression.",
        "(3) Construct the target sentence from the target matching expression.",
        "This mechanism generates some candidates of translation.",
        "To select the best translation out of them, we define the score of a translation."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Use of extracted information from examples or example-based translation is becoming the new wave of machine translation.",
        "The basic idea, of example-based translation is very simple: translate a source sentence by imitating the translation example of a similar sentence in the database.",
        "The idea first appeared in [Na.gao 84], and some research ha.s followed it [Sumita 88][Sato 89][Sadler 89a.",
        "][Sadler 89b].",
        "But a. great deal of effort is still needed to implement the idea,.",
        "In our previous work, we show how to select the best target word in case-frame translation based on examples[Sato 89].",
        "In this paper, we concentrate on two problems:",
        "1.",
        "How to combine some fragments of translation examples in order to translate one sentence?",
        "2.",
        "How to select the best.",
        "translation out of",
        "many candidates?",
        "We show partial solutions for them in MBT2.",
        "MBT2 is the second prototype system in our Memory-based Translation Project.",
        "MBT2 can do bidirectional translation between an English word-dependency tree and a Japanese word-dependency tree.",
        "It is implemented in Sicstus Prolog."
      ]
    },
    {
      "heading": "2 Need to Combine Fragments",
      "text": [
        "The basic idea of example-based translation is very simple: translate a source sentence by imitating the translation example of similar sentence in the database.",
        "But in many cases, it is necessary to imitate more than one translation example and combine some fragments of them.",
        "Let's consider the translation of the following sentence.",
        "(1) He buys a book on international politics.",
        "If we know the following translation example (2) and (3), we can translate sentence (1) into sentence (4) by imitating examples and combining fragments of them.",
        "(2) Ile buys a notebook.",
        "Kare ha nouto zuo kau.",
        "(3) I read a book on.",
        "international politics.",
        "Wataishi ha kokusaiseiji nitsuite kakareta hon wo yomu.",
        "(4) Kare ha kokusaiseiji nitsuite kakareta wo kau.",
        "It is easy for a human to do this, but not so for a machine.",
        "The ability to combine some fragments of translation examples is essential to example-based translation.",
        "A lack of this ability restricts the power of example-based translation.",
        "In this paper, we concentrate on the implementation of this ability on machine."
      ]
    },
    {
      "heading": "3 Matching Expression",
      "text": [
        "To implement the ability to combine some fragments of translation example in order to translate one sentence, we must determine the following:",
        "• how to represent translation examples • what is a fragment • how to represent the combination of fragments"
      ]
    },
    {
      "heading": "3.1 Translation Database",
      "text": [
        "The translation database is the collection of translation examples.",
        "A translation example consists of three parts:",
        "• an English word-dependency tree (EWD) • a Japanese word-dependency tree (JWD) • correspondence links",
        "Each number with prefix 'e' or 'j' in word-dependency trees represents the ID of the subtree.",
        "Each node in a tree contains a word (in root form) and its syntactic category.",
        "A correspondence link is represented as a pair of IDs."
      ]
    },
    {
      "heading": "3.2 Translation Unit",
      "text": [
        "A word-dependency (sub)tree which has a correspondence link is translatable; e.g. el, e2, e3, jl, j 3, j 5.",
        "A translatable tree in which some translatable subtrees are removed is also translatable; e.g. el-e2, el-e3, e1-e2-e3, j1-j3, j1-j5, j1-j3-j5.",
        "Both of them are translatable fragments.",
        "Sadler calls them tron.lation units[Sadler 89a]."
      ]
    },
    {
      "heading": "3.3 Matching Expression",
      "text": [
        "Next we will introduce the concept 'matching expression.'",
        "Matching expression(ME) is defined as the following:",
        "or [a,<ID>,<ME>] 7% add <ME> as a %% child of root %% node of <ID> Every ID in an ME should be translatable.",
        "We assume the example in Section 3.1 and the following example.",
        "Watashi ha kokusaiseiji nitsuite kakareta hon wo yomu.",
        "clinks( [ell, j11] , [e12, j13] , [e13,j15], [e16,j20]]).",
        "Under this assumption, the word-dependency tree (a) can be represented by the matching expression (b).",
        "(a) E[buy,v] ,",
        "[[lie ,pron]] , [[pook,n], [[a,det]], Hon,p], [[international,adj]]]]]] %% He buys a book on international %% politics.",
        "(b) [el, [r,e3, [e13]]",
        "To reduce the search space and the number of candidates, we define replaceablity between syntactic categories.",
        "If two nodes are replaceable, system makes only a replace-command.",
        "As a result, the the system does not make some matching expressions; e.g. Eel , [d,3] [e13]]]"
      ]
    },
    {
      "heading": "4.2 Transfer",
      "text": [
        "In the transfer step, the system replaces every ID in the source matching expression with its corresponding ID.",
        "For example,",
        "The matching expression (b) consists of two translation units: el-e3, e13.",
        "And it has the information to combine them."
      ]
    },
    {
      "heading": "4 Translation via Matching Expression",
      "text": [
        "Figure 1 shows the flow of the translation pro.",
        "cess.",
        "The translation process consists of three steps: decomposition, transfer, and composition.",
        "This process generates all candidates of translation using Prolog's backtrack mechanism."
      ]
    },
    {
      "heading": "4.1 Decomposition",
      "text": [
        "In decomposition, the system decomposes a source word-dependency tree(SWD) into translation units, and makes a source matching ex-pression(SME).",
        "For example,",
        "The main tasks in this step are to retrieve translation units and compare the source WD with retrieved translation units.",
        "To retrieve translation units quickly, we use some hashing techniques.",
        "There are two program to do the comparison task; one for English WDs and one for Japanese WDs.",
        "In comparison of Japanese WDs, the order of subtrees is not important."
      ]
    },
    {
      "heading": "4.3 Composition",
      "text": [
        "in the composition step, the system composes the target word-dependency tree according to the target matching expression.",
        "For example,",
        "[ [nitsuite ,p] , [[kokusaiseiji.,n]]]1]]]]] %% Rare ha kokusaiseiji nitsuite %% kakareta hon wo kau.",
        "This step divides into two sub-steps; the main composing step and validity checking.",
        "In the main composing step, there is no ambiguity with one exception.",
        "Because an add-command [a ,<ID> ,<ME>] specifies only the parent node(<ID>) to add the tree(<ME>), there are some choices in composing English word-dependency trees.",
        "In this step, all possibilities are generated.",
        "Validity of the composed word-dependency trees are checked using syntactic categories.",
        "Validity is checked in every parent-children unit, For example, in the above target word-dependency tree, [v, [p,p]] , [p,[pron]], [p, [n]] , [n, [aux]] , are checked.",
        "A unit is valid if there is a. unit which has the same category pattern in the database.",
        "A word-dependency tree is valid if all parent-children units are valid.",
        "Translation Example Source (or Target) WD"
      ]
    },
    {
      "heading": "5 Score of Translation",
      "text": [
        "To select the best translation out of all candidates generated by system, we introduce the score of a translation.",
        "We define it based on the score of the matching expression, because the matching expression determines the translation output.",
        "The scores of .the source matching expression and the target matching expression are calculated separately."
      ]
    },
    {
      "heading": "5.1 Score of Translation Unit",
      "text": [
        "First, we will define the score of a translation unit.",
        "The score of a translation unit should reflect the correctness of the translation unit.",
        "Which translation unit is better?",
        "Two main factors are:",
        "I.",
        "A larger translation unit is better.",
        "2.",
        "A translation unit in a matching expression",
        "is a fragment of a source (or target) word-dependency tree, and also a fragment of a translation example.",
        "There are two environments of a translation unit; in a source (or target) tree and in a translation example.",
        "The more similar these two environments are, the better.",
        "To calculate 1, we define the size of a translation unit(TU).",
        "size(TU) = the number of nodes in TU To calculate 2, we need a measure of similarity between two environments, i.e. external similarity.",
        "To estimate external similarity, we introduce a unit called restricted environment.",
        "A restricted environment consists of the nodes one link outside of a TU normally.",
        "If corresponding nodes are same in two environments, those environments are extended one more link outside.",
        "Figure 2 illustrates restricted environments of a TU.",
        "We estimate external similarity as the best matching of two restricted environments.",
        "To find the best matching, we first determine the correspondences between nodes in two restricted environments.",
        "Some nodes have several candidates of correspondence.",
        "For example, 727 corresponds with rn6 or ni7.",
        "In this case, we select the most similar node.",
        "To do this, we assume that similarity values between nodes (words) are defined as numeric values between 0 and 1 in a thesaurus.",
        "When the best matching is found, we can calculate the matching point between two environments, nipoint(TU,W D).",
        "rnpoint(TU, WD) summation of similarity values between corresponding nodes in two restricted environments at the best matching We use this value as a measure of similarity between two environments.",
        "Finally, we define the score of a translation unit, score(TU, W D).",
        "For example, we assume that the following similarity values are defined in a thesaurus.",
        "250 4 sim( [book,n] , [notebook ,n] , 0.8) .",
        "s im( [buy , v] , [read, v] , .",
        "5) .",
        "sim( [hon,n] , [nouto,n],0.8).",
        "sim( [kau,v] , [yomu,v],0.5).",
        "Then the scores of translation units in the previous section are the followings.",
        "Ttj size nap oi n t score el-e3 2 0.8 5.6 e13 5 0.5 27.5 ji-j5 4 0.8 19.2 j15 6 1.5 45"
      ]
    },
    {
      "heading": "5.2 Score of Matching Expression",
      "text": [
        "The score of a matching expression is defined as the following.",
        "For example,"
      ]
    },
    {
      "heading": "5.3 Score of Translation",
      "text": [
        "-.Finally, we define the score of a translation as the following.",
        "For example.",
        "the score of the translation in the previous section is 0.642."
      ]
    },
    {
      "heading": "6 Examples",
      "text": [
        "The English verb cat corresponds to two Japanese verbs, taberu.",
        "and okasu.",
        "For example.",
        "(4) The man cats vegetables.",
        "iii to ha yasai wo taberu.",
        "{5) Acid eats metal.",
        "San ha kinzoku wo okasu.",
        "Figure 3 shows translation outputs based on example (,1) and (5) by MBT2.",
        "MBT2 chooses taberu for he eats potatoes and okasu for sulfuric acid rats iron.",
        "*** Translation Source *** [[eat,v], [[he,pron]], [[potato,n]]] n He eats potatoes.",
        "*** Translation Results *** No.",
        "1 (Score = 0.5889) ataberu,v], Hha,p], [[kare,pron]]], Hwo,p], [[jagaimo,n]]]] No.",
        "2 (Score = 0.4556) Hokasu,v], Hha,p], [[kare,pron]]], [[wo,p] , [[jagaimo,n]]]] *** Translation Source *** Heat,v], Hacid,n3, [[sulfuric,adj]]], [[iron,n]]] n Sulfuric acid eats iron.",
        "*** Translation Results *** No.",
        "1 (Score = 0.5500) Hokasu,v], Hha,p], [[ryuusan,n]]], Hwo,p], [[tetsu,n]]]] No.",
        "2 (Score = 0.4683) Htaberu,v], [[had], [[ryuusan,nl]], Efwo,pl, [[tetsu,n]]]]"
      ]
    },
    {
      "heading": "7 Discussion",
      "text": [
        "Although MBT2 is not a full realization of Na-gao's idea, it contains some merits from the original idea.",
        "1. it is easy to modify the system.",
        "The knowledge of the system is in the form of translation examples and thesauri.",
        "We can modify the system with addition of translation examples.",
        "2.",
        "It can do high quality translation.",
        "The system sees as wide a scope as possible in a sentence and uses the largest translation units.",
        "It produces high quality translations.",
        "3.",
        "It can translate some metaphorical sentences,",
        "in the system, semantic information is not used as constraints.",
        "As a result, the system can translate some metaphorical sentences.",
        "Demerits or problems of the system are:",
        "1.",
        "A great deal of computation is needed.",
        "2.",
        "Can we make good thesauri?",
        "The first problem is not serious.",
        "Parallel computation or some heuristics will overcome it.",
        "But the second problem is serious.",
        "We have to study how to construct large thesauri."
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "This paper describes how to combine some translation units in order to translate one sentence and how to select the best translation out of some candidates generated by system.",
        "To represent the combination of fragments, we introduce the representation called matching expression.",
        "To select the best translation, we define the score of translation based on the score of the matching expression.",
        "This framework can be applied to not only the translation between word-dependency trees but also the translation between other data structures.",
        "We hope that generation can be implemented in same framework as the translation from a word-dependency tree to a. list or string.",
        "acknowlegments The authors would like to thank Mort Webster for his proof reading."
      ]
    }
  ]
}
