{
  "info": {
    "authors": [
      "Shing-Kit Chan",
      "Wai Lam",
      "Xiaofeng Yu"
    ],
    "book": "Proceedings of the Third International Joint Conference on Natural Language Processing",
    "id": "acl-I08-2078",
    "title": "An Online Cascaded Approach to Biomedical Named Entity Recognition",
    "url": "https://aclweb.org/anthology/I08-2078",
    "year": 2008
  },
  "references": [
    "acl-N03-1028",
    "acl-P05-1012",
    "acl-P06-1059",
    "acl-W02-1001",
    "acl-W02-2018",
    "acl-W04-1213",
    "acl-W04-1217",
    "acl-W04-1219",
    "acl-W04-1221"
  ],
  "sections": [
    {
      "text": [
        "An Online Cascaded Approach to Biomedical Named Entity Recognition *",
        "Shing-Kit Chan, Wai Lam, Xiaofeng Yu",
        "We present an online cascaded approach to biomedical named entity recognition.",
        "This approach uses an online training method to substantially reduce the training time required and a cascaded framework to relax the memory requirement.",
        "We conduct detailed experiments on the BioNLP dataset from the JNLPBA shared task and compare the results with other systems and published works.",
        "Our experimental results show that our approach achieves comparable performance with great reductions in time and space requirements."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In the biomedical domain, the vast amount of data and the great variety ofinduced features are two major bottlenecks for further natural language processing on the biomedical literature.",
        "In this paper, we investigate the biomedical named entity recognition (NER) problem.",
        "This problem is particularly important because it is a necessary preprocessing step in many applications.",
        "This paper addresses two main issues that arise from biomedical NER.",
        "The work described in this paper is substantially supported by grants from the Research Grant Council of the Hong Kong Special Administrative Region, China (Project Nos: CUHK 4179/03E and CUHK4193/04E) and the Direct Grant of the Faculty of Engineering, CUHK (Project Codes: 2050363 and 2050391).",
        "This work is also affiliated with the Microsoft-CUHK Joint Laboratory for Human-centric Computing and Interface Technologies.",
        "Long Training Time: Traditional approaches that depend on the maximum likelihood training method are slow even with large-scale optimization methods such as L-BFGS.",
        "This problem worsens with the sheer volume and growth rate of the biomedical literature.",
        "In this paper, we propose the use of an online training method that greatly reduces training time.",
        "Large Memory Space: The total number of features used to extract named entities from documents is very large.",
        "To extract biomedical named entities, we often need to use extra features in addition to those used in general-purpose domains, such as prefix, suffix, punctuation, and more orthographic features.",
        "We need a correspondingly large memory space for processing, exacerbating the first issue.",
        "We propose to alleviate this problem by employing a cascaded approach that divides the NER task into a segmentation task and a classification task.",
        "The overall approach is the online cascaded approach, which is described in the remaining sections of this paper: Section 2 describes the general model that is used to address the above issues.",
        "We address the issue of long training time in Section 3.",
        "The issue of large memory space is addressed in Section 4.",
        "Experimental results and analysis are presented in Section 5.",
        "We discuss related work in Section 6 and conclude with Section 7."
      ]
    },
    {
      "heading": "2. Model Descriptions",
      "text": [
        "Our proposed model is similar to a conditional random field in a sequence labeling task, but we avoid directly dealing with the probability distribution.",
        "We use a joint feature representation F(x, y) for each input sequence x and an arbitrary output sequence y, as follows.",
        "where each f (x, y,i) is a local feature function at position i.",
        "For example, in a segmentation task using the IOB2 notation, the k-th local feature in f (x, y, i) can be defined as",
        "With parameter w, the best output sequence y for an input sequence x can be found by calculating the best score:",
        "y = argmax w y'"
      ]
    },
    {
      "heading": "3. Online Training",
      "text": [
        "We propose to estimate the parameter w in an online manner.",
        "In particular, we use the online passive-aggressive algorithm (Crammer et al., 2006).",
        "Parameters are estimated by margin-based training, which chooses the set of parameters that attempts to make the \"margin\" on each training instance (xt, yt ) greater than a predefined value 7,",
        "A hinge loss function l(w; xt) is defined as if 7t > 7 otherwise where Yt is the margin on input xt defined as",
        "In online training, the parameter w is updated iteratively.",
        "Formally speaking, in the t-th iteration with the parameter wt and the training instance xt, we try to solve the following optimization problem.",
        "where C > 0 is a user-defined aggressiveness parameter and £ > 0 is a slack term for the training data when it is not linearly-separable.",
        "C controls the penalty of the slack term and the aggressiveness of each update step.",
        "A larger C implies a more aggressive update and hence a higher tendency to overfit.",
        "The solution to Problem (7) is where Tt = min < C,",
        "The passiveness of this algorithm comes from the fact that the parameter wt is not updated when the hinge loss for xt is zero.",
        "It can be proved that the relative loss bound on the training data (and which also bounds the number of prediction mistakes on the training data) cannot be much worse than the best fixed parameter chosen in hindsight.",
        "See (Crammer et al., 2006) for a detailed proof.",
        "Following most of the work on margin-based training, in this paper we choose Y to be a function of the correct output sequence y and the predicted output sequence yy.",
        "otherwise where [[z]] is 1 if z is true, and 0 otherwise.",
        "The major computation difficulty in this online training comes from Equation (3).",
        "Finding the best output yy is in general an intractable task.",
        "We follow the usual first-order independence assumption made in a linear-chained CRF (Lafferty et al., 2001) model and calculate the best score using the Viterbi algorithm."
      ]
    },
    {
      "heading": "4. Cascaded Framework",
      "text": [
        "We divide the NER task into a segmentation task and a classification task.",
        "In the segmentation task, a sentence x is segmented, and possible segments of biomedical named entities are identified.",
        "In the classification task, the identified segments are classified into one of the possible named entity types or rejected.",
        "wt+i = argmin",
        "In other words, in the segmentation task, the sentence x are segmented by where Fs( ) is the set of segment features, and ws is the parameter for segmentation.",
        "In the classification task, the segments (which can be identified by ys) in a sentence x are classified by where Fc( ) is the set of classification features, and wc is the parameter for classification.",
        "In this cascaded framework, the number of possible labels in the segmentation task is Ns.",
        "For example, Ns = 3 in the IOB2 notation.",
        "In the classification task, the number of possible labels is Nc + 1, which is the number of entity types and one label for \"Other\".",
        "Following the first-order independence assumption, the maximum total number of features in the two tasks is O(max(N,N?",
        ")), which is much smaller than the single-phase approach in which the total number of features is O((Ns Nc )).",
        "Another potential advantage of dividing the NER task into two tasks is that it allows greater flexibility in choosing an appropriate set of features for each task.",
        "In fact, adding more features may not necessarily increase performance.",
        "(Settles, 2004) reported that a system using a subset of features outperformed one using a full set of features."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "We conducted our experiments on the GENIA corpus (Kim et al., 2003) provided in the JNLPBA (Kim et al., 2004) shared task.",
        "There are 2,000 MED-LINE abstracts in the GENIA corpus with named entities tagged in the IOB2 format.",
        "There are 18,546 sentences and 492,551 words in the training set, and 3,856 sentences and 101,039 words in the evaluation set.",
        "The line indicating the MEDLINE abstract ID boundary information is not used in our experiments.",
        "Each word is tagged with \"B-X\", \"I-X\", or \"O\" to indicate that the word is at the \"beginning\" (B) or \"inside\" (I) of a named entity of type X, or \"outside\" (O) of a named entity.",
        "The named entity types are: DNA, RNA, celLline, celLtype, and protein.",
        "The features used in our experiments mainly follow the work of (Settles, 2004) and (Collins, 2001).",
        "For completeness, we briefly describe the features here.",
        "They include word features, orthographic features, parts-of-speech (POS), and two lexicons.",
        "The word features include unigram, bigram, and trigram (e.g. the previous word, the next word, and the previous two words), whereas the orthographic features include capital letter, dash, punctuation, and word length.",
        "Word class (WC) features are also added, which replace a capital letter with \"A\", a lower case letter with \"a\", a digit with \"0\", and all other characters with \"_\".",
        "Similar brief word class (BWC) features are added by collapsing all of the consecutive identical characters in the word class features into one character.",
        "For example, for the word NF-kappa, WC = AA_aaaaa, and BWC = A_a.",
        "These are listed in Tables 2 and 3.",
        "The POS features are added by the GENIA tagger.",
        "All of these features except for the prefix/suffix features are applied to the neighborhood window [i – 1, i + 1] for every word.",
        "Two lexicons for cell lines and genes are drawn from two online public databases: the Cell Line Database and the BBID.",
        "The prefix/suffix and lexicon features are applied to position i only.",
        "All of the above features are com-",
        "System",
        "Fi",
        "(Zhou and Su, 2004)",
        "72.55",
        "Online Cascaded",
        "72.16",
        "(Okanohara et al., 2006)",
        "71.48",
        "(Kim et al., 2005)",
        "71.19",
        "(Finkel et al., 2004)",
        "70.06",
        "(Settles, 2004)",
        "69.80",
        "Table 3: Features used in the JNLPBA experiment.",
        "The features for Capital Letter, Digit, Dash, and Punctuation are represented as regular expressions.",
        "bined with the previous label yi_i and the current label yi to form the final set of features.",
        "In the segmentation task, only three labels (i.e. B, I, O) are needed to represent the segmentation results.",
        "In the classification task, the possible labels are the five entity types and \"Other\".",
        "We also add the segmentation results as features in the classification task.",
        "We tried different methods to extract the named entities from the JNLPBA dataset for comparisons.",
        "These programs were developed based on the same basic framework.",
        "All of the experiments were run on a Unix machine with a 2.8 GHz CPU and 16 GB RAM.",
        "In particular, the CRF trained by maximum-likelihood uses the L-BFGS algorithm (Liu and Nocedal, 1989), which converges quickly and gives a good performance on maximum entropy models (Malouf, 2002; Sha and Pereira, 2003).",
        "We compare our experimental results in several dimensions.",
        "Training Time: Referring to Table 4, the training time of the online cascaded approach is substantially shorter than that of all of the other approaches.",
        "In the single-phase approach, training a CRF by maximum likelihood (ML) using the L-BFGS algorithm is the slowest and requires around 28 hours.",
        "The online method greatly reduces the training time to around two hours, which is 14 times faster.",
        "By employing a two-phase approach, the training time is further reduced to half an hour.",
        "Memory Requirement: Table 4 shows the number of features that are required by the different methods.",
        "For methods that use the single-phase approach, because the full set of features (See Section 4) is too big for practical experiments on our machine, we need to set a higher cutoff value to reduce the number of features.",
        "With a cutoff of 20 (i.e. only features that occur more than 20 times are used), the number of features can still go up to about 8 million.",
        "However, in the two-phase approach, even with a smaller cutoff of 5, the number of features can still remain at about 8 million.",
        "F1 -measure: Table 4 shows the F1-measure in our experiments, and Table 1 compares our results with different systems in the JNLPBA shared tasks and other published works.",
        "Our performance of the single-phase CRF with maximum likelihood training is 69.44%, which agrees with (Settles, 2004) who also uses similar settings.",
        "The single-phase online method increases the performance to 71.17%.",
        "By employing a cascaded framework, the performance is further increased to 72.16%, which can be regarded as comparable with the best system in the",
        "JNLPBA shared task.",
        "6 Related Work",
        "The online training approach used in this paper is based on the concept of \"margin\" (Cristianini, 2001).",
        "A pioneer work in online training is the perceptron-like algorithm used in training a hidden",
        "Unigram",
        "(w-2), (w-i), (w0), (wi), (w2)",
        "Bigram",
        "(W-2 W-i), (W-i W0), (w0 Wi), (Wi w2)",
        "Trigram",
        "(W-2 W-i W0), (W-i Wo Wi), (Wq W\\ w2)",
        "Word features",
        "as in Table 2",
        "Prefix/suffix",
        "Up to a length of 5",
        "Word Class",
        "WC",
        "Brief Word Class",
        "BWC",
        "Capital Letter",
        "\"[A-Z] [a-z]",
        "[A-Z]{2,} [a-z]+[A-Z]+",
        "Digit",
        "[0-9]+ \" [\"0-9] * [0-9] [\"0-9] *$ \" [\"0-9] * [0-9] [0-9] [~0-9]*$ \"[0-9]+ $ [0-9] + [, .]",
        "[0-9, .]",
        "+ [A-Za-z]+[0-9]+ [0-9]+[A-Za-z]+",
        "Dash",
        "[-] + \" [-] + [-] + $",
        "Punctuation",
        "[,;:?",
        "!-+'\"\\/]+",
        "Word length",
        "length of the current word Xi",
        "Table 4: The number of features, training time, and F1 that are used in our experiments.",
        "The cutoff thresholds for the single-phase CRFs are set to 20, whereas that of the online cascaded approach is set to 5 in both segmentation and classification.",
        "The last column shows the relative error reductions on F1 (compared to CRF+ML).",
        "Table 5: Results of the individual task in the online cascaded approach.",
        "The F1 of the classification task is 92.76% (which is based on the fully correct segmented testing data).",
        "et al., 2005) also proposed an online margin-based training method for parsing.",
        "This type of training method is fast and has the advantage that it does not need to form the dual problem as in SVMs.",
        "A detailed description ofthe online passive-aggressive algorithm used in this paper and its variants can be found in (Crammer et al., 2006).",
        "The Margin Infused Relaxed Algorithm (MIRA), which is the ancestor of the online passive-aggressive algorithm and mainly for the linearly-separable case, can be found in (Crammer and Singer, 2003).",
        "(Kim et al., 2005) uses a similar two-phase approach but they need to use rule-based postprocessing to correct the final results.",
        "Their CRFs are trained on a different dataset that contains all of the other named entities such as lipid, multi cell, and other organic compound.",
        "Table 1 shows the comparisons of the final results.",
        "In the JNLPBA shared task, eight NER systems were used to extract five types of biomedical named entities.",
        "The best system (Zhou and Su, 2004) uses \"deep knowledge\", such as name alias resolution, cascaded entity name resolution, abbreviation resolution, and in-domain POS.",
        "Our approach is relatively simpler and uses a unified model to accomplish the cascaded tasks.",
        "It also allows other postprocessing tasks to enhance performance.",
        "7 Conclusion",
        "We have presented an online cascaded approach to biomedical named entity recognition.",
        "This approach substantially reduces the training time required and relaxes the memory requirement.",
        "The experimental results show that our approach achieves performance comparable to the state-of-the-art system.",
        "Experiments",
        "no.",
        "of features",
        "training time",
        "Fi",
        "rel.",
        "err.",
        "red.",
        "on F\\",
        "single-phase",
        "CRF + ML CRF + Online",
        "8,004,392 8,004,392",
        "1699 mins 116 mins",
        "69.44 71.17",
        "5.66%",
        "two-phase",
        "Online + Cascaded",
        "seg: 2,356,590 class: 8,278,794",
        "14+15 = 29 mins",
        "72.16",
        "8.90%",
        "Experiments",
        "R P Fi",
        "Segmentation Classification",
        "80.13 73.68 76.77 92.75 92.76 92.76"
      ]
    }
  ]
}
