{
  "info": {
    "authors": [
      "Daniel Ortiz-Martínez",
      "Ismael García-Varea",
      "Francisco Casacuberta"
    ],
    "book": "Human Language Technologies: the 2010 Annual Conference of the North American Chapter of the Association for Computational Linguistics",
    "id": "acl-N10-1079",
    "title": "Online Learning for Interactive Statistical Machine Translation",
    "url": "https://aclweb.org/anthology/N10-1079",
    "year": 2010
  },
  "references": [
    "acl-D07-1080",
    "acl-D08-1024",
    "acl-J03-1002",
    "acl-J93-2003",
    "acl-P02-1038",
    "acl-P06-1096",
    "acl-W02-0110",
    "acl-W04-3225"
  ],
  "sections": [
    {
      "text": [
        "Daniel Ortiz-Martinez Ismael Garcia-Varea Francisco Casacuberta",
        "Dpto.",
        "de Sist.",
        "Inf.",
        "y Comp.",
        "Dpto.",
        "de Informâtica Dpto.",
        "de Sist.",
        "Inf.",
        "y Comp.",
        "Univ.",
        "Politec.",
        "de Valencia Univ.",
        "de Castilla-La Mancha Univ.",
        "Politec.",
        "de Valencia",
        "46071 Valencia, Spain 02071 Albacete, Spain 46071 Valencia, Spain",
        "dortiz@dsic.upv.es ivarea@info-ab.uclm.es fcn@dsic.upv.es",
        "State-of-the-art Machine Translation (MT) systems are still far from being perfect.",
        "An alternative is the so-called Interactive Machine Translation (IMT) framework.",
        "In this framework, the knowledge of a human translator is combined with a MT system.",
        "The vast majority of the existing work on IMT makes use of the well-known batch learning paradigm.",
        "In the batch learning paradigm, the training of the IMT system and the interactive translation process are carried out in separate stages.",
        "This paradigm is not able to take advantage of the new knowledge produced by the user of the IMT system.",
        "In this paper, we present an application of the online learning paradigm to the IMT framework.",
        "In the online learning paradigm, the training and prediction stages are no longer separated.",
        "This feature is particularly useful in IMT since it allows the user feedback to be taken into account.",
        "The online learning techniques proposed here incrementally update the statistical models involved in the translation process.",
        "Empirical results show the great potential of online learning in the IMT framework."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Information technology advances have led to the need for more efficient translation methods.",
        "Current MT systems are not able to produce ready-to-use texts.",
        "Indeed, MT systems usually require human post-editing to achieve high-quality translations.",
        "One way of taking advantage of MT systems is to combine them with the knowledge of a human translator in the IMT paradigm, which is a special type of the computer-assisted translation paradigm (Isabelle and Church, 1997).",
        "An important contribution to IMT technology was pioneered by the TransType project (Foster et al., 1997; Langlais et al., 2002) where data driven MT techniques were adapted for their use in an interactive translation environment.",
        "Following the TransType ideas, Barrachina et al.",
        "(2009) proposed a new approach to IMT, in which fully-fledged statistical MT (SMT) systems are used to produce full target sentence hypotheses, or portions thereof, which can be partially or completely accepted and amended by a human translator.",
        "Each partial, correct text segment is then used by the SMT system as additional information to achieve improved suggestions.",
        "Figure 1 illustrates a typical IMT session.",
        "source(f ): Para ver la lista de recursos reference(ê): To view a listing of resources",
        "Figure 1: IMT session to translate a Spanish sentence into English.",
        "In interaction-0, the system suggests a translation (es).",
        "In interaction-1, the user moves the mouse to accept the first eight characters \"To view \" and presses the [a] key (k), then the system suggests completing the sentence with \"list of resources\" (a new es).",
        "Interactions 2 and 3 are similar.",
        "In the final interaction, the user accepts the current suggestion.",
        "In this paper, we also focus on the IMT framework.",
        "Specifically, we present an IMT system that is able to learn from user feedback.",
        "For this purpose, we apply the online learning paradigm to the IMT framework.",
        "The online learning techniques that we propose here allow the statistical models involved in the translation process to be incrementally updated.",
        "inter.-O",
        "ep es",
        "To",
        "view",
        "the",
        "resources",
        "list",
        "ep",
        "To",
        "view",
        "inter.-l",
        "k",
        "es",
        "H",
        "list",
        "of",
        "resources",
        "To",
        "view",
        "a",
        "list",
        "inter.-2",
        "k",
        "es",
        "^| ng",
        "resources",
        "To",
        "view",
        "a",
        "listing",
        "inter.-3",
        "k",
        "es",
        "0",
        "■",
        "resources",
        "accept",
        "eP",
        "To",
        "view",
        "a",
        "listing",
        "of",
        "resources",
        "Figure 2 (inspired from (Vidal et al., 2007)) shows a schematic view of these ideas.",
        "Here, f is the input sentence and e is the output derived by the IMT system from f. By observing f and e, the user interacts with the IMT system until the desired output e is produced.",
        "The input sentence f and its desired translation ê can be used to refine the models used by the system.",
        "In general, the model is initially obtained through a classical batch training process from a previously given training sequence of pairs (fi,ei) from the task being considered.",
        "Now, the models can be extended with the use of valuable user feedback."
      ]
    },
    {
      "heading": "2. Interactive machine translation",
      "text": [
        "IMT can be seen as an evolution of the SMT framework.",
        "Given a sentence f from a source language F to be translated into a target sentence e of a target language E, the fundamental equation of SMT (Brown et al., 1993) is the following:",
        "where Pr(f | e) is approximated by a translation model that represents the correlation between the source and the target sentence and where Pr(e) is approximated by a language model representing the well-formedness of the candidate translation e.",
        "State-of-the-art statistical machine translation systems follow a loglinear approach (Och and Ney, 2002), where direct modelling of the posterior probability Pr(e | f ) of Equation (1) is used.",
        "In this case, the decision rule is given by the expression:",
        "ê = argmax where each hm(e, f ) is a feature function representing a statistical model and Am its weight.",
        "Current MT systems are based on the use of phrase-based models (Koehn et al., 2003) as translation models.",
        "The basic idea of Phrase-based Translation (PBT) is to segment the source sentence into phrases, then to translate each source phrase into a target phrase, and finally to reorder the translated target phrases in order to compose the target sentence.",
        "If we summarize all the decisions made during the phrase-based translation process by means of the hidden variable àf, we obtain the expression:",
        "where each àk G {1... K} denotes the index of the target phrase ë that is aligned with the k-th source phrase f k, assuming a segmentation of length K.",
        "According to Equation (4), and following a maximum approximation, the problem stated in Equation (2) can be reframed as:",
        "In the IMT scenario, we have to find an extension es for a given prefix ep.",
        "To do this we reformulate Equation (5) as follows:",
        "where the term p(ep) has been dropped since it does depend neither ones nor on a.",
        "Thus, the search is restricted to those sentences e which contain ep as prefix.",
        "It is also worth mentioning that the similarities between Equation (6) and Equation (5) (note that epes = e) allow us to use the same models whenever the search procedures are adequately modified (Barrachina et al., 2009).",
        "Following the loglinear approach stated in Equation (3), Equation (6) can be rewriten as:",
        "îs = argmax which is the approach that we follow in this work.",
        "A common problem in IMT arises when the user sets a prefix (ep) which cannot be found in the phrase-based statistical translation model.",
        "Different solutions have been proposed to deal with this problem.",
        "The use of word translation graphs, as a compact representation of all possible translations of a source sentence, is proposed in (Barrachina et al., 2009).",
        "In (Ortiz-Martinez et al., 2009), a technique based on the generation of partial phrase-based alignments is described.",
        "This last proposal has also been adopted in this work."
      ]
    },
    {
      "heading": "3. Related work",
      "text": [
        "In this paper we present an application of the online learning paradigm to the IMT framework.",
        "In the online learning setting, models are trained sample by sample.",
        "Our work is also related to model adaptation, although model adaptation and online learning are not exactly the same thing.",
        "The online learning paradigm has been previously applied to train discriminative models in",
        "Watanabe et al., 2007; Chiang et al., 2008).",
        "These works differ from the one presented here in that we apply online learning techniques to train generative models instead of discriminative models.",
        "In (Nepveu et al., 2004), dynamic adaptation of an IMT system via cache-based model extensions to language and translation models is proposed.",
        "The work by Nepveu et al.",
        "(2004) constitutes a domain adaptation technique and not an online learning technique, since the proposed cache components require pre-existent models estimated in batch mode.",
        "In addition to this, their IMT system does not use state-of-the-art models.",
        "To our knowledge, the only previous work on online learning for IMT is (Cesa-Bianchi et al., 2008), where a very constrained version of online learning is presented.",
        "This constrained version of online learning is not able to extend the translation models due to technical problems with the efficiency of the learning process.",
        "In this paper, we present a purely statistical IMT system which is able to incrementally update the parameters of all of the different models that are used in the system, including the translation model, breaking with the above mentioned constraints.",
        "What is more, our system is able to learn from scratch, that is, without any preexisting model stored in the system.",
        "This is demonstrated empirically in section 5."
      ]
    },
    {
      "heading": "4. Online IMT",
      "text": [
        "In this section we propose an online IMT system.",
        "First, we describe the basic IMT system involved in the interactive translation process.",
        "Then we introduce the required techniques to incrementally update the statistical models used by the system.",
        "The basic IMT system that we propose uses a loglinear model to generate its translations.",
        "According to Equation (7), we introduce a set of seven feature functions (from h1 to h7):",
        "• n-gram language model (h1)",
        "is defined as follows:",
        "where Dn = - – – is a fixed discount (cn 1 and c^2 are the number of n-grams with one and two counts respectively), N1+(ei – is the number of unique words that follows the history",
        "Equation (8) corresponds to the probability given by an n-gram language model with an interpolated version of the Kneser-Ney smoothing (Chen and",
        "Goodman, 1996).",
        "max{cX (e",
        "1 and cx (ei – n+1 ) is the count of the n-gram 1, where cx (•) can represent true counts",
        "ct(•) or modified counts cm(•).",
        "True counts are used for the higher order n-grams and modified counts for the lower order n-grams.",
        "Given a certain n-gram, its modified count consists in the number of different words that precede this n-gram in the training corpus.",
        "target sentence-length model (h2) h2(e, f) = log(p(|f | | |e|)) = log(0|e|(|f | +0.5) -(/>|e|(|f | – 0.5)), where 0|e|(-) denotes the cumulative distribution function (cdf) for the normal distribution (the cdf is used here to integrate the normal density function over an interval of length 1).",
        "We use a specific normal distribution with mean /X|e| and standard deviation u|e| for each possible target sentence length | e| .",
        "inverse and direct phrase-based models (h3, h4) hs(e, a, f ) = log(n f=i p(fk |eäfc )), where p(fk|ëak) is defined as follows:",
        "distortion model (h7)",
        "In Equation (9), pphr ( fk |e„k ) denotes the probability given by a statistical phrase-based dictionary used in regular phrase-based models (see (Koehn et al., 2003) for more details).",
        "Phmm(f k|ëak) is the probability given by an HMM-based (intraphrase) alignment model (see (Vogel et al., 1996)):",
        "The HMM-based alignment model probability is used here for smoothing purposes as described in (Ortiz-Martinez et al., 2009).",
        "Analogously h4 is defined as:",
        "• target phrase-length model (h5)",
        "h5(e, a, f) = log(np(|ëk|)), where p(|ëk|) = 5(1 – 5)|ek|.",
        "h5 implements a target phrase-length model by means of a geometric distribution with probability of success on each trial 5.",
        "The use of a geometric distribution penalizes the length of target phrases.",
        "• source phrase-length model (h6)",
        "h6(e,a, f) = log(nK=i p(|fk| | |eäfc |)),where p(|f | | |ëâfc|) = 5(1 – 5)abs(|/k|-|e~kD and abs(-) is the absolute value function.",
        "A geometric distribution is used to model this feature (it penalizes the difference between the source and target phrase lengths).",
        "pfe |ak-i) = 5(1 – 5)abs(b5k -l5k-i ), bakdenotes the beginning position of the source phrase covered by ak and lak_1 denotes the last position of the source phrase covered by ak-i.",
        "A geometric distribution is used to model this feature (it penalizes the reorderings).",
        "The log-linear model, which includes the above described feature functions, is used to generate the suffixes given the user-validated prefix ep.",
        "Specifically, the IMT system generates a partial phrase-based alignment between the user prefix ep and a portion of the source sentence f, and returns the suffixes as the translation of the remaining portion of f (see (Ortiz-Martinez et al., 2009)).",
        "After translating a source sentence f, a new sentence pair (f, e) is available to feed the IMT system (see Figure 1).",
        "In this section we describe how the log-linear model described in section 4.1 is updated given the new sentence pair.",
        "To do this, a set of sufficient statistics that can be incrementally updated is maintained for each feature function h(-).",
        "A sufficient statistic for a statistical model is a statistic that captures all the information that is relevant to estimate this model.",
        "Regarding feature function hi and according to equation (8), we need to maintain the following data: ck;i and ck;2 given any order k, and cX (•) (see section 4.1 for the meaning of each symbol).",
        "Given a new sentence e, and for each k-gram ei-k+iof e where 1 < k < n and 1 < i < |e| + 1, we modify the set of sufficient statistics as it is shown in Algorithm 1.",
        "The algorithm checks the changes in the counts of the k-grams to update the set of sufficient statistics.",
        "Sufficient statistics for Dk are updated following the auxiliar procedure shown in Algorithm 2.",
        "Feature function h2 requires the incremental calculation of the mean /X|e| and the standard deviation u| e| of the normal distribution associated to a target sentence length | e| .",
        "For this purpose the procedure described in (Knuth, 1981) can be used.",
        "In this procedure, two quantities are maintained for each normal distribution: /X|e| and S|e|.",
        "Given a new sentence input : n (higher order), ei_fc+1 (k-gram), (current set of sufficient statistics) output : S (updated set of sufficient statistics) if k = n then",
        "LupdD(S ,k,CT (ei_fc+i),cT (ei_fcH",
        "Algorithm 1 : Pseudocode for updating the sufficient statistics of a given k-gram input : S (current set of sufficient statistics),k",
        "(order), c (current count), c' (new count) output : (ckii,Cfci2) (updated sufficient statistics) begin if c = 0 then Algorithm 2: Pseudocode for the UpdD procedure pair ( f, e), the two quantities are updated using a recurrence relation:",
        "where c(|e|) is the count of the number of sentences of length |e| that have been seen so far, and /X|e| and",
        "S|e| are the quantities previously stored (/X|e| is initialized to the source sentence length of the first sample and S|e| is initialized to zero).",
        "Finally, the standard deviation can be obtained from S as follows:",
        "U|e| = ^/SH/(c(|e|) – 1).",
        "Feature functions h3 and h4 implement inverse and direct smoothed phrase-based models respectively.",
        "Since phrase-based models are symmetric models, only an inverse phrase-based model is maintained (direct probabilities can be efficiently obtained using appropriate data structures, see (Ortiz-Martinez et al., 2008)).",
        "The inverse phrase model probabilities are estimated from the phrase counts:",
        "According to Equation (13), the set of sufficient statistics to be stored for the inverse phrase model consists of a set of phrase counts (c(f , ë ) and E/' c(f ë) must be stored separately).",
        "Given a new sentence pair (f, e), the standard phrase-based model estimation method uses a word alignmentma-trix between f and e to extract the set of phrase pairs that are consistent with the word alignment matrix (see (Koehn et al., 2003) for more details).",
        "Once the consistent phrase pairs have been extracted, the phrase counts are updated.",
        "The word alignment matrices required for the extraction of phrase pairs are generated by means of the HMM-based models used in the feature functions h3 and h4.",
        "Inverse and direct HMM-based models are used here for two purposes: to smooth the phrase-based models via linear interpolation and to generate word alignment matrices.",
        "The weights of the interpolation can be estimated from a development corpus.",
        "Equation (10) shows the expression of the probability given by an inverse HMM-based model.",
        "The probability includes lexical probabilities p(f |ej) and alignment probabilities p(a3-|a3-i, l).",
        "Since the alignment in the HMM-based model is determined by a hidden variable, the EM algorithm is required to estimate the parameters of the model (see (Och and Ney, 2003)).",
        "However, the standard EM algorithm is not appropriate to incrementally extend our HMM-based models because it is designed to work in batch training scenarios.",
        "To solve this problem, we apply the incremental view of the EM algorithm described in (Neal and Hinton, 1998).",
        "According to (Och and Ney, 2003), the lexical probability for a pair of words is given by the expression:",
        "where c(f |e) is the expected number of times that the word e is aligned to the word f. The alignment probability is defined in a similar way:",
        "where c(a3- |a3-i, l) denotes the expected number of times that the alignment aj has been seen after the previous alignment a3-i given a source sentence composed of l words.",
        "Given the equations (14) and (15), the set of sufficient statistics for the inverse HMM-based model consists of a set of expected counts (numerator and denominator values are stored separately).",
        "Given a new sentence pair (f, e), we execute a new iteration of the incremental EM algorithm on the new sample and collect the contributions to the expected counts.",
        "The parameters of the direct HMM-based model are estimated analogously to those of the inverse HMM-based model.",
        "Once the direct and the inverse HMM-based model parameters have been modified due to the presentation of a new sentence pair to the IMT system, both models are used to obtain word alignments for the new sentence pair.",
        "The resulting direct and inverse word alignment matrices are combined by means of the symmetrization alignment operation (Och and Ney, 2003) before extracting the set of consistent phrase pairs.",
        "HMM-based alignment models are used here because, according to (Och and Ney, 2003) and (Toutanova et al., 2002), they outperform IBM 1 to IBM 4 alignment models while still allowing the exact calculation of the likelihood for a given sentence pair.",
        "The 5 parameters of the geometric distributions associated to the feature functions h5, h6 and h7 are left fixed.",
        "Because of this, there are no sufficient statistics to store for these feature functions.",
        "Finally, the weights of the log-linear combination are not modified due to the presentation of a new sentence pair to the system.",
        "These weights can be adjusted off-line by means of a development corpus and well-known optimization techniques."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "This section describes the experiments that we carried out to test our online IMT system.",
        "The experiments were performed using the XEROX XRCE corpus (SchlumbergerSema S.A. et al., 2001), which consists of translations of Xerox printer manuals involving three different pairs of languages: French-English, Spanish-English, and German-English.",
        "The main features of these corpora are shown in Table 1.",
        "Partitions into training, development and test were performed.",
        "This corpus is used here because it has been extensively used in the literature on IMT to report results.",
        "IMT experiments were carried out from English to the other three languages.",
        "The evaluation of the techniques presented in this paper were carried out using the Keystroke and mouse-action ratio (KSMR) measure (Barrachina et al., 2009).",
        "This is calculated as the number of keystrokes plus the number of mouse movements plus one more count per sentence (aimed at simulating the user action needed to accept the final translation), the sum of which is divided by the total number of reference characters.",
        "In addition to this, we also used the well-known BLEU score (Papineni et al., 2001) to measure the translation quality of the first translation hypothesis produced by the IMT system for each source sentence (which is automatically generated without user intervention).",
        "To test the techniques proposed in this work, we carried out experiments in two different scenarios.",
        "In the first one, the first 10 000 sentences extracted from the training corpora were interactively translated by means of an IMT system without any preexistent model stored in memory.",
        "Each time a new sentence pair was validated, it was used to incrementally train the system.",
        "Figures 3 a, 3b and 3 c show the evolution of the KSMR with respect to the number of sentence pairs processed by the IMT system; the results correspond to the translation from English to Spanish, French and German, respectively.",
        "In addi-",
        "Table 1: XEROX corpus statistics for three different language pairs (from English (En) to Spanish (Sp), French (Fr) and German (Ge)) tion, for each language pair we interactively translated the original portion of the training corpus and the same portion of the original corpus after being randomly shuffled.",
        "As these figures show, the results clearly demonstrate that the IMT system is able to learn from scratch.",
        "The results were similar for the three languages.",
        "It is also worthy of note that the obtained results were better in all cases for the original corpora than for the shuffled ones.",
        "This is because, in the original corpora, similar sentences appear more or less contiguosly (due to the organization of the contents of the printer manuals).",
        "This circumstance increases the accuracy of the online learning, since with the original corpora the number of lateral effects ocurred between the translation of similar sentences is decreased.",
        "The online learning of a new sentence pair produces a lateral effect when the changes in the probability given by the models not only affect the newly trained sentence pair but also other sentence pairs.",
        "A lateral effect can cause that the system generates a wrong translation for a given source sentence due to undesired changes in the statistical models.",
        "The accuracy were worse for shuffled corpora, since shuffling increases the number of lateral effects that may occur between the translation of similar sentences (because they no longer appear contiguously).",
        "A good way to compare the quality of different online IMT systems is to determine their robustness in relation to sentence ordering.",
        "However, it can generally be expected that the sentences to be translated in an interactive translation session will be in a non-random order.",
        "Alternatively, we carried out experiments in a different learning scenario.",
        "Specifically, the XEROX",
        "#Sentences (b) English-French (c) English-German",
        "test corpora were interactively translated from the English language to the other three languages, comparing the performance of a batch IMT system with that of an online IMT system.",
        "The batch IMT system is a conventional IMT system which is not able to take advantage ofuserfeedbackaftereachtranslation while the online IMT system uses the new sentence pairs provided by the user to revise the statistical models.",
        "Both systems were initialized with a log-linear model trained in batch mode by means of the XEROX training corpora.",
        "The weights of the log-linear combination were adjusted for the development corpora by means of the downhill-simplex algorithm.",
        "Table 2 shows the obtained results.",
        "The table shows the BLEU score and the KSMR for the batch and the online IMT systems (95% confidence intervals are shown).",
        "The BLEU score was calculated from the first translation hypothesis produced by the IMT system for each source sentence.",
        "The table also shows the average online learning time (LT) for each new sample presented to the system.",
        "All the improvements obtained with the online IMT system were statistically significant.",
        "Also, the average learning times clearly allow the system to be used in a real-time scenario.",
        "En 1 Sp",
        "En Fr",
        "En 1 Ge",
        "Train",
        "Sent.",
        "pairs Running words Vocabulary",
        "55761",
        "52844",
        "49376",
        "571960",
        "657172",
        "542762",
        "573170",
        "506877",
        "440682",
        "25627",
        "29565",
        "24958",
        "27399",
        "24899",
        "37338",
        "Dev.",
        "Sent.",
        "pairs Running words Perplexity (3-grams)",
        "1012",
        "1 994",
        "1 964",
        "12111",
        "13808",
        "9480",
        "9801",
        "9162",
        "8283",
        "46.2",
        "34.0",
        "96.2",
        "74.1",
        "68.4",
        "124.3",
        "Test",
        "Sent.",
        "pairs Running words Perplexity (3-grams)",
        "1125",
        "1 984",
        "1 996",
        "7634",
        "9358",
        "9572",
        "9805",
        "10792",
        "9823",
        "107.0",
        "59.6",
        "192.6",
        "135.4",
        "92.8",
        "169.2",
        "test corpora using the batch and the online IMT systems.",
        "The average online learning time (LT) in seconds is shown for the online system",
        "Finally, in Table 3 a comparison of the KSMR results obtained by the online IMT system with state-of-the-art IMT systems is reported (95% confidence intervals are shown).",
        "We compared our system with those presented in (Barrachina et al., 2009): the alignment templates (AT), the stochastic finite-state transducer (SFST), and the phrase-based (PB) approaches to IMT.",
        "The results were obtained using the same Xerox training and test sets (see Table 1) for the four different IMT systems.",
        "Our system outperformed the results obtained by these systems.",
        "AT PB SFST Online"
      ]
    },
    {
      "heading": "6. Conclusions",
      "text": [
        "We have presented an online IMT system.",
        "The proposed system is able to incrementally extend the statistical models involved in the translation process, breaking technical limitations encountered in other works.",
        "Empirical results show that our techniques allow the IMT system to learn from scratch or from previously estimated models.",
        "One key aspect of the proposed system is the use of HMM-based alignment models trained by means of the incremental EM algorithm.",
        "The incremental adjustment of the weights of the log-linear models and other parameters have not been tackled here.",
        "For the future we plan to incorporate this functionality into our IMT system.",
        "The incremental techniques proposed here can also be exploited to extend SMT systems (in fact, our proposed IMT system is based on an incrementally updateable SMT system).",
        "For the near future we plan to study possible aplications of our techniques in a fully automatic translation scenario.",
        "Finally, it is worthy of note that the main ideas presented here can be used in other interactive applications such as Computer Assisted Speech Transcription, Interactive Image Retrieval, etc (see (Vidal et al., 2007) for more information).",
        "In conclusion, we think that the online learning techniques proposed here can be the starting point for a new generation of interactive pattern recognition systems that are able to take advantage of user feedback."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Work supported by the EC (FEDER/FSE), the",
        "Spanish Government (MEC, MICINN, MITyC,",
        "MAEC, \"Plan E\", under grants MIPRCV \"Consolider Ingenio 2010\" CSD2007-00018, iTrans2 TIN2009-14511, erudito.com TSI-020110-2009-439), the Generalitat Valenciana (grant Prome-teo/2009/014), the Univ.",
        "Politecnica de Valencia (grant 20091027) and the Spanish JCCM (grant PBI08-0210-7127).",
        "IMT system",
        "BLEU",
        "KSMR",
        "LT (s)",
        "En-Sp",
        "batch online",
        "55.1± 2.3 60.6± 2.3",
        "18.2± 1.1 15.8± 1.0",
        "0.04",
        "En-Fr",
        "batch online",
        "33.7± 2.0 42.2± 2.2",
        "33.9± 1.3 27.9± 1.3",
        "0.09",
        "En-Ge",
        "batch online",
        "20.4± 1.8 28.0± 2.0",
        "40.3± 1.2 35.0± 1.3",
        "0.07"
      ]
    }
  ]
}
