{
  "info": {
    "authors": [
      "Masaki Yamashina",
      "Fumihiko Obashi"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2157",
    "title": "Collocational Analysis in Japanese Text Input",
    "url": "https://aclweb.org/anthology/C88-2157",
    "year": 1988
  },
  "references": [
    "acl-C80-1045",
    "acl-C86-1060",
    "acl-C86-1067",
    "acl-C86-1106",
    "acl-J86-3002"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper proposes a new disambiguation method for Japanese text input.",
        "This method evaluates candidate sentences by measuring the number of Word Co-occurrence Patterns (WCP) included in the candidate sentences.",
        "An automatic WCP extraction method is also developed.",
        "An extraction experiment using the example sentences from dictionaries confirms that WCP can be collected automatically with an accuracy of 98.7% using syntactic analysis and some heuristic rules to eliminate erroneous extraction.",
        "Using this method, about 305,000 sets of WCP are collected.",
        "A co-occurrence pattern matrix with semantic categories is built based on these WCP.",
        "Using this matrix, the mean number of candidate sentences in Kana-to-Kanji translation is reduced to about 1/10 of those from existing morphological methods.",
        "1–Introduction For keyboard input of Japanese, Kana-to-kanji translation method [Kawada79] [Makino80] [A be86] is the most popular technique.",
        "In this method, Kana input sentences are translated automatically into Kanji-Kana sentences.",
        "However, non-segmented Kana input is highly ambiguous, because of the segmentation ambiguities of Kana input into morphemes, and homonym ambiguities.",
        "Some research has been carried out mainly to overcome homonym ambiguity using a word usage dictionary [Makino80] and by using case grammar [Abe86].",
        "A new technique named collocational analysis method, is proposed to overcome both ambiguities.",
        "This evaluates the certainty of candidate sentences by measuring the number of co-occurrence patterns between word pairs.",
        "It is used in addition to the usual morphological analysis.",
        "To realize this, it is essential to build a dictionary which can reflect Word Co-occurrence Patterns (WCP).",
        "In English processing research, there has been an attempt [Grishman86] to collect semi-automatically sublanguage selectional patterns.",
        "In Japanese processing research, there have been attempts [Shi-rai86] [Tanaka86] to collect combinations of words with this kind of relationship, either completely or semi-automatically.",
        "These two attempts did not provide a dictionary for practical use.",
        "A new method is proposed for building a dictionary which accumulates WCP.",
        "The first feature of this method is the collection of WCP from the common combination of two words having a dependency relationship in a sentence, because these common combinations will most likely reoccur in future texts.",
        "In this method, it is important to identify dependency relationships between word pairs, instead of identifying, the whole dependency structure of the sentence.",
        "For this purpose, Dependency Localization Analysis (DLA) is used.",
        "This identifies the word pairs having a definite dependency relationship using syntactic analysis and some heuristic rules.",
        "This paper will first describe collocational analysis, a new concept in Kana-to-Kanji translation, then the compilation of WCP dictionary, next the translation algorithm and finally translation experimental results."
      ]
    },
    {
      "heading": "2. Concept of Collocational Analysis in Translation",
      "text": [
        "Collocational analysis evaluates the correctness of a translated sentence by measuring the WCP within the sentence.",
        "The WCP data is accumulated in a 2-dimensional matrix, by information units indicating more restricted concepts than the words can indicate by themselves.",
        "As previously mentioned there are two kinds of ambiguities in Kana-to-Kanji translation.",
        "In Fig.1, disambiguation process of homonyms is illustrated. '",
        "NM (a national",
        "Kana sequence ' i.",
        "5 4 [kokkaoensousuru]' is input, the usual translation system will develop two possible candidate words ' Mgt ' (a national anthem) and ' fiZJIZ (a state)', for the partial Kana sequence of ' fb [kokka].",
        "The system will also develop uniquely the candidate word, , yH .6 (to play) ' for ' 5 4 Z') [ensousurtt]'.",
        "These candidate words are obtained by table searching and morphological analysis.",
        "However, morphological analysis alone can't identify which one is correct for ' [kokka].",
        "Using collocational analysis, the WCP of ' H(a state)' and i 7a (to play)' is found to be nil, while that of ' EA* (a national anthem)' and 4 6 (to play)' is found to be probable.",
        "Using WCP, ' 4 .",
        "(to play a national anthem)' is selected as the final candidate sentence.",
        "If the Kana sequence ' t 0 4 6 [kokkaokensetsusuru]' is input, M*>1 it at 6 (to build a state)' is obtained in same manner.",
        "Homonyms f or %1C0-4(k o k k a) ( to play ) 'Alvf 51-6' ( a national anthem ) (ansousuru)",
        "'he new compilation method extracts from a Senixnee two w(irel combinations which have a dependency relationsitip.",
        "'Phis is illustrated with the sample sentence' 11: A t) (I shot a bird flying in the sky.)'.",
        "At first this method analyzer a sentence morphologically.",
        "In this example, the sentence is segmeilted into five flunsetsu ( japano:e grammatical units, like phrases) and the parts of speech of each word are obtained. '",
        "' bird)' and.",
        "(sky)' nouns.",
        "(to fly)' and ' t'.",
        "(to shoot) ' are verbs.",
        "(ha)' in the first Bunsettat, ' (o)' in the second one and in the fourth one are post positional words.",
        "They determine the dependent attributes of nouns in dependency relationship.",
        "The dependency relationship between words is analyzed using Japanese syntactic rules.",
        "In the extraction step, D1,A is used.",
        "This process first finds out unique dependency relationships.",
        "\"Unique relationship\" means that a dependent has only one possible governor within the sentence.",
        "In this exam pie, tile iplationsinps between ' ∎!",
        "(a bird) and o (to shoot)' and ' 1,S''; (to fly) and (a bird)' ar,-,!",
        "identified as unique.",
        ".Next, 'ambiguous relationships\" are processed.",
        "This te.",
        "lationship means that a dependent has several possible governors.",
        "In this case, l)n governor winch can be identified as moat likely by heuristicendes is located.",
        "This rule will only accept relationships where dependent and governor are adja-emit, because this relationship has the highest possibility.",
        "In this example, ' has two possible candidate governors, ' A (to fly)' and ' f1J k. (to shoot).",
        "In tins case, because, ' (sky) and A J (to fly)' are adjacent, it is identified that ' (sky)' is dependent and ' A ,!!",
        ": (to fly)' is governor.",
        "Next, 41N1-,t(I)' has also two possible candidate governors, lib !,;: (to fly)' and ' Ill 7c (to shoot)'.",
        "In this ease, because, these two governors are not adjacent to the dependent, the dependency relationship between '1i,h-t(I)' and two candidate governors don't be identified for extraction.",
        "Furthermore, some specific part-of-speech sequences which have many ambiguous dependency relationships are rejected for extraction.",
        "Following is an example of confusing part-of-speech sequence.",
        "In spite of similar syntactic style, ' -;,A; L (red)' re (a red car's window)' modifys adjacent word eep, (a car)', while, ' ;)1: Lr (red)' in ' f9( 11:!",
        ": (a red flower in fall)' .modifys a word at end of sentence ' lE (a dower)'.",
        "'['his, in case of this sequence, if a dependent and a governor are adjacent, the relationship between the modifying adjective and the modified noun 43 not identified.",
        "(/) os t p os it ion) p I101111 silt\" K F -177_3-1 (a red tar's window) (red flower in fall)"
      ]
    },
    {
      "heading": "3.2 Extraction. Experiment",
      "text": [
        "9.`o provide a large volume of syntactically correct Sentences, example sentences written in dictionaries [Ohno82] liVlasuda831 were employed.",
        "This is because, these example sentences are a rich source of data indicating typical usage of each common word with short sentences and they are as-sinned to represent common usages within an extremely large amount of source data.",
        "Five hundred example sentences were used to examine the accuracy of this automatic extraction method.",
        "82% of sem-tences could be analyzed morphologically.",
        "As result, 718 sets of dependency relationship were extracted from these morphologically-analyzed sentences with an accuracy of 981%.",
        "Che causes of erroneous extraction are mainly misidentification of part-of--speech and of compound words.",
        "'fir' misidentification of dependency relationship was much less frequent,.",
        "Using this method, 305,000 sets of WCP were collected from 300,000 example sentences.",
        "In these WCI', about 45% of them are relationships between noun and verb or adjective with postpositional word, 21% are relationships between noun and noun with ' 01.)",
        "(postpositional word)'., and 26% are tin: nouns palm constructing compound words."
      ]
    },
    {
      "heading": "3.3 Co-occurrence Pattern Matrix",
      "text": [
        "With the aim of constructing a reliable WCP dictionary., the.",
        "use of individual words, is impractical, because the dictionary becomes too large.",
        "Semantic categories are useful because, if word A and B are synonyms, they will have similar co-occurrence patterns to other words.",
        "litis allows the W(1P dictionary, described in semantic categories, to be greatly reduced in size!.",
        "Scores of semantic categories were developed, however, it was found that the number of these categories was too small to accurately describe word relationships.",
        "'OY tunately, there is a Japanese!",
        "thesaurus lOhno821 with 1,000",
        "modifying adj.",
        "etc.",
        "-I- noun + ®"
      ]
    },
    {
      "heading": "4. Translation Algorithm",
      "text": [
        "Fig.3 shows the translation process outline.",
        "First, table-searching is done for all segmentation possibilities to get each part-of-speech of segment.",
        "This is carried out referring to independent word dictionary (nouns, verbs, adjectives, etc.",
        "[65,000 words]), prefix and suffix dictionary [1085 words], dependent word dictionary (postpositions, auxiliary verbs, etc.",
        "[422 words]).",
        "Then, among the morpheme sequences constructed with each segment, the grammatically possible sequences are selected.",
        "Next, the candidate sentences with the least number of Bunsetsu are selected [Yoshimura83].",
        "Furthermore, among these selected sentences, those which have the least number of words are selected.",
        "In this process, a heuristic rule is used to prevent morpheme sequence mis-selection.",
        "This rule rejects the combinations of nouns constructing a compound word, if the usage frequency of either nouns is very low.",
        "ex.",
        "Input Kana sequence: bN tr, [kankeinonaka]",
        "Secondly, the co-occurrence pattern matrix is utilized in order to determine the number of WCP within each candidate sentence.",
        "The counting operation is carried out only on adjacent Bunsetsu, because, in most cases, relationships are between adjacent Bunsetsu and determining extended relationships would prove to be too time-consuming.",
        "Finally, the candidate sentence with the maximum WCP number is chosen as the prime candidate.",
        "To prevent mistaken deletion of prime candidates caused by word pairs which rarely co-occur, following rule is used.",
        "If the usage frequency of either word in WCP is low, the.candidate sentences of which WCP number is less one than maximum number, are also identified as prime candidates.",
        "In following example, both are identified as prime candidates."
      ]
    },
    {
      "heading": "5. Translation Experimental Result",
      "text": [
        "About four hundred test sentences were used to evaluate the accuracy of collocational analysis.",
        "The mean number of candidate sentences was 62.6, selected by considering leant number of Bunsetsu.",
        "Error ratio for this was 1.7%.",
        "Error ratio means the proportion of correct Bunsetsu missed by the selecting operation in each process to total number Bunsetsu.",
        "The mean number of candidate sentences \"elected by least number of words was 16.1 with an error of 0.8%.",
        "Finally, the number of candidate sentences selected by collocational analysis method was further reduced to 6.4 with an error ratio of 1.6%.",
        "Furthermore, translation accuracy of the practical translation algorithm based on the above description was examined using 10 leading articles in news papers(about 14,000 characters).",
        "This practical algorithm was modified 14 processing proper nouns, numerals and symbols, and to save memory.",
        "It was confirmed that the translation accuracy evaluated by character unit of this method was higher than 95%."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "A method for disambiguation based on collocational analysis of non-segmented Kana-to-Kanji translation has been developed.",
        "To realize this, an automatic WCP dictionary compilation method has also been developed.",
        "In an extraction.",
        "experiment using example sentences front dictionaries, it was confirmed that WCP can be collected automatically with a 98.7% accuracy using syntactic analysis and some heuristic rules to eliminate errors.",
        "Using this method, about 305,000 sets of WCP were collected.",
        "The co-occurrence pattern matrix was built based on these WCP and used in translation experiments.",
        "Experimental results show that the mean number of candidate sentences is reduced to about 1/10 of those from existing morphological methods and that a translation accuracy :if 95% can be achieved.",
        "The collocational analysis method can also be applied to Japanese text input by speech recognition."
      ]
    },
    {
      "heading": "Reference",
      "text": []
    }
  ]
}
