{
  "info": {
    "authors": [
      "John Bear",
      "Jerry R. Hobbs"
    ],
    "book": "Applied Natural Language Processing Conference",
    "id": "acl-A88-1032",
    "title": "Localizing Expression of Ambiguity",
    "url": "https://aclweb.org/anthology/A88-1032",
    "year": 1988
  },
  "references": [
    "acl-J82-3004",
    "acl-J86-3006",
    "acl-P83-1009",
    "acl-P85-1008"
  ],
  "sections": [
    {
      "heading": "Artificial Intelligence Center SRI International Abstract",
      "text": [
        "In this paper we describe an implemented program for localizing the expression of many types of syntactic ambiguity, in the logical forms of sentences, in a manner convenient for subsequent inferential processing.",
        "Among the types of ambiguities handled are prepositional phrases, very compound nominals, adverbials, relative clauses, and preposed prepositional phrases.",
        "The algorithm we use is presented, and several possible shortcomings and extensions of our method are discussed."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Ambiguity is a problem in any natural language processing system.",
        "Large grammars tend to produce large numbers of alternative analyses for even relatively simple sentences.",
        "Furthermore, as is well known, syntactic information may be insufficient for selecting a best reading.",
        "It may take semantic knowledge of arbitrary complexity to decide which alternative to choose.",
        "In the TACITUS project [Hobbs, 1986; Hobbs and Martin, 1987] we are developing a pragmatics component which, given the logical form of a sentence, uses world knowledge to solve various interpretation problems, the rzzolut:un of syntactic ambiguity among them.",
        "Sentences are translated into logical form by the DIALOGIC system for syntactic and semantic analysis [Grosz et al., 1982].",
        "In this paper we describe how information about alternative parses is passed concisely from DIALOGIC to the pragmatics component, and more generally, we discuss a method of localizing the representation of syntactic ambiguity in the logical form of a sentence.",
        "One possible approach to the ambiguity problem would be to produce a set of logical forms for a sentence, one for each parse tree, and to send them one at a time to the pragmatics component.",
        "This involves considerable duplication of effort if the logical forms are largely the same and differ only with respect to attachment.",
        "A more efficient approach is to try to localize the information about the alternate possibilities.",
        "Instead of feeding two logical forms, which differ only with respect to an attachment site, to a pragmatics component, it is worthwhile trying to condense the information of the two logical forms together into one expression with a disjunction inside it representing the attachment ambiguity.",
        "That one expression may then be given to a pragmatics component with the effect that parts of the sentence that would have been processed twice are now processed only once.",
        "The savings can be considerably more dramatic when a set of five or ten or twenty logical forms can be reduced to one, as is often the case.",
        "In effect, this approach translates the syntactic ambiguity problem into a highly constrained coreference problem.",
        "It is as though we translated the sentence in (1) into the two sentences in (2)",
        "(1) John drove down the street in a car.",
        "(2) John drove down the street.",
        "It was in a car.",
        "where we knew \"it\" had to refer either to the street or to the driving.",
        "Since coreference is one of the phenomena the pragmatics component is designed to cope with [Hobbs and Martin, 1987], such a translation represents progress toward a solution.",
        "The rest of this paper describes the procedures we use to produce a reduced set of logical forms from a larger set.",
        "The basic strategy hinges on the idea of a neutral representation (Hobbs, 1982].",
        "This is similar to the idea behind Church's Pseudo-attachment (Church, 1980].",
        "Pereira's Rightmost Normal Form [Pereira, 1083], and what Rich et al.",
        "refer to as the Procrastination Approach to parsing [Rich, Barnett, Wittenburg, and Whittemore.",
        "1086].",
        "However, by expressing the ambiguity as a disjunction in logical form, we put it into the form most convenient for subsequent inferential processing."
      ]
    },
    {
      "heading": "2 Range of Phenomena",
      "text": []
    },
    {
      "heading": "2.1 Attachment Possibilities",
      "text": [
        "There are three representative classes of attachment ambiguities, and we have implemented our approach to each of these.",
        "For each class, we give representative examples and show the relevant logical form fragments that encode the set of possible attachments.",
        "In the first class are those constituents that may attach to either nouns or verbs.",
        "(3) John saw the man with the telescope.",
        "The prepositional phrase (PP) \"with the telescope\" can be attached either to the man\" or to \"saw\".",
        "If n/ stands for the man, t for the telescope, and e for the seeing event, the neutral logical form for the sentence includes .",
        "A with(y,t) A [y=mVy=e] A ... That is, something y is with the telescope, and it is either the man or the seeing event.",
        "Gerund modifiers may also modify nouns and verbs, resulting in ambiguities like that in the sentence I saw the Grand Canyon, flying to New York.",
        "Their treatment is identical to that of PPs.",
        "If g is the Grand Canyon, n is New York, and e is the seeing event, the neutral logical form will include ... A f/y(y,n) A [y = g V y = el A ... That is, something y is flying to New York, and it is either the Grand Canyon or the seeing event.",
        "In the second class are those constituents that can only attach to verbs, such as adverbials.",
        "George said Sam left his wife yesterday.",
        "Here \"yesterday\" can modify the saying or the leaving but not \"his wife\".",
        "Suppose we take yesterday to be a predicate that applies to events and specifies something about their times of occurrence, and suppose el is the leaving event and e2 the saying event.",
        "Then the neutral logical form will include ... A yesterday(y) A [y = el V y = e2] A ... That is, something y was yesterday and it is either the leaving event or the saying event.",
        "Related to this is the case of a relative clause where the preposed constituent is a PP, which could have been extracted from any of several embedded clauses.",
        "In That was the week during which George thought Sam told his wife he was leaving, the thinking, the telling, or the leaving could have been during the week.",
        "Let to be the week, el the thinking, e2 the telling, and e3 the leaving.",
        "Then the neutral logical form will include",
        "That is, something y was during the week, and y is either the thinking, the telling, or the leaving.",
        "The third class contains those constituents that may only attach to nouns, e.g., relative clauses.",
        "This component recycles the oil that flows through the compressor that is still good.",
        "The second relative clause, \"that is still good,\" can attach to \"compressor\", or \"oil\", but not to \"flows\" or \"recycles\".",
        "Let o be the oil and c the compressor.",
        "Then, ignoring \"still\", the neutral logical form will include .",
        ".",
        ".",
        "A good(y) A [y=cVy=o] A... That is, something y is still good, and y is either the compressor or the oil.",
        "Similar to this are the compound nominal ambiguities, as in He inspected the oil filter element.",
        "\"Oil\" could modify either \"filter\" or \"element\".",
        "Let o be the oil, f the filter, e the element, and nn the implicit relation that is encoded by the nominal compound construction.",
        "Then the neutral logical form will include ... A nn( f , e) A nn(o, y) A [y =f V y = e] A ... That is, there is some implicit relation nn between the filter and the element, and there is another implicit relation nn between the oil and something y, where y is either the filter or the element.",
        "Our treatment of all of these types of ambiguity has been implemented.",
        "In fact, the distinction we base the attachment possibilities on is not that between nouns and verbs, but that between event variables and entity variables in the logical form.",
        "This means that we would generate logical forms encoding the attachment of adverbials to event nominal-izations in those cases where the event nouns are translated with event variables.",
        "Thus in I read about Judith's promotion last year.",
        "\"last year\" would be taken as modifying either the promotion or the reading, if \"promotion\" were represented by an event variable in the logical form."
      ]
    },
    {
      "heading": "2.2 Single or Multiple Parse Trees",
      "text": [
        "In addition to classifying attachment phenomena in terms of which kind of constituent something may attach to, there is another dimension along which we need to classify the phenomena: does the DIALOGIC parser produce all possible parses, or only one?",
        "For some regular structural ambiguities, such as very compound nominals, and the \"during which\" examples, only a single parse is produced.",
        "In this case it is straightforward to produce from the parse a neutral representation encoding all the possibilities.",
        "In the other cases, however, such as (nonpreposed) PPs, adverbials, and relative clauses, DIALOGIC produces an exhaustive (and sometimes exhausting) list of the different possible structures.",
        "This distinction is an artifact of our working in the DIALOGIC system.",
        "It would be preferable if there were only one tree constructed which",
        "allows the nn relation to be distributed to the two conjuncts.)"
      ]
    },
    {
      "heading": "6.2 Ordering Heuristics",
      "text": [
        "So far we have only been concerned with specifying the set of possible attachment sites.",
        "However, it is true, empirically, that certain attachment sites can be favored over others, strictly on the basis of syntactic (and simple semantic) information alone.' For example, for the prepositional phrase attachment problem, an informal study of several hundred examples suggests that a very good heuristic is obtained by using the following three principles: (1) favor right association;",
        "(2) override right association if (a) the PP is temporal and the second nearest attachment site is a verb or event nom-inalization, or (b) if the preposition typically signals an argument of the second nearest attachment site (verb or relational noun) and not of the nearest attachment site; (3) override right association if a comma (or comma intonation) separates the PP from the nearest attachment site.",
        "The preposition\"of\" should be treated specially; for \"of\" PPs, right association is correct over 98% of the time.",
        "There are two roles such a heuristic ordering of possibilities can play.",
        "In a system without sophisticated semantic or pragmatic processing, the favored attachment could simply be selected.",
        "On the other hand, in a system such as TACITUS in which complex inference procedures access world knowledge in interpreting a text, the heuristic ordering can influence an allocation of computational resources to the various possibilities."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The authors have profited from discussions with Stu Shieber about this work.",
        "The research was funded by the Defense Advanced Research Projects Agency under Office of Naval Research contract N00014-85-C-0013."
      ]
    }
  ]
}
