{
  "info": {
    "authors": [
      "Nathan Schneider",
      "Behrang Mohit",
      "Chris Dyer",
      "Kemal Oflazer",
      "Noah A. Smith"
    ],
    "book": "NAACL",
    "id": "acl-N13-1076",
    "title": "Supersense Tagging for Arabic: the MT-in-the-Middle Attack",
    "url": "https://aclweb.org/anthology/N13-1076",
    "year": 2013
  },
  "references": [
    "acl-D08-1063",
    "acl-D08-1092",
    "acl-E12-1017",
    "acl-H01-1035",
    "acl-H93-1061",
    "acl-J07-2003",
    "acl-J94-2001",
    "acl-N01-1026",
    "acl-N03-1017",
    "acl-N06-2015",
    "acl-N10-1083",
    "acl-N12-1090",
    "acl-P02-1040",
    "acl-P05-1071",
    "acl-P07-1123",
    "acl-P07-2045",
    "acl-P08-2030",
    "acl-P10-4002",
    "acl-P11-1061",
    "acl-P12-1073",
    "acl-P12-2050",
    "acl-W03-1022",
    "acl-W04-3207",
    "acl-W05-0909",
    "acl-W06-1670",
    "acl-W10-2906"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We consider the task of tagging Arabic nouns with WordNet supersenses.",
        "Three approaches are evaluated.",
        "The first uses an expert-crafted but limited-coverage lexicon, Arabic WordNet, and heuristics.",
        "The second uses unsupervised sequence modeling.",
        "The third and most successful approach uses machine translation to translate the Arabic into English, which is automatically tagged with English supersenses, the results of which are then projected back into Arabic.",
        "Analysis shows gains and remaining obstacles in four Wikipedia topical domains."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "A taxonomic view of lexical semantics groups word senses/usages into categories of varying granularities.",
        "WordNet supersense tags denote coarse semantic classes, including person and artifact (for nouns) and motion and weather (for verbs); these categories can be taken as the top level of a taxonomy.",
        "Nominal supersense tagging (Ciaramita and Johnson, 2003) is the task of identifying lexical chunks in the sentence for common as well as proper nouns, and la-beling each with one of the 25 nominal supersense categories.",
        "Figure 1 illustrates two such labelings of an Arabic sentence.",
        "Like the narrower problem of named entity recognition, supersense tagging of text holds attraction as a way of inferring representations that move toward language independence.",
        "Here we consider the problem of nominal supersense tagging for Arabic, a language with ca.",
        "300 million speakers and moderate linguistic resources, including a WordNet (Elkateb et al., 2006), annotated datasets (Maamouri et al., 2004; Hovy et al., 2006), monolingual corpora, and large amounts of Arabic-English parallel data.",
        "The supervised learning approach that is used in state-of-the-art English supersense taggers (Cia",
        "post hoc English glosses and translation.",
        "ramita and Altun, 2006) is problematic for Arabic, since there are supersense annotations for only a small amount of Arabic text (65,000 words by Schneider et al., 2012, versus the 360,000 words that are annotated for English).",
        "Here, we reserve that corpus for development and evaluation, not training.",
        "We explore several approaches in this paper, the most effective of which is to (1) translate the Arabic sentence into English, returning the alignment structure between the source and target, (2) apply English supersense tagging to the target sentence, and (3) heuristically project the tags back to the Arabic sentence across these alignments.",
        "This ?MT-in-the-middle?",
        "approach has also been successfully used for mention detection (Zitouni and Florian, 2008) and coreference resolution (Rahman and Ng, 2012).",
        "We first discuss the task and relevant resources (?2), then the approaches we explored (?3), and finally present experimental results and analysis in ?4."
      ]
    },
    {
      "heading": "2 Task and Resources",
      "text": [
        "A gold standard corpus of sentences annotated with nominal supersenses (as in figure 1) facilitates automatic evaluation of supersense taggers.",
        "For development and evaluation we use",
        "the AQMAR Arabic Wikipedia Supersense Corpus1 (Schneider et al., 2012), which augmented a named entity corpus (Mohit et al., 2012) with nominal supersense tags.",
        "The corpus consists of 28 articles selected from four topical areas: history (e.g., ?Islamic Golden Age?",
        "), science (?Atom?",
        "), sports (?Real Madrid?",
        "), and technology (?Linux?).",
        "Schneider et al. (2012) found the distributions of supersense categories in these four topical domains to be markedly different; e.g., most instances of communication (which includes kinds of software) occurred in the technology domain, whereas most substances were found in the science domain.",
        "The 18 test articles have 1,393 sentences (39,916 tokens) annotated at least once.2 As the corpus was released with two annotators?",
        "(partially overlapping) taggings, rather than a single gold standard, we treat the output of each annotator as a separate test set.",
        "Both annotated some of every article; the first (Ann-A) annotated 759 sentences, the second (Ann-B) 811 sentences.",
        "Lexicon.",
        "What became known as ?supersense tags?",
        "arose from a high-level partitioning of synsets in the original English WordNet (Fellbaum, 1998) into lexicographer files.",
        "Arabic WordNet (AWN) (Elkateb et al., 2006) allows us to recover supersense categories for some 10,500 Arabic nominal types, since many of the synsets in AWN are cross-referenced to English WordNet, and can therefore be associated with supersense categories.",
        "Further, OntoNotes contains named entity annotations for Arabic (Hovy et al., 2006).",
        "From these, we construct an Arabic supersense lexicon, mapping Arabic noun lemmas to supersense tags.",
        "This lexicon contains 23,000 types, of which 11,000 are multiword units.",
        "Token coverage of the test set is 18% (see table 1).",
        "Lexical units encountered in the test data were up to 9-ways supersense-ambiguous; the average ambiguity of in-vocabulary tokens was 2.0 supersenses.",
        "Unlabeled Arabic text.",
        "For unsupervised learning we collected 100,000 words of Arabic Wikipedia text, not constrained by topic.",
        "The articles in this sample were subject to a minimum length threshold",
        "(2012), but we exclude two test set documents??Light?",
        "and ?Ibn Tolun Mosque?",
        "?due to preprocessing issues.",
        "and are all cross-linked to corresponding articles in English, Chinese, and German.",
        "Arabic?English machine translation.",
        "We used two independently developed Arabic-English MT systems.",
        "One (QCRI) is a phrase-based system (Koehn et al., 2003), similar to Moses (Koehn et al., 2007); the other (cdec) is a hierarchical phrase-based system (Chiang, 2007), as implemented in cdec (Dyer et al., 2010).",
        "Both were trained on about 370M tokens of parallel data provided by the LDC (by volume, mostly newswire and UN data).",
        "Each system includes preprocessing for Arabic morphological segmentation and orthographic normalization.",
        "The QCRI system used a 5-gram modified Kneser-Ney language model that generated full-cased forms (Chen and Goodman, 1999).",
        "cdec used a 4-gram KN language model over lowercase forms and was recased in a post-processing step.",
        "Both language models were trained using the Giga-word v. 4 corpus.",
        "Both systems were tuned to optimize BLEU on a held-out development set (Papineni et al., 2002).",
        "English supersense tagger.",
        "For English supersense tagging, an open-source reimplementation of the approach of Ciaramita and Altun (2006) was released by Michael Heilman.4 This tagger was trained on the SemCor corpus (Miller et al., 1993) and achieves 77% F1 in-domain."
      ]
    },
    {
      "heading": "3 Methods",
      "text": [
        "We explored 3 approaches to the supersense tagging of Arabic: heuristic tagging with a lexicon, unsupervised sequence tagging, and MT-in-the-middle."
      ]
    },
    {
      "heading": "3.1 Heuristic Tagging with a Lexicon",
      "text": [
        "Using the lexicon built from AWN and OntoNotes (see ?2), our heuristic approach works as follows:",
        "1.",
        "Stem and vocalize; we used MADA (Habash and Rambow, 2005; Roth et al., 2008).",
        "2.",
        "Greedily detect word sequences matching lexicon entries from left to right.",
        "3.",
        "If a lexicon entry has more than one associated supersense, Arabic WordNet synsets are 3QCRI accomplishes this using MADA (Habash and Rambow, 2005; Roth et al., 2008).",
        "cdec includes a custom CRFbased segmenter and standard normalization rules.",
        "E?",
        "person location artifact substance Automatic English supersense tagging e?",
        "1 2 3 4 5 6 7 8 9 English sentence a 1 2 3 4 5 6 Arabic sentence (e.g., token 6 aligns to English tokens 7?9)",
        "bic words (with their POS tags).",
        "Step 4 of the projection procedure constructs the Arabic-to-English mapping {1?person11, 4?location",
        "6}, resulting in the tagging shown in the bottom row.",
        "weighted to favor earlier senses (presumed by lexicographers to be more frequent) and then the supersense with the greatest aggregate weight is selected.",
        "Formally: Let senses(w) be the ordered list of AWN senses of lemma w. Let senses(w, s) ?",
        "senses(w) be those senses that map to a given supersense s. We choose arg maxs(|senses(w, s)|/ mini:senses(w)i?senses(w,s) i)."
      ]
    },
    {
      "heading": "3.2 Unsupervised Sequence Models",
      "text": [
        "Unsupervised sequence labeling is our second approach (Merialdo, 1994).",
        "Although it was largely developed for part-of-speech tagging, the hope is to use in-domain Arabic data (the unannotated Wikipedia corpus discussed in ?2) to infer clusters that correlate well with supersense groupings.",
        "We applied the generative, feature-based model of Berg-Kirkpatrick et al. (2010), replicating a feature-set used previously for NER (Mohit et al., 2012)?",
        "including context tokens, character n-grams, and POS?and adding the vocalized stem and several stem shape features: 1) ContainsDigit?",
        "; 2) digits replaced by #; 3) digit sequences replaced by # (for stems mixing digits with other characters); 4) YearLike?",
        "?true for 4-digit numerals starting with 19 or 20; 5) LatinWord?, per the morphological analysis; 6) the shape feature of Ciaramita and Altun (2006) (Latin words only).",
        "We used 50 iterations of learning (tuned on dev data).",
        "For evaluation, a many-to-one mapping from unsupervised clusters to supersense tags is greedily induced to maximize their correspondence on evaluation data."
      ]
    },
    {
      "heading": "3.3 MT-in-the-Middle",
      "text": [
        "A standard approach to using supervised linguistic resources in a second language is cross-lingual projection (Yarowsky and Ngai, 2001; Yarowsky et al., 2001; Smith and Smith, 2004; Hwa et al., 2005; Mi-halcea et al., 2007; Burkett and Klein, 2008; Burkett et al., 2010; Das and Petrov, 2011; Kim et al., 2012, who use parallel sentences extracted from Wikipedia for NER).",
        "The simplest such approach starts with an aligned parallel corpus, applies supersense tagging to the English side, and projects the labels through the word alignments.",
        "A supervised monolingual tagger is then trained on the projected labels.",
        "Preliminary experiments, however, showed that this underperformed even the simple heuristic baseline above (likely due to domain mismatch), so it was abandoned in favor of a technique that we call MT-in-the-middle projection.",
        "This approach does not depend on having parallel data in the training domain, but rather on an Arabic?English machine translation system that can be applied to the sentences we wish to tag.",
        "The approach is inspired by token-level pseudo-parallel data methods of previous work (Zitouni and Florian, 2008; Rahman and Ng, 2012).",
        "MT output for this language pair is far from perfect?especially for Wikipedia text, which is distant from the domain of the translation system's training data?but, in the spirit of Church and Hovy (1993), we conjecture that it may still be useful.",
        "The method is as follows:",
        "1.",
        "Preprocess the input Arabic sentence a to match the decoder's model of Arabic.",
        "2.",
        "Translate the sentence, recovering not just the English output e?",
        "but also the derivation/alignment structure z relating words and/or phrases of the English output to words and/or phrases of the Arabic input.",
        "3.",
        "Apply the English supersense tagger to the English translation, discarding any verbal supersense tags.",
        "Call the tagger output E?.",
        "4.",
        "Project the supersense tags back to the Ara",
        "bic sentence, yielding A?",
        ": Each Arabic token a ?",
        "a that is (a) a noun, or (b) an adjective following 0 or more adjectives following a noun is mapped to the first English supersense mention in E?",
        "containing some word aligned to a.",
        "Then, for each English supersense men",
        "beled/unlabeled6 mention precision, recall, and F-score against each annotator.",
        "The last row is a hybrid: MT-in-the-middle followed by lexicon heuristics to improve recall.",
        "Best single-technique and best hybrid results are bolded.",
        "tion, all its mapped Arabic words are grouped into a single mention and the supersense category for that mention is projected.",
        "Figure 2 illustrates this procedure.",
        "The cdec system provides word alignments for its translations derived from the training data; whereas QCRI only produces phrase-level alignments, so for every aligned phrase pair ?a?, e??",
        "?",
        "z, we consider every word in a?",
        "as aligned to every word in e?",
        "(introducing noise when English supersense mention boundaries do not line up with phrase boundaries)."
      ]
    },
    {
      "heading": "4 Experiments and Analysis",
      "text": [
        "Table 1 compares the techniques (?3) for full Arabic supersense tagging.",
        "The number of nouns, tokens, and mentions covered by the automatic tagging is reported, as is the mention-level evaluation against human annotations.",
        "The evaluation is reported separately for the two annotators in the dataset.",
        "With heuristic lexicon lookup, 18% of the tokens are marked as part of a nominal supersense mention.",
        "Both labeled and unlabeled mention recall with this method are below 30%; labeled precision is about 30%, and unlabeled mention precision is above 50%.",
        "From this we conclude that the biggest problems are (a) out-of-vocabulary items and (b) poor semantic disambiguation of in-vocabulary items.",
        "The unsupervised sequence tagger does even worse on the labeled evaluation.",
        "It has some success at detecting supersense mentions?unlabeled recall is substantially improved, and unlabeled precision is",
        "slightly improved.",
        "But it seems to be much worse at assigning semantic categories; the number of labeled true positive mentions is actually lower than with the lexicon-based approach.",
        "MT-in-the-middle is by far the most successful single approach: both systems outperform the lexicon-only baseline by about 10 F1 points, despite many errors in the automatic translation, English tagging, and projection, as well as underlying linguistic differences between English and Arabic.",
        "The baseline's unlabeled recall is doubled, indicating substantially more nominal expressions are detected, in addition to the improved labeled scores.",
        "We further tested simple hybrids combining the lexicon-based and MT-based approaches.",
        "Applying MT-in-the-middle first, then expanding token coverage with the lexicon improves recall at a small cost to precision (table 1, last row).",
        "Combining the techniques in the reverse order is slightly worse than MT-based projection without consulting the lexicon.",
        "MT-in-the middle improves upon the lexicon-only baseline, yet performance is still dwarfed by the supervised English tagger (at least in the SemCor evaluation; see ?2), and also well below the 70% inter-annotator F1 reported by Schneider et al. (2012).",
        "We therefore examine the weaknesses of our approach for Arabic."
      ]
    },
    {
      "heading": "4.1 MT for Projection",
      "text": [
        "In analyzing our projection framework, we performed a small-scale MT evaluation with the Wikipedia data.",
        "Reference English translations for 140 Arabic Wikipedia sentences?5 per article in the corpus?were elicited from a bilingual linguist.",
        "Table 2 compares the two systems under three standard metrics of overall sentence translation quality.8",
        "While the resulting number of sentences with references is far from ideal and there is only one reference translation for each, all three measures favor QCRI.",
        "For a targeted measure of lexical translation quality of noun expressions, we elicited acceptability judgments from a bilingual annotator for translated and supersense-projected phrases.",
        "Given each MT system output (for the same 140 sentences) in which mentions predicted by the English supervised tagger were highlighted, along with the Arabic source sentence, the judge was asked for each English mention whether it was a valid translation.9 We call this lexical projection precision.",
        "Figure 3 shows examples, and the last column of table 2 gives overall statistics.",
        "Upwards of 90% of the lexical translations were accepted; as with the automatic MT measures, QCRI slightly outperforms cdec (especially in the technology and sports domains10).",
        "Of the problematic lexical translations, some are almost certainly domain effects: e.g., corn or maize instead of atom.",
        "Others are more nuanced, e.g., shipments for charges and electronics for electrons.",
        "Transliteration errors included IMAX in place of EMACS and genoa lynx for GNU Linux.",
        "However, lexical projection precision seems to be a relatively small part of the problem, especially considering that not all translation errors lead to supersense tagging errors.",
        "Lexical projection recall was not measured, but noun token coverage (see table 1) is instructive.",
        "Most noun tokens ought to be tagged; 77% is the noun coverage rate in the gold standard.",
        "In table 1, and translation edit rate (TER) (Snover et al., 2006)",
        "respectively.",
        "For sports the respective differences were 4.3 and 4.4.",
        "In the other domains the differences never exceeded 3.3.",
        "Interestingly, this is the only generalization about topical domain performance we were able to find that holds across annotators and systems, in contrast with the stark topical effects observed by Mohit et al. (2012) for NER.",
        "tems over 140 sentences.",
        "The first three are automatic measures with 1 reference translation.",
        "For the fourth, a bilingual judged the translation acceptability of phrases that were identified as supersense mentions by the English tagger (lexical projection precision).",
        "noun coverage gains track overall improvements.",
        "If QCRI produces better translations, why is cdec more useful for supersense tagging?",
        "As noted in ?3.3, cdec gives word-level alignments (even when the decoder uses large phrasal units for translation), allowing for more precise projections.11 We suspect this is especially important in light of findings that larger phrase sizes are indicative of better translations (Gamon et al., 2005), so these are exactly the cases where we expect the translations to be valuable."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "To our knowledge, this is the first study of automatic Arabic supersense tagging.",
        "We have shown empirically that an MT-in-the-middle technique is most effective of several approaches that do not require labeled training data.",
        "Analysis sheds light on several challenges that would need to be overcome for better Arabic lexical semantic tagging."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We thank Wajdi Zaghouani for the translation of the Arabic Wikipedia MT set, Francisco Guzman and Preslav Nakov for the output of QCRI's MT system, and Waleed Ammar and anonymous reviewers for their comments.",
        "This publication was made possible by grant NPRP-08485-1-083 from the Qatar National Research Fund (a member of the Qatar Foundation).",
        "The statements made herein are solely the responsibility of the authors.",
        "11Our experiments use QCRI as an off-the-shelf system.",
        "As a reviewer notes, it could be retrained to produce word-level alignments, which would likely improve the accuracy of supersense tag projection."
      ]
    }
  ]
}
