{
  "info": {
    "authors": [
      "Barry Haddow",
      "Michael Matthews"
    ],
    "book": "Biological, translational, and clinical language processing",
    "id": "acl-W07-1019",
    "title": "The Extraction of Enriched Protein-Protein Interactions from Biomedical Text",
    "url": "https://aclweb.org/anthology/W07-1019",
    "year": 2007
  },
  "references": [
    "acl-E06-1051",
    "acl-M98-1002",
    "acl-P04-1043",
    "acl-W00-1427",
    "acl-W03-0424",
    "acl-W04-1207",
    "acl-W06-3322"
  ],
  "sections": [
    {
      "text": [
        "The Extraction of Enriched Protein-Protein Interactions from Biomedical",
        "Text",
        "Barry Haddow and Michael Matthews",
        "There has been much recent interest in the extraction of PPIs (protein-protein interactions) from biomedical texts, but in order to assist with curation efforts, the PPIs must be enriched with further information of biological interest.",
        "This paper describes the implementation of a system to extract and enrich PPIs, developed and tested using an annotated corpus of biomedical texts, and employing both machine-learning and rule-based techniques."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The huge volume of literature generated in the biomedical field is such that researchers are unable to read all the papers that interest them.",
        "Instead they must rely on curated databases, containing information extracted from the literature about, for example, which proteins interact.",
        "These curated databases are expensive to produce as they rely on qualified biologists to select the papers, read them to extract the relevant information, enter this information into the database, and crosscheck the information for quality control, a procedure which can be very time-consuming.",
        "If NLP techniques could be used to aid curators in their task then the costs of producing curated databases could be substantially reduced.",
        "In the context of biomedical information extraction, there has been much recent interest in the automated extraction of PPIs (protein-protein interactions) from biomedical literature.",
        "The recent BioCreAtIvE Challenge highlights the desire to utilize these extraction techniques to automatically or semi-automatically populate curated PPI databases.",
        "However, just identifying the interactions is not necessarily sufficient, as curators typically require additional information about the interactions, such as the experimental method used to detect the interaction, and the names of any drugs used to influence the behaviour of the proteins.",
        "Furthermore, curators may only be interested in interactions which are experimentally proven within the paper, or where the proteins physically touch during the interaction.",
        "This paper describes the implementation of a system designed to extract mentions of PPIs from biomedical text, and to enrich those PPIs with additional information of biological interest.",
        "The enriched information consists of properties (name-value pairs associated with a PPI, for example a directness property could indicate whether the interaction is direct or not direct) and attributes (relations between the PPI relation or its participating entities and other entities, such as the experimental method used to detect the PPI).",
        "This system for extracting and enriching PPIs was developed as part of the TX M programme, which aims to develop tools to help with the curation of biomedical papers.",
        "After reviewing related work in the following section, a detailed description of how the annotated corpus was created and its descriptive statistics is provided in section 3.",
        "The methods used to extract the properties and attributes are explained in section 4, and then evaluated and discussed in section 5.",
        "Some conclusions and suggestions for further work are offered in section 6."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "There has been much recent interest in extracting ppis from abstracts and full text papers (Bunescu and Mooney, 2006; Giuliano et al., 2006; Plake et al., 2005; Blaschke and Valencia, 2002; Donaldson et al., 2003).",
        "In these systems however, the focus has been on extracting just the ppis without attempts to enrich the ppis with further information.",
        "Enriched ppis can be seen as a type of biological event extraction (Alphonse et al., 2004; Wattarujeekrit et al., 2004), a technique for mapping entities found in text to roles in predefined templates which was made popular in the MUC tasks (Marsh and Perzanowski, 1998).",
        "There has also been work to enrich sentences with semantic categories (Shah and Bork, 2006) and qualitative dimensions such as polarity (Wilbur et al., 2006).",
        "Using NLP to aid in curation was addressed in the KDD 2002 Cup (Yeh et al., 2002), where participants attempted to extract records curatable with respect to the FlyBase database, and has been further studied by many groups (Xu et al., 2006; Karamanis et al., 2007; Ursing et al., 2001).",
        "The Protein-Protein Interaction task of the recent BioCreAtIvE challenge (Krallinger et al., 2007) was concerned with selecting papers and extracting information suitable for curation.",
        "The ppi detection subtask (IPS) required participants not simply to detect ppi mentions, but to detect curatable ppi mentions, in other words to enrich the ppi mentions with extra information.",
        "Furthermore, another of the subtasks (IMS) required participants to add information about experimental methods to the curatable ppis."
      ]
    },
    {
      "heading": "3. Data Collection and Corpus",
      "text": [
        "A total of 217 papers were selected for annotation from PubMed and PubMedCentral as having experimentally proven protein-protein interactions (ppis).",
        "The papers were annotated by a team of nine annotators, all qualified in biology to at least PhD level, over a period of approximately five months.",
        "The xml versions of the papers were used wherever possible, otherwise the html versions were used and converted to xml using an in-house tool.",
        "The full-text of each paper, including figure captions, was annotated, although the materials and methods sections were not included in the annotation.",
        "From the 217 annotated papers, a total of 65 were selected randomly for double annotation and 27 for triple annotation.",
        "These multiply-annotated papers were used to measure inter-annotator agreement (iaa), by taking each pair of annotations on the same paper, and scoring one annotation against the other using the same algorithm as for scoring the system against the annotated data (see Section 5).",
        "Each doubly annotated paper contributed one pair of annotations, whilst the triply annotated papers contributed three pairs of annotations.",
        "The overall iaa score is the micro-average of the F1 scores on each pair of corresponding annotations, where it should be emphasised that the Fi does not depend on the order in which the annotated papers were combined.",
        "The multiply annotated papers were not reconciled to produce a single gold version, rather the multiple versions were left in the corpus.",
        "The papers were annotated for entities and relations, and the relations were enriched with properties and attributes.",
        "The entities chosen for annotation were those involved in ppis (Protein, Complex, Fusion, Mutant and Fragment) and those which could be attributes of ppis (CellLine, Drug-Compound, ExperimentalMethod and Modification-Type).",
        "A description of the properties and attributes, as well as counts and iaa scores are shown in Tables 1 and 2.",
        "Once annotated, the corpus was split randomly into three sections, train (66%), devtest (17%) and test (17%).",
        "train and devtest were to be used during the development of the system, for feature exploration, parameter tuning etc., whilst test was reserved for scoring the final system.",
        "The splits were organised so that multiply annotated versions of the same paper were placed into the same section.",
        "The total number of distinct ppis annotated in the 336 papers was 11523, and the ppi iaa, measured using Fi , was 64.77.",
        "The following are examples of enriched ppis, with the entities in bold face:",
        "(1) Tat may also increase initiation of HIV-1 transcription by enhancing phosphorylation of SP1, a transcription factor involved in the basal HIV-1 transcription [14].",
        "(2) To confirm that LIS1 and Tat interact in vivo, we used yeast two-hybrid system, in which Tat was expressed as a bait and LIS1 as a prey.",
        "Again, we found that LIS1 and Tat interacted in this system.",
        "In Example 1, the properties attached to the ppi between \"Tat\" and \"SP1\" are Referenced, Direct and Positive, and \"phosphorylated\" is attached as a ModificationAfter attribute.",
        "Example 2 shows a ppi between \"Tat\" and \"LIS1\" (in the second sentence) which is given the properties Proven, Direct and Positive, and has the InteractionDetectionMethod attribute \"yeast two-hybrid system\".",
        "This second example indicates that attributes do not have to occur in the same sentence.",
        "Statistics on the occurrence of properties are shown in Table 1.",
        "For most of the property values, there are significant numbers of ppis, except for Unspecified and Negative, which are used in less than 10% of cases.",
        "Note that annotators were permitted to mark more than one ppi between a given pair of entities if, for example, they wished to mark both Positive and Negative ppis because the author is making a statement that proteins interact under one condition and not under another condition.",
        "For the purposes of data analysis and to make modelling easier, such ppis have been collapsed to give a single ppi which may have multiple values for each property and attribute.",
        "Table 2 shows occurrence statistics for attributes, where, as for properties, there can be multiple values for the same attribute.",
        "A notable feature of the attribute attachment counts is that certain attributes (ModificationBefore and DrugTreatment especially) are quite rarely attached, making it difficult to use statistical techniques.",
        "Also shown in Tables 1 and 2 are the iaa figures for all properties and attributes.",
        "The iaa for properties is generally high, excepted for the Unspecified value of the IsProven property.",
        "This being something of a \"none of the above\" category means that the annotators probably have different standards regarding the uncertainty required before the ppi is placed in this class.",
        "The iaa for attributes is, on the whole, lower, with some attributes showing particularly low iaa (ParticipantldentificationMethod).",
        "A closer investigation shows that the bulk of the disagreement is about when to attach, in other words if both annotators decide to attach an attribute to a particular ppi, they generally agree about which one, scoring a micro-averaged overall F1 of 95.10 in this case.",
        "Name",
        "Explanation",
        "Values",
        "Counts",
        "Pet",
        "IAA",
        "IsPositive",
        "The polarity of the statement about the ppi.",
        "Positive Negative",
        "10718 836",
        "93.01 7.26",
        "99.57 90.12",
        "IsDirect",
        "Whether the ppi is direct or not.",
        "Direct NotDirect",
        "7599 3977",
        "65.95 34.51",
        "86.59 61.38",
        "IsProven",
        "Whether the ppi is proven in the paper or not.",
        "Proven",
        "Referenced",
        "Unspecified",
        "7562 2894 1096",
        "65.63 25.11 9.51",
        "87.75 88.61 34.38",
        "Name",
        "Entity type",
        "Explanation",
        "Count",
        "IAA",
        "InteractionDetectionMethod",
        "ExperimentalMethod",
        "Method used to detect the ppi.",
        "2085",
        "59.96",
        "ParticipantldentificationMethod",
        "ExperimentalMethod",
        "Method used to detect the participant.",
        "1250",
        "36.83",
        "ModificationBefore",
        "Modification",
        "Modification of participant before interaction.",
        "240",
        "68.13",
        "ModificationAfter",
        "Modification",
        "Modification of participant after interaction.",
        "1198",
        "86.47",
        "DrugTreatment",
        "DrugCompound",
        "Treatment applied to participant.",
        "844",
        "49.00",
        "CellLine",
        "CellLine",
        "Cell-line from which participant was drawn.",
        "2000",
        "64.38"
      ]
    },
    {
      "heading": "4. Methods",
      "text": [
        "The property and attribute assignment modules were implemented as part of an NLP pipeline based on the lt-xml2 architecture.",
        "The pipeline consists of tokenisation, lemmatisation, part-of-speech tagging, species word identification, abbreviation detection and chunking, named entiry recognition (NER) and relation extraction.",
        "The part-of-speech tagging uses the Curran and Clark POS tagger (Curran and Clark, 2003) trained on MedPost data (Smith et al., 2004), whilst the other preprocessing stages are all rule based.",
        "Tokenisation, species word identification and chunking were implemented in-house using the lt-xml2 tools (Grover and Tobin, 2006), whilst abbreviation extraction used the Schwartz and Hearst abbreviation extractor (Schwartz and Hearst, 2003) and lemmatisation used morpha (Minnen et al., 2000).",
        "The NER module uses the Curran and Clark NER tagger (Curran and Clark, 2003), augmented with extra features tailored to the biomedical domain.",
        "Finally, a relation extractor based on a maximum entropy model and a set of shallow linguistic features is employed, as described in (Nielsen, 2006).",
        "To assign properties to each ppi extracted by the relation extraction component, a machine learning based property tagger was trained on a set offeatures extracted from the context of the ppi.",
        "The property tagger used a separate classifier for each property, but with the same feature set, and both Maximum Entropy (implemented using Zhang Le's maxent) and Support Vector Machines (implemented using svmlight) were tested.",
        "To choose an optimal feature set, an iterative greedy optimisation procedure was employed.",
        "A set of potential features were implemented, with options to turn parts of the feature set on or off.",
        "The full feature set was then tested on the devtest data with each of the feature options knocked out in turn.",
        "After examining the scores on all possible feature knockouts, the one which offered the largest gain in performance was selected and removed permanently.",
        "The whole procedure was then repeated until knockouts produced no further gains in performance.",
        "The resulting optimised feature set contains the following features: ngram Both unigrams and bigrams were implemented, although, after optimisation, unigrams were switched off.",
        "The ngram feature uses vlw backoff, which means that words are replaced by their verb stems, backed off to lemmas and then to the word itself if not available.",
        "Furthermore, all digits in the words are replaced with \"0\".",
        "Ngrams are extracted from the sentences containing the participants in the ppi, and all sentences in between.",
        "Ngrams occurring before, between and after the participants of the ppi are treated as separate features.",
        "entity The entity feature includes the text and type",
        "of the entities in the ppi.",
        "headword This feature is essentially constructed in the same way as the ngram feature, except that only head verbs of chunks in the context are included, and the vlw backoff is not used.",
        "entity-context In the entity context feature, the vlw backoffs of the two words on either side of each of the entities in the ppi are included, with their positions marked.",
        "For attribute assignment, experiments were performed with both rule-based and machine-learning approaches.",
        "The following sections summarise the methods used for each approach.",
        "In the rule-based approach, handwritten rules were written for each attribute, using part-of-speech tags, lemmas, chunk tags, head words and the NER tags.",
        "In all, 20 rules were written.",
        "Each rule is",
        "Table 3: The rules used to assign ModificationAfter attributes.",
        "The protein column indicates whether the attribute attaches to the 1st or 2nd protein, the prec field indicates the precision of the rule on the training set and the count indicates the number of times the rule applied correctly in training.",
        "In the rules, P1 refers to the first protein, P2 refers to the second protein, ATT refers to the attribute, * refers to any number of words, any-word refers to any single word, and pass refers to the passive voice.",
        "For example, the rule \"P2 - any-word ATT\" applied to the sentence \"protein 1 is regulated by protein 2-dependent phosphorylation\" would result in the attribute phos-phorylation being assigned as the ModificationAfter attribute to protein 1.",
        "ranked according to its precision as determined on the train set, and the rules are applied in order of their precision.",
        "This is particularly important with modification attributes which are constrained so that a given modification entity can only be attached once per interaction.",
        "Table 3 lists the rules used to assign the ModificationAfter attribute.",
        "For this approach, attributes are modelled as relations between ppis and other entities.",
        "For each ppi in a document, a set of candidate relations is created between each of the entities in the ppi and each of the attribute entities contained in the same sen-tence(s) as the ppi.",
        "If there are no entities of the appropriate type for a given attribute in the same sentence as the ppi, the sentences before and after the ppi are also scanned for candidate entities.",
        "Each of the candidate relations that correspond to attributes annotated in the gold standard are considered positive examples, whilst those that were not annotated are considered negative examples.",
        "For example, given the following sentence:",
        "Protein A phosphorylates protein B [Protein] [Modification] [Protein]",
        "If the gold standard indicates a ppi between Protein A and Protein B with phosphorylates assigned as a ModificationAfter attribute to Protein B, four candidate relations will be created as shown in Table 4",
        "A set of features is extracted for each of the examples and a maximum entropy (ME) model is trained using Zhang Le's maxent toolkit.",
        "The features used are listed below:",
        "entity The text and part-of-speech of the attribute, as used for properties.",
        "entity-context The entity context feature used for properties, except that the context size was increased to 4, and parts-of-speech of the context words were also included.",
        "ngram This is the same as the ngram feature used for properties, except that unigrams were switched on.",
        "entities-between The entities that appear between the two entities involved in the candidate relation.",
        "parent-relation-feature Indicates the position of the attribute entity with respect to parent ppi (i.e. before, after, or in between).",
        "For attributes that are in between the two entities involved in the ppi, also indicates if the sentence is active or passive."
      ]
    },
    {
      "heading": "5. Evaluation",
      "text": [
        "To score the property tagger, precision, recall and F1 are calculated for each of the seven possible",
        "Rule",
        "Protein",
        "Prec",
        "Count",
        "PI ATTP2",
        "P2",
        "100",
        "13",
        "PI is ATT by P2",
        "PI",
        "100",
        "1",
        "ATT 0ÎP2",
        "P2",
        "86.1",
        "112",
        "ATT oîPl",
        "PI",
        "74.5",
        "80",
        "PI * ATT site",
        "PI",
        "72.2",
        "13",
        "PI * ATT by *P2",
        "P2",
        "70.0",
        "100",
        "PI * (ATT pass) *P7",
        "P2",
        "64.0",
        "16",
        "PI *ATT*P2",
        "P2",
        "67.5",
        "187",
        "P2ATT",
        "P2",
        "75.0",
        "100",
        "P2 - any-word ATT",
        "PI",
        "73.7",
        "14",
        "Type",
        "Entity 1",
        "Entity 2",
        "Label",
        "Mod Before",
        "Prot A",
        "phosphorylates",
        "neg",
        "Mod Before",
        "ProtB",
        "phosphorylates",
        "neg",
        "Mod After",
        "Prot A",
        "phosphorylates",
        "neg",
        "Mod After",
        "ProtB",
        "phosphorylates",
        "pos",
        "Table 5: The performance of the property tagger, measured by training on train and devtest combined, then testing on TEST.",
        "The two scores given for each system are for testing on gold PPls, and testing on predicted ppis.",
        "An F1 score is shown for each property value, as well as a microaveraged overall score.",
        "property values and then the F1 scores are micro-averaged to give an overall score.",
        "As mentioned in Section 3.1, all versions of the annotation for each multiply-annotated document were included in the training and test sets, taking care that all versions of the same document were included in the same set.",
        "This has the disadvantage that the system can never achieve 100% in cases where the annotators differ, but the advantage of giving partial credit where there is genuine ambiguity and the system agrees with one of the options chosen by the annotators.",
        "The scores for all property values, tested on TEST, are shown in Table 5, both using the model (with Maximum Entropy and SVM) and using a baseline where the most popular value is assigned.",
        "Two scores are shown, the performance as measured when the test set has the gold ppis, and the performance when the test set has the predicted ppis, scored only on those PPls where both system and gold agree.",
        "The relation extractor used to predict the ppis is trained on the same documents as were used to train the property tagger.",
        "To see which features were most effective, a knockout (lesion) test was conducted in which features were knocked out one by one and performance was measured on the devtest set.",
        "In each feature knockout, one of the features from the list in Section 4.2 was removed.",
        "Table 6 shows how the overall performance is affected by the different knockouts.",
        "From the knockout experiment it is clear that the ngram (actually bigram) feature is by far the most effective, with the other features only contributing marginally to the results.",
        "Table 6: The effect of knocking out features on the property score.",
        "Tests are conducted by training on train and testing on devtest, on predicted ppis.",
        "\"vanilla\" refers to the case where the optimal features set is employed.",
        "The attributes are scored in the same manner as the properties.",
        "Table 7 summarises the results for both the rule-based and machine learning attribute systems.",
        "These are compared to a baseline system that simply attaches the nearest entity of the appropriate type for each attribute.",
        "The results for the more common property values are generally close to human performance (as measured by iaa), however performance on both IsNegative and Unspecified is fairly low.",
        "In the case of Unspecified, the IAA is also low, making it likely that the training and test data is inconsistent, compounding the problem of the low occurrence rate of this value.",
        "The Negative value also suffers from a low occurrence rate, leading to an imbalance between Negative and positive which makes life hard for the",
        "Name",
        "Value",
        "Baseline",
        "Maximum Entropy",
        "SVM",
        "Gold",
        "Predicted",
        "Gold",
        "Predicted",
        "Gold",
        "Predicted",
        "IsPositive",
        "Positive",
        "96.87",
        "97.33",
        "97.10",
        "98.22",
        "97.08",
        "98.27",
        "Negative",
        "0.00",
        "0.00",
        "38.46",
        "48.39",
        "45.45",
        "57.53",
        "IsDirect",
        "Direct",
        "78.66",
        "81.90",
        "82.05",
        "85.54",
        "81.94",
        "86.87",
        "NotDirect",
        "0.00",
        "0.00",
        "58.92",
        "54.33",
        "60.80",
        "63.44",
        "IsProven",
        "Proven",
        "78.21",
        "78.85",
        "87.86",
        "82.73",
        "88.08",
        "88.51",
        "Referenced",
        "0.00",
        "0.00",
        "81.46",
        "69.65",
        "82.83",
        "81.97",
        "Unspecified",
        "0.00",
        "0.00",
        "25.74",
        "29.41",
        "22.77",
        "28.00",
        "Overall",
        "74.20",
        "76.24",
        "83.87",
        "83.33",
        "84.09",
        "86.79",
        "Feature",
        "Knockout score",
        "Difference",
        "vanilla",
        "86.08",
        "0.00",
        "ngram",
        "81.86",
        "-4.22",
        "entity",
        "85.30",
        "-0.77",
        "headword",
        "84.38",
        "-0.50",
        "entity-context",
        "85.54",
        "-0.54",
        "Table 7: The performance of the attribute tagger, on test.",
        "The two scores given for each system are for testing on gold ppis, and testing on predicted ppis.",
        "Performance on each attribute value is measured using F1, and then microaveraged to give an overall figure.",
        "machine learners.",
        "However it is also possible that the shallow linguistic features used in these experiments are not sufficient to make the sometimes subtle distinction between a negative statement about an interaction and a positive one, and that models based on a deeper linguistic analysis (e.g. parse trees as in (Moschitti, 2004)) would be more successful.",
        "Note also that the feature set was optimised for maximum performance across all property values, with all given equal weight, but if some values are more important than others then this could be taken into account in the optimisation, with possibly different feature sets used for different property names.",
        "The results for the attributes using the rule-based system are approximately 75% of human performance and are higher than results for the machine learning system.",
        "However, for the ModificationAfter, CellLine, and InteractionDetectionMethod attributes, which occur more frequently than the other attributes and have higher iaa, the machine learning system is competitive and even slightly outperforms in the case of the InteractionDetectionMethod.",
        "The scores are directly correlated with the iaa and both the scores and the iaa are higher for the attributes that tend to occur in the same sentence as the ppi.",
        "On a practical level, this suggests that those who hope to create similar systems would be advised to start with local attributes and pay particular attention to iaa on non-local attributes.",
        "As regards properties, good results were obtained using shallow linguistic features, but it would be interesting to learn whether machine learning techniques based on a deeper linguistic analysis would be more effective.",
        "Also, properties were treated as additional information added on to the ppis after the relation extractor had run, but perhaps it would be more effective to combine relation extraction and property tagging to, for example, consider positive and negative ppis as different types of relations.",
        "For attributes, it would be interesting to combine the rule-based and machine learning systems.",
        "This has the advantage of having a system that can both learn from annotated data when it exists, but can be potentially improved by rules when necessary or when annotated data is not available.",
        "Another issue may be that some attributes might not be represented explicitly by a single entity in a document.",
        "For example, an experimental method may be described rather than explicitly stated.",
        "Attributes that are not local to the ppi caused difficulty for both the annotators and the system.",
        "It would be interesting to see if it is easier to attach attributes to a single ppi that has been derived from the text, rather than attempting to assign attributes to each specific mention of a ppi within the text.",
        "This could be accomplished by attempting to merge the information gathered from each relation along the lines described in (Hobbs,",
        "Since the main motivation for developing the system to extract enriched ppis was to develop a tool to aid curators, it would be useful to know how effective the system is in this task.",
        "Aside from (Karama-nis et al., 2007), there has been little work published to date on the effect that NLp could have on the cu-ration process.",
        "In the most recent BioCreAtlvE evaluation, the PPI subtasks were concerned with automating information extraction tasks typically performed by curators such as distinguishing between curatable and non-curatable ppi mentions and specifying the details of how the ppi was detected.",
        "Attribute",
        "Baseline",
        "Rule-based",
        "Machine Learning",
        "Gold",
        "Predicted",
        "Gold",
        "Predicted",
        "Gold",
        "Predicted",
        "InteractionDetectionMethod",
        "36.02",
        "39.71",
        "39.22",
        "41.38",
        "37.02",
        "46.81",
        "ParticipantldentificationMethod",
        "08.68",
        "09.27",
        "12.32",
        "12.87",
        "03.37",
        "05.97",
        "ModificationBefore",
        "13.10",
        "16.00",
        "42.22",
        "43.84",
        "04.88",
        "08.33",
        "ModificationAfter",
        "43.37",
        "46.00",
        "64.93",
        "73.04",
        "62.32",
        "69.64",
        "DrugTreatment",
        "49.57",
        "51.11",
        "51.29",
        "53.33",
        "13.90",
        "24.52",
        "CellLine",
        "50.19",
        "45.90",
        "54.47",
        "50.47",
        "45.13",
        "42.28",
        "Overall",
        "29.68",
        "30.32",
        "45.26",
        "48.32",
        "32.08",
        "43.11"
      ]
    },
    {
      "heading": "6. Conclusions",
      "text": [
        "A system was implemented for enriching protein-protein interactions (PPls) with properties and attributes providing additional information useful to biologists.",
        "It was found that a machine learning approach to property tagging, using simple contextual features, was very effective in most cases, but less effective for values that occurred rarely, or for which annotators found difficulty in assigning values.",
        "For the attributes, sparsity of data meant that rule-based approaches worked best, using fairly simple rules that could be quickly developed, although machine learning approaches could be competitive when there was sufficient data."
      ]
    },
    {
      "heading": "7. Acknowledgements",
      "text": [
        "The authors are very grateful to the annotation team, and to Cognia (http://www.cognia.",
        "com) for their collaboration on the TXM project.",
        "This work is supported by the Text Mining programme of ITI Life Sciences Scotland (http: / / www.",
        "itilifesciences .",
        "com)."
      ]
    }
  ]
}
