{
  "info": {
    "authors": [
      "Bruce Loatman"
    ],
    "book": "Message Understanding Conference",
    "id": "acl-M91-1029",
    "title": "PRC Inc: Description of the PAKTUS System Used for MUC-3",
    "url": "https://aclweb.org/anthology/M91-1029",
    "year": 1991
  },
  "references": [],
  "sections": [
    {
      "heading": "BACKGROUND",
      "text": [
        "The PRC Adaptive Knowledge-based Text Understanding System (PAKTUS) has been under development as an Independent Research and Development project at PRC since 1984.",
        "The objective is a generic system of tools, including a core English lexicon, grammar, and concept representations, for building natural language processing (NLP) systems for text understanding.",
        "Systems built with PAKTUS are intended to generate input to knowledge based systems or data base systems.",
        "Input to the NLP system is typically derived from an existing electronic message stream, such as a news wire.",
        "PAICTUS supports the adaptation of the generic core to a variety of domains: JINTACCS messages, RAINFORM messages, news reports about a specific type of event, such as financial transfers or terrorist acts, etc., by acquiring sublanguage and domain-specific grammar, words, conceptual mappings, and discourse patterns.",
        "The long-term goal is a system that can support the processing of relatively long discourses in domains that are fairly broad with a high rate of success."
      ]
    },
    {
      "heading": "APPROACH",
      "text": [
        "PAKTUS may be viewed from two perspectives.",
        "In one view it is seen as a generic environment for building NLP systems, incorporating modules for lexical acquisition, grammar building, and conceptual template specification.",
        "The other perspective focuses on the grammar, lexicon, concept templates, and parser already embedded within it, and views it as an NLP system itself.",
        "The early emphasis in developing PAKTUS was on those components supporting the former view.",
        "The grammar and lexicon that form the common core of English, as well as the stock of generic conceptual templates, entered PAKTUS primarily as a side effect of the testing of extensions to the NLP system development environment.",
        "More recent work has focused on extending the linguistic knowledge within the overall architecture, such as prepositional phrase attachment, compound nominals, temporal analysis, and metaphorical usage, and on adapting the core to particular domains, such as RAINFORM messages or news reports.",
        "The first step in this project was an evaluation of existing techniques for NLP, as of 1984.",
        "This evaluation included implementing rapid prototypes using techniques as in [1], [2], [3], and [4].",
        "Judging that no one technique was adequate for a full treatment of the NLP problem, we adopted a hybrid approach, breaking the text understanding process into specialized modules for text stream preprocessing, lexical analysis, including morphology, syntactic analysis of clauses, conceptual analysis, domain-specific pattern matching based on an entire discourse (e.g., a news report), and fmal output-record generation.",
        "Knowledge about word morphology was drawn from [5] and is represented as a semantic network, as is lexical and semantic knowledge in general.",
        "The grammar specification has been based on our analysis of message text, and draws from [5], [6], and [7].",
        "It was first implemented as an augmented transition network (ATN), using a linguistic notation similar to that in [4].",
        "This implementation relies on an interactive graphic interface to specify and debug grammar rules.",
        "More recent investigations focus on alternative formalisms.",
        "Our conceptual analysis combines aspects of conceptual dependency [1], [8], case grammar [9], semantic preferences [10], and psychology [11].",
        "We provided a feedback loop from the conceptual analyzer to the syntactic parser for faster, more accurate analysis.",
        "We have found empirically that the current parser usually runs in linear time (on a Sun 3/260, about 0.1 second per word, regardless of sentence length).",
        "This is a result of the feedback together with \"look ahead\" tests at critical decision points.",
        "Those infrequent sentences requiring more time are terminated by the parser, which returns the longest parsed substring, or a run-on analysis.",
        "The resultant loss of recall is more than compensated for in increased system throughput.",
        "MUC-3 corpus sentences that PAKTUS parses completely (about 47% of the total corpus) average about two seconds of parse time, compared to about ten seconds each for partial and run-on parses (about 51% of the total corpus).",
        "Our first version of the domain-specific discourse pattern matcher was based on [2], but a more versatile version, based on specification-by-examples, was added during MUCK 2 development.",
        "This uses clause, sentence, and noun",
        "phrase semantic and syntactic patterns, and was used again in MUC-3.",
        "We have begun implementing discourse-level pattern matching (somewhat like scripts), but this was not sufficiently developed for use in MUC-3.",
        "In addition to these functional NLP components, PAKTUS has a broad set of development tools, including grammar construction tools and debugger, a lexical acquisition interface, conceptual specification tools, domain pattern builders, and some automatic learning capabilities.",
        "These greatly facilitated adaptation of the system to the MUC-3 task."
      ]
    },
    {
      "heading": "System Architecture",
      "text": [
        "PAKTUS integrates a variety of methods that have had some success in the past.",
        "The architecture of the PAKTUS-based NLP system used for MUC-3 is shown in Figure 1.",
        "Processing begins with the arrival of an electronic stream of text, such as the MUC-3 corpus.",
        "The first function performed is the decomposition of the stream of characters into individual messages, message segments, sentences, and strings of words, based on document format specifications contained in a MUC-3 document specification template.",
        "The words identified by the preprocessor are mapped into entries in the lexicon which contain information about their syntax and semantics, as illustrated in Figure 2 for the word \"knows\".",
        "The lexicon, contained in five databases, contains separate information for root words (\"words\" in Figure 2), concepts, and surface forms or \"tokens\".",
        "The latter are mapped into data structures based on the roots.",
        "These mappings are contained the \"parses\" database of Figure 2.",
        "Compound words and idioms are first mapped into synthetic tokens, and then processed like other surface forms.",
        "All this information is organized in memory in two networks: a lexical net and a concept net.",
        "These two networks are linked by conceptual associations, as illustrated in Figure 2.",
        "The words, concepts, and associations are brought into memory only as needed in processing text.",
        "PAKTUS includes an object-oriented DBMS that performs these lexicon operations [121.",
        "When words are encountered that have never been seen previously by PAKTUS, it tries to analyze these morphologically.",
        "The morphology module has information about approximately 250 affixes, one of which, -en, is illustrated in Figure 3.",
        "It analyzes words in terms of known roots and the affixes, although some words can be adequately analyzed without any knowledge of the root (e.g., any word not in the lexicon that ends in \"ology\"",
        "denotes an \"information domain\").",
        "It derives both syntactic information and semantic information, producing an internal PAICTUS representation.",
        "In addition, for MUC-3, we added morphological heuristics for guessing syntactic and semantic information in many cases, even when the root is unknown (e.g., an unrecognized word ending in \"ation\" might be an abstract noun).",
        "If all of this fails to identify the word, the system deduces as much as it can from the syntactic and semantic context during parsing.",
        "The next step in processing the text is to parse the sentences syntactically, according to a grammar specification, to generate syntactic configurations.",
        "The conceptual analyzer then maps the syntactic configurations into conceptual frames (concept structures with roles filled by phrase constituents), usually resolving much ambiguity in the process.",
        "If the syntax cannot be mapped into any conceptual frame, it is rejected and the syntactic parser tries alternatives.",
        "The first two levels of the conceptual network are shown in Figure 4.",
        "The conceptual roles used in PAKTUS are shown in Figure 5.",
        "The discourse analyzer collects all the conceptual frames for an entire narrative (i.e., an entire news report for the MUC-3 application) and produces application-specific structures that represent the information that is to be extracted from the document, based on the discourse template specifications.",
        "These structures are then reformatted into simulated MUC-3 data base updates (i.e., filled templates).",
        "An example is given below.",
        "There are important feedback points in this process, as shown in Figure 1.",
        "For example, the conceptual analyzer may notify the syntactic parser that a proposed parse is semantically unacceptable, signalling that an alternative parse should be attempted.",
        "This semantic testing is always invoked at the clause level, and sometimes sooner.",
        "In addition, when confronted with two computationally expensive paths, \"look ahead\" procedures that quickly scan the sentence are invoked to decide which to try first.",
        "For example, a past participle following a noun",
        "may or may not signal the beginning of a relative clause in which the noun is the direct object.",
        "In this case, a partial conceptual analysis quickly determines whether the noun can be mapped into any concept associated with the verb.",
        "If it cannot, the relative clause path is not pursued."
      ]
    },
    {
      "heading": "APPLICATION TO MUC-3",
      "text": [
        "To apply PAKTUS to MUC-3, five tasks were performed.",
        "Due to the modular design of PAKTUS, these are clearly delineated and were performed by different people.",
        "Some tasks must be initiated in sequence, but may be cascaded as the corpus of text is processed, so that, except for a brief period at the beginning of the task, work proceeded in parallel.",
        "The number of changes to various knowledge bases is summarized in Figure 6.",
        "The five tasks were:",
        "• Build a template specifying the formats of the input streams (dev-muc3, tstl and tst2).",
        "This was easy and required about a day to perform.",
        "• Read in the documents and update the lexicon using the PAKTUS interactive graphic interface.",
        "This was relatively easy for those words (typically nouns) that only require categorization, but not conceptual mapping specifications (as verbs do).",
        "The latter has often been done successfully by relying on PAICTUS default values.",
        "• Adapt the grammar to the sublanguage of the application.",
        "Actually changing the grammar is easy with the PAKTUS interactive graphic tools for this, but determining what is the grammar of the sublanguage may be quite difficult, requiring much linguistic knowledge and study of the corpus.",
        "Changes for MUC-3 were minor.",
        "• Define the application-specific discourse templates.",
        "This is the least developed component of PAICTUS, and the one that will receive the most attention in continuing work, such as for MUC-4.",
        "For MUC-3, phrase and sentence-level patterns were defined.",
        "A function unified these and mapped them into the 18-slot MUC-3 templates.",
        "Specify and implement the interface to the application system (the MUC-3 template fills).",
        "This was tedious, but easy compared to the other tasks.",
        "It is strictly conventional software engineering.",
        "Message number 99 from the \"testl\" set, which is reprinted in Appendix H, will be used to illustrate PAKTUS's operation for MUC-3.",
        "PAKTUS processes text sequentially, first stripping off the document header, then identifying sentences, which are processed syntactico-semantically one at a time, after which all the results are passed to the discourse component.",
        "The lexical analysis of this sentence is shown in Figure 8.",
        "Each word has one or more senses, represented as a root symbol, which is generally the concatenation of the English token, the \"A\" character, and the PAKTUS lexical category (e.g., \"ReportAMonotrans\"), or as a simple structure involving a root, lexical category, inflectional mark, and sometimes a conceptual derivation (e.g. the structure \"(ReportAMonotrans LAEffect-mark Base CAIt-got)\" represents the adjective sense of \"reported\").",
        "For each word, all senses in the PAKTUS lexicon are fetched or derived at this time; disambiguation is generally delayed until the syntactic and semantic phases.",
        "An exception in this",
        "example is the word \"tonight\" which has been replaced by the date from the dateline of this MUC-3 news report.",
        "The syntactic and conceptual analyses of this sentence are shown in Figures 9 and 10, respectively.",
        "Note that conceptual structures are produced for some nouns (e.g., \"embassies\"), not just for verbs.",
        "Figure 14 illustrates the ability of PAICTUS to deal with unknown words, which is essential in any application that continually processes new text.",
        "This shows the syntactic analysis of a sentence from one of the \"test2\" reports.",
        "It contains three words that can not be derived from the PAKTUS lexicon: \"Estevez\", \"MPTL\", and \"supposed\".",
        "PA1CTUS made assumptions about each word, based on morphology and syntactico-semantic context.",
        "It was able to produce a reasonably accurate parse, by guessing that \"Estevez\" is a Spanish name, and recognizing that \"MFIL\" is a noun in apposition with the preceding noun phrase, and that \"supposed\" must in this case be a passive voice monotransitive verb.",
        "2.",
        "DATE OF INCIDENT - 25 OCT 89 3.",
        "TYPE OF INCIDENT BOMBING 4.",
        "CATEGORY OF INCIDENT TERRORIST ACT 5.",
        "PERPETRATOR: ID OF INDIV(S) \"TERRORISTS\" 6.",
        "PERPETRATOR: ID OF ORG(S) 7.",
        "PERPETRATOR: CONFIDENCE REPORTED AS FACT: - 8.",
        "PHYSICAL TARGET: ID(S) \"EMBASSIES\" 9.",
        "PHYSICAL TARGET: TOTAL NUM PLURAL 10.",
        "PHYSICAL TARGET: TYPE(S) DIPLOMAT OFFICE OR"
      ]
    },
    {
      "heading": "RESIDENCE: \"EMBASSIES\"",
      "text": []
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
