{
  "info": {
    "authors": [
      "K. Vijay-Shanker",
      "Aravind K. Joshi"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P85-1011",
    "title": "Some Computational Properties of Tree Adjoining Grammers",
    "url": "https://aclweb.org/anthology/P85-1011",
    "year": 1985
  },
  "references": [],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "Tree Adjoining Grammar (TAG) is a formalism for natural language grammars.",
        "Some of the basic notions of TAG's were introduced in 1.1oehi,Levy, and Takahashi l9751 and by kloshi.",
        "19831.",
        "A detailed investigation of the linguistic relevance of TAG's has been carried out in (Kroch and Joshi,19851.",
        "In this paper, we will describe some new results for TAG., especially in the following areas: (1) parsing complexity of TAG's, (2) some closure results for TAG'., and (3) the relationship to Head grammars."
      ]
    },
    {
      "heading": "1. INTRODUCTION 2. TREE ADJOINING GRAMMARS – TAG's",
      "text": [
        "We now introduce tree adjoining grammars (TAG's).",
        "TAG's are more powerful than CFC's, both weakly and strongly.'",
        "TAG's were first introduced in lioshi, Levy, and Takahashi,19751 and Poshi,19831.",
        "We include their description in this section to make the paper self-contained.",
        "We can define a tree adjoining grammar as follows.",
        "A tree adjoining grammar G is a pair (I,A) where I is a set of initial trees, and A is a set of auxiliary trees.",
        "A tree a is an initial tree if it is of the form Investigation of constrained grammatical systems from the a point of view of their linguistic adequacy and their computational tractability has been a major concern of computational linguists for the last several years.",
        "Generalized Phrase Structure grammars (GPSG), Lexical Functional grammars (LFG), Phrase Linking grammars (PLC), and Tree Adjoining grammars (TAG) are some key examples of grammatical systems that have been and still continue to be investigated along these lines.",
        "• E L\" Some of the basic notions of TAG's were introduced in 1Joshi, Levy, and Takahashi,19751 and 1.1oehi,19831.",
        "Some preliminary investigations of the linguistic relevance and some computational properties were also carried out in lioshi,19831.",
        "More recently, a detailed investigation of the linguistic relevance of TAG's were carried out by 1Kroch and Joshi,19851.",
        "In this paper, we will describe some new results for TAG'., especially in the following areas: (1) parsing complexity of TAG's, (2) some closure results for TAG's, and (3) the relationship to Head grammars.",
        "These topics will be covered in Sections 3, 4, and S respectively.",
        "In section 2, we will give an introduction to TAG'..",
        "In section 8, we will state some properties not discussed here.",
        "A detailed exposition of these results is given in (Vijay-Shankar and Joshi,19851.",
        "'This work was partially sut,ported by NSF Grants MCS-8210116-CER, MCS412-07204.",
        "We want to thank Carl Pollard, Kelly Roach, David Scut sad David Weir.",
        "We have benefited enormously by valuable discussions with therm That is, the root node of a is labelled S and the frontier nodes are all terminal symbols.",
        "The internal nodes are all non-terminals.",
        "A tree 13 is an auxiliary tree if it is of the form"
      ]
    },
    {
      "heading": "111112 E",
      "text": [
        "That is, the root node of 0 is labelled with a -..on-terminal X and the frontier nodes are all labelled with terminals symbols except one which is labelled X.",
        "The node labelled by X on the frontier will be called the foot node of 13.",
        "The frontiers of initial trees belong to r, whereas the frontiers of the auxiliary trees belong to E. N 12+Li"
      ]
    },
    {
      "heading": "N L'.",
      "text": [
        "We will now define a composition operation called adjoining, (or adjunction) which composes an auxiliary tree 0 with a tree 7.",
        "Let be a tree with a node n labelled X and let 13 be an auxiliary tree with the root labelled with the same symbol X.",
        "(Note that must have, by definition, a node (and only one) labelled X on the frontier.)",
        "IGrammara GI and G2 are weakly equivalent if the tiring language of Cl, 14011 – the string language of G2.",
        "14021.",
        "GI and 02 are strongly equivalent if they 1st weakly equivalent and for each w is L(Gll L(G2).",
        "both GI and 02 assign the same struetural deeeription to w. A grammar G is weakly adequate for • (string) language L, if 1,(G) wir L G is strongly adequate for L if L(G) se, L sad for sack w in 1., 0 assigns aa •appropriate• structural description to w. The notion of strong adequacy is undoubtedly not precise became it depends on the lotion of appropriate stmetural descriptions",
        "The tree t dominated by X in 7 is excised, 0 is inserted at the node it in 7 and the tree t is attached to the foot node (labelled X) of 0, i.e., 0 is inserted or adjoined to the node n in 7 pushing t downwards.",
        "Note that adjoining is not a substitution operation.",
        "We will now define T(G): The set of all trees derived in G starting from initial trees in I.",
        "This set will be called the tree set of G. L(G): The set of all terminal strings which appear in the frontier of the trees in T(G).",
        "This set will be called the str_im language if.y.",
        "language) of G. If L is the string language of a TAG G then we say that L is a Tree-Adjoining LanenageILA11...",
        "The relationship between TAG's , context-free grammars, and the corresponding string languages can be summarized as follows (1Joshi, Levy, and Takahashi, 19751, (Joshi, 19831).",
        "Theorem 2.1: For every context-free grammar, G', there is an equivalent TAG, G, both weakly and strongly.",
        "Theorem 2.2: For every TAG, G, we have the following situations: a. L(G) is context-free and there is a context-free grammar G' that is strongly (end therefore weakly) equivalent to G. b. L(G) is context-free and there is no context-tree grammar G' that is equivalent to G. Of course, there must be a context-free grammar that is weakly equivalent to G. e. L(G) is strictly context-sensitive.",
        "Obviously is this case, there is no context-free grammar that is weakly equivalent to G. Parts (a) and (c) of Theorem 2.2 appear ia (Pool* Levy, and Takahashi, 1975().",
        "Part (b) is implicit in that paper, but it is important to state it explicitly as we have done here because of its linguistic significance.",
        "Example 2.1 illustrates part (a).",
        "We will now illustrate parte (b) and (c).",
        "Clearly, L(G), the string language of G is Lt(aaelta/a>ol which is a context-free language.",
        "Thus, there must exist a context-free grammar, G', which is at least weakly equivalent to G. It can be shown however that there is no context-free grammar G' which is strongly equivalent to G. i.e., T(G) T(G').",
        "This follows from the fact that the set T(G) (the tree set of G) is non-recognizable,.",
        "i.e., there is no finite state bottom-up tree automaton that can recognize precisely T(G).",
        "Thus a TAG ELIL generate a context-free language,.",
        "structural descriptions to the strings that cannot be",
        "The precise definition of L(G) is as follows: L(G) L1 e en / a > o, w is a string of a's and b's such that",
        "(1) the number of a's the number of b's a, and (2) for any initial substring of w, the number of a's > the number of b's. }",
        "Li is a strictly context-sensitive language (i.e., a context-sensitive language that is not context-free).",
        "This can be shown as follows.",
        "Intersecting L with the regular language e b• e c* results in the language L2 ={anbnecn/n>o)=Lifleb'ec* L2 is well-known strictly context-sensitive language.",
        "The result of intersecting a context-free language with a regular language is always a context-free language; hence, LI is not a context-free language.",
        "It is thus a strictly context-sensitive language.",
        "Example 2.3 thus illustrates part (c) of Theorem 2.2.",
        "TAG's have more power than CFO's.",
        "However, the extra power is quite limited.",
        "The language Li has equal number of a's, b's and c'a; however, the a's and b's are mixed in a certain way.",
        "The language L2 is similar to Lt, except that a's come before all b's.",
        "TAG's as defined so far are not powerful enough to generate 1.2.",
        "This can be seen as follows.",
        "Clearly, for any TAG for L2, each initial tree must contain equal number of a's, b's and c's (including zero), and each auxiliary tree must also contain equal number of a's, b's and c's.",
        "Further in each case the a's must precede the b's.",
        "Then it is easy to see from the grammar of Example 2.3, that it will not be possible to avoid getting the a's and b's mixed.",
        "However, L2 can be generated by a TAG with local constraints (see Section 2.1) The so-called copy language.",
        "L.■{Ivew/wi{a,bla) also cannot be generated by a TAG, however, again, with local constraints.",
        "It is thus clear that TAG's can generate more than context-free languages.",
        "It can be shown that TAG's cannot generate all context-sensitive languages Poshi ,19841.",
        "Although TAG's are more powerful than CFG's, this extra power is highly constrained and apparently it is just the right kind for characterizing certain structural descriptions.",
        "TAG's share almost all the formal properties of CFG'a (more precisely, the corresponding classes of languages), as we shall see in section 4 of this paper and (Vijay-Shankar and Joe609851.",
        "In addition,the string languages of TAG's can also be parsed in polynomial time, in particular in 0(n.).",
        "The parsing algorithm is described in detail in section 3."
      ]
    },
    {
      "heading": "TAG'. with Local Constraint. on Adjoining",
      "text": [
        "The adjoining operation as defined in Section 2.1 is °context-free* An auxiliary tree, say, is adjoinable to a tree t at a node, say, n, if the label of that node is X. Adjoining does not depend on the context (tree context) around the node a.",
        "In this sense, adjoining is context-free.",
        "In ',Tashi ,19831, local constraints on adjoining similar to those investigated by (Joshi and Levy ,1977( were considered.These are a generalization of the context-sensitive constraints studied by (Peters and Ritchie ,19691. it was soon recognized, however, that the full power of these constraints was never fully utilized, both in the linguistic context as well as in the 'formal languages' of TAG's.",
        "The so-called proper analysis contexts and domination contexts (as defined in lloshi and Levy ,1971) as used in (Joshi ,19113) always turned out to be such that the context elements were always in a specific elementary tree i.e., they were further localized by being in the same elementary tree.",
        "Based on this observation and a suggestion in (Joehi, Levy and Takahashi ,1975), we will describe a new way of introducing local constraints.",
        "This approach not only captures the insight stated above, but it is truly in the spirit of TAG's.",
        "The earlier approach was not so, although it was certainly adequate for the investigation in (Joshi ,1983).",
        "A precise characterization of that approach still remains an open problem.",
        "elementary tree t E I 1.1 A, and for each node, n, in t, we specify the set 0 of auxiliary trees that can be adjoined at the node a.",
        "Note that if there is no constraint then all auxiliary trees are adjoinable at a (of course, only those whose root has the same label as the label of tbo node o).",
        "Thus, in general, 0 is a subset of the set of all the auxiliary trees adjoinable at a.",
        "We will adopt the following conventions.",
        "1.",
        "Since, by definition, no auxiliary trees are adjoinable to a node labelled by a terminal symbol, no constraint has to be stated for node labelled by a terminal.",
        "2.",
        "If there is no constraint, i.e., all auxiliary trees (with the appropriate root label) are adjoinable at a node, say, n, then we will not state this explicitly.",
        "3.",
        "If no auxiliary trees are adjoinable at a node a, then we will write the constraint as (0), where cb denotes the null set.",
        "4.",
        "We will also allow for the possibility that for a node at least one adjoining is obligatory, of course, from the set of all possible auxiliary trees adjoinable at that node.",
        "Hence a TAG with local constraints is defined 38 follows.",
        "G = (I, A) is a TAG with local constraints if for each node, 13. in each tree t, be specify one (and only one) of the following constraints.",
        "1.",
        "Selective Adjoining la) Only a specified subset of the set of all auxiliary trees are adjoiaable at n. SA is written as (C), where C is a subset of the set of all auxiliary trees adjoinable at a.",
        "If C equals the set of all auxiliary trees adjoinable at a, then we do not explicitly state this at the node n.",
        "2.",
        "Null Adjoining 11.a) No auxiliary tree is adjoinable at the node N. NA will be written as (0).",
        "3.",
        "0blisatinic Adjoininic 12:) At least one (out of all the auxiliary trees adjoinable at a) must be adjoined at n. OA is written as (0A), or as 0(C) where C is a subset of the set of all auxiliary trees adjoinable at a.",
        "There are no constraints in at.",
        "In Ono auxiliary trees are adjoinable at the root node and the foot node and for the center S node there are no constraints.",
        "Starting with al and adjoining )9 to al at the root node we obtain In at no auxiliary trees can be adjoined to the root node.",
        "Only $1 is adjoinable to the left S node at depth 1 and only )92 is adjoinable to the right S node at depth 1.",
        "In 01 only )51 is adjoinahle at the root node and no auxiliary trees are adjoinable at the 4-.1 node.",
        "Similarly for /32.",
        "We must now modify our definition of adjoining to take care of the local constraints, given a tree 7 with a node, say, 11, labelled A and given an auxiliary tree, say, /3, with the root node labelled A, we define adjoining as follows.",
        "/3 is adjoinable to 7 at the node a if 0 E 3, where e is the constraint associated with the node a in 7 .",
        "The result of adjoining d to 7 will be as defined in earlier, except that the constraint C associated with a will be replaced by C', the constraint associated with the root node of$ and by C•, the constraint associated with the foot node of 0.",
        "Thus, given = 0 =",
        "We also adopt the convention that any derived tree with a node which has an OA constraint associated with it will not be included in the tree set associated with a TAG, G. The string language L. of G is then defined as the set of all terminal strings of all trees derived in G (starting with initial trees) which have no OA constraints left-in them.",
        "Example 2.5: Let G =a (I,A) be a TAG with local constraints where",
        "Adjoining fi to the center S node (the only node at which adjunction can be made) we have",
        "•",
        "It is easy to see that G generates the string language L ( a° b° e co /n >0) Other languages such as L'=(a°2 In >11, L• (a.2 1n > I) also cannot be generated by TAG's.",
        "This is because the strings of a TAL grow linearly (for a detailed definite of the property called 'contact growth' property, see Poshi ,19831.",
        "For those familiar with Poshi, 19831, it is worth pointing out that the SA constraint is only abbreviating, i.e., it does not affect the power of TAG's.",
        "The NA and OA constraints however do affect the power of TAG'..",
        "This way of looking at local constraints has only greatly simplified their statement, but it has also allowed us to capture the insight that the 'locality of the constraint is statable in terms of the elementary trees themselves!"
      ]
    },
    {
      "heading": "3.2. Simple Linguistic Examples",
      "text": [
        "We now give a couple of linguistic examples.",
        "Readers may refer to 1Kroch and Joshi, 19851 for details.",
        "I.",
        "Starting with 71 = at which is an initial tree and then adjoining $1 (with appropriate lexical insertions) at the indicated node in al, we obtain 12.",
        "We will give a few additional definitions.",
        "These are not necessary for defining derivations in a TAG as defined in section 2.",
        "However, they are introduced to help explain the parsing algorithm and the proofs for some of the closure properties of TAL's.",
        "The frontier of any derived tree 1 belongs to either E. N 2.",
        "\"+ u to r if E D(a) initial tree a, then for some initial tree a.",
        "Note if E D(a) for some is also a sentential tree.",
        "If is an auxiliary tree, / E D(0) and the frontier of I is w1 X w2 (X is a nonterminal.w1,w2 E En) then the leaf node having this non-terminal symbol X at the frontier is called the foot of 7.",
        "Sometimes we will be loosely using the phrase •adjoining with a derived tree • E D(0) for some auxiliary tree d. What we mean is that suppose we adjoin d at some node and then adjoin within d and so on, we can derive the desired derived tree E D(0) which uses the same adjoining sequence and use this resulting tree to •adjoin • at the original node."
      ]
    },
    {
      "heading": "3.2. The Parsing Algorithm",
      "text": [
        "The algorithm, we present here to parse Tree-Adjoining Languages (TAL:11, is a modification of the CYK algorithm (which is described in detail in (kho and 1111man,19731), which uses a dynamic programming technique to parse CFL's.",
        "For the sake of making our description of the parsing algorithm simpler, we shall present the algorithm for parsing without considering local constraints.",
        "We will later show bow to handle local constraints.",
        "Wr shall assume that any node in the elementary trees in the grammar has atmoist two children.",
        "This assumption can be made without any loss of generality, because it can be easily shown that for any TAG G there is an equivalent TAG GI such that any node in any elementary tree in GI has atmost two children.",
        "A similar assumption is made in CYK algorithm.",
        "We use the terms ancestor and descendant, throughout the paper as a transitive and reflexive relation, for example, the foot node may be called the ancestor of the foot node.",
        "The algorithm works as follows.",
        "Let be the input to be parsed.",
        "We use a four-dimensional array A; each element of the array contains a subset of the nodes of derived trees.",
        "We say a node X of a derived tree / belongs to AP,j,k.11 if X dominates a sub-tree of whose frontier • given by either ai+1...ai Y ak+1...a, (where the foot node of / a labelled by Y) or 341...a, (i.e., j ••• k. This",
        "corresponds to the case when 7 is a sentential tree).",
        "The indices (i,j,k,l) refer to the positions between the input symbols and range over 0 through o.",
        "If i 5 say, then it refers to the gap between as and as.",
        "Initially, we fill Ali,i+1,1+1,i+11 with those nodes in the frontier of the elementary trees whose label is the same as the input a1+1 for 0 < i < n-1.",
        "The foot nodes of auxiliary trees will belong to all A(i,i,j,j), such that i < j.",
        "We are now in a position to fill in all the elements of the array A.",
        "There are five cases to be considered."
      ]
    },
    {
      "heading": "Fixure 3.1",
      "text": [
        "Although we have stated that the elements of the array contain a subset of the nodes of derived trees, what really goes in there are the addresses of nodes in the elementary trees.",
        "Thus the the size of any set is bounded by a constant, determined by the grammar.",
        "It is hoped that the presentation of the algorithm below will make it clear why we do so."
      ]
    },
    {
      "heading": "3.3. The algorithm",
      "text": [
        "The complete algorithm is given below Step 1 For 1=0 to n-1 step 1 do Step 2 put all nodes in the frontier of elementary trees whose label is as.1 in A(/.1+1./.1,1.+11.",
        "Step 3 For 1=0 to step 1 do Step 4 for j=i to n-1 step 1 do Step 6 put foot nodes of all auxiliary trees in A(i.l.j.J1 Step 8 For 1=0 to a step I do Step 7 For i=1 to 0 step I do Step 8 For pi to 1 step I do Step 9 For k=1 to j step I do Step 10 do Case I Step 11 do Case 2 Step 12 do Case 3 Step 13 do Case 6 Step 14 do Case 4 Step 16 Accept if root of Boss initial tree E A[0.j.j.nl.",
        "0 < J <n where., (a) Case 1 corresponds to situation where the left sibling is the ancestor of the foot node.",
        "The parent is put in Ali,j.k,I1 if the left sibling is in Ali,j.k.m1 and the right sibling is in Alm,p,p,11, where k < m < I, m < p, p < I.",
        "Therefore Case 1 is written as For s=k to 1-1 step 1 do for p= a to 1 step I do if there is a left sibling in A(i.j.k.sI and the right sibling in A(m.p.p.11 satisfying appropriate restrictions then put their parent in A(i.j.k.1J.",
        "(b) Case 2 corresponds to the case where the right sibling is the ancestor of the foot node.",
        "If the left sibling is in Ali,m.m.p1 and the right sibling is in Alp,j,k,11, i <iii < p and p < j, then we put their parent in Ali.j,k,11.",
        "This may be written as",
        "For s=1 to 3-1 step 1 do For p=s+1 to j stop I do for all left siblings in Mi.s.s,p1 and right siblings in A(p.j.k.1) satisfying appropriate restrictions put theis parents",
        "(c) Case 3 corresponds to the case where neither children are ancestors of the foot node.",
        "If the left sibling E Ali,j,j,m1 and the right sibling E A(m,p,p,lj then we can put the parent in Ali,j,j,Il if it is the casethat(i<j<mori<j<m)and(m<p<lorm<p< 1)5 This may be written as fo a = j to 1-1 step 1 do for p = j to 1 step 1 do for all loft siblings in AO.. j,j,n1 and right siblings in A(a,p,p.1) satisfying the appropriate restrictions put.",
        "their parent in AIi.j j .11.",
        "(e) Case 5 corresponds to adjoining.",
        "If X is a node in Alm,j,k,pl and Y is the root of a auxiliary tree with same symbol as that of X, such that Y is in Ati,m,p,11 ((i <an < p < I or i < an < p < I) and (in < j < k < p or in < j <k< p)).",
        "This may be written as for • = i to j step 1 do for p = • to 1 step 1 do if a node X E Ala. j,k,p) and the root of auxiliary tree is in Ali.a.p.1.1 then put X in Case 4 corresponds to the case where a node Y has only one child X If X E A(i,j,k,11 then put Y in Ati,j,k,11.",
        "Repeat Case 4 again if Y has no siblings."
      ]
    },
    {
      "heading": "3.4. Complexity of the Algorithm",
      "text": [
        "It is obvious that steps 10 through 15 (cases a-e) are completed in 0(n2), because the different cases have at most two nested for loop statements, the iterating variables taking values in the range 0 through n. They are repeated almost 0(0) times, because of the four loop statements in steps 6 through 9.",
        "The initialization phase (steps 1 through 5) has a time complexity of 0(n + n2) os 0(o2).",
        "Step 15 is completed in 0(11).",
        "Therefore, the time complexity of the parsing algorithm is 0019."
      ]
    },
    {
      "heading": "3.5. Correetnem of the Algorithm",
      "text": [
        "The main issue in proving the algorithm correct, is to show that while computing the contents of an element of the array A, we must have already determined the contents of other elements of the array needed to correctly complete this entry.",
        "We can show this inductively by considering each case individually.",
        "We give an informal argument below.",
        "Case 1: We need to know the cootenta of Alm,p,p,Il where m < I, i < m, when we are trying to compute the contents of Aii.j,k,II.",
        "Since I is the variable itererated in the outermost loop (step 6), we can assume (by induction hypothesis) that for all in < I and for all p,q,r, the contents of Alp,q.r,m( are already computed.",
        "Hence, the contents of A(i,j,k,mj are known.",
        "Similarly, for all in > I. and for all p,q, and r < I, Alm,p,q,r1 would have been computed.",
        "Thus, Alm,p,p,I1 would also have been computed.",
        "Case 2: By a similar reasoning, the contents of Ali,m,m,pl and Alp,j,k,I1 are known since p < I and p > Case 3: When we are trying to compute the contents of some A(i,j,j,I1, we need to know the modes in Ali,j,j,pj and Alp,q,q,11.",
        "Note j > i or j < I.",
        "Hence, we know that the contents of Ali,j,j,p( and Alp,q,q,11 would have been computed already.",
        "Case 5: The contents of Afi,m,p,11 and Afm,j,k,p1 must be known in order to compute A(i,j,k,I1, where (i<m<p<I or i < m<p<l)and(m<j<k<porm<j<k<p).",
        "Since either in > i or p < I, contents of Alm,j,k,pl will be knows.",
        "Similarly, since either in < j or k < p, the contents of AP,m,p,Il would have been computed."
      ]
    },
    {
      "heading": "3.6. Parsing with Local Constraints",
      "text": [
        "So far,we have assumed that the given grammar has no local constraints, If the grammar has local constraints, it is easy to modify the above algorithm to take care of them.",
        "Note that in Cue 5, if an adjunction occurs at a node X, we add X again to the element of the array we are computing.",
        "This seems to be in contrast with our definition of how to associate local constraints with the nodes in a sentential tree.",
        "We should have added the root of the auxiliary tree instead to the element of the array being computed, since so far as the local constraints are concerned,this node decides the local constraints at this node in the derived tree.",
        "However, this scheme cannot be adopted in our algorithm for obvious reasons.",
        "We let pairs of the form (X,C) belong to elements of the array, where X is as before and C represents the local constraints to be associated with this node.",
        "We then alter the algorithm as follows.",
        "If (X,C1) refers to a node at which we attempt to adjoin with an auxiliary tree (whose root is denoted by (Y,C2)), then adjunction would determined by Ct.",
        "If adjunction is allowed, then we can add (X,C2) in the corresponding element of the array.",
        "In cases 1 through 4, we do not attempt to add a new element if any one of the children has an obligatory constraint.",
        "Once it has been determined that the given string belongs to the language, we can find the parse in a way similar to the scheme adopted in CYK algorithm.To make this process simpler and more efficient, we can use pointers from the new element added to the elements which caused it to be put there.",
        "For example, consider Case I of the algorithm (step 10 ).",
        "If we add a node Z to Ali.j,k.11, because of the presence of its children X and Y in A(i,j,k,m1 and Alm,p,p.11 respectively, then we add pointers from this node Z in Ali,j,k,11 to the nodes X, Y in Ali,j,k.ml and A(m.p,p,11.",
        "Once this has been done, the parse can be found by traversing the tree formed by these pointers.",
        "A parser based on the techniques described above is currently being implemented and will be reported at time of presentation."
      ]
    },
    {
      "heading": "4. CLOSURE PROPERTIES OF TAG's",
      "text": [
        "In this section, we present some closure results for TALs.",
        "We now informally sketch the proofs for the closure properties.",
        "Interested readers may refer to (Vijay-Shankar and Joshi,1985) for the complete proofs."
      ]
    },
    {
      "heading": "4.1. Closure under Union",
      "text": [
        "Let GI and Ga be two TAG) generating Li and L2 respectively.",
        "We can construct a TAG G such that L(G)L1 U 12.",
        "Let G1 ( It, At, NI, S ), and G2 12, A2, N2, S"
      ]
    },
    {
      "heading": "Without loss of generality, we may assume that the NI It N2",
      "text": [
        "Let G U 12, AtIi A2, Nt U N2, S ).",
        "We claim that L(G) LI"
      ]
    },
    {
      "heading": "U L2.",
      "text": [
        "Let x E LI U Then a E LI or x E LI.",
        "If it E LI, then it must be possible to generate the string x in G , since I , At are in G. Hence a E L(G).",
        "Similarly if a E L5 , we can show that a E L(G).",
        "Hence LI U 1,2 C L(G).",
        "If a E L(G), then x is derived using either only It, At or only Iv A2 since Nt n me 0.",
        "Hence, x E Li or x L.,.",
        "Thus, L(G) U 1.2.",
        "Therefore, L(G) U"
      ]
    },
    {
      "heading": "4.2. Closure under Concatenation",
      "text": [
        "Let GI 14,A4,NI,S4), G2 = (I2,A2,N2,S2) be two TAG.",
        "generating LI, L2 respectively, such that N1 n N2 •is 4.",
        "We can"
      ]
    },
    {
      "heading": "construct a TAG G (1, A, N, S) such that L(G)==L1 . L2. We",
      "text": [
        "choose S such that S is not in NI U N2.",
        "We let N Nt U N2 U (S), A us At U A2.",
        "For all tt E11,t2EI2,weaddt12toI,asshown in Fig 4.2.1.",
        "Therefore, I m.( t12 / t1 E I, t2 E 12), where the nodes in the subtrees ti and t2 of the tree t the same constraints associated with them as in the original grammars GI and G2.",
        "It is easy to show that L(G) 21.1 L1 .",
        "L., once we note that there are no auxiliary trees in G rooted with the symbol S. and that N1 n N2 us"
      ]
    },
    {
      "heading": "4.3. Closure under Kitten* Star",
      "text": [
        "Let GI = (11,A4,N4,S4) be a TAG generating L4.",
        "We can show that we can construct a TAG G such that L(G) = L. Let S be a symbol not in N1, and let N = NI U (SI.",
        "We let the set 1 of initial trees of G be (te), where t, is the tree shown in Fig 4.3a.",
        "The set of auxiliary trees A is defined as A = (ljA / t1 E II) U Al.",
        "The tree ttA is as shown in Fig 4.3b, with the constraints on the root of each ttA being the null adjoining constraint, no constraints on the foot, and the constraints on the nodes of the subtrees el of the trees el/.",
        "being the same as those for the corresponding nodes in the initial tree tt of Gt.",
        "To see why L(G) == LI', consider x L(G).",
        "Obviously, the tree derived (whose frontier is given by x ) must be of the form shown in Fig 4.3e, where each t1' is a sentential tree in Gpsuch t1' E D(t;), for an initial tree t; in Gt.",
        "Thus, L(G) C"
      ]
    },
    {
      "heading": "On the other band, if a E LI°, then x E Lt for 1",
      "text": [
        "< i < a.",
        "Let each in then be the frontier of the sentential tree t1' of G1 such that t,1' E D( ti), tj E It.",
        "Obviously, we can derive the tree T, using the initial tree t,, and have a sequence of adjoining operations using the auxiliary trees tiA for 1 < i < n. From T we can obviously obtain the tree T' the same as given by Fig 4.3c, using only the auxiliary trees in At.",
        "The frontier of T' is obviously Hence, x e LIG).",
        "Therefore, L,' e L(C).",
        "Thus L(G) LI°.",
        "(a) t, = Let LT be a TAL and LR be a regular language.",
        "Let G be a TAG generating LT and M = (Q , , 5 , q0 , QF) be a finite state automaton recognizing L. We can construct a grammar G and will show that L(G1) = k, n LR.",
        "Let a be an elementary tree in G. We shall associate with each node a quadruple (q1,q2,q3,q4) where q1,q2,q3,o4 E Q. Lee (c11.112.cl3,O4) be associated with a node X in a.",
        "Let us assume that a is an auxiliary tree, and that X is an ancestor of the foot node of a. and hence, the ancestor of the foot node of any derived tree r in D(a).",
        "Let Y be the label of the root and foot nodes of a.",
        "If the frontier of (-r in D(a)) is wi w2 Y w3 w4, and the frontier of the subtree of I rooted at Z, which corresponds to the node X in a is w2 Y w3.",
        "The idea of associating (q4,q2,q3,q4) with X is that it must be the case that b.",
        "(cji, w2) = q2, and b(qs, w3) q4.",
        "When 7 becomes a part of the sentential tree whose frontier is given by u w1 w2 v vr, W4 w, then it must be the case that e(q2, v) = qs.",
        "Following this reasoning, we must make q2 = q3, if Z is not the ancestor of the foot node of or if 7 is in D(a) for some initial tree a in G. We have assumed here, as in the case of the parsing algorithm presented earlier, that any node in any elementary tree has atmost two children.",
        "From G we can obtain G1 as follows.",
        "For each initial tree a, associate with the root the quadruple (qa, q, q, qr) where q0 is the initial state of the finite state automaton M, and qF E Qr.",
        "For each auxiliary tree iff of G, associate with the root the quadruple (q4,q2,q3,q4), where q,q4,q2,q3,q4 are some variables which will later be given values from Q.",
        "Let X be some node in some elementary tree a.",
        "Let (q1,q2,q3,q4) be associated with X. Theo, we have to consider the following cases Case I: X has two children Y and Z.",
        "The left child Y is the ancestor of the foot node of a.",
        "Then associate with Y the quadruple ( p, q2, q3, q ), and ( q, r, r, s ) with Z, and associate with X the constraint that only those trees whose root has the quadruple ( q1, p, s, q4 ), among those which were allowed in the original grammar, may be adjoined at this node.",
        "If q1 y p, or q4 y s , then the constraint associated with X must be made obligatory.",
        "If in the original grammar X had an obligatory constraint associated with it then we retain the obligatory constraint regardless of the relationship between qt and p, and q, and s. If the constraint associated with X is a null adjoining constraint, we associate (11, q2, qs, q ), and ( q, r, r, q4 ) with Y and Z respectively, and associate the null adjoining constraint with X.",
        "If the label of Z is a, where a E 2, then we choose s and q such that 6 ( q, a ) s. In the null adjoining constraint case, q is chosen such that 5 ( q, a ) q4.",
        "Case 2: This corresponds to the case where a node X has two children Y and Z, with (q1,q2,ci3,q4) associated at X.",
        "Let Z ( the right child ) be the ancestor of the the foot node the tree a.",
        "Then we shall associate (p,q,q,r), (r,q2,q2,․) with Y and Z.",
        "The emaciated constraint with X shall be that only those trees among those which were allowed in the orignal grammar may be adjoined provided their root has the quadruple (qt,p,s,q4) associated with it.",
        "If qt p or q4 y r thee we make the constraint obligatory.",
        "If the original grammar had obligatory constraint we will retain the obligatory constraint.",
        "Null constraint in the original grammar will force us to use null constraint sad not consider the cases where it is not the case that qt p and",
        "We will associate with Y the quadruple (p,q2,os) and the constraint that root of the tree which can be adjoined at X should have the quadruple (q1,p,s,q4) associated with it among the trees which were allowed in the original grammar, if it is to be adjoined at X.",
        "The cases where the original grammar had null or obligatory constraint associated with this node or Y is labelled with a terminal symbol, are treated similar to how we dealt with them in the previous cams.",
        "Once this has been done, let qt,...,qm be the independent variables for this elementary tree a, then we produce as many copies of a so that qt,...,qm take all possible values from Q.",
        "The only difference among the various copies of a so produced will be constraints associated with the nodes is the trees.",
        "Repeat the process for all the elementary trees in G. Once this has been dose and each tree given a unique name we can write the constraints is terms of these names.",
        "We will now show why L(G1) all Len Ls.",
        "Let w e L(G1).",
        "Then there is a sequence of adjoining operations starting with an initial tree a to derive w. Obviously, w E LT, also since corresponding to each tree used in deriving w, there is a corresponding tree in G, which differs only in the constraints associated with its nodes.",
        "Note, however, that the constraints associated with the nodes in tree.",
        "in G1 are just a restriction of the corresponding ones in G, or an obligatory constraint where there was nose in G. Now, it we can assume ( by inductioe hypothesis ) that if after a adjoining operations we can derive E D(ct').",
        "then there is a corresponding tree 7 E D(a) in G, which has the same tree structure as 7' but differing only in the constraints associated with the corresponding nodes, then if we adjoin at some node in to obtain 71', we can adjoin in 7 to obtain 71 (corresponding to Therefore, if w can be derived is Gt, thee it can definitely be derived in G. If we can also show that L(G1) g Lit, then we can conclude that L(G1) g Li.",
        "(1 Lit.",
        "We can use inductios to prove this.",
        "The induction hypothesis is that if all derived trees obtained after k < a adjoining operations have the property P thee so will the derived trees after a + 1 adjoining.",
        "where P is defined as,",
        "Actually what we mean by an adjoining operation is not necessarily just one adjoining operation but the minimum number so that no obligatory constraints are associated with any nodes in the derived trees.",
        "Similarly, the base case need not consider only elementary trees, but the smallest (in terms of the number of adjoining operations) tree starting with elementary trees which has no obligatory constraint =iodated with any of its nodes.",
        "The base case can be seen easily considering the way the grammar was built (it can be shown formally by induction on the height of the tree) The inductive step is obvious.",
        "Note that the derived tree we are going to use for adjoining will have the property P, and so will the tree at which we adjoin; the former because of the way we designed the grammar and assigned constraints, and the latter because of induction hypothesis.",
        "Thus so will the new derived tree.",
        "Once we have proved this, all we have to do to show that L(G1) C LR is to consider those derived trees which are sentential trees and observe that the roots of these trees obey property P. Now, if a string x E LT (1 LR, we can show that x E L(G).",
        "To do that, we make use of the following claim.",
        "Let be an auxiliary tree in G with root labelled Y and let 7 E D(fl).",
        "We claim that there is a fir in Gt with the same structure as 0, such that there is a 7' in D(beta())') where 7' has the same structure as 7, such that there is no OA constraint in Let X be a node in fit which was used in deriving 7.",
        "Theo there is a node X' in 7' such that X' belongs to the auxilliary tree Pi\" (with the same structure as 191.",
        "There are several cares to consider - Case 1: X is the ancestor of the foot node of 01, such that the frontier of the subtree of 01 rooted at X is w1Yw4 and the frontier of the subtree of 7 rooted at X is wetZw2w4.",
        "Let e(q1,w2) q, 05.",
        "(<1.w1) = q2, 6(ct2,w2) .1R r, and e(r,w4) q4.",
        "Then X' will have (t11,(1,r,q4) associated with it, and there will be no OA constraint in Case 2: X is the ancestor of the foot node of 01, and the frontier of the subtree of 01 rooted at X is wsYw 4.",
        "Let the frontier of the subtree of 7 rooted at X is westw2w4.",
        "Then we claim that X' in 7' will have associated with it the quadruple (q5,q,r,q4), if e(qt,w2) q, e(q,w1) p, e(p,w2) r. and e(r,w4) q4.",
        "Case 3: Let the frontier of the subtree of $1 (and also 7) rooted at X is w1w2.",
        "Let e(q,w1) p, e(p,w2) r. Then X' will have associated with it the quadruple (q,p,p,r).",
        "We shall prove our claim by induction on the number of adjoining operations used to derive i.",
        "The base case (where i = 0) is obvious from the way the grammar G1 was built.",
        "We shall now assume that for all derived trees 1, which have been derived from $ using k or less adjoining operations, have the property as required in our claim.",
        "Let 7 be a derived tree in 0 after k adjunctions.",
        "By our inductive hypothesis we may assume the existence of the corresponding derived tree 7' E D(0') derived in Gt.",
        "Let X be a node in 7 as shown in Fig. 4.4.1.",
        "Then the node X' in corresponding to X will have associated with it the quadruple (q1',42',q3',\"4•).",
        "Note we are assuming here that the left child Y' of X' is the ancestor of the",
        "foot node of 0'.",
        "The quadruples (qt.,q2',q2',p) and (p,p1,p1,q46) will be associated with Y' and Z' (by the induction hypothesis).",
        "Let ft be derived from .1 by adjoining 01 at X as in Fig. 4.4.2.",
        "We have to show the existence of fit' in 01 such that the root of this auxiliary tree has associated with it the quadruple (q,ci1',q4•,r).",
        "The existence of the tree follows from induction hypothesis (k 0).",
        "We have also got to show that there exists 71' with the same structure as -7' but one that allows $1' to be adjoined at the required node.",
        "But this should be so, since from the way we obtained the trees in GI, there will exist such that X1' has the quadruple (q,q2',q2',r) and the constraints at X1' are dictated by the quadruple (q,q1',q4•,r), but such that the two children of X1' will have the same quadruple as in 1'.",
        "We can now adjoin $1' in \"ji° to obtain it% It can be shown that 71' has the required property to establish our claim.",
        "w'l Y T'2 101 v°2 5• (q't.e1)=q.2P(p.r.",
        "d=p1 5.",
        "(cr3.v.2)=P 56(1310wa2)=41.4 6*(q.x)=4.1 6*(q°4.y)=r Figure 4.4.1 Figure 4.4.2 Firstly, any node below the foot of $1' in -71' will satisfy our requirements as they are the same as the corresponding nodes in 7e.",
        "Since $1' satisfies the requirement, it is simple to observe that the nodes in $1' will, even after the adjunction of 01' in it•.",
        "However, because the quadruple associated with )(1' are different, the quadruples of the nodes above X1 must reflect this change.",
        "It is easy to check the existence of an auxiliary tree such that the nodes above X1' satisfy the requirements as stated above.",
        "It can also be argued an the basis of the design of grammar G. that there exists trees which allow this new auxiliary tree to be adjoined at the appropriate place.",
        "This then allows us to conclude that there exist a derived tree for each derived tree belongin to D(/3) as in our claim.",
        "The next step is to extend our claim to take into account all derived trees (i.e., including the sentential trees).",
        "This can be done in a manner similar to our treatment of derived trees belonging to D(0) for some auxiliary tree $ as above.",
        "Of course, we have to consider only the case where the finite state automates' starts from the initial state qs, and reaches some final state qf on the input which is the frostier of some sentential tree in G. This, then allows us to conclude that LT fl L(G1).",
        "Hence, L(G1) ft L."
      ]
    },
    {
      "heading": "5. HEAD GRAMMARS AND TAG'.",
      "text": [
        "In this section, we attempt to show that Head Grammars (HG) are remarkably similar to Tree Adjoining Grammars.",
        "It appears that the basic intuition behind the two systems is more or less the same.",
        "Head Grammars were introduced in (Pollard,19841, but we follow the notations used in (Roach.10841.",
        "It has been observed that TAG's and HG's share a lot of common formal properties such as almost identical closure results, similar pummping lemma.",
        "Consider the basic operation in Head Grammars - the Head Wrapping operation.",
        "A derivation from a non-terminal produces a pair (a more convenient representation for this pair is ).",
        "The arrow denotes the head of the string, which in turn determines where the string is split up when wrapping operation takes place.",
        "For example, consider X->LL2(A,B), and let A.whtx and B=>.ugtv.Then we say, X'wbuglvx.",
        "We shall define some functions used in the HG formalism, which we need here.",
        "If A derives in 0 or more steps the beaded string wits and B derives ugv, then",
        "Let $ be an auxilliary tree and let a be a sentential tree as in Fig S.I.",
        "Adjoining 8 at the root of the sub-tree 7 gives us the sentential tree in Fig 5.1.",
        "We can, now see how the string whx has °wrapped around the sub-tree i.e.the string ugv.",
        "This seems to suggest that there is something similiar in the role played by the foot in an auxilliary tree and the bead in a Head Grammar how the adjoining operations and head-wrapping operations operate on strings.",
        "We could say that if X is the root of an auxiliary tree eland ai...ai X ai+1...a2 is the frontier of a derived tree 1 E D(0), then the derivation of 7 would correspond to a derivation from a non-terminal X to the string al...al tai+1...a2 in HG and the use of 7 in some sentential tree would correspond to how the strings ay.. ay and al+1...a2 are used in deriving a string in HI,.",
        "Based on this observation, we attempt to show the close relationship of TAL'e and HL's.",
        "It is more convinient for us to think of the headed string (i,a1...a0 as the string with the head pointing in between the symbols al and ai+1 rather than at the symbol al.",
        "The definition of the derivation operators can be extended in a straightforward manner to take this into account.",
        "However, we can acheive the same effect by considering the definitions of the operators LL,LC,ete.",
        "Pollard suggests that cases such as LL2(ia) be left undefined.",
        "We shall assume that if ir =wwity then LLi4 why, wa L LC2() w• xA, LC2(57.,;) = LCI(i,X) LCd) Ne, then say that if G is a Head Grammar, thee wi w14x belongs to L(G) if and only if S derives the headed string wtx or volqx.",
        "With this new definition, we shall show, without giving the proof, bat the class of TAL's is contained in the class of HL's, by systematically converting any TAG G to a HG G. We shall assume, without loss of generality, that the constraints expressed at the nodes of elementary trees of G ate -",
        "1) Nothing can be adjoined at a node (NA), 2) Any appropriate tree (symbols at the node and root of the auxiliary tree must match) can be adjoined (AA), or 3) Adjoining at the node is obligatory (OA).",
        "It is easy to show that these constraints are enough, and that selective adjoining can be expressed in terms of these and additional non-terminals.",
        "We know give a procedural description of obtaining an equivalent Head Grammar from a Tree-Adjoining Grammar.",
        "The procedure works as follows.",
        "It is a recursive procedure (Convert_ to_HG) which takes in two parameters, the first representing the node on which it is being applied and the second the label appearing on the left-band side of the HG productions for this node.",
        "If X is a nonterminal, for each auxiliary tree $ whose root has the label X, we obtain a sect f productions such that the first one has X on the left-hand side.",
        "Using these productions, we can derive the string w1Xw2 where a derived tree in D(0) has a frontier w1Yw2.",
        "If Y is anode with with label X in some tree where adjoining is allowed, we introduce the productions -> LL2(X.111 (so that a derived tree with root.",
        "label X nay wrap around the string derived fro.",
        "the subtree below this node) 11' -> LCI(Al.....A3) (sunning that there are J children of this node and the 1%5 child is the ancestor of the foot node.",
        "By calling the procedure recursively for all the j children of T with Alok ranging from I through J. we can derive from II' the frontier of the subtree below T)"
      ]
    },
    {
      "heading": "add productions Sys->LL2(node symbol.r).",
      "text": [
        ".",
        "A2'.",
        "A3') Sym->LC2(Al' At'.",
        "A3') where are new non-terminal sysbolsoti Al correspond to the j children of the node and 1=1 if foot node is not a descendant of node else Si such that the ltb child of node is ancestor of foot node.j=number of children of node for k=1 to j step I do",
        "else if the node has a terminal symbol a. then add the production Sys ->i else (it is e. foot node ) If the constraint at the foot node is AA then add the productions _ _ Sys ->LL2(node symbol.A)/X if the constraint is OA then add only the production"
      ]
    },
    {
      "heading": "Sys ->LL2(node symbol:I)",
      "text": [
        "if the csnstraint is IA add the production Sys -30., We shall now give an example of converting a TAG G to a HG.",
        "G contains a single initial tree a, and a single auxiliary tree $ as in Fig. 5.2.",
        "T' -> I' ( this is to handle the case where no a = adjunction takes place at T) If G is a TAG then we do the following – Repeat for every Initial tree Convert_to HG(root.,S') (S' will be the start symbol of Figure $.2 the new Head Grammar).",
        "Obvionsiv, L(G) (aabnew / a> 01 Repeat for each Auxilliary tree Convert G, HG(root.rootsyabol) where Convert to HO(node.nsme) is defined am follows if node is an internal node then case I If the constraint at the nods is AA",
        "Applying the procedure Convert_to_HG to this grammar we obtain the HG whose productions are given by",
        "It is worth emphasising that the main point of this exercise was to show the similarities between Head Grammars and Tree Adjoining Grammars.",
        "We have shown how a HG G' (using our extended definitions) can be obtained in a systematic fashion from a TAG G. It is our belief that the extension of the definition may not necessary.",
        "Yet, this conversion process should help us understand the similarities between the two formalisms."
      ]
    },
    {
      "heading": "6. OTHER MATHEMATICAL PROPERTIES OF TAG's",
      "text": []
    }
  ]
}
