{
  "info": {
    "authors": [
      "Jurgen Kunze"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E89-1027",
    "title": "A Formal Representation of Propositions and Temporal Adverbials",
    "url": "https://aclweb.org/anthology/E89-1027",
    "year": 1989
  },
  "references": [],
  "sections": [
    {
      "text": [
        "A FORMAL REPRESENTATION OF PROPOSITIONS AND TEMPORAL ADVERBIALS Jurgen Kunze Zentralinstitut fur Sprachwissenschaft der Akademie der Wissenschaften der DDR Prenzlauer Promenade 149-152 Berlin, DDR-1100 ABSTRACT The topic of the paper is the introduction of a formalism that permits a homogeneous representation of definite temporal adverbials, temporal quantifications (as frequency and duration), temporal conjunctions and tenses, and of their combinations with propositions.",
        "This unified representation renders it possible to show how these components refer to each other and interact in creating temporal meanings.",
        "The formal representation is oased on the notions \"phase-set\" and \"phase-operator\", and it involves an interval logic.",
        "Furthermore logical connections are used, but the (always troublesome) logical quantifications may be avoided.",
        "The expressions are rather near to linguistic structures, which facilitates the link to text analysis.",
        "Some emprical confirmations are outlined."
      ]
    },
    {
      "heading": "1. THE GENERAL FRAME",
      "text": [
        "This paper presents some results that have been obtained in the field of time and tense-phenomena (Kunze 1987).",
        "In connection with this some links to text analysis, knowledge representation and inference mechanisms have been taken into account.",
        "The formalism presented here differs from what is under label of temporal logic on the market (e. g. Prior (1967), Aqvist/Guenthner (1978).",
        "Our main intention is to establish a calculus that is rather near to linguistic structures on one side (for text analysis) and to inference mechanisms on the other side.",
        "The whole formalism has integrating features, i. e. the following components are represented by the same f or-mal means in a way, that it becomes easy and effective to refer the different components to each other:",
        "- The propositions and their validity with respect to time; - Definite temporal adverbials (next week, every Tuesday); - Definite temporal quantifications as frequency (three times) and duration (three hours), comparision of frequencies, durations etc.",
        "; - Temporal conjunctions; - Tenses and their different meanings.",
        "The unified representation renders it possible to observe how the components interact in creating temporal meanings and relations.",
        "Some details have to be left out here, e. g. the notion \"determined time\" and the axiomatic basis of the calculus."
      ]
    },
    {
      "heading": "2. PHASE-SETS AND PROPOSITIONS",
      "text": [
        "A phase p is an interval (either unbounded or a span or a moment) which a truth value (denoted by q(p)) is assigned to: q(p) T : p is considered as an affirmative phase.",
        "q(p) = F p is considered as a denying phase.",
        "The intervals are subsets of the time axis U (and never empty!).",
        "A phase-set P is a pair [P*,q), where P* is a set of intervals, and q (the evaluation function) assigns a truth value to each pe P*.",
        "P has to fulfil the following consistency demand: (A) For all p' ,p\" e. 1,1* holds: If p'n p\" 0, then q(p') = q(p\").",
        "A phase-set P is called complete, iff the union of all phases of P covers U. Propositions R are replaced by complete phase-sets that express the \"structured\" validity of R on the time axis U.",
        "Such a phase-set, denoted by (R>, has to be understood as a possible temporal perspective of R. There are propositions that differ from each other in this perspective only: For (1) John sleeps in the dining room.",
        "one has several such perspectives: He is sleeping there, he sleeps there because the bedroom is painted (for some days), he sleeps always there.",
        "SO the phases of CR> are quite different, even with clear syntactic consequences for the underlying verb: The local adverbial may not be omitted in the second and third case!, I skip here completely the following problems:",
        "- A more sophisticated application of nested phase-sets for the representation of discontinuous phases in KR>; - the motivation of phases (e. g. according to Vendler (1967)) and their adequacy.",
        "3.",
        "PHASE-OPERATORS",
        "A phase-operator is a mapping with phase-sets as arguments and values.",
        "There are phase-operators with one and with two arguments.",
        "A two-place phase-operator P-0(P1,P2) is characterized by the following properties: (B) If P = P-0(P1,P2), then P* = PT, e. the set of intervals of the resulting phase-set is the same as of the first argument; (C) For each phase-operator there is a characteristic condition that says how q(p) is defined by q1(p) and P2 for all peP4.",
        "This condition implies always that q(p) = F follows from q1(p) = F. So the effect of applying P-0(131,P2) that some T-phases of P1 change their.",
        "truth value, new phases are not created The characteristic conditions are based on two-place relations between intervals.",
        "Let rel( , ) be such a relation.",
        "Then we define (by means of rel) q(p) according to the following scheme:",
        "We will use three phase-operators and define their evaluation functions in the following way by (D):",
        "\"p2 and p are not seperated from each other\", i. e. p2up is an interval.",
        "As an illustration we consider some examples.",
        "Needless to say, that their exact represention requires further formal equipment we have not introduced yet.",
        "Typical cases for 0CC and PER are:",
        "(2) Yesterday was bad weather.",
        "Overlapping of (yesterday) and a T-phase of <bad weather).",
        "(3) John worked the whole evening.",
        "A T-phase of (evening) is contained in a T-phase of <John works).",
        "(for (2/2124LE), (yesterday) cf.",
        "7.)",
        "There is only a slight difference between the characteristic conditions for 0CC and NEX: NEX admits additionally only MEETS(p2,p) and MEETS(p,p2) in the sense of Allen (1984).",
        "Later will motivate that NEX is the appropriate phase-operator for the conjunction when.",
        "Therefore, sentences of the form (4) R1, when R2.",
        "(cf. (N), (0)) will be represented by an expression that contains NEX(<R2),(121)) as core.",
        "The interpretation is that nothing happens between a certain T-phase of (R1) and a certain T-phase of (R2) (if they do not overlap).",
        "The next operation we are going to define is a one-place phase-operator with indeterminate character.",
        "It may be called \"choice\" or \"singling out\" and will be denoted by xP1, where P1 =",
        "If we need different choices, we write xP1' yP1' zP2, ..., using the first sign as an index in the mathematical sense.",
        "Moreoverove define one-place phase-operators with parameters:",
        "F otherwise (for all p 6 Px, independently of q1(p)) Similarily one defines ORD(P1,g) for integers g: ORD(P1,g) assigns the value T exactly to the g-th T-phase of P1, if there is one, with certain arrangements for g (e. g. how to express \"the last but second\" etc.)",
        "Finally we define the \"alternation\" alt(P1) of an arbitrary phase-set P1 = (I,q13.",
        "By alternation new phases may be created: alt(P1) contains exactly those phases which one gets by joining all phases of P1 that are not seperated F otherwise -199-from each other and have the same value 141(p1).",
        "So the intervals of alt(P1) are unions of intervals of P1, the q-values are the common ql-values of their parts (of.",
        "(A)).",
        "It is always alt(alt(P1)) =",
        "right on the time axis U, one has an alternating succession of phases in alt(P1) with respect to the q-values.",
        "alt(P1) is the \"maximal levelling\" of the phase-set Pl."
      ]
    },
    {
      "heading": "4. LOGICAL CONNECTIONS",
      "text": [
        "The negation of a phase-set P1 is defined as follows:",
        "Note that (^•R) and -,(R> may be different because of non-equivalent phase-perspectives for -,R and R!",
        "For each two-place functor \"a\" (e. g. 12 II a. v It) we define P1 a P2, if the sets P1 and P2 are equal:",
        "the corresponding truth function (e. g. vel for 'iv.\").",
        "Obviously for every phase-operator P-0 the expression P-0(1)1,P2) -1.",
        "P1 represents both a phase-set and a clear \"tautology\" - in other words - a phase-set that is \"always true\", if P1 is complete.",
        "Therefore, alt(P-0(171,P2).4.1)1) U° (where U° is the phase-set that contains the time axis U as the only interval with the q-value T) reflects the double nature of the aforesaid implication."
      ]
    },
    {
      "heading": "5. TRUTH CONDITIONS",
      "text": [
        "The last considerations lead imme-deately to the following definitions.",
        "The whole formalism requires two types of truth conditions, namely",
        "(L) alt(P) U° (M) alt(P) * ^,U° .",
        "They have different status: (L) is used, if the phase-set P is considered as a temporal representation of something that is valid, independently of time.",
        "(M) is appliedlif P is considered as something that represents a certain \"time\" (expressed by the phases of P).",
        "Because of the second possibility, alt appears not only in truth conditions, but it may constitute arguments in phase-operators etc., too.",
        "This will be shown in the examples below.",
        "Obviously one has for arbitrary phase-sets P = CP*,q):",
        "alt(P) a U° iff dt U 3p eP* (q(p) T & tap) alt(P) iff 3t eU 3p eP*.",
        "(q(p) T & t E p) 6.",
        "SOME COMMENT ON THE FORMALISM",
        "By regarding the time axis U as a basic notion one has to take the trouble to consider the topology of U, and gets difficulties with closed and - 200 - and open sets, environments etc..",
        "This may be avoided by taking an axiomatic viewpoint: For all operations, relations etc.",
        "one formulates the essential properties needed and uses them without direct connection to the time axis.",
        "In this way U becomes a part of a model of the whole formalism.",
        "This is independent of the fact, that in definitions and explanations U may appear for making clear what is meant."
      ]
    },
    {
      "heading": "7. TEMPORAL ADVERBIALS",
      "text": [
        "In section 2. we have outlined, how propositions R are substituted by phase-sets (R).",
        "The same has to be done for temporal adverbials.",
        "First we consider definite adverbials: (tuesday) is a phase-set P, where Pm is the set of all days (as spans p covering together the whole time axis U), and exactly the Tuesdays have the value q(p) = T. For (dm) the set Ps is the same, but it is q(p) = T for all p G Pm.",
        "<evening> has as intervals suitable subintervals of the days with q(p) = T, whereas the remaining parts of the days form phases with q(p) = F in (evening) Analogously <year> contains all years as spans p with q(p) = T, whereas 41980 has the same spans, but exactly one with q(p) = T. Now we combine temporal adverbials with propositions.",
        "An exact representation would require that we list all possible structures of phrases, clauses etc.",
        "that express a certain combination.",
        "We use instead of this \"standard para-phrases\" as \"at least on Tuesdays R\".",
        "If R is a certain proposition, e. g.",
        "R = John works in the library , then this paraphrase stands (as a remedy) for (5) John works, worked, ... in the library every Tuesday.",
        "On every Tuesday John ... On Tuesday of every week John ... At least on Tuesdays John ...",
        "Examples with truth conditions:",
        "(6) (the days, when R)",
        "(1986 is a year, throughout which it is always true, that every Tuesday is a day, when R occurs.)",
        "The second argument of PER is a phase-set defined by an alt-operation.",
        "This phase-set has as T-phases exactly those maximal periods during which (8) holds.",
        ",PER((mar),...) selects the years that are covered by such a period, and the whole expression says that 1986 is such a year (and nothing about other years). '",
        "The time of speech L is formally represented by a phase-set L° with three phases, namely L itself with q(L) = T, and the two remaining infinite intervals with the q-value F. Then one may define (today) = OCC((a_M),L°).",
        "By",
        "using the phase-operator ORD (cf. (I)) one introduces (yesterday) etc., and similarily (this year)",
        "(11) (in this year three = (R)-0•KAR(00C((R), alt(...) = U° (12) (the three times R in this year) = KAR(00C(<R>, (this year)),3) alt(...) ^,U°",
        "In (11) a yes-no-decision is expressed (there are three T-phases of (R) in this year), but in (12) a \"time\" is defined, namely the three T-phases of (R) in this year.",
        "Therefore the truth conditions are different.",
        "The expression in (12) may appear as an argument in other expressions again.",
        "Now we apply the operation \"choice\":",
        "0CC((R),x()) determines the T-phases of (R) on a single day, KAR(...,3) keeps them iff there are exactly three (otherwise they become F-phases, cf. (I)), OCC(x(day),...) assigns to the single day the value Tiff the T-phases of (R) on this day have been preserved.",
        "Therefore, x0CC(...,...) is a T-F-distribution over all days if x runs over all days, and the whole expression says that all T-days are Tuesdays.",
        "These examples demonstrate the application of logical functors.",
        "As one can see, the expressions render it possible to formulate even rather complex temporal relations in a comprehensible manner without much redundancy, the necessary arguments appear only once (or twice for certain quantifications as e. g. (puesday) and (411y) in (8)).",
        "In order to handle durations, one needs another phase-operator EXT that is quite similar to KAR and ORD.",
        "The argument R stands either for \"bare\" propositions (without any temporal component) or for propositions with some temporal components.",
        "In the latter case the corresponding expression has to be substituted for <It>:",
        "(16) Every Tuesday John watches television in the evening.",
        "with R' = John watches television.",
        "Then one can represent (1) by (R) = 000( (R'), (evening)) with alt(...) -'U° (John's t.v.phases in evenings) and apply (8): (tuesday)",
        "Similarily one obtains (10) from (8).",
        ".",
        "The truth condition in (8) causes that alt(...) occurs as argument in (10).",
        "The sign \"=\" in the examples means that the left side is defined by the right side, the left side is stripped of one (or mare) temporal components.",
        "In this sense (6), (8) and (9) are rules, (7) and (10) include two rules in each case The full and exact form of such rules requires more than the standard paraphrases, namely corresponding (syntactic) structures on their left side.",
        "Till now nothing has been said about tenses.",
        "It is indeed possible to represent tenses in the formalism that we have outlined.",
        "But it is impossible to introduce \"universal\" rules for tenses.",
        "Even between closely related languages like English and German there are essential differences.",
        "So it does not make sense to explain here the details for the German tenses (cf. Kunze 1987).",
        "The main points in describing tenses are these: At first one needs a distinction between \"tense meanings\" and \"tense forms\" (e. g. a Present-Perfect-form may be used as Future Perfect).",
        "After that one has to introduce special conditions for special tense meanings (e. g. for perfect tenses in German and English, for the aorist in other languages).",
        "Further a characterization of tense meanings by a scheme like Reichen-bach's is necessary, including the introduction of the time of speech L°.",
        "On this basis rules for tense-assignment may be formulated expressing which tenses (* meanings) a phase xP or a phase-set P can be assigned to.",
        "From the formal point of view tenses then look like very general adverbials, and it is rather easy to explain how tenses and adverbials fit together.",
        "Tense-assignments create new expressions in addition to those used above.",
        "It is important that the position of the phases of (R) does not depend on the tense R is used with: The tense selects some of these phases by phase-operators.",
        "So alt(NEX(xP,L°)) * -,U° is the basic condition for the actual Present (cf. (G))."
      ]
    },
    {
      "heading": "9. TEMPORAL CONJUNCTIONS",
      "text": [
        "For some temporal conjunctions there are two basic variants, the \"particular\" usage and the \"iterative\" usage.",
        "We illustrate this phenomenon for when: (N) wheal (particular usage of when): WHEN1(R1,R2): (for \"R., when IL\") i c",
        "alt(NEX((R2>,(1y)) s ^'U-.",
        "(17) When John went to the library, he found 10 $.",
        "(Once, when ... )",
        "In (17) there is a reference to a single T-phase of (R1> and a single T-phase of (R2).",
        "One can show that the truth condition for wheal is equivalent to 3x 3Y(alt(NEX(x(R2),y(R1))) * – 0) but this form is avoidable (cf. (H) and the end of 5.",
        ").",
        "(0) when2(iterative usage of when): WHEN2R1,R2): (for \"R1, when R2\") alt((R2>*4•NEICaR2)9(R1) )) =U° (18) When John went to the library,",
        "he took the bus.",
        "(Whenever ) In (18) something is said about all T-phases of (R2), namely V x 3Y(alt(NEX(x(R2) ) s •-•U°) , which is equivalent to the truth condition for when Conjunctions like while, as long as, etc.",
        "are represented in a similar way with the phase-operator PER (cf. (F)).",
        "For the conjunctions after, before, since and till one needs in addition an ANTE and a POST-operator, which are tense-dependent (the main difference is caused by imperfective vs. perfective) and modify the arguments of the phase-operators.",
        "Some of the conjunctions have both basic variants, whereas since admits no iterative usage.",
        "2• - 203 - The meaning of since is expressed by (P) since: (only particular usage) SINCE(R1,R2): (for \"R1, since R2\") alt(PER(POST((R2)), (R1))) * -'U°, and the truth condition for after is 1 (q) afteri (particular usage of after): AFTER1(R1,R2): (for \"R1, after R2\") alt(PER((R1),POST((R2)))) * It turns out that an analysis of temporal conjunctions based only on the Reichenbach scheme causes some difficulties.",
        "It works very well for when and while (cf. Hornstein 1977) and the German equivalents (als/wenn, wahrend and solange), but for the remaining cases ANTE and POST-operations seem to be inivitable.",
        "10.",
        "AN EMPIRICAL CONFIRMATION By combining the rules for tense-assignment and the truth conditions for the temporal conjunctions (in German there are seven basic types) and by allowing for some restrictions for their use (e. g. als only for Past, seat not for Future) one gets for each conjunction a prediction about the possible combinations of tenses in the matrix and the temporal clause.",
        "Gelhaus (1974) has published statistical data about the distributions of tenses in the matrix and the temporal clause for German.",
        "From the huge LIMAS-corpus the took all instances of the use of temporal conjunctions.",
        "From my calculus one cannot obtain statistics, of course, it decides only on \"correctness\".",
        "The comparision proved that there is an almost complete coincidence.",
        "The combinations for als/wenn cannot be derived, if one takes 0CC instead of NE2 in (N) and (0).",
        "The same seems to be the case for when.",
        "The restrictions for the propositions R1 and R2 (e. g. L+FINIT3), given by Wunderlich (1970), can be deduced from the truth conditions (details about both questions in (Kunze (1987))."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
