{
  "info": {
    "authors": [
      "David G. Hays"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P79-1022",
    "title": "Applications",
    "url": "https://aclweb.org/anthology/P79-1022",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Truth, like beauty, is in the eye of the beholder, / offer a few remarks for the use of those who seek a point of view from which to see truth in the six papers assigned to this session.",
        "Linguistic computation is the fundamental and primitive branch of the art of computation, as I have remarked off and on.",
        "The insight of von Neumann, that operations and data can be represented in the same storage device, is the linguistic insight that anything can have a name in any language, (Whether anything can have a definition is a different question.)",
        "I recall surprising a couple of colleagues with this remark early in the 1960s, when I had to point out the obvious fact that compiling and interpreting are linguistic procedures and therefore that only in rare instances does a computer spend more time on mathematics than on linguistics.",
        "By now we all take the central position of our subject matter for granted.",
        "I express this overly familiar truth only for the pragmatic reason that some familiar truths are more helpful than others in preparing for a given discourse.",
        "Syntax needs semantic justification, but semantics has the inherent justification that knowledge is power.",
        "The semantic justification of syntax is easy: Who would try to represent knowledge without a good grammar?",
        "I have not yet found a better illustration than the timetable, an example that I have used for some years now.",
        "Without rules of arrangement and interpretation, the timetable collapses into a list of places, the digits 0,..9, and a few special symbols.",
        "Almost all of the information in a timetable is conveyed by the syntax, and one suspects that the same is true of the languages of brains, minds, and computers.",
        "Syntax needs more than semantic justification, and pragmatics is ready to serve.",
        "Without pragmatic justifica.. tion, the difference between cognitive and syntactic structures is ridiculous.",
        "We may find more justifiers later, but the rediscovery of pragmatics is a boon to those who grow tired of hearing language maligned, It is easy to make fun of English, the language of Shake.",
        "speare, Bertrand Russell, and modern science.",
        "But the humor sometimes depends on the ignorance of the joker, We find first semantic, then pragmatic, and perhaps later other kinds of justification for the quirkiness of English and other languages, and the jokes lose their point.",
        "Form, not content, admits of calculation.",
        "Since Aristo.. tle proceeded in accordance with this rule, I find it surprising that John Locke omitted mention of the simple ideas in reflection.",
        "(One may recall that Locke knew of simple ideas in perception. – yellow, warm, smooth...and considered knowledge to derive from perception and ro...",
        "flection.)",
        "Listing the simple ideas in reflection seems in fact to be a task for our century, anticipated in part in the 19th century.",
        "Predication, instantiation, membership, componency, denotation, localization, modalim zetion are some candidates that presently show strength.",
        "Content, not form, disambiguates, A more precise statement is that specific and not general knowledge fixes our interpretations of what we encounter, certainly in language and probably also in other channels of perception.",
        "Thus the great body of knowledge of our culture, of the individual mind, or of the massive database makes lends an appearance of fixedness and stability to the world that simpler minds, cultures, and computers cannot get.",
        "The general rules of syntax, semantics, and pragmatics define the thinkable, allowing ambiguity when some specific issue comes up.",
        "In a hash house or a conversation, understanding and trust come with complete and exact information.",
        "Conversation is a social activity.",
        "The thinking computer (Raphael's title) may be an artificial mind, but the conversing computer (William D. Orr's title) is an artificial person and must accept the obligations of social converse.",
        "Those obligations are massive: \"to do justice and love mercy\", \"to do unto others as you would have them do unto you\", to act only as it would be well for all to act, to express fully and concisely what is relevant, \"to tell the truth, the whole truth, and nothing but the truth\".",
        "Trust precedes learning.",
        "Lest anyone suppose that I have listed the precepts of our greatest masters in a spirit of fun, I hasten to add this obvious truth from study of our species.",
        "Whether the sciences be called social, behavioral, or human, they tell us that one accepts knowledge for one's own store only from sources that can be trusted.",
        "Nor could wisdom dictate the opposite, since internalized knowledge is inaccessible to test and correction.",
        "Is the computer worthy of trust?",
        "I have asked this question of students, grading the context from simple arithmetic trust (they trust their pocket calculators to give accurate sums and products) to complex personal trust (they would not accept the computer as a friend).",
        "We have, I think, no experience with computers that are functionally worthy of trust in any but simple matters.",
        "We may be learning to make computers follow the masters' precepts in conversation.",
        "Whether their users will ever accept them for what they are worth is hard to predict.",
        "If computers grow trustworthy and are assigned important tasks, then when Crisis occurs the issue of trust may determine such outcomes as war or peace.",
        "Thus the issue is not frivolous.",
        "Trust arises from knowledge of origin as well as from knowledge of functional capacity.",
        "Genetic and cultural history provide enormous confirmation that a neighbor can be trusted, beyond even broad experience.",
        "We can gain only a little knowledge about a friend in the course of a friendship, but we can bring to bear all of our own inherent mechanisms of trust for those that look and smell like us when crisis occurs.",
        "The six papers in this session, written by human beings and selected by persons of authority, deserve sufficient trust that the reader may learn from them.",
        "The systems that they describe may grow into knowledgeable, semantically and pragmatically effective, syntactically well-formed conversants.",
        "Their contributions are to that end, and have the advantage that, by seeking to apply knowledge they can detect its limits.",
        "Science needs application, since contact with reality tends to remind us scientists that there are more things out there than are dreamed of in our theories."
      ]
    }
  ]
}
