{
  "info": {
    "authors": [
      "Diana Maynard",
      "Hamish Cunningham",
      "Kalina Bontcheva"
    ],
    "book": "Conference of the European Association for Computational Linguistics – Demonstrations",
    "id": "acl-E03-2009",
    "title": "Multilingual Adaptations of a Reusable Information Extraction Tool",
    "url": "https://aclweb.org/anthology/E03-2009",
    "year": 2003
  },
  "references": [
    "acl-P02-1022"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this demo we will present GATE, an architecture and framework for language engineering, and ANNIE, an information extraction system developed within it.",
        "We will demonstrate how ANNIE has been adapted to perform NE recognition in different languages, including Indie and Slavonic languages as well as Western European ones, and how the resources can be reused for new applications and languages."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "GATE is an architecture, development environment, and framework for building systems that process human language (Cunningham et al., 2002; Maynard et al., 2002).",
        "It has been in development at the University of Sheffield since 1995, and has been used for many R&D projects, including Information Extraction in multiple languages and media, and for multiple tasks and clients.",
        "GATE is available freely, as an open source system, under the GNU library licence, and has been downloaded by around 2500 sites worldwide.",
        "The core architecture and some applications developed within GATE have been previously demonstrated (Cunningham et al., 2002); however, this demonstration will focus on the multilingual aspects of GATE, and adaptations of its IE system for different languages.",
        "Version 2 of GATE has a large number of added features from the previous version, such as:",
        "• comprehensive Unicode multilingual support via• tools for performance evaluation • support for manual annotation • reusable visualisation components • database support (Oracle, PostgresQL) • support for distributed resources from the Web • comprehensive document format support (SGML, XML, HTML, RDF, email, plain text) ® Gate Unicode Editor - Unicode Sampler.txt Arabic: ^^i, U \\&$ £L>jJI JS\\ ,j£ j*\\3 LI.",
        "Armenians MjiGmiii mujiul]}i mwbi k kGbk u6hmjfiqhuu ■.jkfitji Farsi / Persian: .pj<p*j Aioujj jjj ljuLui^l ^jl.",
        "p-*^ Georgian: SoEub 3^8 cpa fro 8(^^030.",
        "Hebrew: *i p'in xi nil n'ym inxi Vo' 'ix.",
        "Hindi: #m WTf, JJ^\"3\"Tff ifr?Tftcft\".",
        "Japanese: %B3J^^*«:'<6*1*'9\", ^ftttftSSottSttA.",
        "Korean: M-fe&B\\m a|# 4= 9i0]3.",
        "0[KX\\ ?10[3.",
        "Marathi: ift TFT*IVS SPFcft\", TfTT ^JtTTlfFI\".",
        "Sanskrit: s>I*IHtJH i ■irf'^Rtd 1 Thai: dunun'ji'ania urifiulmrilifeiiu^ij Yiddish: \"11 owi tij uiu oy ]ix mil \\ov ivp yx",
        "{kind-personName, rule-KalinaPerson} a|AmiChs.l BUE File We are currently investigating methods of adapting ANNIE to new languages with the minimum of resources and time.",
        "Our previous experiments with languages other than English have demonstrated that we can get reasonable results in around 2 person months using a native speaker and hand-coded semantic tagging rules, without requiring resources such as dictionaries or POS taggers for that language.",
        "We arc also planning participation in the TIDES-bascd \"surprise language experiment\", which requires various NLP tasks such as IE, IR, summarisation and MT to be carried out in a month on a surprise language, the nature of which will not be known in advance.",
        "The open and flexible architecture of GATE, and the separation of linguistic data from processing makes it an ideal environment within which to perform such a task.",
        "Any available linguistic resources such as dictionaries and POS taggers can be simply plugged into the model, but if these are not available we can simply modify other components as necessary."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "In this demo we have shown how an existing set of IE tools has been modified to a diverse set of languages with minimum overhead.",
        "The advantage of having such low-overhead portability is that it enables quick deployment of IE tools with acceptable performance, which, even if not developed in end-used applications, can be used to bootstrap the creation of IE-annotated corpora and/or facilitate the training of learning tools for adaptive IE.",
        "In addition, some adaptive IE tools are now using the ANNIE components to provide them with richer linguistic information (Ciravegna et al., 2002)."
      ]
    }
  ]
}
