{
  "info": {
    "authors": [
      "Satoshi Tojo"
    ],
    "book": "Proceedings of the Fifth International Workshop on Inference in Computational Semantics",
    "id": "acl-W06-3911",
    "title": "Multi-dimensional Temporal Logic for Events and States",
    "url": "https://aclweb.org/anthology/W06-3911",
    "year": 2006
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Multi-dimensional Temporal Logic for Events",
        "and.",
        "States",
        "Satoshi To jo",
        "JA 1ST",
        "The inclusion relation in temporal extents can be regarded as a prime requisite for the temporal expression.",
        "We propose a multidimensional temporal logic, combining the inclusion relation with the conventional precedence relation.",
        "First we define the syntax and the semantics of the fused logic, and then we apply the logic to the classification of occurrences to events and states, based on their upward/downward heredities.",
        "Thereafter, we consider the mutual relation between the precedence and the inclusion relations and discuss a proper set of axioms for the realistic time."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In this paper, we introduce a multidimensional modal logic to represent the temporal structure of events and states.",
        "The linear temporal logic is the prime method of representation of time in natural language semantics.",
        "Another conventional approach, the interval-based time, has also contributed to the analysis of time in which two intervals are related in such ways that one overlaps the other, one includes the other, and so on [6,14,4].",
        "Among such relations, van Benthem [15] regarded the inclusion relation as important, and defined the modalities DT and Ox, each of which represents 'all the superin-tervals' and the latter 'all the subintervals,' respectively.",
        "In this paper, we further develop the idea and discuss the logic of the inclusion relation together with the conventional precedence.",
        "Here, we do not consider the internal structure of each interval, and identify a time point with a shorter interval; for fear that the term 'interval' might be misunderstood as a sequence of time points, we employ the word temporal extent, that is a certain consecutive duration of time, in this study.",
        "The temporal logic is formalized by such modal operators as F, G, P, and H, each of which represents 'some future,' 'all the future,' 'some past,' and 'all",
        "Fig.",
        "1. upwar/downward hereditary the past,' respectively.",
        "We add DT and Ux to these, and propose a polymodal logic with regard to the ordinary temporal order and the inclusion relation.",
        "With this logic, we express the distinction of events and states.",
        "In the following Section 2, we explain the intrinsic distinction of events ans states in terms of temporal heredity.",
        "In Section 3 we show the syntax and semantics of the logic.",
        "We apply the logic to events and states in Section 4, and thereafter, we discuss a proper set of axioms for the logic in Section 5.",
        "In Section 6 we summarize our contribution."
      ]
    },
    {
      "heading": "2. Upward/downward heredity",
      "text": [
        "Let us consider an example of a simple detective story.",
        "If a murder suspect has an alibi between 2:00am and 4:00am, then (s)he has one also between 2:30am and 3:30am.",
        "Because 'have an alibi' is also valid in all the subintervals, this statement is said to be downward hereditary.",
        "On the contrary, if the presumed time of the death is between 3:00am and 4:00am, then it is also true that the victim died between 2:00am and 5:00am.",
        "As 'presumed death time' also holds in all the superintervals, the statement is said to be upward hereditary [11].",
        "This distinction can be reduced to the following issue; if an event occurs in a point-wise instant, it becomes upward hereditary.",
        "Whereas, if a state persists with a certain duration of time, it naturally becomes downward hereditary.",
        "The situation is explained in Fig. 1.",
        "An event is the perfective view, in which whole the event structure including the beginning point and the culmination point is packed to a sole time point.",
        "As in the left-hand side of Fig. 1, if a temporal extent / includes this occurrence, so does /' (D /).",
        "On the contrary, if some state persists for a given temporal extent /' as in the right-hand side of the figure, then so does / (Ç V).",
        "Hereafter, in case / Ç V, V is called to be a super-extent of /, and / is a sub-extent of In this paper, we simply call those which are upward hereditary events, and those which are downward hereditary states, while we call both of them generically occurrences.",
        "If we claim that an occurrence (f is an event, and if an occurrence tp is a state, /' I hip implies / lh ip (l Ç /').",
        "Fig.",
        "2.",
        "Two-dimensional time",
        "In the following section, we introduce the two-dimensional time.",
        "One dimension is the conventional precedence (-<), and the other is the inclusion relation (Ç); both of which are given between two temporal extents so that they are arranged in the planar space as in Fig. 2."
      ]
    },
    {
      "heading": "3. Syntax and semantics of h'ra",
      "text": [
        "In this section, we first give the syntax of the logic, and later, we give its Kripke semantics.",
        "The language consists of prepositional variables ip, ip, • • •, logical connectives -i, V, A, and modal operators G, H, DT, Ox where parentheses and punctuation marks are added if necessary.",
        "Modal operators are interpreted in the following way.",
        "G(f at all the future time, ip Hip at all the past time, ip Oxip in all the sub-extents, ip□V in all the super-extents, ip",
        "Modal operators F, P, 0T, and O4.",
        "are abbreviations of – 'G – ~i-ff~i, ~Ot-i, and -O^-i, respectively.",
        "Note that the two temporal extents in the precedence relation do not share a common time (t ft t).",
        "F^ip and ()^F\\p are differently valuated; the former refers to some future of a super-extent of the current time while the latter does to a super-extent of some future.",
        "The former does not include the current time though the latter may include it.",
        "Thus, the truth values may be different in the two sentences.",
        "Generally speaking, all these operators are not commutative.",
        "A modal logic with the modality □ is normal if (i) the logic includes all the tautologies, (ii) is closed under Modus Ponens, and (iii) satisfies the following property:",
        "(K) D((p =^ip)=^ (D(p =^ Dip), and (iv) if cp is a sentence of the logic so is Dip.",
        "Because all the G, H, DT, Oxsatisfy the above conditions, the combined logic is normal.",
        "First, we introduce the set of axioms for G and H and that of DT and □4.",
        "independently.",
        "The logic Kt, the minimal tense logic, has the following axioms.",
        "The logic KT + Kn is the fusion of KT and Kn, and we denote it as i^Tnhereafter.",
        "Kripke semantics",
        "We introduce Kripke semantics for K r .",
        "A Kripke model for the logic is a tuple (W, <, y, Ç, D, Ih), where W is a non-empty set of possible worlds, and -< and Ç are binary relations on W. Thus, each temporal extent is regarded as a possible world, and both of the precedence and the inclusion are two different accessibilities between the possible worlds.",
        "The semantics, i.e., Ih is defined inductively as follows.",
        "u Ih ip A xp iff u Ih ip and u Ih xp, u Ih ip V ip iff 11 Ih p or // Ih i.\\ u Ih ip =$- ip iff u Ih ip implies // Ih xp, u Ih nip iff u f ip, u Ih Gip iff Vv e W, u ^ v implies w Ih 99, u Ih i/f e W, u y v implies w Ih 99, m Ih Dt9?",
        "iff \\/v e U .",
        "îjÇî) implies r Ih ip, u Ih Oxip iff Vv e W, u D v implies v Ih ip.",
        "In Kripke semantics, (4<±) and (4^) represent the transitivity, (C«±) and (C^j.)",
        "the conversion, and (T^) the reflexivity, respectively.",
        "A formula ip is true in model A4, denoted by Ai |= (p, if u Ih 99 for every u e PF.",
        "Now, we define the veridicality as follows.",
        "AI |= Dj.^ ^ ip iff yu[u D u].",
        "If -< and Ç satisfy all of the above conditions for AI, A4 is called to be a i^TD-model.",
        "Now, we can construct the canonical model [3]; i.e., v99, ip £ KTn iff there exists KTn-model A4 such that A4 ty= ip (completeness)."
      ]
    },
    {
      "heading": "4. Events and states",
      "text": []
    },
    {
      "heading": "4. 1 Downward heredity",
      "text": [
        "A proposition is gestalt if it never holds over two temporal extents one of which properly contains the other [11].",
        "That is, the gestalt of an occurrence shows the exact temporal extent where the occurrence takes place on the time axis.",
        "If we directly translate the feature of a state, (2), into a formula, (2)' ip^U.ip.",
        "Now let us consider the possibility that there exists a super-extent (0T), in all the sub-extents of which ip still holds (Oxip).",
        "In Fig. 3, if we reside in t\\ and ip is a state (ip =>- nxip), we can assume an enlarged temporal extent t2 Q h) where t2 Ih \\3xip.",
        "In case ip does not hold before and after the enlarged extent t2, i.e.,",
        "t2 Ih H^ip A U^ip A G^ip, then the enlarged extent specified by t2 can be regarded as the maximal extent, i.e., the gestalt of the state.",
        "Example 1 If \"Alice was sleeping between 1pm and 2pm\" then we can infer that she has slept in any sub-extent of [Ipm, 2pm], as:",
        "Fig.",
        "3.",
        "Maximal duration",
        "Fig.",
        "4.",
        "Upward heredity where A stands for 'Alice. '",
        "In this case, we can also infer that there must be a maximal extent, including [1pm, 2pm], in any sub-extents of which she sleeps.",
        "1pm, 2pm] Ih OrDx((A sleeps)).",
        "If she actually took a siesta between 12:30pm and 3pm, [12:30pm, 3pm] Ih H-i((A sleeps)) A D^A sleeps)) A G->((A sleeps)).",
        "Here, (( }} is an identical event which happens once and for all, and is not a situation type."
      ]
    },
    {
      "heading": "4. 2 Upward heredity",
      "text": [
        "On the contrary, if an occurrence of an event is upward hereditary, and in this case, cp should not appear both in the past and in the future.",
        "This situation is depicted in Fig. 4.",
        "The thick line is the gestalt of the event and is encircled by its temporal extent.",
        "Let t\\ be the original temporal extent of ep and t2 Q ii) Ih cp; if t\\ -< t3, necessarily t3 \\f cp even though t3 may be included in t2.",
        "However, in the similar way to the downward heredity, we can assume the minimal extent in which the event occurred, as:",
        "(>x(H-i(p A DV A G^(p).",
        "Example 2 If \"Betty woke up between 7:30am and 8am\" then we can infer that there must be the minimal extent in [7:30am, 8am], that could be more adequately called an instant, when she got up.",
        "Let u be such a small extent, then:",
        "u Ih H-i{{B wakes up)) A DT((i?",
        "wakes up)) A G^((B wakes up)).",
        "Fig.",
        "5.",
        "Triangular constraints"
      ]
    },
    {
      "heading": "5. Triangular constraints",
      "text": [
        "The two accessibilities in Section 3 cannot be independent of each other for a realistic model of time.",
        "Here, a model of time means an empirically plausible time, or in other words, all the given temporal extents can be mapped consistently onto the physical time axis, that is linear and unbounded.",
        "As is the left-hand side of Fig. 5, given three temporal extents ti,t2 and t3, if ti is included in t3 and t2 precedes t3, then t2 should also precede ti.",
        "The figure suggests the following three constraints.",
        "First, seen from t2, that is, if t2 I h then t3 I h <)xip, and thus t\\ I h ip.",
        "Next, if we see from t3,",
        "Pip I 1 /V- (4) Namely, if t3 Ih Pep then t3 Ih \\3xPip, i.e., for all t\\ Ç t3, t\\ Ih Pep.",
        "Finally, if we see from ti, then:",
        "OrP(p => Pip.",
        "(5) This means that if t\\ Ih tyPip then t3 Ih Pip and thus t2 Ih ip.",
        "Because the axioms (3), (4), and (5) concerns the same arrangement of three temporal extents, the meanings should be equivalent.",
        "Actually, we can show that the three axioms are the identical one (see Appendix).",
        "We name the axiom (Ai).",
        "The duals of them become:",
        "(5) * Hp I 17/r~.",
        "In the very similar way, for the right-hand side of Fig. 5 we can show that the following conditions represent the same axiom.",
        "If t4 Ih O^Fcp, then /.-, Ih Ftp and h, Ih ip.",
        "If /.-, Ih Fip, then /.-, Ih U±F<p.",
        "If te Ih then t5 Ih and t± Ih (p.",
        "The followings are the another family of axioms.",
        "We name it (^2).",
        "The dual of them become:",
        "(8) * Hp III 1 r'.",
        "Combining (T^) with the above formulae, we obtain the following equations of modalities.",
        "At this stage, the following set of axioms:",
        "can be considered as a proper candidate of the two-dimensional temporal structure."
      ]
    },
    {
      "heading": "6. Discussion",
      "text": [
        "We have proposed a multidimensional temporal logic, combining the logic Knof the inclusion relation (Ç) of temporal extents together with the logic KTof the conventional precedence relation (-<), and showed the syntax and the semantics of the fusion of them as /\\'y .",
        "With this logic, we gave explanations for the gestalt of occurrences in terms of temporal extents, as well as the progressive and the perfect aspects.",
        "Thereafter, we also added several axioms to constrain the relationship between two different accessibilities, Ç and -<, to express the realistic time.",
        "Though we have mainly discussed the distinction of upward/ downward heredity in this paper, we can extend the notion to the classification of aspects.",
        "In [15], the progressive and the perfective aspects were represented by 0Tand P, respectively.",
        "Although these may look rather oversimplified, we can support the idea in that both of the progressive form OV and the perfect form Pep are downward hereditary (Ox), as: OV \\~(c±) n.j.C>T<0V ^(4t)* Dj-OV; and Pep =>- O^Pcp (See (4) in Section 5).",
        "In the similar way to the conventional temporal logic, a set of axioms specifies a kind of multidimensional temporal logic.",
        "Namely, adding or subtracting some axioms, we can represent different temporal structures.",
        "At the current stage, /\\'y – {(T. )• (Ttj.",
        ")}, i.e., KTn – {(Ctj.)}",
        "was proved to be decidable as in [17].",
        "The sequent rules for KT were given in [9] and those for {(4), (T)} with (K) becomes S4.",
        "Although KT+SA cannot satisfy the cut elimination property [7], we can employ the restricted cut elimination for the subformulae [12,13].",
        "Because the restricted sequent system satisfies the subformula property, we can show that the whole sequent system also satisfies it.",
        "If a system has the subformula property, it has a finite model.",
        "According to Harrop's theorem [3], if a system has a finite model with a finite set of axioms, it is decidable.",
        "G =",
        "n^G =",
        "0,G",
        "H =",
        "F =",
        "□,F =",
        "P =",
        "a,p =",
        "0rP",
        "On the contrary, because the system {(4^), (Cf-J.)}",
        "'1S same as KT, KTn – {(T^i)} is the fusion of two KT's and again becomes decidable.",
        "Although we can claim that KTUa gives the proper relationship of the inclusion and the precedence, the sequent system and the proof method of which would become more complicated.",
        "The logical features such as decidability of the extended multidimensional modal logic, as well as the proof system, are under investigation.",
        "We here prove the equality of (3) (4) (5).",
        "• (3) h (4): By (C<_) 0^ => HF{§tf), and by (3) => H Fip.",
        "Its dual becomes I'Gp =>- O^ip, and thus, PG(P(p) =>- I 1 I'p.",
        "From (( ' :.",
        ").",
        "Pip =£■ PGPip; hence, Pep I \\ I'p (4).",
        "• (4) h (3): By (C_>), Gp) => GP(Gip).",
        "From (4) P(Gip) => □4P(Gp), and by (C* ).",
        "I'Gp => I \\ I'Gp => Uxip.",
        "Therefore, GPGip => Gl 1 r'.",
        "Combining them, we obtain Gp =£■ Gl 1 p. Its dual becomes FQ^ip =£■ Fip.",
        "• (5) h (4): By (C^), Pip D^Pip.",
        "Given O^Pip Pip (5), the right-hand side of the above is reduced to OxPip.",
        "• (4) h (5): By (C^), Hip =£■ d^Q^Hip.",
        "Because the dual of (4) becomes <) lip =>- Hip, we obtain lip =£■ I 17/r~.",
        "Its dual becomes ()^Pip =^ Pip.",
        "We can show the equality of (6) (7) (8) similarly, replacing the modal operators symmetrically."
      ]
    }
  ]
}
