{
  "info": {
    "authors": [
      "Gae-won You",
      "Seung-won Hwang",
      "Young-In Song",
      "Long Jiang",
      "Zaiqing Nie"
    ],
    "book": "EMNLP",
    "id": "acl-D10-1042",
    "title": "Mining Name Translations from Entity Graph Mapping",
    "url": "https://aclweb.org/anthology/D10-1042",
    "year": 2010
  },
  "references": [
    "acl-C04-1089",
    "acl-J98-4003",
    "acl-P02-1051",
    "acl-P04-1021",
    "acl-P08-1113",
    "acl-P09-1098",
    "acl-P93-1003",
    "acl-P98-1069",
    "acl-P98-2220",
    "acl-W04-3248"
  ],
  "sections": [
    {
      "text": [
        "Mining Name Translations from Entity Graph Mapping*",
        "Gae-won Yout Seung-won Hwang* Young-In Song* Long Jiang* Zaiqing Nie*",
        "*Pohang University of Science and Technology, Pohang, Republic of Korea",
        "{gwyou,swhwang}@postech.ac.kr",
        "*Microsoft Research Asia, Beijing, China",
        "This paper studies the problem of mining entity translation, specifically, mining English and Chinese name pairs.",
        "Existing efforts can be categorized into (a) a transliteration-based approach leveraging phonetic similarity and (b) a corpus-based approach exploiting bilingual co-occurrences, each of which suffers from inaccuracy and scarcity respectively.",
        "In clear contrast, we use unleveraged resources of monolingual entity co-occurrences, crawled from entity search engines, represented as two entity-relationship graphs extracted from two language corpora respectively.",
        "Our problem is then abstracted as finding correct mappings across two graphs.",
        "To achieve this goal, we propose a holistic approach, of exploiting both transliteration similarity and monolingual co-occurrences.",
        "This approach, building upon monolingual corpora, complements existing corpus-based work, requiring scarce resources of parallel or comparable corpus, while significantly boosting the accuracy of transliteration-based work.",
        "We validate our proposed system using real-life datasets."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Entity translation aims at mapping the entity names (e.g., people, locations, and organizations) in source language into their corresponding names in target language.",
        "While high quality entity translation is essential in cross-lingual information access and trans-",
        "*This work was done when the first two authors visited Microsoft Research Asia.",
        "lation, it is non-trivial to achieve, due to the challenge that entity translation, though typically bearing pronunciation similarity, can also be arbitrary, e.g., Jackie Chan and (pronounced Cheng",
        "Long).",
        "Existing efforts to address these challenges can be categorized into transliteration-and corpus-based approaches.",
        "Transliteration-based approaches (Wan and Verspoor, 1998; Knight and Graehl, 1998) identify translations based on pronunciation similarity, while corpus-based approaches mine bilingual co-occurrences of translation pairs obtained from parallel (Kupiec, 1993; Feng et al., 2004) or comparable (Fung and Yee, 1998) corpora, or alternatively mined from bilingual sentences (Lin et al., 2008; Jiang et al., 2009).",
        "These two approaches have complementary strength-transliteration-based similarity can be computed for any name pair but cannot mine translations of little (or none) phonetic similarity.",
        "Corpus-based similarity can support arbitrary translations, but require highly scarce resources of bilingual co-occurrences, obtained from parallel or comparable bilingual corpora.",
        "In this paper, we propose a holistic approach, leveraging both transliteration-and corpus-based similarity.",
        "Our key contribution is to replace the use of scarce resources of bilingual co-occurrences with the use of untapped and significantly larger resources of monolingual co-occurrences for translation.",
        "In particular, we extract monolingual cooccurrences of entities from English and Chinese Web corpora, which are readily available from entity search engines such as PeopleEntityCube, deployed by Microsoft Research Asia.",
        "Such engine automatically extracts people names from text and their co-occurrences to retrieve related entities based on co-occurrences.",
        "To illustrate, Figure 1(a) demonstrates the query result for \"Bill Gates,\" retrieving and visualizing the \"entity-relationship graph\" of related people names that frequently co-occur with Bill in English corpus.",
        "Similarly, entity-relationship graphs can be built over other language corpora, as Figure 1(b) demonstrates the corresponding results for the same query, from Renlifang on Chinese Web corpus.",
        "From this point on, for the sake of simplicity, we refer to English and Chinese graphs, simply as Ge and Gc respectively.",
        "Though we illustrate with English-Chinese pairs in the paper, our method can be easily adapted to other language pairs.",
        "In particular, we propose a novel approach of abstracting entity translation as a graph matching problem of two graphs Ge and Gc in Figures 1(a) and (b).",
        "Specifically, the similarity between two nodes veand vc in Ge and Gc is initialized as their transliteration similarity, which is iteratively refined based on relational similarity obtained from monolingual cooccurrences.",
        "To illustrate this, an English news article mentioning \"Bill Gates\" and \"Melinda Gates\" evidences a relationship between the two entities, which can be quantified from their co-occurrences in the entire English Web corpus.",
        "Similarly, we can mine Chinese news articles to obtain the relationships between \"tfcJK-H 1^\" and \"f§MH Once these two bilingual graphs of people and their relationships are harvested, entity translation can leverage these parallel relationships to further evidence the mapping between translation pairs, as Figure 1(c) illustrates.",
        "To highlight the advantage of our proposed approach, we compare our results with commercial machine translators (1) Engkoo developed in Microsoft Research Asia and (2) Google Translator.",
        "In particular, Figure 2 reports the precision for two groups \"heads\" that belong to top-100 popular people (determined by the number of hits), among randomly sampled 304 people names from six graph pairs of size 1,000 each, and the remaining \"tails\".",
        "Commercial translators such as Google, leveraging",
        "Ours Google Engkoo",
        "bilingual co-occurrences that are scarce for tails, show significantly lower precision for tails.",
        "Meanwhile, our work, depending solely on monolingual co-occurrences, shows high precision, for both heads and tails.",
        "Our focus is to boost translation accuracy for long tails with non-trivial Web occurrences in each monolingual corpus, but not with much bilingual cooccurrences, e.g., researchers publishing actively in two languages but not famous enough to be featured in multilingual Wikipedia entries or news articles.",
        "As existing translators are already highly accurate for popular heads, this focus well addresses the remaining challenges for entity translation.",
        "To summarize, we believe that this paper has the following contributions:",
        "• We abstract entity translation problem as a graph mapping between entity-relationship graphs in two languages.",
        "• We develop an effective matching algorithm leveraging both pronunciation and cooccurrence similarity.",
        "This holistic approach complements existing approaches and enhances the translation coverage and accuracy.",
        "• We validate the effectiveness of our approach using various real-life datasets.",
        "The rest of this paper is organized as follows.",
        "Section 2 reviews existing work.",
        "Section 3 then develops our framework.",
        "Section 4 reports experimental results and Section 5 concludes our work.",
        "1 – ",
        "Hail",
        "1 Head \"",
        "-",
        "EWS Wflcü",
        "mm-.",
        "(a) English PeopleEntityCube Ge (b) Chinese Renlifang Gc (c) Abstracting translation as graph mapping Figure 1: Illustration of entity-relationship graphs"
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "In this section, we first survey related efforts, categorized into transliteration-based and corpus-based approaches.",
        "Our approach leveraging both is complementary to these efforts.",
        "Many name translations are loosely based on phonetic similarity, which naturally inspires transliteration-based translation of finding the translation with the closest pronunciation similarity, using either rule-based (Wan and Verspoor, 1998) or statistical (Knight and Graehl, 1998; Li et al., 2004) approaches.",
        "However, people are free to designate arbitrary bilingual names of little (or none) phonetic similarity, for which the transliteration-based approach is not effective.",
        "Corpus-based approach can mine arbitrary translation pairs, by mining bilingual co-occurrences from parallel and comparable bilingual corpora.",
        "Using parallel corpora (Kupiec, 1993; Feng et al., 2004), e.g., bilingual Wikipedia entries on the same person, renders high accuracy but suffers from high scarcity.",
        "To alleviate such scarcity, (Fung and Yee, 1998; Shao and Ng, 2004) explore a more vast resource of comparable corpora, which share no parallel document-or sentence-alignments as in parallel corpora but describe similar contents in two languages, e.g., news articles on the same event.",
        "Alternatively, (Lin et al., 2008) extracts bilingual cooccurrences from bilingual sentences, such as annotating terms with their corresponding translations in English inside parentheses.",
        "Similarly, (Jiang et al., 2009) identifies potential translation pairs from bilingual sentences using lexical pattern analysis.",
        "The complementary strength of the above two approaches naturally calls for a holistic approach, such as recent work combining transliteration-and corpus-based similarity mining bilingual cooccurrences using general search engines.",
        "Specifically, (Al-Onaizan and Knight, 2002) uses transliteration to generate candidates and then web corpora to identify translations.",
        "Later, (Jiang et al., 2007) enhances to use transliteration to guide web mining.",
        "Our work is also a holistic approach, but leveraging significantly larger corpora, specifically by exploiting monolingual co-occurrences.",
        "Such expansion enables to translate \"long-tail\" people entities with non-trivial Web occurrences in each monolingual corpus, but not much bilingual co-occurrences.",
        "Specifically, we initialize name pair similarity using transliteration-based approach, and iteratively reinforces base similarity using relational similarity."
      ]
    },
    {
      "heading": "3. Our Framework",
      "text": [
        "Given two graphs Ge = (Ve,Ee) and Gc = (Vc,Ec) harvested from English and Chinese corpora respectively, our goal is to find translation pairs, or a set S of matching node pairs such that S ç Vex Vc.",
        "Let R be a \\Ve\\-by-\\Vc\\ matrix where each Rij denotes the similarity between two nodes i G Ve and j G Vc.",
        "Overall, with the matrix R, our approach consists of the following three steps, as we will discuss in the following three sections respectively:",
        "1.",
        "Initialization: computing base translation similarities R^j between two entity nodes using transliteration similarity"
      ]
    },
    {
      "heading": "2.. Reinforcement model: reinforcing the trans-",
      "text": [
        "lation similarities Rij by exploiting the monolingual co-occurrences",
        "3.",
        "Matching extraction: extracting the matching pairs from the final translation similarities R^j",
        "We initialize the translation similarity Rij as the transliteration similarity.",
        "This section explains how to get the transliteration similarity between English and Chinese names using an unsupervised approach.",
        "Formally, let an English name Ne = (e\\,e2, --- ,en) and a Chinese name Nc = (ci,c2, - - -, cm) be given, where ei is an English word and Ne is a sequence of the words, and ciis a Chinese character and Nc is a sequence of the characters.",
        "Our goal is to compute a score indicating the similarity between the pronunciations of the two names.",
        "We first convert Nc into its Pinyin representation PYc = (s\\,s2, - - -, sm), where si is the Pinyin representation of ci.",
        "Pinyin is the romanization representation of pronunciation of Chinese character.",
        "For example, the Pinyin representation of Ne = \"ao\", \"ba\", \"ma\").",
        "The Pinyin representations of Chinese characters can be easily obtained from Chinese character pronunciation dictionary.",
        "In our experiments, we use an in-house dictionary, which contains pronunciations of 20, 774 Chinese characters.",
        "For the Chinese characters having multiple pronunciations, we only use the most popular one.",
        "Calculation of transliteration similarity between Ne and Nc is now transformed to calculation of pronunciation similarity between Ne and PYc.",
        "Because letters in Chinese Pinyins and English strings are pronounced similarly, we can further approximate pronunciation similarity between Ne and PYc using their spelling similarity.",
        "In this paper, we use Edit Distance (ED) to measure the spelling similarity.",
        "Moreover, since words in Ne are transliterated into characters in PYc independently, it is more accurate to compute the ED between Ne and PYc, i.e., EDname(Ne, PYc), as the sum of the EDs of all component transliteration pairs, i.e., every ei in Neand its corresponding transliteration (si) in PYc.",
        "In other words, we need to first align all sj's in PYcwith corresponding ei in Ne based on whether they are translations of each other.",
        "Then based on the alignment, we can calculate EDname(Ne, PYc) using the following formula.",
        "where esi is a string generated by concatenating all si's that are aligned to ei and ED(ei,esi) is the Edit Distance between ei and esi, i.e., the minimum number of edit operations (including insertion, deletion and substitution) needed to transform ei into esi.",
        "Because an English word usually consists of multiple syllables but every Chinese character consists of only one syllable, when aligning ei's with sj's, we add the constraint that each ei is allowed to be aligned with 0 to 4 si's but each si can only be aligned with 0 to 1 ei.",
        "To get the alignment between PYc and Ne which has the minimal EDname(Ne, PYc), we use a Dynamic Programming based algorithm as defined in the following formula:",
        "where, given a sequence X = (x\\,x2, - --) such that xi is a word, X%,j is the subsequence (xi, xi+\\, - - -, Xj) of X and Len(X) is the number of letters except spaces in the sequence X.",
        "For instance, the minimal Edit Distance between the English name \"Barack Obama\" and the Chinese Pinyin representation \"ba lake ao ba ma\" is 4, as the best alignment is: \"Barack\" <-> \"ba la ke\" (ED: 3), \"Obama\" – \"ao bama\" (ED: 1).",
        "Finally the transliteration similarity between Nc and Ne is calculated using the following formula.",
        "EDname(Ne, PYc)",
        "For example, Simti (\"Barack Obama\", \"E JtL-ÄES,\") is 1 - = 0.826.",
        "From the initial similarity, we model our problem as an iterative approach that iteratively reinforces the similarity R^j of the nodes i and j from the matching similarities of their neighbor nodes u and v.",
        "The basic intuition is built on exploiting the similarity between monolingual co-occurrences of two different languages.",
        "In particular, we assume two entities with strong relationship co-occur frequently in both corpora.",
        "In order to express this intuition, we formally define an iterative reinforcement model as follows.",
        "Let Rj denote the similarity of nodes i and j at t-th iteration:",
        "The model is expressed as a linear combination of (a) the relational similarity J2 Rt,v/2k and (b) transliteration similarity Rj.",
        "(A is the coefficient for interpolating two similarities.)",
        "In the relational similarity, Bt(i,j,9) is an ordered set of the best matching pairs between neighbor nodes of i and ones of j such that \\/(u, v)k G Bt(i,j,9),Rtuv > 0, where (u,v)k is the matching pair with k-th highest similarity score.",
        "We consider (u, v) with similarity over some threshold 0, or RUuv > 0, as a matching pair.",
        "In this neighbor matching process, if many-to-many matches exist, we select only one with the greatest matching score.",
        "Figure 3 describes such matching process more formally.",
        "N (i) and N (j) are the sets of neighbor nodes of i and j, respectively, and H is a priority queue sorting pairs in the decreasing order of similarity scores.",
        "Meanwhile, note that, in order to express that the confidence for matching (i, j) progressively converges as the number of matched neighbors increases, we empirically use decaying coefficient 1/2k for RUv, because ET=i 1/2k = 1.",
        "After the convergence of the above model, we get the \\Ve\\-by-\\Vc\\ similarity matrix R°°.",
        "From this matrix, we extract one-to-one matches maximizing the overall similarity.",
        "More formally, this problem can be stated as the maximum weighted bipartite matching (West,"
      ]
    },
    {
      "heading": "3.. while H is not empty do",
      "text": []
    },
    {
      "heading": "6.. break",
      "text": []
    },
    {
      "heading": "7.. end if",
      "text": []
    },
    {
      "heading": "8.. if neither u nor v are matched yet then",
      "text": [
        "îî .",
        "end while 2000)- Given two groups of entities Ve and Vc from the two graphs Ge and Gc, we can build a weighted bipartite graph is G = (V,E), where V = Ve U Vcand E is a set of edges (u, v) with weight R^V.",
        "To filter out null alignment, we construct only the edges with weight > 6.",
        "From this bipartite graph, the maximum weighted bipartite matching problem finds a set of pairwise non-adjacent edges S ç E such that J2 (u,v)es Rwv is the maximum.",
        "Well-known algorithms include Hungarian algorithm with time complexity of O(\\V| log\\V| + \\V\\\\E|) (West, 2000).",
        "In this paper, to speed up processing, we consider a greedy alternative with the following steps (1) choose the pair with the highest similarity score, (2) remove the corresponding row and column from the matrix, and (3) repeat (1) and (2) until their matching scores are over a specific threshold 6."
      ]
    },
    {
      "heading": "4. Experiments",
      "text": [
        "This section reports our experimental results to evaluate our proposed approach.",
        "First, we report our experimental setting in Section 4.1.",
        "Second, we validate the effectiveness and the scalability of our approach over a real-life dataset in Section 4.2.",
        "This section describes (1) how we collect the English and Chinese EntityCube datasets, (2) how to build ground-truth test datasets for evaluating our framework, and (3) how to set up three parameters A, 9, and 6.",
        "First, we crawled Ge = (Ve,Ee) and Gc = ( Vc, Ec) from English and Chinese EntityCubes.",
        "Specifically, we built a graph pairs (Ge,Gc) expanding from a \"seed pair\" of nodes se £ Ve and sc £ Vcuntil the number of nodes for each graph becomes 1,000.",
        "More specifically, when we build a graph Ge by expanding from se, we use a queue Q.",
        "We first initialize Q by pushing the seed node se.",
        "We then iteratively pop a node ve from Q, save ve into Ve, and push its neighbor nodes in decreasing order of co-occurrence scores with ve.",
        "Similarly, we can get Gc from a counterpart seed node vc.",
        "By using this procedure, we built six graph pairs from six different seed pairs.",
        "In particular, the six seed nodes are English names and its corresponding Chinese names representing a wide range of occupation domains (e.g., 'Barack Obama,' 'Bill Gates,' 'Britney Spears,' 'Bruno Senna,' 'Chris Paul,' and 'Eminem') as Table 1 depicts.",
        "Meanwhile, though we demonstrate the effectiveness of the proposed method for mining name translations in Chinese and English languages, the method can be easily adapted to other language pairs.",
        "Second, we manually searched for about 50 \"ground-truth\" matched translations for each graph pair to build test datasets Ti, by randomly selecting nodes within two hops from the seed pair (se, sc), since nodes outside two hops may include nodes whose neighbors are not fully crawled.",
        "More specifically, due to our crawling process expanding to add neighbors from the seed, the nodes close to the seed have all the neighbors they would have in the full graph, while those far from the node may not.",
        "In order to pick the nodes that well represent the actual neighbors, we built test datasets among those within two hops.",
        "However, this crawling is used for the evaluation sake only, and thus does not suggest the bias in our proposed framework.",
        "Table 1 describes the size of such test dataset for each graph pair.",
        "i",
        "\\Ve\\, \\Vc\\",
        "\\Ti\\",
        "English Name",
        "Chinese Name",
        "1",
        "1,000",
        "51",
        "Barack Obama",
        "2",
        "1,000",
        "52",
        "Bill Gates",
        "3",
        "1,000",
        "40",
        "Britney Spears",
        "4",
        "1,000",
        "53",
        "Bruno Senna",
        "5",
        "1,000",
        "51",
        "Chris Paul",
        "6",
        "1,000",
        "57",
        "Eminem",
        "Lastly, we set up the three parameters A, 9, and 6 using 6-fold cross validation with 6 test datasets Ti's of the graphs.",
        "More specifically, for each dataset Ti, we decide Ai and 9i such that average MRR for the other 5 test datasets is maximized.",
        "(About MRR, see more details of Equation (4) in Section 4.2.)",
        "We then decide 6i such that average F1-score is maximized.",
        "Figure 4 shows the average MRR for Ai and 9i with default values 9 = 0.66 and A = 0.2.",
        "Based on these results, we set Ai with values {0.2, 0.15, 0.2, 0.15, 0.2, 0.15} that optimize MRR in datasets T1,.. .T6, and similarly 9i with {0.67, 0.65, 0.67, 0.67, 0.65, 0.67}.",
        "We also set 6i with values {0.63, 0.63, 0.61, 0.61, 0.61, 0.61} optimizing F1-score with the same default values A = 0.2 and 9 = 0.66.",
        "We can observe the variances of optimal parameter setting values are low, which suggests the robustness of our framework.",
        "This section reports our experimental results using the evaluation datasets explained in previous section.",
        "For each graph pair, we evaluated the effectiveness of (1) reinforcement model using MRR measure in Section 4.2.1 and (2) overall framework using precision, recall, and F1 measures in Section 4.2.2.",
        "We also validated (3) scalability of our framework over larger scale of graphs (with up to five thousand nodes) in Section 4.2.3.",
        "(In all experimental results, Bold numbers indicate the best performance for each metric.)",
        "We evaluated the reinforcement model over MRR (Voorhees, 2001), the average of the reciprocal ranks of the query results as the following formula:",
        "Each q is a ground-truth matched pair (u,v) such that u £ Ve and v £ Vc, and rankq is the rank of the similarity score of Ruv among all Ruk 's such that k £ Vc.",
        "Q is a set of such queries.",
        "By comparing",
        "MRRs for two matrices R and R°°, we can validate the effectiveness of the reinforcement model.",
        "• Baseline matrix (R): using only the transliteration similarity score, i.e., without reinforcement",
        "• Reinforced matrix (R°°): using the reinforced similarity score obtained from Equation (3)",
        "We empirically observed that the iterative model converges within 5 iterations.",
        "In all experiments, we used 5 iterations for the reinforcement.",
        "Table 2 summarizes our experimental results.",
        "As these figures show, MRR scores significantly increase after applying our reinforcement model except for the set T4 (on average from 69% to 81%), which indirectly shows the effectiveness of our reinforcement model.",
        "Based on the reinforced matrix, we evaluated the effectiveness of our overall matching framework using the following three measures-(1) precision: how accurately the method returns matching pairs, (2) recall: how many the method returns correct matching pairs, and (3) F1-score: the harmonic mean of precision and recall.",
        "We compared our approach with a baseline, mapping two graphs with only transliteration similarity.",
        "• Baseline: in matching extraction, using R as the similarity matrix by bypassing the reinforcement step",
        "• Ours: using R°°, the similarity matrix converged by Equation (3)",
        "Set",
        "MRR",
        "Baseline R",
        "Reinforced R°°",
        "Ti",
        "0.6964",
        "0.8377",
        "T2",
        "0.6213",
        "0.7581",
        "T3",
        "0.7095",
        "0.7989",
        "T4",
        "0.8159",
        "0.8378",
        "T5",
        "0.6984",
        "0.8158",
        "To",
        "0.5982",
        "0.8011",
        "Average",
        "0.6900",
        "0.8082",
        "In addition, we compared ours with the machine translators of Engkoo and Google.",
        "Table 3 summarizes our experimental results.",
        "As this table shows, our approach results in the highest precision (about 80% on average) without compromising the best recall of Google, i.e., 61% of Google vs. 63% of ours.",
        "Overall, our approach outperforms others in all three measures.",
        "Meanwhile, in order to validate the translation accuracy over popular head and long-tail, as discussed in Section 1, we separated the test data into two groups and analyzed the effectiveness separately.",
        "Figure 5 plots the number of hits returned for the names from Google search engine.",
        "According to the distribution, we separate the test data into top-100 popular people with the highest hits and the remaining, denoted head and tail, respectively.",
        "Number of names",
        "Table 4 shows the effectiveness with both datasets, respectively.",
        "As difference of the effectiveness between tail and head (denoted diff) with respect to three measures shows, our approach shows stably high precision, for both heads and tails.",
        "To validate the scalability of our approach, we evaluated the effectiveness of our approach over the number of nodes in two graphs.",
        "We built larger six graph pairs (Ge,Gc) by expanding them from the seed pairs further until the number of nodes reaches 5,000.",
        "Figure 6 shows the number of matched translations according to such increase.",
        "Overall, the number of matched pairs linearly increases as the number of nodes increases, which suggests scalability.",
        "The ratio of node overlap in two graphs is about between 7% and 9% of total node size."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "This paper abstracted name translation problem as a matching problem of two entity-relationship graphs.",
        "This novel approach complements existing name translation work, by not requiring rare resources of parallel or comparable corpus yet outperforming the state-of-the-art.",
        "More specifically, we combine bilingual phonetic similarity and monolingual Web co-occurrence similarity, to compute a holistic notion of entity similarity.",
        "To achieve this goal, we developed a graph alignment algorithm that iteratively reinforces the matching similarity exploiting relational similarity and then extracts correct matches.",
        "Our evaluation results empirically validated the accuracy of our algorithm over real-life datasets, and showed the effectiveness on our proposed perspective."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was supported by Microsoft Research Asia NLP theme funding and MKE (Ministry of Knowledge Economy), Korea, under the ITRC (Information Technology Research Center) support program supervised by the IITA (Institute for Information Technology Advancement) (IITA-2009-",
        "C1090-0902-0045).",
        "Set",
        "Precision",
        "Recall",
        "F1-score",
        "Engkoo",
        "Google",
        "Baseline",
        "Ours",
        "Engkoo",
        "Google",
        "Baseline",
        "Ours",
        "Engkoo",
        "Google",
        "Baseline",
        "Ours",
        "Ti",
        "0.5263",
        "0.4510",
        "0.5263",
        "0.8974",
        "0.3922",
        "0.4510",
        "0.1961",
        "0.6863",
        "0.4494",
        "0.4510",
        "0.2857",
        "0.7778",
        "T2",
        "0.7551",
        "0.75",
        "0.7143",
        "0.8056",
        "0.7115",
        "0.75",
        "0.2885",
        "0.5577",
        "0.7327",
        "0.75",
        "0.4110",
        "0.6591",
        "T3",
        "0.5833",
        "0.7925",
        "0.5556",
        "0.7949",
        "0.5283",
        "0.7925",
        "0.1887",
        "0.5849",
        "0.5545",
        "0.7925",
        "0.2817",
        "0.6739",
        "T4",
        "0.5",
        "0.45",
        "0.7368",
        "0.7353",
        "0.425",
        "0.45",
        "0.35",
        "0.625",
        "0.4595",
        "0.45",
        "0.4746",
        "0.6757",
        "T5",
        "0.6111",
        "0.3137",
        "0.5",
        "0.7234",
        "0.4314",
        "0.3137",
        "0.1765",
        "0.6667",
        "0.5057",
        "0.3137",
        "0.2609",
        "0.6939",
        "T6",
        "0.5636",
        "0.8947",
        "0.6",
        "0.8605",
        "0.5438",
        "0.8947",
        "0.1053",
        "0.6491",
        "0.5536",
        "0.8947",
        "0.1791",
        "0.74",
        "AVG",
        "0.5899",
        "0.6086",
        "0.6055",
        "0.8028",
        "0.5054",
        "0.6086",
        "0.2175",
        "0.6283",
        "0.5426",
        "0.6086",
        "0.3155",
        "0.7034",
        "Method",
        "Precision",
        "Recall",
        "F1-score",
        "head",
        "tail",
        "diff",
        "head",
        "tail",
        "diff",
        "head",
        "tail",
        "diff",
        "Engkoo",
        "0.6082",
        "0.5854",
        "0.0229",
        "0.59",
        "0.4706",
        "0.1194",
        "0.5990",
        "0.5217",
        "0.0772",
        "Google",
        "0.75",
        "0.5588",
        "0.1912",
        "0.75",
        "0.5588",
        "0.1912",
        "0.75",
        "0.5588",
        "0.1912",
        "Ours",
        "0.8462",
        "0.7812",
        "0.0649",
        "0.66",
        "0.6127",
        "0.0473",
        "0.7416",
        "0.6868",
        "0.0548"
      ]
    }
  ]
}
