{
  "info": {
    "authors": [
      "Karel Bílek",
      "Daniel Zeman"
    ],
    "book": "Workshop on Statistical Machine Translation",
    "id": "acl-W13-2207",
    "title": "CUni Multilingual Matrix in the WMT 2013 Shared Task",
    "url": "https://aclweb.org/anthology/W13-2207",
    "year": 2013
  },
  "references": [
    "acl-J03-1002",
    "acl-N03-1017",
    "acl-P03-1021",
    "acl-P07-2045",
    "acl-W08-0325",
    "acl-W12-3151"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We describe our experiments with phrase-based machine translation for the WMT 2013 Shared Task.",
        "We trained one system for 18 translation directions between English or Czech on one side and English, Czech, German, Spanish, French or Russian on the other side.",
        "We describe a set of results with different training data sizes and subsets.",
        "For the pairs containing Russian, we describe a set of independent experiments with slightly different translation models."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "With so many official languages, Europe is a paradise for machine translation research.",
        "One of the largest bodies of electronically available parallel texts is being nowadays generated by the European Union and its institutions.",
        "At the same time, the EU also provides motivation and boosts potential market for machine translation outcomes.",
        "Most of the major European languages belong to one of three branches of the IndoEuropean language family: Germanic, Romance or Slavic.",
        "Such relatedness is responsible for many structural similarities in European languages, although significant differences still exist.",
        "Within the language portfolio selected for the WMT shared task, English, French and Spanish seem to be closer to each other than to the rest.",
        "German, despite being genetically related to English, differs in many properties.",
        "Its word order rules, shifting verbs from one end of the sentence to the other, easily create long-distance dependencies.",
        "Long German compound words are notorious for increasing out-of-vocabulary rate, which has led many researchers to devising unsupervised compound-splitting techniques.",
        "Also, upper-case/lowercase distinction is more important because all German nouns start with an up-percase letter by the rule.",
        "Czech is a language with rich morphology (both inflectional and derivational) and relatively free word order.",
        "In fact, the predicate-argument structure, often encoded by fixed word order in English, is usually captured by inflection (especially the system of 7 grammatical cases) in Czech.",
        "While the free word order of Czech is a problem when translating to English (the text should be parsed first in order to determine the syntactic functions and the English word order), generating correct inflectional affixes is indeed a challenge for English-to-Czech systems.",
        "Furthermore, the multitude of possible Czech word forms (at least order of magnitude higher than in English) makes the data sparseness problem really severe, hindering both directions.",
        "Most of the above characteristics of Czech also apply to Russian, another Slavic language.",
        "Similar issues have to be expected when translating between Russian and English.",
        "Still, there are also interesting divergences between Russian and Czech, especially on the syntactic level.",
        "Russian sentences typically omit copula in the present tense and there is also no direct equivalent of the verb ?to have?.",
        "Periphrastic constructions such as ?there is XXX by him?",
        "are used instead.",
        "These differences make the Czech-Russian translation interest",
        "ing as well.",
        "Interestingly enough, results of machine translation between Czech and Russian has so far been worse than between English and any of the two languages, language relatedness notwithstanding.",
        "Our goal is to run one system under as similar conditions as possible to all eighteen translation directions, to compare their translation accuracies and see why some directions are easier than others.",
        "The current version of the system does not include really language-specific techniques: we neither split German compounds, nor do we address the peculiarities of Czech and Russian mentioned above.",
        "In an independent set of experiments, we tried to deal with the data sparseness of Russian language with the addition of a backoff model with a simple stemming and some additional data; those experiments were done for Russian and Czech|English combinations."
      ]
    },
    {
      "heading": "2 The Translation System",
      "text": [
        "Both sets of experiments use the same basic framework.",
        "The translation system is built around Moses1 (Koehn et al., 2007).",
        "Two-way word alignment was computed using GIZA++2 (Och and Ney, 2003), and alignment symmetrization using the grow-diag-final-and heuristic (Koehn et al., 2003).",
        "Weights of the system were optimized using MERT (Och, 2003).",
        "No lexical reordering model was trained.",
        "For language modeling we use the SRILM toolkit3 (Stolcke, 2002) with modified Kneser-Ney smoothing (Kneser and Ney, 1995; Chen and Goodman, 1998)."
      ]
    },
    {
      "heading": "3 General experiments",
      "text": [
        "In the first set of experiments we wanted to use the same setting for all language pairs."
      ]
    },
    {
      "heading": "3.1 Data and Preprocessing Pipeline",
      "text": [
        "We applied our system to all the ten official language pairs.",
        "In addition, we also experimented with translation between Czech on one side and German, Spanish, French or Russian on the other side.",
        "Training data for these additional language pairs were obtained",
        "by combining parallel corpora of the officially supported pairs.",
        "For instance, to create the Czech-German parallel corpus, we identified the intersection of the English sides of Czech-English and English-German corpora, respectively; then we combined the corresponding Czech and German sentences.",
        "We took part in the constrained task.",
        "Unless explicitly stated otherwise, the translation model in our experiments was trained on the combined News-Commentary v8 and Eu-roparl v7 corpora.4 Note that there is only News Commentary and no Europarl for Russian.",
        "We were also able to evaluate several combinations with large parallel corpora: the UN corpus (English, French and Spanish), the Giga French-English corpus and CzEng (Czech-English).",
        "We did not use any large corpus for Russian-English.",
        "Table 1 shows the sizes of the training data.",
        "for every language pair in the parallel training corpus.",
        "Languages are identified by their ISO 639 codes: cs = Czech, de = German, en = English, es = Spanish, fr = French, ru = Russian.",
        "Every line corresponds to the respective version of EuroParl + News Commentary; the second part presents the extra corpora.",
        "The News Test 2010 (2489 sentences in each language) and 2012 (3003 sentences) data sets5 were used as development data for MERT.",
        "BLEU scores reported in this paper were computed on the News Test 2013 set",
        "(3000 sentences each language).",
        "We do not use the News Tests 2008, 2009 and 2011.",
        "All parallel and monolingual corpora underwent the same preprocessing.",
        "They were tokenized and some characters normalized or cleaned.",
        "A set of language-dependent heuristics was applied in an attempt to restore the opening/closing quotation marks (i.e. \"quoted\" ?",
        "?quoted?)",
        "(Zeman, 2012).",
        "The data are then tagged and lemmatized.",
        "We used the Featurama tagger for Czech and English lemmatization and TreeTagger for German, Spanish, French and Russian lemmatization.",
        "All these tools are embedded in the Treex analysis framework (?abokrtsk?",
        "et al, 2008).",
        "The lemmas are used later to compute word alignment.",
        "Besides, they are needed to apply ?supervised truecasing?",
        "to the data: we cast the case of the lemma to the form, relying on our morphological analyzers and tag-gers to identify proper names, all other words are lowercased.",
        "Note that guessing of the true case is only needed for the sentence-initial token.",
        "Other words can typically be left in their original form, unless they are uppercased as a form of HIGHLIGHTING."
      ]
    },
    {
      "heading": "3.2 Experiments",
      "text": [
        "BLEU scores were computed by our system, comparing truecased tokenized hypothesis with truecased tokenized reference translation.",
        "Such scores must differ from the official evaluation?see Section 3.2.4 for discussion of the final results.",
        "The confidence interval for most of the scores lies between ?0.5 and ?0.6 BLEU % points.",
        "The set of baseline experiments were trained on the supervised truecased combination of News Commentary and Europarl.",
        "As we had lemmatizers for the languages, word alignment was computed on lemmas.",
        "(But our previous experiments showed that there was little difference between using lemmas and lowercased 4-character ?stems?.)",
        "A hexagram language model was trained on the monolingual version of the News Commentary + Europarl corpus (typically a slightly larger superset of the target side of the parallel corpus).",
        "Besides the monolingual halves of the parallel corpora, additional monolingual data were provided / permitted.",
        "Our experiments in previous years clearly showed that the Crawled News corpus (2007?2012), in-domain and large, contributed significantly to better BLEU scores.",
        "This year we included it in our baseline experiments for all language pairs: translation model on News Commentary + Europarl, language model on monolingual part of the two, plus Crawled News.",
        "In addition there are the Gigaword corpora published by the Linguistic Data Consortium, available only for English (5th edition), Spanish (3rd) and French (3rd).",
        "Table 2 gives the sizes and Table 3 compares BLEU scores with Gigaword against the baseline.",
        "Gigaword mainly contains texts from news agencies and as such it should be also in-domain.",
        "Nevertheless, the crawled news are already so large that the improvement contributed by Gigaword is rarely significant.",
        "in Gigaword, sentences elsewhere) and tokens of additional monolingual training corpora.",
        "?newsc+euro?",
        "are the monolingual versions of the News Commentary and Europarl parallel corpora.",
        "?news.all?",
        "denotes all years of the Crawled News corpus for the given language.",
        "ments (left column) on News Test 2013 data, computed by the system on tokenized data, versus similar setup with Gigaword.",
        "The difference was typically not significant.",
        "Various combinations with larger parallel corpora were also tested.",
        "We do not have results for all combinations because these experiments needed a lot of time and resources and not all of them finished in time successfully.",
        "In general the UN corpus seems to be of low quality or too much off-domain.",
        "It may help a little if used in combination with news-euro.",
        "If used separately, it always hurts the results.",
        "The Giga French-English corpus gave the best results for English-French as expected, even without the core news-euro data.",
        "However, training the model on data of this size is extremely demanding on memory and time.",
        "Finally, Czeng undoubtedly improves Czech-English translation in both directions.",
        "The news-euro dataset is smaller for this language pair, which makes Czeng stand out even more.",
        "See Table 4 for details.",
        "corpora.",
        "computed by our system, comparing truecased tokenized hypothesis with truecased tokenized reference translation.",
        "The official evaluation by matrix.statmt.",
        "org gives typically lower numbers, reflecting the loss caused by detokenization and new (different) tokenization.",
        "The baseline experiments were conducted mostly on 64bit AMD Opteron quad-core 2.8 GHz CPUs with 32 GB RAM (decoding run on 15 machines in parallel) and the whole pipeline typically required between a half and a whole day.",
        "However, we used machines with up to 500 GB RAM to train the large language models and translation models.",
        "Aligning the UN corpora with Giza++ took around 5 days.",
        "Giga French-English corpus was even worse and required several weeks to complete.",
        "Using such a large corpus without pruning is not practical."
      ]
    },
    {
      "heading": "4 Extra Experiments with Russian",
      "text": [
        "In a separate set of experiments, we tried to take a basic Moses framework and change the setup a little for better results on morphologically rich languages.",
        "Tried combinations were Russian-Czech and Russian-English.",
        "cased computed by the system, BLEUl is the official lowercased evaluation by matrix.",
        "statmt.org.",
        "BLEUt is official truecased evaluation.",
        "Although lower official scores are expected, notice the larger gap in en-fr and cs-fr translation.",
        "There seems to be a problem in our French detokenization procedure."
      ]
    },
    {
      "heading": "4.1 Data",
      "text": [
        "For the additional Russian-to-Czech systems, we used following parallel data: ?",
        "UMC 0.1 (Klyueva and Bojar, 2008) ?",
        "tri-parallel set, consisting of news articles ?",
        "93,432 sentences ?",
        "data mined from movie subtitles (described in further detail below) ?",
        "2,324,373 sentences ?",
        "Czech-Russian part of InterCorp ?",
        "a corpus from translation of fiction books (?er-m?k and Rosen, 2012) ?",
        "148,847 sentences For Russian-to-English translation, we used combination of ?",
        "UMC 0.1 ?",
        "95,540 sentences ?",
        "subtitles ?",
        "1,790,209 sentences ?",
        "Yandex English-Russian parallel corpus 6 ?",
        "1,000,000 sentences ?",
        "wiki headlines from WMT website 7 ?",
        "514,859 sentences ?",
        "common crawl from WMT website ?",
        "878,386 sentences",
        "Added together, Russian-Czech parallel data consisted of 2,566,615 sentences and English-Czech parallel data consisted of 4,275,961 sentences 8.",
        "We also used 765 sentences from UMC003 as a devset for MERT training.",
        "We used the following monolingual corpora to train language models.",
        "Russian:",
        "?",
        "Russian sides of all the parallel data ?",
        "4,275,961 sentences ?",
        "News commentary from WMT website ?",
        "150,217 sentences ?",
        "News crawl 2012 ?",
        "9,789,861 sentences For Czech: ?",
        "Czech sides of all the parallel data ?",
        "2,566,615 sentences ?",
        "Data downloaded from Czech news articles9 ?",
        "1,531,403 sentences ?",
        "WebColl (Spoustov?",
        "et al, 2010) ?",
        "4,053,223 sentences ?",
        "PDT 10 ?",
        "115,844 sentences ?",
        "Complete Czech Wikipedia ?",
        "3,695,172 sentences ?",
        "Sentences scraped from Czech social server okoun.cz ?",
        "580,249 sentences For English: ?",
        "English sides of all the paralel data ?",
        "4,275,961 sentences ?",
        "News commentary from WMT website ?",
        "150,217 sentences",
        "Czech and English data was tokenized and tagged using Mor?e tagger; Russian was tokenized and tagged using TreeTagger.",
        "TreeTagger also does lemmatization; however, we didn't use lemmas for alignment or translation models, since our experiments showed that primitive stemming got better results.",
        "However, what is important to mention is that TreeTagger had problems with some corpora, mostly Common Crawl.",
        "For some reason, Russian TreeTagger has problems with ?dirty?",
        "data?sentences in English, French or random non-unicode noise.",
        "It either slows down significantly or stops working at all.",
        "For this reason, we wrapped TreeTagger in a script that detected those hangs and replaced the erroneous Russian sentences with bogus, one-letter Russian sentences (we can't delete those, since the lines already exist in the opposite languages; but since the pair doesn't really make sense in the first place, it doesn't matter as much).",
        "All the data are lowercased for all the models and we recase the letters only at the very end.",
        "For an unrelated project dealing with movie subtitles translation, we obtained data from OpenSubtitles.org for Czech and English subtitles.",
        "However, those data were not aligned on sentence level and were less structured?we had thousands of .srt files with some sort of metadata.",
        "When exploiting the data from the subtitles, we made several observations: ?",
        "language used in subtitles is very different from the language used in news articles ?",
        "one of the easiest and most accurate sentence alignments in movie subtitles is the one based purely on the time stamps ?",
        "allowing bigger differences in the time stamps in the alignment produced more data, but less accurate ?",
        "the subtitles are terribly out of domain (as experiments with using only the subtitle data showed us), but adding the corpus mined from the subtitles still increases the accuracy of the translation ?",
        "allowing bigger differences in the time stamps and, therefore, more (albeit less accurate) data always led to better results in our tests.",
        "In the end, we decided to pair as much subtitles as possible, even with the risk of some being misaligned, because we found out that this helped the most."
      ]
    },
    {
      "heading": "4.2 Translation model, language model",
      "text": [
        "For alignment, we used primitive stemming that takes just first 6 letters from a word.",
        "We found out that using this ?brute force?",
        "stemming?for reasons that will have to be explored in a further research?return better results than regular lemmatization, for both alignment and translation model, as described further.",
        "For each language pair, we used a translation model with two translation tables, one of them as backoff model.",
        "More exactly, the primary translation is from a form to a combination of (lower case) form and tag, and the secondary backoff translation is from a ?stem?",
        "described above to a combination of (lower case) form and tag.",
        "We built two language models?one for tags and one for lower case forms.",
        "The models were actually a mixed model using interpolate option in SRILM?we trained a different language model for each corpus, and then we mixed the language models using a small development set from UMC003."
      ]
    },
    {
      "heading": "4.3 Final Results",
      "text": [
        "The final results from matrix.statmt.org are in the table Table 8.",
        "You might notice a sharp difference between lowercased and truecased BLEU?that is due to a technical error that we didn't notice before the deadline."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "We have described two independent Moses-based SMT systems we used for the WMT 2013 shared task.",
        "We discussed experiments with large data for many language pairs from the point of view of both the translation accuracy and efficiency."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The work on this project was supported by the grant P406/11/1499 of the Czech Science Foundation (GA?R), and by the grant 639012 of the Grant Agency of Charles University (GAUK)."
      ]
    }
  ]
}
