{
  "info": {
    "authors": [
      "Rolf Backofen",
      "Gert Smolka"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P93-1026",
    "title": "A Complete and Recursive Feature Theory",
    "url": "https://aclweb.org/anthology/P93-1026",
    "year": 1993
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Various feature descriptions are being employed in constrained-based grammar formalisms.",
        "The common notational primitive of these descriptions are functional attributes called features.",
        "The descriptions considered in this paper are the possibly quantified first-order formulae obtained from a signature of features and sorts.",
        "We establish a complete first-order theory FT by means of three axiom schemes and construct three elementarily equivalent models.",
        "One of the models consists of so-called feature graphs, a data structure common in computational linguistics.",
        "The other two models consist of so-called feature trees, a record-like data structure generalizing the trees corresponding to first-order terms.",
        "Our completeness proof exhibits a terminating simplification system deciding validity and satisfiability of possibly quantified feature descriptions."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Feature descriptions provide for the typically partial description of abstract objects by means of functional attributes called features.",
        "They originated in the late seventies with so-called unification grammars [14], a by now popular family of declarative grammar formalisms for the description and processing of natural language.",
        "More recently, the use of feature descriptions in logic programming has been advocated and studied [2, 3, 4, 17, 16].",
        "Essentially, feature descriptions provide a logical version of records, a data structure found in many programming languages.",
        "Feature descriptions have been proposed in various forms with various formalizations [1, 13, 9, 15, 5, 10].",
        "We will follow the logical approach pioneered by [15], which accommodates feature descriptions as standard first-order formulae interpreted in first-order structures.",
        "In this approach, a semantics for *We appreciate discussions with Joachim Niehren and Ralf Treinen who read a draft version of this paper.",
        "The research reported in this paper has been supported by the Bundesminister fiir Forschung und Technologie under contracts ITW 90002 0 (DISCO) and ITW 9105 (Hydra).",
        "For space limitations proofs are omitted; they can be found in the complete paper [6].",
        "feature descriptions can be given by means of a feature theory (i.e., a set of closed feature descriptions having at least one model).",
        "There are two complementary ways of specifying a feature theory: either by explicitly constructing a standard model and taking all sentences valid in it, or by stating axioms and proving their consistency.",
        "Both possibilities are exemplified in [15]: the feature graph algebra F is given as a standard model, and the class of feature algebras is obtained by means of an axiomatization.",
        "Both approaches to fixing a feature theory have their advantages.",
        "The construction of a standard model provides for a clear intuition and yields a complete feature theory (i.e., if 0 is a closed feature description, then either 0 or is valid).",
        "The presentation of a recursively enumerable axiomatization has the advantage that we inherit from predicate logic a sound and complete deduction system for valid feature descriptions.",
        "The ideal case then is to specify a feature theory by both a standard model and a corresponding recursively enumerable axiomatization.",
        "The existence of such a double characterization, however, is by no means obvious since it implies that the feature theory is decidable.",
        "In fact, so far no decidable, consistent and complete feature theory has been known.",
        "In this paper we will establish a complete and decidable feature theory FT by means of three axiom schemes.",
        "We will also construct three models of FT, two consisting of so-called feature trees, and one consisting of so-called feature graphs.",
        "Since FT is complete, all three models are elementarily equivalent (i.e., satisfy exactly the same first-order formulae).",
        "While the feature graph model captures intuitions common in linguistically motivated investigations, the feature tree model provides the connection to the tree constraint systems [8, 11, 12] employed in logic programming.",
        "Our proof of FT's completeness will exhibit a simplification algorithm that computes for every feature description an equivalent solved form from which the solutions of the description can be read of easily.",
        "For a closed feature description the solved form is either T (which means that the description is valid) or I (which means that the description is invalid).",
        "For",
        "a feature description with free variables the solved form is 1 if and only if the description is unsatisfiable."
      ]
    },
    {
      "heading": "1.1 Feature Descriptions",
      "text": [
        "Feature descriptions are first-order formulae built over an alphabet of binary predicate symbols, called features, and an alphabet of unary predicate symbols, called sorts.",
        "There are no function symbols.",
        "In admissible interpretations features must be functional relations, and distinct sorts must be disjoint sets.",
        "This is stated by the first and second axiom scheme of FT: (Axl) VxVyVz(f(x, y) A f(x, z) – + y z) (for every feature f)",
        "(Ax2) Vx(A(x) A B(x) 1) (for every two distinct sorts A and B).",
        "A typical feature description written in matrix notation is",
        "It may be read as saying that x is a woman whose father is an engineer, whose husband is a painter, and whose father and husband are both of the same age.",
        "Written in plain first-order syntax we obtain the less suggestive formula",
        "The axiom schemes (Ax 1) and (Ax2) still admit trivial models where all features and sorts are empty.",
        "The third and final axiom scheme of FT states that certain \"consistent\" descriptions have solutions.",
        "Three Examples of instances of FTs third axiom scheme are",
        "where yf I abbreviates --az(f(y, z)).",
        "Note that the third description f(x , A g(y, x) A h(y, z) A fyi is \"cyclic\" with respect to the variables x and y."
      ]
    },
    {
      "heading": "1.2 Feature Trees",
      "text": [
        "A feature tree (examples are shown in Figure 1) is a tree whose edges are labeled with features, and whose nodes are labeled with sorts.",
        "As one would expect, the labeling with features must be deterministic, that is, the direct subtrees of a feature tree must be uniquely identified by the features of the edges leading to them.",
        "Feature trees can be seen as a mathematical model of records in programming languages.",
        "Feature trees without subtrees model atomic values (e.g., numbers).",
        "Feature trees may be finite or infinite, where infinite feature trees provide for the convenient representation of cyclic data structures.",
        "The last example in Figure 1 gives a finite graph representation of an infinite feature tree, which may arise as the representation of the recursive type equation nat = 0 1 s(nat).",
        "Feature descriptions are interpreted over feature trees as one would expect:",
        "• Every sort symbol A is taken as a unary predicate, where a sort constraint A(x) holds if and only if the root of the tree x is labeled with A.",
        "• Every feature symbol f is taken as a binary predicate, where a feature constraint f(x, y) holds if and only if the tree x has the direct subtree y at feature f.",
        "The theory of the corresponding first-order structure (i.e., the set of all closed formulae valid in this structure) is called FT. We will show that FT is in fact exactly the theory specified by the three axiom schemes outlined above, provided the alphabets of sorts and features are both taken to be infinite.",
        "Hence FT is complete (since it is the theory of the feature tree structure) and decidable (since it is complete and specified by a recursive set of axioms).",
        "Another, elementarily equivalent, model of FT is the substructure of the feature tree structure obtained by admitting only rational feature trees (i.e., finitely branching trees having only finitely many subtrees).",
        "Yet another model of FT can be obtained from so-called feature graphs, which are finite, directed, possibly cyclic graphs labelled with sorts and features similar to feature trees.",
        "In contrast to feature trees, nodes of feature graphs may or may not be labelled with sorts.",
        "Feature graphs correspond to the so-called feature structures commonly found in linguistically motivated investigations [14, 7]."
      ]
    },
    {
      "heading": "1.3 Organization of the Paper",
      "text": [
        "Section 2 recalls the necessary notions and notations from Predicate Logic.",
        "Section 3 defines the theory FT by means of three axiom schemes.",
        "Section 4 establishes the overall structure of the completeness proof by means of a lemma.",
        "Section 5 studies quantifier-free conjunctive formulae, gives a solved form, and introduces path constraints.",
        "Section 6 defines feature trees and graphs and establishes the respective models of FT.",
        "Section 7 studies the properties of so-called prime formulae, which are the basic building stones of the solved form for general feature constraints.",
        "Section 8 presents the quantifier elimination lemmas and completes the completeness proof."
      ]
    },
    {
      "heading": "2 Preliminaries",
      "text": [
        "Throughout this paper we assume a signature SORl-.9 FEA consisting of an infinite set SOR of unary predicate symbols called sorts and an infinite set FEA of binary predicate symbols called features.",
        "For the completeness of our axiomatization it is essential that there are both infinitely many sorts and infinitely many features.The letters A, B, C will always denote sorts, and the letters f, g, h will always denote features.",
        "A path is a word (i.e., a finite, possibly empty sequence) over the set of all features.",
        "The symbol c denotes the empty path, which satisfies ep = p = pc for every path p. A path p is called a prefix of a path q, if there exists a path p' such that pp' = q.",
        "We also assume an infinite alphabet of variables and adopt the convention that x, y, z always denote variables, and X, Y always denote finite, possibly empty sets of variables.",
        "Under our signature SOR LI) FEA, every term is a variable, and an atomic formula is either a feature constraint xfy (f(x,y) in standard notation), a sort constraint Ax (A(x) in standard notation), an equation x y, .1 (\"false\"), or T (\"true\").",
        "Compound formulae are obtained as usual with the connectives A, V, and the quantifiers 3 and V. We use 30 [V0] to denote the existential [universal] closure of a formula 0.",
        "Moreover, V(0) is taken to denote the set of all variables that occur free in a formula 0.",
        "The letters 0 and 0 will always denote formulae.",
        "We assume that the conjunction of formulae is an associative and commutative operation that has T as neutral element.",
        "This means that we identify 0 A (0 AG) with 0 A (0 A 0), and 0 A T with 0 (but not, for example, xfy A xfy with xfy).",
        "A conjunction of atomic formulae can thus be seen as the finite multiset of these formulae, where conjunction is multiset union, and T (the \"empty conjunction\") is the empty multiset.",
        "We will write 0 C 0 (or 0 E 0, if 0 is an atomic formula) if there exists a formula '0' such that 0 A 0/ = 0.",
        "Moreover, we identify 3x3y0 with 3y3x0.",
        "If X = {xi, • • • , xn), we write 3X0 for 3xi ...3xn0.",
        "If X = 0, then 3X0 stands for 0.",
        "Structures and satisfaction of formulae are defined as usual.",
        "A valuation into a structure A is a total function from the set of all variables into the universe lAl of A.",
        "A valuation a' into A is called an x-update [X-update] of a valuation a into A if a' and a agree everywhere but possibly on x [X].",
        "We use 0A to denote the set of all valuations a such that A, a k 0.",
        "We write 0 0 (\"0 entails 0\") if qY C 0A for all structures A, and 4,1=1 (\"0 is equivalent to 0\") if 011 = 0A for all structures A.",
        "A theory is a set of closed formulae.",
        "A model of a theory is a structure that satisfies every formulae of the theory.",
        "A formula 0 is a consequence of a theory T (T 0) if V0 is valid in every model of T. A formula 0 entails a formula 0 in a theory T (4) kT 0) if 0.4 C 0A for every model A of T. Two formulae 0, 0 are equivalent in a theory T (0 HT 0) if 0A = OA for every model A of T. A theory T is complete if for every closed formula 0 either 0 or – .0 is a consequence of T. A theory is decidable if the set of its consequences is decidable.",
        "Since the consequences of a recursively enumerable theory are recursively enumerable (completeness of first-order deduction), a complete theory is decidable if and only if it is recursively enumerable.",
        "Two first-order structures A, B are elementarily equivalent if, for every first-order formula 0, 0 is valid in A if and only if 0 is valid in B.",
        "Note that all models of a complete theory are elementarily equivalent."
      ]
    },
    {
      "heading": "3 The Axioms",
      "text": [
        "The first axiom scheme says that features are functional:",
        "(Axl) VxVyVz(xfy A xf z y z) (for every",
        "feature f).",
        "The second scheme says that sorts are mutually disjoint:",
        "(Ax2) Vx(Ax A Bx 1.)",
        "(for every two distinct sorts A and B).",
        "The third and final axiom scheme will say that certain \"consistent feature descriptions\" are satisfiable.",
        "For its formulation we need the important notion of a solved clause.",
        "An exclusion constraint is an additional atomic formula of the form xtr (\"f undefined on x\") taken to be equivalent to – ay (xfy) (for some variable y x).",
        "A solved clause is a possibly empty conjunction 0 of atomic formulae of the form x fy, Ax and x such that the following conditions are satisfied:",
        "1. no atomic formula occurs twice in 0 2. if Ax E 0 and Bx E 0, then A= B 3. if xfy E 0 and xf z E 0, then y = z 4. if xfy E 0, then xfj ct 0.",
        "Figure 2 gives a graph representation of the solved clause xfu A xgv A xlit A",
        "Av A vgz A vhw A v ft A Bw A wfT A wgi As in the example, a solved clause can always be seen as the graph whose nodes are the variables appearing in the clause and whose arcs are given by the feature constraints xfy.",
        "The constraints Ax, zit appear as labels of the node x.",
        "A variable x is constrained in a solved clause 0 if 0 contains a constraint of the form Ax, xfy or xfi.",
        "We use CV(0) to denote the set of all variables that are constrained in 0.",
        "The variables in V(0) - CV(0) are called the parameters of a solved clause 0.",
        "In the graph representation of a solved clause the parameters appear as leaves that are not not labeled with a sort or a feature exclusion.",
        "The parameters of the solved clause in Figure 2 are y and z.",
        "We can now state the third axiom scheme.",
        "It says that the constrained variables of a solved clause have solutions for all values of the parameters: (Ax3) C.13X0 (for every solved clause 0 and X = CV(0)).",
        "The theory FT is the set of all sentences that can be obtained as instances of the axiom schemes (Axl), (Ax2) and (Ax3).",
        "The theory FT° is the set of all sentences that can be obtained as instances of the first two axiom schemes.",
        "As the main result of this paper we will show that FT is a complete and decidable theory.",
        "By using an adaption of the proof of Theorem 8.3 in [15] one can show that FT0 is undecidable."
      ]
    },
    {
      "heading": "4 Outline of the Completeness Proof",
      "text": [
        "The completeness of FT will be shown by exhibiting a simplification algorithm for FT.",
        "The following lemma gives the overall structure of the algorithm, which is the same as in Maher's [12] completeness proof for the theory of constructor trees.",
        "1. every sort constraint Ax, every feature constraint x fy, and every equation x y such that x y is a prime formula 2.",
        "T is a prime formula, and there is no other closed prime formula 3. for every two prime formulae )3 and )3' one can compute a formula b that is either prime or 1 and satisfies f3 A )3' I=IFT 6 and V(b) C V(/3 A )31) 4. for every prime formula )3 and every variable x one can compute a prime formula )3' such that HFT 13' and V(J3') C V(3x#) 5. if f3, • • • fin are prime formulae, then",
        "Proof.",
        "Suppose a set of prime formulae as required exists.",
        "Let 0 be a formula.",
        "We show by induction on the structure of 0 how to compute a Boolean combination b of prime formulae such that 0 HFT b and",
        "If 0 is an atomic formula Ax, xfy or x y, then cb is either a prime formula, or 0 is a trivial equation x x, in which case it is equivalent to the prime formula T. If 0 is -.0, A 7,/, or 0 V 0', then the claim follows immediately with the induction hypothesis.",
        "It remains to show the claim for 0 = 3x0.",
        "By the induction hypothesis we know that we can compute a Boolean combination 6 of prime formulae such that HFT 111 and V(b) C V(0).",
        "Now b can be transformed to a disjunctive normal form where prime formulae play the role of atomic formulae; that is, 6 is equivalent to cri V ...V an, where every \"clause\" ai is a conjunction of prime and negated prime formulae.",
        "Hence",
        "where all three formulae have exactly the same free variables.",
        "It remains to show that one can compute for every clause o a Boolean combination 6 of prime formulae such that 3xo- 1=IFT 6 and V(6) C V(3xo-).",
        "We distinguish the following cases.",
        "(i) CT = # for some basic formula #.",
        "Then the claim follows by assumption (4).",
        "(ii) CT = n > 0.",
        "Then the claim follows with assumptions (5) and (6).",
        "(iii) a = A1 n> 0.",
        "Then HFT TAA1 73i",
        "and the claim follows with case (ii) since T is a prime formula by assumption (2).",
        "(iv) a = #1 A ... A f3k A .-93 A ... A , k > 1, n > O.",
        "Then we know by assumption (3) that either #1A...A flk 1=IFT or A ... A /3k"
      ]
    },
    {
      "heading": ".HFT 13 for some prime",
      "text": [
        "formula #.",
        "In the former case we choose 6 = and in the latter case the claim follows with case (i) or (ii).",
        "0",
        "Note that, provided a set of prime formulae with the required properties exists, the preceding lemma yields the completeness of FT since every closed formula can be simplified to T or (since T is the only closed prime formula).",
        "In the following we will establish a set of prime formula as required."
      ]
    },
    {
      "heading": "5 Solved Formulae",
      "text": [
        "In this section we introduce a solved form for conjunctions of atomic formulae.",
        "A basic formula is either J. or a possibly empty conjunction of atomic formulae of the form Ax, xfy, and x y.",
        "Note that T is a basic formula since T is the empty conjunction.",
        "Every basic formula 0 1 has a unique decomposition 0 = 4'N A Oa into a possibly empty conjunction ON of equations \"x y\" and a possibly empty conjunction OG of sort constraints \"Ax\" and feature constraints \"n y\".",
        "We call ON the normalizer and and OG the graph of 0.",
        "We say that a basic formula 0 binds x to y if x y E 0 and x occurs only once in 0.",
        "Here it is important to note that we consider equations as directed, that is, assume that x y is different from y x if x y.",
        "We say that 0 eliminates x if 0 binds x to some variable y.",
        "A solved formula is a basic formula 7 1 such that the following conditions are satisfied:",
        "1. an equation x y appears in 7 if and only if 7 eliminates x 2. the graph of 7 is a solved clause.",
        "Note that a solved clause not containing exclusion constraints is a solved formula, and that a solved formula not containing equations is a solved clause.",
        "The letter 7 will always denote a solved formula.",
        "We will see that every basic formula is equivalent in FT0 to either 1 or a solved formula.",
        "Figure 3 shows the so-called basic simplification rules.",
        "With 0[x y] we denote the formula that is obtained from 0 by replacing every occurrence of x with y.",
        "We say that a formula 0 simplifies to a formula 0 by a simplification rule p if / is an instance of p. We say that a basic formula 0 simplifies to a basic formula 0 if either 0 = 0 or 0 simplifies to 0 in finitely many steps each licensed by one of basic simplification rules in Figure 3.",
        "Note that the basic simplification rules (1) and (2) correspond to the first and second axiom scheme, respectively.",
        "Thus they are equivalence transformation with respect to FT0.",
        "The remaining three simplification rules are equivalence transformations in general.",
        "In the quantifier elimination proofs to come it will be convenient to use so-called path constraints, which provide a flexible syntax for atomic formulae closed under conjunction and existential quantification.",
        "We start by defining the denotation of a path.",
        "The interpretations fA , gA of two features f, g in a structure A are binary relations on the universe I.A1 of A; hence their composition fA o gA is again a binary relation on At satisfying a(fA o gA)b <=> 3c E IAI: afAc A cfAb for all a,b E lAl.",
        "Consequently we define the denotation pA of a path p = fi • • fri in a structure A as the composition",
        "where the empty path e is taken to denote the identity relation.",
        "If A is a model of the theory FT0, then every paths denotes a unary partial functionon the universe of A.",
        "Given an element a E pA is thus either undefined on a or leads from a to exactly one b E 1111.",
        "Let p, q be paths, x, y be variables, and A be a sort.",
        "Then path constraints are defined as follows: A, a xpy :<=>.",
        "a(x)pA ct(y) A, akzplyq :.#=> 3a E lAl: a(x) pA a A a(y)qA a A,c Axp 3a E IAI: oz(x)pA aAa E AA.",
        "Note that path constraints xpy generalize feature constraints x f y.",
        "A proper path constraint is a path constraint of the form \"Axp\" or \"xp lyq\" .",
        "Every path constraint can be expressed with the already existing formulae, as can be seen from the following equivalences:",
        "The closure [7] of a solved formula 7 is the closure of the atomic formulae occurring in 7 with respect to the following deduction rules: x y xpy yfz xpz yqz Ay xpy XEX xey xpf z xp lyq Axp • Recall that we assume that equations x y are directed, that is, are ordered pairs of variables.",
        "Hence, xey E [7] and yex [7] if x y E 7.",
        "The closure of a solved clause 6 is defined analogously.",
        "Proposition 5.3 Let 7 be a solved formula.",
        "Then: I. if 71- E [7], then -y",
        "2. xey E [7] iff = y orx=-'yE7 3. x fy E [7] if xfy E 7 or 3z: x z E 7 and zfy E xPfY G [7] if 3z: xpz E [7] and z fy E 5. if p e and xpy,xpz E[y], then y = z 6. it is decidable whether a path constraint is in [Y]"
      ]
    },
    {
      "heading": "6 Feature Trees and Feature Graphs",
      "text": [
        "In this section we establish three models of FT consisting of either feature trees or feature graphs.",
        "Since we will show that FT is a complete theory, all three models are in fact elementarily equivalent.",
        "A tree domain is a nonempty set D C FEA* of paths that is prefix-closed, that is, if pq E D, then p E D. Note that every tree domain contains the empty path.",
        "A feature tree is a partial function a: FEA* SOR whose domain is a tree domain.",
        "The paths in the domain of a feature tree represent the nodes of the tree; the empty path represents its root.",
        "We use Da to denote the domain of a feature tree cr.",
        "A feature tree is called finite [infinite] if its domain is finite [infinite].",
        "The letters cr and r will always denote feature trees.",
        "The subtree pa of a feature tree o at a path p E Dais the feature tree defined by (in relational notation)",
        "A feature tree a is called a subtree of a feature tree r if a is a subtree of r at some path p E Dr, and a direct subtree if p = f for some feature f. A feature tree a is called rational if (1) a has only finitely many subtrees and (2) a is finitely branching (i.e., for every p E Da, the set {pf E Do I f E FEAI is finite).",
        "Note that for every rational feature tree a there exist finitely many features , fr, such that Da C fnr The feature tree structure 'T is the SORW FEA-structure defined as follows:",
        "• the universe of 'T is the set of all feature trees • a E AT if o(e) = A (i.e., cr's root is labeled with A) • (a, r) fT iff f E Da and r= fa (i.e., r is the subtree of a at f).",
        "The rational feature tree structure R is the substructure of T consisting only of the rational feature trees.",
        "Theorem 6.1 The feature tree structures T and 72 are models of the theory FT. A feature pregraph is a pair (x, 7) consisting of a variable x (called the root) and a solved clause 7 not containing exclusion constraints such that, for every variable y occurring in 7, there exists a path p satisfying xpy E [7].",
        "If one deletes the exclusion constraints in Figure 2, one obtains the graphical representation of a feature pregraph whose root is x.",
        "A feature pregraph (x, 7) is called a subpregraph of a feature pregraph (y, 6) if 7 C 6 and x = y or x E V(6).",
        "Note that a feature pregraph has only finitely many subpregraphs.",
        "We say that two feature pregraphs are equivalent if they are equal up to consistent variable renaming.",
        "For instance, (x, xfy A ygx) and (u, ufx A xgu) are equivalent feature pregraphs.",
        "A feature graph is an element of the quotient of the set of all feature pregraphs with respect to equivalence as defined above.",
        "We use (x,7) to denote the feature graph obtained as the equivalence class of the feature pregraph (x,7).",
        "In contrast to feature trees, not every node of a feature graph must carry a sort.",
        "The feature graph structure g is the SOR -19 FEA-structure defined as follows:",
        "• the universe of g is the set of all feature graphs • (x,^y) E AC if Ax E7 • ((x,7), o-) E fQ if there exists a maximal feature subpregraph (y, b) of (x, 7) such that xfy E 7 and a = (y, 6).",
        "Theorem 6.2 The feature graph structure g is a model of the theory FT. Let .7\" be the structure whose domain consists of all feature pregraphs and that is otherwise defined analogous to g. Note that g is in fact the quotient of .r with respect to equivalence of feature pregraphs.",
        "Proposition 6.3 The feature pregraph structure is a model of FT0 but not of FT."
      ]
    },
    {
      "heading": "7 Prime Formulae",
      "text": [
        "We now define a class of prime formulae having the properties required by Lemma 4.1.",
        "The prime formulae will turn out to be solved forms for formulae built from atomic formulae with conjunction and existential quantification.",
        "A prime formula is a formula 3X7 such that",
        "1.",
        "7 is a solved formula 2.",
        "X has no variable in common with the normalizer of 7 3. every x E X can be reached from a free variable, that is, there exists a path constraint ypx E [7] such that y X.",
        "The letter /3 will always denote a prime formula.",
        "Note that T is the only closed prime formula, and that 3X7 is a prime formula if 3x3X7 is a prime formula.",
        "Moreover, every solved formula is a prime formula, and every quantifier-free prime formula is a solved formula.",
        "The definition of prime formulae certainly fulfills the requirements (1) and (2) of Lemma 4.1.",
        "The fulfillment of the requirements (3) and (4) will be shown in this section, and the fulfillment of the requirements (5) and (6) will be shown in the next section.",
        "Proposition 7.1 Let 3X7 be a prime formula, A be a model of FT, and A, a 3X-y.",
        "Then there exists one and only one X-update a' of a such that A, a' 1=7.",
        "The next proposition establishes that prime formulae are closed under existential quantification (property (4) of Lemma 4.1).",
        "The next proposition establishes that prime formulae are closed under consistent conjunction (property (3) of Lemma 4.1).",
        "The closure of a prime formula aX7 is defined as follows:",
        "The proper closure of a prime formula # is defined as follows: [0]* E [0] Iir is a proper path constrain* Proposition 7.6 If 13 is a prime formula and 7r E [P], then 13 k ir (and hence ix We now know that the closure [(3], taken as an infinite conjunction, is entailed by 13.",
        "We are going to show that, conversely, 0 is entailed by certain finite subsets of its closure [3].",
        "An access function for a prime formula /3 = 3X7 is a function that maps every x E V(-y) – X to the rooted path xe, and every x E X to a rooted path x'p such that x'px E [-y] and x' 1;t X.",
        "Note that every prime formula has at least one access function, and that the access function of a prime formula is injective on V(7) (follows from Proposition 5.3 (5)).",
        "The projection of a prime formula )3 = aX7 with respect to an access function @ for )3 is the conjunction of the following proper path constraints:",
        "Obviously, one can compute for every prime formula an access function and hence a projection.",
        "Furthermore, if A is a projection of a prime formula /3, then A taken as a set is a finite subset of the closure [/3].",
        "As a consequence of this proposition one can compute for every prime formula an equivalent quantifier-free conjunction of proper path constraints.",
        "We close this section with a few propositions stating interesting properties of closures of prime formulae.",
        "These propositions will not be used in the proofs to come.",
        "Proposition 7.11 gives us a decision procedure for \"i3 FT )3\" since membership in [)3]* is decidable, A' is finite, and A' can be computed from /3'."
      ]
    },
    {
      "heading": "8 Quantifier Elimination",
      "text": [
        "In this section we show that our prime formulae satisfy the requirements (5) and (6) of Lemma 4.1 and thus obtain the completeness of FT. We start with the definition of the central notion of a joker.",
        "A rooted path xp consists of a variable x and a path p. A rooted path xp is called unfree in a prime formula # if"
      ]
    },
    {
      "heading": "3 prefix p' of p 3 yq: x y and xp' yq E [M",
      "text": [
        "A rooted path is called free in a prime formula )3 if it is not unfree in #.",
        "A proper path constraint r is called an x-joker for a prime formula ,3 if 71 cl [,3] and one of the following conditions is satisfied:",
        "1.",
        "7r = Axp and xp is free in )3 2. w = xpi yq and xp is free in /3 3. ir = ypjzq and xq is free in 13."
      ]
    },
    {
      "heading": "3x,6 kFT Bx(,3 A A",
      "text": [
        "The proof of this lemma uses the third axiom scheme, the existence of infinitely many features, and the existence of infinitely many sorts."
      ]
    }
  ]
}
