{
  "info": {
    "authors": [
      "Hen-Hsen Huang",
      "Chi-Hsin Yu",
      "Tai-Wei Chang",
      "Cong-Kai Lin",
      "Hsin-Hsi Chen"
    ],
    "book": "Linguistic Annotation Workshop",
    "id": "acl-W13-2309",
    "title": "Analyses of the Association between Discourse Relation and Sentiment Polarity with a Chinese Human-Annotated Corpus",
    "url": "https://aclweb.org/anthology/W13-2309",
    "year": 2013
  },
  "references": [
    "acl-C04-1200",
    "acl-C10-2172",
    "acl-D09-1036",
    "acl-J05-2005",
    "acl-L08-1093",
    "acl-N03-1030",
    "acl-P04-1087",
    "acl-P07-1124",
    "acl-P12-1008",
    "acl-W12-1636"
  ],
  "sections": [
    {
      "text": [
        "In this work, we annotate both discourse relation and sentiment information on a moderate-sized Chinese corpus extracted from the ClueWeb09.",
        "Based on the annota-tion, we investigate the association between the relation type and the sentiment polarity in Chinese and interpret the data from various aspects.",
        "Finally, we highlight some language phenomena and give some remarks.",
        "1 Introduction A discourse relation indicates how two arguments (i.e., elementary discourse units) cohere to each other.",
        "Various discourse relations were defined according to different taxonomy (Carlson and Marcu, 2001; Carlson et al., 2002; Prasad et al., 2008).",
        "In the work of the Penn Discourse Treebank 2.0 annotation, Prasad et al. (2008) labeled four grammatical classes of connectives in English, including subordinating conjunctions, coordinating conjunctions, adverbial connectives, and implicit connectives.",
        "Besides, the sense of each connective was also tagged.",
        "They defined three levels of sense hierarchy for the connec-tives.",
        "The four classes on the top level are Tem-poral, Contingency, Comparison, and Expansion.",
        "There are explicit and implicit uses of discourse relations.",
        "An explicit discourse relation indicates the arguments are connected with an overt discourse marker (i.e., connective).",
        "A connective joins two discourse units such as phrases, clauses, or sentences together.",
        "For example, the word however is a common connective that indicates a Comparison relation between two argu-ments.",
        "The sense of a discourse marker denotes how its two arguments cohere.",
        "In other words, a discourse marker presents the relation of its two arguments.",
        "In other cases, discourse marker is absent from an implicit relation.",
        "However, readers can still infer the relation from its argument pair.",
        "To resolve implicit discourse relations, i.e., without the information from discourse markers, is more challenging (Lin et al., 2009; Zhou et al., 2010).",
        "Hutchinson (2004) pointed out the properties of a discourse marker from three dimensions, including polarity, veridicality, and type.",
        "The polarity of a discourse marker indicates the sentiment transition of its two arguments.",
        "Veridi-cality, the second dimension of a discourse marker, specifies whether both the two arguments are true or not.",
        "Type, similar to the sense which is annotated in the PDTB, is the third dimension of a discourse marker.",
        "Our previous work (Huang and Chen, 2012a; Huang and Chen, 2012b) addressed the interaction between the sentiment polarity and the discourse structure in Chinese.",
        "Consider (S1), which consists of three clauses and forms a nested discourse structure shown in Figure 1.",
        "(S1) ???????????????????????????????",
        "(Although the management office tried to make the Yang-mingshan area a more natural environment as the long-term garden of Taipei)???????????????",
        "(but due to the two-day weekend and the improved economic conditions)???????????????????",
        "(the issues of tourist parking, garbage, and other indirect effects become more serious)?",
        "The second and the third clauses form a Contingency relation with a sentiment polarity transition from Positive to Negative.",
        "Furthermore,",
        "polarity p1 of the first clause in the instance (S2) is labeled as Positive, the polarity p2 of the second clause is labeled as Negative, the resulting polarity pw of the whole sentence is also labeled as Negative, and the discourse relation between the two clauses is labeled as Comparison.",
        "(S2) ????????????????????",
        "(Although French brand cars share more than half of the domestic market share)??????????",
        "(but the market share continued to shrink)?",
        "The inter-agreements of p1, p2, pw, and discourse relation among annotators are 0.49, 0.50, 0.47, and 0.41 in Fleiss?",
        "Kappa values, respectively (all are moderate agreement).",
        "The resulting corpus is publicly available on the website of NTU Chinese Discourse Resources1.",
        "4 Results and Discussion To investigate the corpus annotated with discourse relation and sentiment polarity, we firstly give an overview of results with respect to these two types of linguistic phenomena.",
        "And then, the most frequent discourse markers for each class of discourse relations are discussed.",
        "Finally, we reorganize the results to several aspects and discuss the association between discourse relations and sentiment polarities.",
        "4.1 Overview of the annotated corpus The distribution of the discourse relations versus the polarities of whole sentence (pw) is shown in Table 2.",
        "Compared to the distributions of discourse relations in the Penn Discourse Treebank (Prasad et al., 2008) shown in Table 3, the explicit Chinese discourse corpus is more similar to the whole English corpus.",
        "The instances of Expansion form the largest set among four discourse relation classes.",
        "In Chinese, the instances of Expansion are even more.",
        "Temporal is the most infrequent relation which has close frequencies in both corpora.",
        "The different characteristic is the frequency of Comparison relation.",
        "In our Chinese corpus, the frequency of Comparison relation is about half of that in the PDTB.",
        "In Table 2, the symbol ?",
        "is used to highlight the relatively major polarity of each relation.",
        "The symbol ?",
        "is marked when the polarity is the majority (i.e., with a frequency greater than 50%).",
        "Near half (49.11%) of the instances belong to Neutral.",
        "Neutral statements are major in Tem- 1 http://nlg.csie.ntu.edu.tw/ntu-discourse/ poral and Expansion classes.",
        "On the other hand, Comparison is the relation which is most involved in expressing sentiment, negative sentiment in particular.",
        "Contingency is second to Comparison in expressing sentiment.",
        "The distribution of the discourse relations versus (p1, p2), the sentiment polarity transitions between two clauses, is shown in Table 4.",
        "Neutral-Neutral is the most frequent polarity transition in all relations.",
        "More than half of the Temporal instances are Neutral-Neutral.",
        "The reason may be that the Temporal relations are usually used in the sentences that describe the objective facts of the past, present, or the future.",
        "In such sentences, the sentiments are relatively rare.",
        "On the other hand, the sentences of Comparison and Contingency occur more in the critical and analytical scenarios.",
        "Although the most frequent transition of Comparison is also Neutral-Neutral (23.14%), the other three types of transitions, Positive-Negative, Neutral-Negative, and Negative-Positive, have close frequencies of 22.71%, 16.90%, and 15.72%, respectively.",
        "Moreover, Negative polarity is involved in all these three transitions in one of their clauses.",
        "The relations between p1, p2, and pw are also interesting.",
        "Table 5 shows the top 10 most frequent correlations of the polarities (p1, p2, pw) of the first clause, the second clause, and the whole sentence.",
        "On the one hand, it is not surprising that most instances belong to (Neutral, Neutral, Neutral).",
        "On the other hand, it is worthy of noting that p2 and pw are identical in the top eight types of combinations in Table 5.",
        "In other words, the resulting sentiment polarity of a two-clause sentence is mostly consistent with the polarity of Relation # % Neu (%) Pos (%) Neg (%) Temporal 849 11.12 ?60.66 22.38 16.96 Contingency 1,598 20.92 ?44.74 26.97 28.29 Comparison 929 12.16 33.37 27.88 ?38.75 Expansion 4,262 55.80 ?51.88 31.75 16.38 Overall 7,638 100.00 ?49.11 29.24 21.65 Table 2: Distribution of discourse relations vs. polarities of whole sentences.",
        "Relation Only Explicit Cases Total # % # % Temporal 3,612 18.88 4,650 12.71 Contingency 3,581 18.72 8,042 21.98 Comparison 5,516 28.83 8,394 22.94 Expansion 6,424 33.58 15,506 42.38 Overall 19,133 100.00 36,592 100.00 Table 3: Distribution of discourse relations in the Penn Discourse TreeBank 2.0.",
        "PDTB Class # Distribution of each type of sentiment polarity transition (p1, p2) (%) Neu Neu Pos Neu Neg Neu Neu Pos Pos Pos Neg Pos Neu Neg Pos Neg Neg Neg Temporal 849 ?57.01 1.53 2.12 16.37 3.53 2.36 12.72 1.06 3.30 Contingency 1,598 ?35.42 3.69 5.88 13.70 10.45 2.32 11.64 1.81 15.08 Comparison 929 ?23.14 2.69 2.48 8.61 3.12 15.72 16.90 22.71 4.63 Expansion 4,262 ?48.33 2.86 1.92 14.24 16.19 0.59 7.86 0.63 7.37 Overall 7,638 ?43.53 2.87 2.84 13.68 11.99 2.99 10.29 3.61 8.20 Table 4: Distribution of discourse relations vs. types of sentiment transitions.",
        "p1 p2 pw Occurrences Neutral Neutral Neutral 3,268 Neutral Positive Positive 945 Positive Positive Positive 908 Neutral Negative Negative 706 Negative Negative Negative 614 Positive Negative Negative 204 Negative Positive Positive 199 Negative Neutral Neutral 125 Positive Neutral Positive 121 Neutral Positive Neutral 99 Table 5: Most frequent (p1, p2, pw) combinations.",
        "p1 = pw p1 ?",
        "pw Total p2 = pw 62.71% 29.79% 92.50% p2 ?",
        "pw 5.51% 1.99% 7.50% Total 68.22% 31.78% 100.00% Table 6: Correlations between (p1,pw) and (p2,pw).",
        "the second clause.",
        "Table 6 shows the correlations of sentiment polarities between clauses and the whole sentence.",
        "Total 92.50% of instances belong to the case (p2 = pw), where the polarity of the second clause is identical to the polarity of the whole sentence.",
        "In Chinese writing, putting the important part of a sentence at the end of the sentence is very common.",
        "4.2 Frequent discourse markers The top discourse markers in our Chinese corpus are shown in Table 7.",
        "For each PDTB class, the five most frequent discourse markers are listed.",
        "In each row of the table, its number of occurrences and the distribution of its nine sentiment polarity transitions are given.",
        "Note that there are three polarities, i.e., positive, neutral, and nega-tive.",
        "The relatively major sentiment polarity transition of each discourser maker is labeled with the symbol ?.",
        "The symbol ?",
        "is marked when the sentiment polarity is the majority, i.e., its ratio is greater than 50%.",
        "Some discourse markers are the top markers in more than one discourse relation such as ?",
        "(also) and ?",
        "(still).",
        "In the discourse marker dictionary, the word ?",
        "(also) is defined as a discourse marker of the Expansion relation.",
        "However, this word is frequent in the instances of all the four relations.",
        "In different relations, the distributions of the sentiment transitions of this word differ.",
        "In other words, the word ?",
        "(also), which is a common word in Chinese, is not only used as a discourse marker for emphasizing the Expansion relation, but also has various senses in other us-ages.",
        "For instance, the word ?",
        "in (S3) is a discourse marker to denote an Expansion relation, but it is a particle in (S4).",
        "In fact, (S4) is an instance of the implicit Contingency relation.",
        "We ignore all of instances of the word ?",
        "(also) in the following analysis since it is an outlier.",
        "(S3) ???????????",
        "(This is an affirmation of our work)??????????????",
        "(and also our encouragement and mo-tivation)?",
        "(S4) ???????",
        "(The mind cannot be open to forward progress)????????",
        "(the world becomes narrow)?",
        "The word ?",
        "(still) is another ambiguous discourse marker.",
        "Besides the Expansion relation defined in the dictionary, it is sometimes used to denote the Temporal relation, especially in the negation context, e.g., ??",
        "(not yet).",
        "The two frequent discourse markers of the Contingency relation, ??",
        "(due to) and ??",
        "(because) share the similar sense, and their distributions of sentiment polarity transitions are more consistent than the other markers of the Contingency relation.",
        "The most frequent discourse marker of the Comparison class is ?",
        "(but).",
        "The other two discourse markers ?",
        "(but) and ??",
        "(but) share the similar sense, however, their polarity distributions differ significantly.",
        "Compared to the more general marker ?",
        "(but), the second frequent marker ?",
        "(but) is bolder and more critical.",
        "(S5) is an example of the marker ?",
        "(but).",
        "As shown in our data, the marker ?",
        "(but) is likely to highlight the negative sentences.",
        "significantly dependent on the sentiment polarities of the arguments at p=0.001.",
        "In the aspect of Polarity Tendency, the ratios of Neutral in the Temporal and Expansion relations are 57.01% and 48.33%, respectively, which are definitely higher than those of Contingency and Comparison relations.",
        "In other words, the two arguments of Contingency and Comparison relations are less likely to be neutral.",
        "The ratio of Negative-Tendency of the Comparison relation is 46.72%.",
        "It confirms the Comparison relation is likely to be involved in negative statements.",
        "As shown in Table 8, three of the five significant discourse markers of Negative-Tendency are the synonyms of ?",
        "(but), which are discourse markers of the Comparison rela-tion.",
        "The other two markers, ??",
        "(otherwise) and ?",
        "(because), are discourse markers of the Contingency relation.",
        "Like the word otherwise in English, ??",
        "(otherwise) is used for introducing what bad scenario will happen if something is not done.",
        "The marker ?",
        "(because) is not only a significant discourse marker of the category Negative-Tendency, but also a significant marker of Negative-Negative from the aspect of Negativ-ity.",
        "From the real data, we find this marker is often used in bad cause-and-effect statements.",
        "(S6) is an example.",
        "The usage of the other discourse marker ??",
        "(because), which is a synonyms of ?",
        "(because), is more general.",
        "(S6) ?????????",
        "(Because the towel is without sunlight for a long time)??????????",
        "(it is easy to breed bacteria and fungi)?",
        "The ratio of Opposite of Comparison relation from the aspect of Polarity Change is 38.43%.",
        "Although it is not as high as expected, it is the highest among the four PDTB classes and much higher than those of three other classes.",
        "Com-pared to the other classes, Comparison is most likely to have a pair of opposite arguments.",
        "Four of the five significant discourse markers of Opposite in Table 8 are the synonyms of ?",
        "(but).",
        "Expansion relation has the highest ratio of NonOpposite.",
        "This matches our expectation that the Expansion relation is used to concatenate several events which have similar properties Aspect Transition Category Sentiment polarity transitions Explanation Significant Discourse Markers Polarity Tendency Positive-Tendency Pos-Neu, Neu-Pos, Pos-Pos, Neg-Pos The two arguments present an overall positive polarity.",
        "??",
        "...?",
        "(not only... also), ??",
        "(finally) , ?...?",
        "(now that... ), ??",
        "...?",
        "(as long as... ), ??",
        "(recently) Neutral Neu-Neu Both arguments are neutral.",
        "??",
        "(and then), ??",
        "(hence) , ??",
        "(at the end), ?",
        "(so) , ??",
        "(as well as) Negative-Tendency Pos-Neg, Neg-Neu, Neu-Neg, Neg-Neg The two arguments present an overall negative polarity.",
        "??",
        "(otherwise), ?",
        "(but), ??",
        "(but), ??",
        "(but), ?",
        "(because) Polarity Change Opposite Neg-Pos, Pos-Neg The polarities of both arguments are opposite.",
        "??",
        "(but), ??...?",
        "(although...) , ?",
        "(but), ?",
        "(but), ??",
        "(but) NonOpposite Neu-Neu, Pos-Neu, Neg-Neu, Neu-Pos, Pos-Pos, Neu-Neg, Neg-Neg The polarities of both arguments are not opposite.",
        "?",
        "(or), ?",
        "(as), ??",
        "(moreover), ??...?",
        "(if ... may), ??",
        "(say) Direction To-Positive Neg-Neu, Neg-Pos, Neu-Pos The second argument is less negative than the first one.",
        "?",
        "?",
        "(finally), ?",
        "?",
        "... ?",
        "(although...) , ??",
        "(recently), ??",
        "...?",
        "(as long as...) , ??",
        "(seem...) Equal Neg-Neg, Neu-Neu, Pos-Pos Both arguments are the same polarity value.",
        "??...?",
        "(Not only... even), ??",
        "(at the end), ??",
        "(in addition), ?",
        "(so), ?...?",
        "(now that...) To-Negative Pos-Neu, Pos-Neg, Neu-Neg The second argument is less positive than the first one.",
        "?",
        "(but), ??",
        "(but), ??",
        "(but), ??",
        "(otherwise), ??...?",
        "(even if...) Negativity NonNegative- NonNegative Neu-Neu, Neu-Pos, Pos-Neu, Pos-Pos Both arguments are not negative.",
        "??",
        "(as well as), ??",
        "(in the future), ??",
        "(in order to), ??",
        "(in addition), ??",
        "(and then) NonNegative- Negative Neu-Neg, Pos-Neg The first argument is not negative while the second argument is negative.",
        "?",
        "(but), ??",
        "(otherwise), ??",
        "(but), ??...?",
        "(even if...), ??",
        "(but) Negative-NonNegative Neg-Neu, Neg-Pos The first argument is negative while the second argument is not negative.",
        "??...?",
        "(although...), ??",
        "(but), ??",
        "(but), ??",
        "(finally), ?",
        "(but) Negative-Negative Neg-Neg Both arguments are negative.",
        "??",
        "(even), ?",
        "(but), ?",
        "(because), ??...?",
        "(if... may), ??",
        "(but)"
      ]
    }
  ]
}
