{
  "info": {
    "authors": [
      "Timm Lichte",
      "Laura Kallmeyer"
    ],
    "book": "International Workshop on Tree Adjoining Grammar and Related Formalisms",
    "id": "acl-W06-1511",
    "title": "Licensing German Negative Polarity Items in LTAG",
    "url": "https://aclweb.org/anthology/W06-1511",
    "year": 2006
  },
  "references": [
    "acl-C88-2147",
    "acl-W06-1510"
  ],
  "sections": [
    {
      "text": [
        "Abstract (2) a. Er hates nicht wahrhaben wollen he has it not accept to be true want Our paper aims at capturing the distribution of negative polarity items (NPIs) within lexicalized Tree Adjoining Grammar (LTAG).",
        "The condition under which an NPI can occur in a sentence is for it to be in the scope of a negation with no quantifiers scopally intervening.",
        "We model this restriction within a recent framework for LTAG semantics based on semantic unification.",
        "The proposed analysis provides features that signal the presence of a negation in the semantics and that specify its scope.",
        "We extend our analysis to modelling the interaction of NPI licensing and neg raising constructions."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": []
    },
    {
      "heading": "1.1 Negative Polarity Items",
      "text": [
        "NPIs are distributionally restricted to linguistic environments that exhibit a trigger for negativity (see e.g., Ladusaw, 1980; Linebarger, 1987; Zwarts, 1997).",
        "More precisely, NPIs seek to be placed within the scope of a negative operator at the level of semantics.",
        "We say that the NPI has to be licensed by an exponent of negativity, the licenser.",
        "Examples in German can be found in (1)–(5) (the NPI is underlined while the licenser is in bold face).",
        "(1) a. Hans war nicht sonderlich zufrieden mit Hans was not very happy with seiner Arbeit his work",
        "b.",
        "*Hans war sonderlich zufrieden mit seiner Arbeit (‘He did not want to accept it to be true’) b.",
        "*Er hates wahrhaben wollen.",
        "(3) a. Es schert ihn nicht it bothers him not (‘He does not give a damn about it’) b.",
        "*Es schert ihn.",
        "(4) a.",
        "Du brauchst diese B¨ucher nicht zu lesen you need these books not to read (‘You need not read these books’) b.",
        "*Du brauchst diese B¨ucher zu lesen.",
        "(5) a. Niemand hat auch nur einen Cent",
        "nobody has even one cent gespendet.",
        "donated (‘Nobody has donated any cent at all.’) b.",
        "*Auch nur einen Cent hat niemand gespendet.",
        "We will mainly be concerned with verbal NPIs such as wahrhaben wollen (‘accept to be true’) and scheren (‘to give a damn about’).",
        "Another group of NPIs we will pay closer attention to are minimizers, here exemplified by auch nur ein Cent (‘any Cent at all’).",
        "They are quantifiers denoting the bottom line of a scale and therefore show affinity with negation due to pragmatic reasons.",
        "Furthermore, minimizers as quantifiers are subject to particular position restrictions with respect to negation (see next section).",
        "A group of NPIs we will leave aside in this paper, however, is that of adjectival NPIs such as sonderlich (‘very’)."
      ]
    },
    {
      "heading": "1.2 NPI Licensers",
      "text": [
        "Various items and constructions can license NPIs.",
        "Besides the more obvious ones such as not, nobody and never, also (among others) few, re",
        "strictors of universal quantifiers, conditional ante-cendents and questions can license at least some of the NPIs.",
        "There has been much controversy about what the characterizing logical property of licensers is.",
        "One proposal is based on the notion of downward entailment (DE, Ladusaw, 1980), which holds for operators whose truth value is persistent over specification.",
        "While the DE property can be found in most of the licensers, there are some, such as questions, where it is hard to detect (see van der Wouden, 1997 for an overview).1 In our proposal we don’t make use of DE as an NPI licensing criterion.",
        "Instead we only require the negation operator (-,) in the semantic representation as licensing feature.",
        "We thereby restrict ourselves to triggers of ‘classic’ negation; we go even further and only implement non-contrastive negation.",
        "We use this term after Jacobs (1982) where non-contrastive negation (NCN) and contrastive negation (CN) are examined for German.",
        "They differ in that sentences with CN can be extended by a but-phrase (Sondern-Phrase) while adding a but-phrase to sentences with NCN gives odd results.",
        "Put differently, CN focuses on parts of a sentence while NCN does not.2 Whether CN or NCN is available, is indicated by intonation and position of the negative element.",
        "However, ambiguous indications are possible.",
        "In our analysis, we leave aside intonation and stick to unambiguous NCN as far as possible."
      ]
    },
    {
      "heading": "1.3 Semantic Scope and Range of Licensing",
      "text": [
        "It is not sufficient for an NPI to just co-occur with a licenser in the same sentence; it has to be in the licenser’s scope.",
        "Furthermore, additional constraints have been proposed in the literature.",
        "One of the most extensively discussed requires the NPI to be c-commanded by the licenser on surface structure (c-command constraint, Ladusaw, 1980).",
        "As Hoeksema (2000) points out, the c-command constraint is too restrictive when applied to languages with a considerably freer word order than English, e.g. Dutch and German (see (4) for an example that does not respect the c-command constraint).",
        "He also points out that the need for the c-command constraint only arises",
        "from capturing the distribution of minimizers.",
        "All other NPIs obey a simple scope constraint in terms of Linebarger’s immediate scope constraint (ISC, Linebarger, 1980; Linebarger, 1987), namely that no other propositional operators (i.e. “logical elements” that are capable of entering into scope ambiguities) may intervene between the licenser and the NPI on LF.",
        "While the ISC seems to hold for quantifiers, quantificational adverbs and operators that conjoin propositions such as because, there are in fact some operators that may scopally intervene.",
        "Among them are non-quantificational adverbs, minimizers and modals, as in (6):",
        "(6) Peter hat keinen Finger r¨uhren m¨ussen.",
        "Peter has no finger move must (‘Peter didn’t need to lift a finger.’) In (6), the negation always has wide scope with respect to the modal m¨ussen (must), hence m¨ussen intervenes between negation and NPI, but still the sentence is grammatical.",
        "Thus, our criterion for an NPI to be licensed is",
        "1. to be in the scope of a negation that is semantically interpreted in the same finite clause, and 2. not to allow regular quantifiers to scopally intervene between negation and NPI.",
        "In this paper, we will also refer to these criterions as immediate scope.3 Minimizers seem to add a third criterion, namely that the licenser has to syntactically c-command the minimizer.",
        "Independently from the ISC, one has to keep in mind that negative elements in German are able to cancel each other out, that is to constitute double negation.",
        "We will come back to this briefly in section 3."
      ]
    },
    {
      "heading": "1.4 Neg Raising Constructions",
      "text": [
        "We extend our analysis to so-called neg raising (NR, cf. Horn, 1978) constructions because there are interesting interactions between NPI licensing and neg raising.",
        "An example of a NR-verb is glauben (‘believe’) in (7).",
        "(7) Hans glaubt nicht, dass Peter kommt.",
        "Hans believes not that Peter comes (‘Hans does not believe that Peter is coming.’) The negation can either take scope at its surface position, i.e., scope over glauben, or it can scope within the embedded sentence.",
        "Hence, two interpretations are generally available: (a) -,believe(p) and (b) believe(p).",
        "The second reading is possible only with NR-verbs.",
        "In LTAG, lexical material is generated at its surface structure position, there is no movement outside the lexicon.",
        "Therefore it is natural to assume with respect to sentences as (7), that the negation is syntactically generated in the matrix clause and that neg raising attitude verbs such as glauben allow for semantic lowering of an attached negation.",
        "This negation then receives wide scope within the sentential complement.",
        "In this, we follow the HPSG analysis proposed in Sailer (to appear).",
        "The presence of an NPI in the embedded sentence as in (8) forces the negation to scope under the bridge verb, that is the (b)-interpretation is chosen.",
        "(8) Hans glaubt nicht, dass Peter Hans believes not that Peter sonderlich gl¨ucklich sein wird.",
        "very happy be will (‘Hans does not believe that Peter will be very happy.’)"
      ]
    },
    {
      "heading": "2 The LTAG Semantics Framework",
      "text": [
        "We use the Kallmeyer and Romero (2005) framework for semantics.",
        "Each elementary tree is linked to a semantic representation containing Ty2 terms and scope constraints.",
        "Ty2 terms are typed A-terms providing individuals and situations as basic types.",
        "The terms can be labeled, and they can contain meta-variables.",
        "The scope constraints are subordination constraints of the form x > y (‘y is a component of x’) with x and y being either propositional labels or propositional meta-variables.",
        "The semantic representations are equipped with feature structure descriptions.",
        "Semantic computation is done on the derivation tree and consists of certain feature value equations between mother and daughter nodes of edges in the derivation tree.",
        "The meta-variables from the semantic representations can occur in the feature structure descriptions.",
        "In this case they can receive values following from the feature value equations performed on the derivation tree.",
        "As an example see Fig. 1 showing the derivation tree for (9) with semantic representations and semantic feature structure descriptions as node labels.",
        "(9) John always laughs",
        "The additional feature equations in this example are depicted with dotted links.",
        "They arise from top-bottom feature identifications parallel to the unifications performed in FTAG (Vijay-Shanker and Joshi, 1988) and from identifications of global features.",
        "They yield 1 = x and 4 = l1.",
        "Applying these identities to the semantic representations after having built their union leads to (10).",
        "The constraint 3 > l1 states that l1 : laugh(x) is a component of 3.",
        "We assume a scope window for quantifiers specifying an upper boundary MAXS (‘maximal scope’) and a lower boundary MINS (‘minimal scope’) for the nuclear scope.",
        "In this we follow Kallmeyer and Romero (2005).",
        "In addition, however, we make use of the feature MINP (‘minimal proposition’).",
        "In their analysis, which was developed for English, MINS and MINP are the same, in other words, there is no separate MINP feature.",
        "In German, the minimal scope of a quantifier seems to depend not only on the verb the quantifier attaches to but also on other factors (see Kallmeyer",
        "and Romero, 2006 in this volume for the influence of word order on quantifier scope in German).",
        "This justifies the assumption that German MINS if different from English MINS.",
        "The scope order is of course such that MAXS is higher than MINS which is in turn higher than MINP.",
        "In order to deal with NPI-licensing we introduce three new features: a global and a local NEG-feature and the global feature N-SCOPE.",
        "Not surprisingly, the latter represents the scope of a negative operator, while the former is needed to check the presence of a negative operator.",
        "The next section offers detailed examples."
      ]
    },
    {
      "heading": "3 The Analysis of Licensers",
      "text": [
        "In this section we give the elementary trees for non-contrastive nicht (not) and niemand (nobody).",
        "A strong trigger for NCN is nicht attached to the verb.",
        "Based on the topological field theory for German the attachment takes place at the right satzklammer, a position that together with the left satzklammer contains the verbal expression.4 As an example see the derivation for (11) in Fig. 2.",
        "(11) Peter ruft Hans nicht an",
        "Peter calls Hans not PART (‘Peter does not call Hans’) Similar to Gerdes (2002), the VP nodes carry features VF (‘Vorfeld’), LK (‘Linke Satzklammer’), MF (‘Mittelfeld’), and RK (‘Rechte Satzklammer’) for the topological fields.",
        "In German, the vorfeld, the position preceding the left satzklammer, must be filled by exactly one constituent.",
        "We guarantee this with the feature VF: The different VF features at the highest VP node in the tree for ruft an make sure that adjunction to the vorfeld is obligatory.",
        "At the same time, elements adjoining to any of the topological fields (see the tree for Peter) have a foot node feature VF = – and have equal top and bottom features VF at their root.",
        "When",
        "adjoining to the vorfeld, these receive values +.",
        "Consequently, further adjunctions of similar elements at the new root node are not possible.",
        "An adjunction at the foot node of the auxiliary tree of the vorfeld element can be excluded by some other feature.",
        "This guarantees that exactly one element gets adjoined into the vorfeld.",
        "Note that we consider the base position of the subject NP being in the mittelfeld and consider the subject as being moved into the vorfeld.",
        "Alternatively, any other element could be moved in to the vorfeld instead.",
        "The semantic combination of nicht and ruft an is shown in Fig. 3.",
        "The MINP feature from ruft indicates the proposition contributed by the verb which is the minimal proposition of the whole elementary tree.",
        "It is included in the scope of all operators (quantifiers, negation, modals, ...) attaching to this verb (An exception is of course neg raising where the scope of the negation does not include the MINP value of the NR-verb.).",
        "The unifications between the two feature structures in Fig. 3 are depicted with dotted lines.",
        "They yield in particular 9 = 7, therefore, with constraint 7 > l1, l1 is in the scope of the negation.",
        "The presence of a negation is indicated by a global NEG = yes.",
        "In case there is no negation, we have to make sure we obtain NEG = no and not just an unspecified NEG value.",
        "Therefore, the VP spine is articulated with non-global NEG features that switch from no to yes once a negation occurs.",
        "Here this is the case at node position V, consequently 6 = 5 = 4 = 3 = yes.",
        "The topmost",
        "NEG then becomes the global NEG.",
        "Cases of double negation, though not considered here, could be captured by assuming that each negation on the verbal spine makes the value of the local NEG feature switch (from no to yes or, if there was already negation, from yes to no).",
        "This way, double negation would lead to a global NEG feature with value no.",
        "The negative quantifier niemand has the distribution of an NP.",
        "The elementary trees in Fig. 4 for niemand reflect the V-, reading which is preferred by an analysis assuming that the NPI must be in the scope of a negation with no quantifiers intervening.",
        "The features NEG, MINP and N-SCOPE work in the same way as in the case of nicht.",
        "The global I feature linked to the initial tree with the trace passes the argument variable to the verb.",
        "Note that this is an analysis for the case where niemand is ‘moved’.",
        "If niemand is in base position, the lexical item comes with an initial tree that is substituted at the corresponding NP slot.",
        "However, since the NEG-feature can only be switched to yes by adjoining an auxiliary tree carrying negation to a VP node, even in these cases we need an additional VP auxiliary tree contributing the sentential negation.5"
      ]
    },
    {
      "heading": "4 The Analysis of NPIs",
      "text": [
        "For this paper we restrict ourselves to verbal NPIs and minimizers.",
        "As an example for a verbal NPI consider scheren (‘to give a damn about sth.’) in (3).",
        "Its lexical entry is shown in Fig. 5.",
        "As in the case of ruft, the verbal spine is articulated with the NEG feature.",
        "Furthermore, GLOBAL contains the requirement of a negation (NEG = yes).",
        "In particular, the topmost NEG feature on the verbal spine is yes while the value of the lowest NEG feature is no.",
        "This means that at some point on the verbal spine a negation must be added that switches the value from no to yes.",
        "Concerning the scope relation between NPI and negation, the following should hold: 1. the NPI must be in the scope of the negation, and 2. quantifiers must not intervene between negation and NPI.",
        "The first condition is guaranteed with constraint 9 > l1.",
        "In order to capture the second restriction, the distinction between MINS and MINP allows us to draw a border line between the domain where quantifiers can take scope and the domain where the negation and the NPI are positioned.",
        "Other scope taking operators (modals, adverbs, ... ) are not concerned by this limit.",
        "This border line is the MINS value, and the crucial NPI-specific constraint is 8 > 9 stating that the negation must",
        "must have wide scope with respect to the sentence containing the minimizer, such as in NR constructions.",
        "Consider the minimizer auch nur einen Cent (‘any cent at all’) in example (5) and its proposed lexical entry in Fig. 7. ǫ scope under the minimal scope of all quantifiers.",
        "The scope relations then can be summarised as in Fig. 6.",
        "As mentioned in 1.3 minimizers show a more restrictive distribution than verbal NPIs.",
        "In addition to the two licensing conditions of verbal NPIs stated above minimizers also obey a third licensing condition in German: the negation must precede the minimizer in the same clause or the negation",
        "We propose a multicomponent lexical entry for minimizers here, since they have to access the semantic feature structure of the VP spine, and therefore have to be adjoined.",
        "This is different from verbal NPIs (that are part of the VP spine by definition), but similar to the negative quantifier niemand.",
        "As for verbal NPIs the presence of a negation is ensured by the global NEG feature, that is required to be yes.",
        "The scope condition is satisfied by the constraints 4 > l1 and 5 > 4: the former one ensures that the semantic contribution of auch nur einen Cent is part of N-SCOPE, while the latter one prohibits any intervening regular quantifier (by requiring N-SCOPE to be a subexpression of MINS).6 In order to meet the third condition we have to make sure that the negation appears somewhere to the left of the minimizer.",
        "In other words, the negation is not attached between the right satzklammer and the minimizer, but somewhere else (as ensured by the global NEG feature).",
        "Remember that the position of a negation is signaled by the local NEG feature on the VP spine and its switch from no to yes.",
        "One way to exploit this is to let the minimizer semantically specify the VP node to which",
        "it can be attached.",
        "This is accomplished by the VP f feature in the lexical entry for auch nur einen Cent, where the local NEG is required to be no, while the global NEG is yes.",
        "Thereby it is guaranteed that somewhere between the position where the adjunction of the minimizer takes place and the maximal projection of the VP the NEG feature has to switch to yes with the aid of a negative item."
      ]
    },
    {
      "heading": "5 The Analysis of Neg Raising",
      "text": [
        "Now let us turn to the neg raising examples from section 1.4.",
        "Attitude verbs that optionally offer neg raising are mapped onto two lexical entries representing a non-NR- and a NR-reading.",
        "In the latter, the negation takes wide scope within the embedded clause.",
        "In other words, quantifiers cannot scopally intervene between the embedding verb and the negation.",
        "This is exemplified in (12).",
        "(12) Peter glaubt nicht, dass jeder seiner Peter believes not that each of his Freunde kommen wird.",
        "friends come will.",
        "(‘Peter does not believe that each of his friends will come’) The NR-reading (believes(p, • • • -, • • •) does not exclude that Peter believes that some of his friends will come.",
        "A reading where Peter believes that none of his friends will come is not available.",
        "In other words, the quantifier has to scope under the negation.",
        "The lexical entry for glaubt with the NR-reading is shown in Fig. 8.",
        "In the syntax we assume a substitution node for the sentential complement.",
        "Long-distance dependencies are then analysed with multicomponents.",
        "This choice was motivated because in German, taking into account scrambling, more movement-based word order variations are possible than in English.",
        "For these we need multicomponents anyway (see the elementary tree set for niemand), and then sentential complements might be treated in parallel.",
        "The S substitution node carries a syntactic feature NR indicating that this is a neg raising construction.",
        "The lowering of the negation is expressed as follows: the N-SCOPE of glaubt (variable 7), i.e., the scope of the attaching negation, does not contain the MINP of glaubt as in non-NR readings.",
        "Instead, it contains the MAXS (variable 9) of the embedded sentence (constraint 7 > 9).",
        "This MAXS is usually contained in the propositional argument",
        "of believe (see Kallmeyer and Romero, 2005); in this special neg raising entry we even require the N-SCOPE to be contained in this argument (constraint 8 > 7).",
        "The MAXS feature 9 marks the upper limit for the scope of all quantifiers occurring inside the embedded clause.",
        "Consequently, wide scope of the lowered negation with respect to the embedded sentence is ensured.",
        "The lexical entry for glaubt with NR-reading also has to make sure that a negative element is attached to its verbal spine.",
        "In this respect its semantic feature structure resembles the one of a verbal NPI, that is the NEG value has to be switched to yes by adjunction.",
        "However, semantically the negation is interpreted in the embedded sentence and NPIs cannot be licensed in the matrix clause.",
        "Therefore, the value of the global NEG feature is no.",
        "The complementizer of the embedded clause takes care of setting the value of the embedded global NEG to yes by identifying the NEG feature of its S node with the topmost NEG feature on the",
        "verbal spine of the embedded clause.",
        "In a non-NRreading, the complementizer only passes the NEG value upwards, i.e., the global NEG of the embedded clause specifies whether a negation is present in the embedded clause.",
        "With this analysis, if a NR-verb embeds an NPI as in (8), the NPI requires the NR-reading; otherwise the global NEG feature of the embedded clause is no.",
        "Next, we want to give an example derivation of a sentence that contains an unlicensed NPI and which amounts to contradicting scope constraints.",
        "It concerns the following sentence: (13) *Hans glaubt nicht, dass es jeden Hans believes not, that it everybody schert.",
        "bothers (‘Hans doesn’t believe that everybody gives a damn about it.’) The NPI schert is not licensed due to the intervening quantifier jeden (every).",
        "The defective dervation of (13) is shown in Fig. 10.",
        "Syntactically, the S leaf of the Hans glaubt nicht tree is substituted by the dass es schert tree and the jeder tree is substituted into the dass es schert tree.",
        "This works fine.",
        "In the semantic representation, however, we observe a clash of the scope constraints.",
        "Remember that we analyse the verbal NPI schert as requiring immediate scope, that is MINS > N-SCOPE.",
        "On the other side, the NR-verb glauben demands the negation to have wide scope with respect to the embedded sentence, hence N-SCOPE > MAXS (constraint l2 > 3) .",
        "If we put these two constraints together we obtain the constraint MINS = MAXS, which means that the area where quantifiers take scope (the MAXS-MINS window) is empty and hence there cannot be any quantifiers.",
        "A quantifer such as jeden is then ruled out due to two semantic constraints it contributes: its semantic content is a subexpression of MAXS (constraint 3 > l3) and MINS is a subexpression of its nuclear scope (constraint 6 > l2).",
        "However, this can only hold if MINS 7� MAXS which is not true for (13) as has been shown.",
        "Figure 10: Defective derivation tree for Hans glaubt nicht, dass es jeden schert"
      ]
    },
    {
      "heading": "6 Conclusion and further research",
      "text": [
        "We propose an LTAG analysis of the distribution of German NPIs.",
        "The crucial criterion for an NPI is the requirement to be in the scope of a negation that is semantically in the same finite clause such that no quantifier can scopally intervene between negation and NPI.",
        "Technically we achieved this using the features NEG and N-SCOPE, that signal the presence of a negation and make its immediate scope available for the NPI.",
        "7 The specific constraints for quantifiers when occurring with",
        "NPI licensing negations are obtained by a distinction between the feature MINS characterizing the lower boundary of quantifier scope and the minimal proposition contributed by a verb that characterizes the lower boundary for the scope of negations.",
        "We think LTAG is particularly well suited to describe this phenomenon since the relation between licenser and licensee can be localized within single elementary trees.",
        "The only exception are neg raising constructions where the licensing property needs to be passed down to the embedded clause.",
        "This is not non-local either and can be easily modelled in LTAG.",
        "This shows that LTAG’s extended domain of locality has advantages not only for syntax (see Kroch, 1987) but also for semantics.",
        "The analyses discussed in this paper have demonstrated the usefulness of semantic feature structure descriptions that specify the combination possibilities of semantic representations and that are separated from the semantic representations themselves.",
        "On the one hand the semantic features encode the contributions of the semantic representations to functional applications.",
        "I.e., they state which elments are contributed as possible arguments for other semantic expressions and which arguments need to be filled.",
        "They thereby simulate lambda abstraction and functional application.",
        "On the other hand they also serve to model the scopal behaviour of different operators and to capture the different boundaries for scope.",
        "The combination of LTAG’s extended domain of locality with a semantics using feature structure unification enables us to capture these constraints within a mildly context-sensitive framework: The structures underlying the computation of syntax and semantics are the context-free derivation trees.",
        "One line of further research we want to pursue is an extension of the proposed analysis to adjectival and adverbial NPIs.",
        "We already started working on this.",
        "But for reasons of space we left this out in this paper."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "For many inspiring discussions of the topics treated in this paper, we are grateful to our colleagues Wolfgang Maier, Frank Richter, Manfred 8 In the HPSG analysis from Soehn (2006) for example, where we do not have an extended domain of locality, one has to specify explicitely that the licenser of an NPI must be found within the next complete clause containing the NPI.",
        "Sailer and Jan-Philipp S¨ohn.",
        "Furthermore, the paper benefitted a lot from the useful comments of three anonymous reviewers."
      ]
    }
  ]
}
