{
  "info": {
    "authors": [
      "Lotfi A. Zadeh"
    ],
    "book": "International Conference on Computational Linguistics and Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P84-1064",
    "title": "A Computational Theory of Dispositions",
    "url": "https://aclweb.org/anthology/P84-1064",
    "year": 1984
  },
  "references": [
    "acl-C82-1068"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "Informally, a disposition is a proposition which is preponderantly, but no necessarily always, true.",
        "For example, birds can fly is a disposition, as are the propositions Swedes are blond and Spaniards are dark.",
        "An idea which underlies the theory described in this paper is that a disposition may be viewed as a proposition with implicit fuzzy quantifiers which are approximations to all and always, e.g., almost all, almost always, moat, frequently, etc.",
        "For example, birds can fly may be interpreted as the result of supressing the fuzzy quantifier most in the proposition most birds can fly.",
        "Similarly, young men like young women may be read as most young men like mostly young women.",
        "The process of transforming a disposition into a proposition is referred to as explicit ation or restoration.",
        "Explicitation sets the stage for representing the meaning of a proposition through the use of test-score semantics (Zadeh, 1978, 1982).",
        "In this approach to semantics, the meaning of a proposition, p, is represented as a procedure which tests, scores and aggregates the elastic constraints which are induced by p. The paper closes with a description of an approach to reasoning with dispositions which is based on the concept of a fuzzy syllogism.",
        "Syllogistic reasoning with dispositions has an important bearing on commonsense reasoning as well as on the management of uncertainty in expert systems.",
        "As a simple application of the techniques described in this paper, we formulate a definition of typicality -- a concept which plays an important role in human cognition and is of relevance to default reasoning."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Informally, a disposition is a proposition which is preponderantly, but not necessarily always, true.",
        "Simple examples of dispositions are: Smoking is addictive, exercise is good for your health, long sentences are more difficult to parse than short sentences, overeating causes obesity, Trudi is always right, etc.",
        "Dispositions play a central role in human reasoning, since much of human knowledge and, especially, commonsense knowledge, may be viewed as a collection of dispositions.",
        "The concept of a disposition gives rise to a number of related concepts among which is the concept of a diapoaitional predicate.",
        "Familiar examples of unary predicates of this type are: Healthy, honest, optimist, safe, etc., with binary dispositional predicates exemplified by: taller than in Swede, are taller than Frenchmen, like in Italians are like Spaniards, like in young men like young women, and smokes in Ron smokes cigarette,.",
        "Another related concept is that of a dispositional command (or imperative) which is exemplified by proceed with caution, avoid overexertion, keep under refrigeration, be frank, etc.",
        "To Professor Nancy Cartwright.",
        "Research supported in part by NASA Grant NCC2-275 and NSF Grant IST-8320416.",
        "The basic idea underlying the approach described in this paper is that a disposition may be viewed as a proposition with suppressed, or, more generally, implicit fuzzy quantifiers such as moat almost all, almost always, usually, rarely, much of the time, etc'''.",
        "To illustrate, the disposition overating causes obesity may be viewed as the result of suppression of the fuzzy quantifier most in the proposition most of those who overeat are obese.",
        "Similarly, the disposition young men like young women may be interpreted as most young men like mostly young women.",
        "It should be stressed, however, that restoration (or explicitation)-- viewed as the inverse of suppression – is an interpretation-dependent process in the sense that, in general, a disposition may be interpreted in different ways depending on the manner in which the fuzzy quantifiers are restored and defined.",
        "The implicit presence of fuzzy quantifiers stands in the way of representing the meaning of dispositional concepts through the use of conventional methods based on truth-conditional, possible-world or model-theoretic semantics (Cresswell, 1973; McCawley, 1981; Miller and Johnson-Laird, 1974).--in the computational approach which is described in this paper, a fuzzy quantifier is manipulated as a fuzzy number.",
        "This idea serves two purposes.",
        "First, it provides a basis for representing the meaning of dispositions; and second, it opens a way of reasoning with dispositions through the use of a collection of syllogisms.",
        "This aspect of the concept of a disposition is of relevance to default reasoning and non-monotonic logic (McCarthy, 1980; McDermott and Doyle, 1980; McDermott, 1982; Reiter, 1983).",
        "To illustrate the manner in which fuzzy quantifiers may be manipulated as fuzzy numbers, assume that, after restoration, two dispositions di and d2 may be expressed as propositions of the form",
        "in which Qi and Q2 are fuzzy quantifiers, and A, B and C are fuzzy predicates.",
        "For example, A",
        "By treating pi and p2 as the major and minor premises in a syltogism, the following chaining syllogism may be established if B C A (Zadeh, 1983): I.",
        "In the literature of linguistics, logic and philosophy of languages, fuzzy quantifiers are usually referred to as vague or generalized quantifiers (Barwise and Cooper, 1981; Peterson, 1979).",
        "In the approach described in this paper, a fuzzy quantifier is interpreted as a fuzzy number which provides an approximate characterization of absolute or relative cardinality.",
        "in which (21 0 Q2 represents the product of the fuzzy numbers Q1 and Q2 (Figure 1).",
        "and >(Qi C3) Q2) should be read as \"at least Q1 0 Q2.\" As shown in Figure 1, Q1 and Q2 are defined by their respective possibility distributions, which means that if the value of Q1 at the point u is a, then a represents the possibility that the proportion of A's in B' is u.",
        "In the special case where Pt and p2 are expressed by (1.3), the chaining syllogism yields most students are undergraduates most undergraduates are young most2 students are young where moat2 represents the product of the fuzzy number with itself (Figure 2)."
      ]
    },
    {
      "heading": "Proportion",
      "text": []
    },
    {
      "heading": "2. Meaning Representation and Test-Score Semantics",
      "text": [
        "To represent the meaning of a disposition, d, vie employ a two-stage process.",
        "First, the suppressed fuzzy quantifiers in d are restored, resulting in a fuzzily quantified proposition p. Then, the meaning of p is represented -- through the use of test-score semantics (Zadeh, 1978, 1982) – as a procedure which acts on a collection of relations in an explanatory database and returns a test score which represents the degree of compatibility of p with the database.",
        "In effect, this implies that p may be viewed as a collection of elastic constraints which are tested, scored and aggregated by the meaning-representation procedure.",
        "In test-score semantics, these elastic constraints play a role which is analogous to that truth-conditions in truth-conditional semantics (Cresswell, 1973).",
        "As a simple illustration, consider the familiar example d snow is white which we interpret as a disposition whose intended meaning is the proposition p usually snow is white .",
        "To represent the meaning of p, we assume that the explanatory database, EDF (Zadeh, 1982), consists of the following relations whose meaning is presumed to be known"
      ]
    },
    {
      "heading": "EDF WHITE [Sample;p] + USUALLYIProportion;p] ,",
      "text": [
        "in which + should be read as and.",
        "The ith row in WHITE is a tuple (S„r,), I = 1,...,m, in which S, is the ith sample of snow, and r, is is the degree to which the color of S, matches white.",
        "Thus, r, may be interpreted as the test score for the constraint on the color of S, induced by the elastic constraint WHITE.",
        "Similarly, the relation USUALLY may be interpreted as an elastic constraint on the variable Proportion, with n representing the test score associated with a numerical value of Proportion.",
        "The steps in the procedure which represents the meaning of p may be described as follows:",
        "1.",
        "Find the proportion of samples whose color is white:",
        "More generally, to represent the meaning of a disposition it is necessary to define the cardinality of a fuzzy set.",
        "Specifically, if A is a subset of a finite universe of discourse U (ui,...,u„), then the sigma-count of A is defined as ECount(A ) = E,pit(u,) , (2.1) in which pA(u,), i == 1,...,n, is the grade of membership of u, in A (Zadeh, 1983a), and it is understood that the sum may be rounded, if need be, to the nearest integer.",
        "Furthermore, one may stipulate that the terms whose grade of membership falls below a specified threshold be excluded from the summation.",
        "The purpose of such an exclusion is to avoid a situation in which a large number of terms with low grades of membership become count-equivalent to a small number of terms with high membership.",
        "The relative sigma-count, denoted by ECount(BIA ), may be interpreted as the proportion of elements of B in A.",
        "More explicitly,",
        "where B n A, the intersection of B and A, is defined by in which the proportion is expressed as the arithmetic average of the test scores.",
        "2.",
        "Compute the degree to which p satisfies the straint induced by USUALLY: most r USUALLY(Proportion p] in which r is the overall test score, i.e., the degree of compatibility of p with ED, and the notation [X == a] means: Set the variable X in the relation R equal to a and read the value of the variable",
        "where A denotes the min operator in infix form.",
        "Thus, in terms of the membership functions of B and A, the relative sigma-count of B and A is given by",
        "As an illustration, consider the disposition d overating causes obesity which after restoration is assumed to read2 p most of those who overeat are obese To represent the meaning of p, we shall employ an explanatory database whose constituent relations are:",
        "The relation POPULATION is a list of names of individuals, with the variables Overeat and Obese representing, respectively, the degrees to which Name overeats and is obese.",
        "In MOST, p is the degree to which a numerical value of Proportion fits the intended meaning of MOST.",
        "To test procedure which represents the meaning of p involves the following steps.",
        "1.",
        "Let Name„ i =-- 1,...,m, be the name of ith indivi",
        "dual in POPULATION.",
        "For each Name„ find the degrees to which Name, overeats and is obese:",
        "2.",
        "Compute the relative sigma-count of OBESE in OVEREAT: p 1 ECount(OBESEI OVEREAT) – A S' 3.",
        "Compute the test score for the constraint induced by MOST: r =-- ,,MOST[Proportion =-- p] .",
        "This test score represents the compatibility of p with the explanatory database."
      ]
    },
    {
      "heading": "3. The Scope of a Fuzzy Quantifier",
      "text": [
        "In dealing with the conventional quantifiers all and some in first-order logic, the scope of a quantifier plays an essential role in defining its meaning.",
        "In the case of a fuzzy quantifier which is characterized by a relative sigma-count, what matters is the identity of the sets which enter into the relative count.",
        "Thus, if the sigma-count is of the form ECount(BIA ), which should be read as the proportion of B' a in A ' s, then B and A will be referred to as the n-set (with n standing for numerator) and b-set (with b standing for base), respectively.",
        "The ordered pair {n-set, b-set}, then, may be viewed as a generalization of the concept of the scope of a quantifier.",
        "Note, however, that, in this sense, the scope of a fuzzy quantifier is a semantic rather than syntactic concept.",
        "As a simple illustration, consider the proposition p 1 most students are undergraduates.",
        "In this case, the n-set of most is undergraduates, the b-set is students, and the scope of most is the pair (undergraduates, students).",
        "2.",
        "It should be understood that (2.5) is just one of many possible interpretations of (2.4), with no implicat;on that is constitutes a prescriptive interpretation of causality.",
        "See Suppes (1970).",
        "As an additional illustration of the interaction between scope and meaning, consider the disposition d I young men like young women .",
        "(3.1) Among the possible interpretations of this disposition, we shall focus our attention on the following (the symbol rd denotes a restoration of a disposition): rd, I most young men like most young women rd2 I most young men like mostly young women .",
        "To place in evidence the difference between rd, and rd2, it is expedient to express them in the form rd, == most young men P1 rd2 == most young men P2 where P1 and P2 are the fuzzy predicates P, A likes most young women and",
        "with the understanding that, for grammatical correctness, likes in P1 and P2 should be replaced by like when P1 and P2 act as constituents of rd, and rd2.",
        "In more explicit terms, P, and P2 may be expressed as",
        "in which Name is the name of a male person and p is the degree to which the person in question satisfies the predicate.",
        "(Equivalently, p is the grade of membership of the person in the fuzzy set which represents the denotation or, equivalently, the extension of the predicate.)",
        "To represent the meaning of P1 and P2 through the use of test-score semantics, we assume that the explanatory database consists of the following relations (Zadeh, 19836):",
        "In LIKE, p is the degree to which Narnel likes Name2 and in YOUNG, p is the degree to which a person whose age is Age is young.",
        "First, we shall represent the meaning of P, by the following test procedure.",
        "1.",
        "Divide POPULATION into the population of males, M.POPULATION, and the population of females,",
        "where w POPUL A T 10 N denotes the projection of POPULATION on the attributes Name and Age.",
        "2.",
        "For each Narnej,j 1.....L, in F.POPULATION, find the age of Name,: A, I Age F.POPULATION[Name=--Name,1 .",
        "3.",
        "For each Name,, find the degree to which Name, is young: ai A a YOUNGEAge=--Aij ,",
        "where ai may be interpreted as the grade of",
        "membership of Namei in the fuzzy set, YW, of young women.",
        "4.",
        "For each Name„ ,=1,...,K, in M.POPULATION, find the age of Namei: B1 4-4 Age M.POPULATIONIName=Natne,) .",
        "5.",
        "For each Namei, find the degree to which Name; likes Name,:",
        "with the understanding that /3,, may be interpreted as the grade of membership of Name, in the fuzzy set, 111„ of women whom Name, likes.",
        "8.",
        "For each Name, find the degree to which Name, likes Name, and Name, is young: A",
        "= a, A O., • Note: As in previous examples, we employ the aggregation operator min ( A ) to represent the meaning of conjunction.",
        "In effect, -4, is the grade of membership of Name, in the intersection of the fuzzy sets WL, and YW.",
        "7.",
        "Compute the relative sigma-count of women whom Name, likes among young women:",
        "8.",
        "Compute the test score for the constraint induced by MOST: r, p MOST [Proportion = (3.5)",
        "This test-score way be interpreted as the degree to which Name, satisfies P1, i.e., r, --= p P1 [Name= Named The test procedure described above represents the meaning of P1.",
        "In effect, it tests the constraint expressed by the proposition"
      ]
    },
    {
      "heading": "ECount(YW I WL,) is MOST",
      "text": [
        "and implies that the n-set and the b-set for the quantifier moat in P, are given by:",
        "By contrast, in the case of P2, the identities of the n-set and the b-set are interchanged, i.e.,"
      ]
    },
    {
      "heading": "n-set YW",
      "text": [
        "and"
      ]
    },
    {
      "heading": "ECount(YW I WL,) is MOST .",
      "text": [
        "Thus, whereas the scope of the quantifier most in P, is { WL„ YW), the scope of mostly in P2 is {YW,WL,).",
        "Having represented the meaning of P, and P2, it becomes a simple matter to represent the meaning of rd, and rd2.",
        "Taking rdi, for example, we have to add the following steps to the test procedure which defines P1.",
        "9.",
        "For each Name„ find the degree to which Name, is young: b, A ,YOUNG[Age = ,",
        "where b, may be interpreted as the grade of membership of Name, in the fuzzy set, YM, of young men.",
        "10.",
        "Compute the relative sigma-count of men who have property P, among young men:",
        "The test score expressed by (3.6) represents the overall test score for the disposition d A young men like young women if d is interpreted as rdi.",
        "If d is interpreted as rd2, which is a more likely interpretation, then the procedure is unchanged except that r, in (3.5) should be replaced by r, ,,MOST[Proportion where"
      ]
    },
    {
      "heading": "4. Representation of Dispositional Commands and Concepts",
      "text": [
        "The approach described in the preceding sections can be applied not only to the representation of the meaning of dispositions and dispositional predicates, but, more generally, to various types of semantic entities as well as dispositional concepts.",
        "As an illustration of its application to the representation of the meaning of dispositional commands, consider de A stay away from bald men , (4.1) whose explicit representation will be assumed to be the command"
      ]
    },
    {
      "heading": "e A stay away from most bald men . (4.2)",
      "text": [
        "The meaning of c is defined by its compliance criterion (Zadeh, 1982) or, equivalently, its propositional content (Searle, 1979), which may be expressed as cc A staying away from most bald men .",
        "To represent the meaning of cc through the use of test-score semantics, we shall employ the explanatory database",
        "The relation RECORD may be interpreted as a diary kept during the period of interest -- in which Name is the name of a man; pfiald is the degree to which he is bald; and Action describes whether the man in question was stayed away from (Action=--1) or not (Action=0).",
        "The test procedure which defines the meaning of dc may be described as follows:",
        "The computed test score expressed by (4.4) represents the degree of compliance with c, while the procedure which leads to r represents the meaning of dc.",
        "The concept of dispositionality applies not only to semantic entities such as propositions, predicates, commands, etc., but, more generally, to concepts and their definitions.",
        "As an illustration, we shall consider the concept of typicality -- a concept which plays a basic role in human reasoning, especially in default reasoning IReiter, 1983), concept formation (Smith and Media, 1981), and pattern recognition (Zadeh, 1977).",
        "Let U be a universe of discourse and let A be a fuzzy set in A (e.g., U cars and A station wagons).",
        "The definition of a typical element of A may be expressed in verbal terms as follows:",
        "t is a typical element of A if and only if (4.5) (a) t has a high grade of membership in A, and (b) most elements of A are similar to t.",
        "It should be remarked that this definition should be viewed as a dispositional definition, that is, as a definition which may fail, in some cases, to reflect our intuitive perception of the meaning of typicality.",
        "To put the verbal definition expressed by (4.5) into a more precise form, we can employ test-score semantics to represent the meaning of (a) and (b).",
        "Specifically, let S be a similarity relation defined on U which associates with each element u in U the degree to which u is similar to t .",
        "Furthermore, let S(t) be the similarity clasa of t, i.e., the fuzzy set of elements of U which are similar to t. What this means is that the grade of membership of u in 5(t) is equal to ps(t,u), the degree to which u is similar to t (Zadeh, 1971).",
        "Let HIGH denote the fuzzy subset of the unit interval which is the extension of the fuzzy predicate high.",
        "Then, the verbal definition (4.5) may be expressed more precisely in the form:",
        "t is a typical element of A if and only if (4.6) 3.",
        "For consistency with the definition of A, S must be such that if u and u' have a high degree of similarity, then their grades of membership in A should be close in magnitude.",
        "(a) pA(t)is HIGH (b) ECount(S(t)1 A)is MOST.",
        "The fuzzy predicate high may be characterized by its membership function pHiGH or, equivalently, as the fuzzy rela-ton HIGH [Grade; pl, in which Grade is a number in the interval [0,1] and A is the degree to which the value of Grade fits the intended meaning of high.",
        "An important implication of this definition is that typicality is a matter of degree.",
        "Thus, it follows at once from (4.6) that the degree, r, to which t is typical or, equivalently, the grade of membership of t in the fuzzy set of typical elements of A, is given by",
        "In terms of the membership functions of HIGH, MOST,S and A, (4.7) may be written as",
        "where piaci!, pmosT, ps and pA are the membership functions of HIGH, MOST, S and A, respectively, and the summation E„ extends over the elements of U.",
        "It is of interest to observe that if pA(t) = 1 and Ps(t,u)= /Wu), (4.9) that is, the grade of membership of u in A is equal to the degree of similarity of u to t, then the degree of typicality of t is unity.",
        "This is reminiscent of definitions of prototypicality (Rosch, 1978) in which the grade of membership of an object in a category is assumed to be inversely related to its \"distance\" from the prototype.",
        "In a definition of prototypicality which we gave in Zadeh (1982), a prototype is interpreted as a so-called -summary.",
        "In relation to the definition of typicality expressed by (4.5), we may say tbat a prototype is a a summary of typical elements of A .",
        "In this sense, a prototype is not, in general, an element of U whereas a typical element of A is, by definition, an element of U.",
        "As a simple illustration of this difference, assume that U is a collection of movies, and A is the fuzzy set of Western movies.",
        "A prototype of A is a summary of the summaries (i.e., plots) of Western movies, and thus is not a movie.",
        "A typical Western movie, on the other hand, is a movie and thus is an element of U."
      ]
    },
    {
      "heading": "5. Fuzzy Syllogisms",
      "text": [
        "A concept which plays an essential role in reasoning with dispositions is that of a fuzzy syllogism (Zadeh, I983c).",
        "As a general inference schema, a fuzzy syllogism may be expressed in the form",
        "where Q1 and Q2 are given fuzzy quantifiers, Q3 is fuzzy quantifier which is to be determined, and A, B, C, D, E and F are interrelated fuzzy predicates.",
        "In what follows, we shall present a brief discussion of two basic types of fuzzy syllogisms.",
        "A more detailed description of these and other fuzzy syllogisms may be found in Zadeh (1983c, 1984).",
        "The intersection/product syllogism may be viewed as an instance of (5.1) in which",
        "and Qg = Q1 0 Q2, i.e., Q3 is the product of Qi and Q2 in fuzzy arithmetic.",
        "Thus, we have as the statement of the syllogism:",
        "where Q is a fuzzy number (or interval) defined by the inequalities oe(Q1 9 Q291) < Q < Qie Q2 , (51) where 9 , 9 0 and 9 are the operations of addition, subtraction, min and max in fuzzy arithmetic.",
        "As a simple illustration, consider the dispositions di 41 students arc young",
        "Then, applying the consequent conjunction syllogism to pi and P2' we can infer that Q students are single and young where 2 mostel < Q < most .",
        "(5.8) Thus, from the dispositions in question we can infer the disposition d students are single and young on the understanding that the implicit fuzzy quantifier in d is expressed by (5.8).",
        "8.",
        "Negation of Dispositions In dealing with dispositions, it is natural to raise the question: What happens when a disposition is acted upon with an operator, T, where T might be the operation of negation, active-to-passive transformation, etc.",
        "More generally, the same question may be asked when T is an operator which is defined on pairs or n-tuples of dispositions.",
        "As an illustration, we shall focus our attention on the operation of negation.",
        "More specifically, the question which we shall consider briefly is the following: Given a disposition, d, what can be said about the negaton of d, not (1?",
        "For example, what can be said about not (birds can fly) or not (young men like young women).",
        "For simplicity, assume that, after restoration, d may be expressed in the form rd Q A's are B's (6.1) Then, not d = not (Q A ' 8 are B' s) .",
        "(6.2) Now, using the semantic equivalence established in Zadeh (1978), we may write",
        "where not Q is the complement of the fuzzy quantifier Q in the sense that the membership function of not Q is given by pfloi 9(u) =-- 1-p9(u) ,0 < u < 1 .",
        "(6.4) Furthermore, the following inference rule can readily be established (Zadeh, 1983a): > (ant Q) A a are not B's"
      ]
    },
    {
      "heading": "Q A's are B's (6.5)",
      "text": [
        "where ant Q denotes the antonym of Q, defined by pant9(u)= p9(1-u), 0 < u < 1 , (6.8) On combining (6.3) and (6.5), we are led to the following result:",
        "As an illustration, if d birds can fly and Q most, then (8.8) yields not (birds can fly) (ant (not most)) birds cannot fly .",
        "(8.9) It should be observed that if Q is an approximation to all, then ant(not Q) is an approximation to some.",
        "For the right-hand member of (8.9) to be a disposition, most must be",
        "an approximation to at least a half.",
        "In this case ant (not most) will be an approximation to most, and consequently the right-hand member of (8.9) may be expressed -- upon the suppression of most -- as the disposition birds cannot fly."
      ]
    },
    {
      "heading": "REFERENCES AND RELATED PUBLICATIONS",
      "text": []
    }
  ]
}
