{
  "info": {
    "authors": [
      "Paul Piwek"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-2088",
    "title": "A Formal Semantics for Generating and Editing Plurals",
    "url": "https://aclweb.org/anthology/C00-2088",
    "year": 2000
  },
  "references": [
    "acl-W98-0608"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present a formal semantics for an object-oriented formalism which allows for the representation of plural objects (such as 'Three N', 'Most of the N', 'Some N',...).",
        "The semantics is given in terms of a mapping to a variant of Discourse Representation Theory.",
        "It is motivated by its suitability for natural language generation and interactive editing of the representations."
      ]
    },
    {
      "heading": "I Introduction",
      "text": [
        "A natural language generator typically generates a noun phrase from a representation consisting of an object with one or more attributes (cf. Reiter & Dale, 2000).",
        "Usually this representation is supplemented with information concerning the context in which the noun phrase has to be realized (e.g., the set of distractors, whether the object is in focus, etc.).",
        "For instance, the EPICURE system (Dale, 1992) deals with reference to plural objects by having the following three attributes on physical objects: structure, whose value can he either a set or individual, cardinatity which in case of a set records the numbers of elements which the set has, and constituents which in case of a set contains the elements of the set.",
        "Our proposal is intended to extend the representations proposed in (Dale, 1992).1 Most importantly, we replace the attribute cardinality with the more general attribute quota (for quantifier) whose value is a quantifier such as 'most', 'few', '5', `< 6' (at most 6), etc.",
        "Furthermore, we introduce the new attribute part_of which takes as a value an object of which the object in question is a part.2 I Note that we are dealing with the generation of plurals from (logically) structured data as opposed to raw data as in, e.g., Stone (1999).",
        "2 We use the mereological 'part of relation as an alternative to 'subset' For details, see the next section.",
        "The object-oriented (00) formalism in which we implement the aforementioned attributes is an extension of standard 00 formalisms.",
        "It is known as Scoped Semantic Networks (SSN; Ribble et al., 1999; Power, 1999).3 An SSN consists of a network of objects together with a mapping of these objects to a set of logical contexts.",
        "This makes it possible to represent universal quantification, implication, negation and other logical operators.",
        "In particular, Power (1999) shows how an SSN can be mapped into a Discourse Representation Structure (ons; Kamp & Reyle, 1993), thus providing a formal semantic interpretation of SSNS.",
        "In this paper, we provide a mapping of ssNs with plural objects to an adapted version of Discourse Representation Theory (DRT).",
        "The mapping is provided to obtain formal truth conditions for the SSNS.",
        "Such a mapping provides us with a mathematically precise characterization of the information which is represented by a SSN in terms of its truth-conditions.",
        "This is useful if we want to automatically manipulate the information which is represented by means of an SSN.",
        "For example, we can formally define whether some piece of information is already implicit in some other piece of information; in other words, we can define a notion of logical consequence.",
        "Related to this is the possibility to use the semantics in order to test the consistency of the information conveyed by an SSN.",
        "For that purpose, we can do so-called model checking: an SSN is consistent if we can construct a model –that is, a logically possible state of the world– in which the SSN is true according to our truth-conditional semantics.",
        "We do not provide a direct formal semantics for SSN, but rather map it to a more convenient logical formalism, i.e., DRT.",
        "The main reason for this approach is that phenomena which we will be modelling in this paper, i.e. (plural) reference and",
        "anaphora, have been studied extensively within DRT (see, e.g., Kamp & Reyle, 1993; Krahmer & Van Deemter, 1998; Piwek, 1997).",
        "Furthermore, we believe that the adaptation of DRT that we propose is of interest in its own right.",
        "The mapping which we provide from SSNS with plural objects to DRSs requires some modifications to standard DRT with plurals (Kamp & Reyle, 1993: Chapter 4).",
        "For networks with only singular objects, there is a straightforward mapping of the objects in a network to the discourse referents which populate a DRS.",
        "Things are different for networks with plural objects.",
        "Consider: (1) Susan has found most books which Bill needs.",
        "The DRS for this sentence is: Intuitively, the meaning of this condition is that: Pr most y which satisfy the conditions to the left of the diamond, it holds that they also satisfy the condition on the right.",
        "Note, that the representation contains no plural discourse referent corresponding to the NP `most books which Bill needs'.",
        "The 'y' in this representation is a referent for singular individuals.",
        "This might make one wonder how it is possible in standard DRT to refer back to plural individuals as in: (3) Susan has found most books which Bill needs.",
        "They were on her desk.",
        "For this purpose, there is a so-called abstraction operation (Kamp & Reyle, 1993:313) with which we can obtain a discourse referent for the set of books which Bill needs and Susan found.",
        "In more technical terms, the set is obtained by the summation of the values which 'y' can take.",
        "Thus there is no direct way of mapping a plural object in a semantic network (which represent the interpretation of an NP) to a plural discourse referent in the corresponding DRS.",
        "For this reason we have chosen to adapt the DRT formalism, so that plural noun phrases do directly correlate with plural discourse referents.",
        "We now proceed as follows.",
        "In Section 2, we specify the mapping from ssNs to our version of DRT.",
        "In the next section (Section 3), we describe an application which uses the ssNs with plurals.",
        "We finish this paper with a conclusions section (Section 4).",
        "2 From SSNs to DRSs In this section, we provide a mapping from ssNs into discourse representation structures (DRSs) with plurals.",
        "We start out by specifying the target of the mapping, i.e., plural DRT.",
        "DRSs with Plurals Following Kamp & Reyle (1993), we treat singular objects and sets of objects as entities of the same kind.",
        "Both are considered to be individuals: atomic and non-atomic individuals, respectively.",
        "Thus, the model theory follows the models which Link (1983) provides for count nouns.",
        "The idea is that the denotation of an NP which contains a count noun can be uniquely subdivided into atomic parts (as opposed to the denotata of mass nouns).",
        "The domain for NPs is structured by a part-whole relation which satisfies the axioms of upper semilattices (for background information on these lattices see Kamp & Reyle, 1993:398-406).",
        "In formal terms, a model is defined as follows: A model 111 is a quintuple (11, E, Pred, Quant, Name) which consist of:",
        "(I) A domain of individuals with the structure of a complete, free, atomic upper semilattice Ll = (U, c) with zero; (II) A domain of eventualities with the structure of a complete, free, atomic upper semilattice E = (E, C); (III) A function Pred mapping predicates P to their extensions in AI, such that",
        "(III.1) for the relations representing thematic roles, such as agent and patient, Pred assigns a set of tuples (e, a), where c E E and a e U.",
        "(III.2) for eventuality predicates, Pred(P) C E. (III.3) For object type predicates, Pred(P) C U.",
        "(IV) A function uant mapping determiners DET to their corresponding interpretations, i.e., a set consisting of tuples (a, b) (where a, b E U).",
        "(V) A function Name mapping constants to members of U.",
        "In particular, the constants Cp, where P is a predicate are mapped to (DPred(P), i.e., the supremum, also known as the sum, of the interpretation of P.",
        "Notice that in our models there are separate domains for objects and eventualities (i.e., states and events).",
        "The relations agent and patient have an eventuality as their first argument and an object as second argument (cf. Parsons, 1990).",
        "agent(e,o) is to be interpreted as: object a is the agent of eventuality e. Furthermore, there are predicates applying to eventualities and others applying to objects.",
        "For our purposes, the most interesting part of the definition is the function (bald which maps determiners to their respective interpretations.",
        "We take the interpretation of a determiner to be a set of tuples, where each tuple consist of a pair of (plural) individuals.",
        "For instance, take the determiner 'most'.",
        "Quant maps it to the following interpretation:5",
        "(4) Quant(Most) = {(r, c) :r C e & r is a non-atomic entity of M & Irl >",
        "Thus 'most' corresponds to the set of all tuples of individuals, such that the first individual is a non-atomic part of the second one and the cardinality of the first is greater than or equal to the cardinality of the second divided by two.",
        "Henceforth, we will call the second individual the context individual (cf. Westerstahl, 1985).",
        "Given a noun phrase, such as 'most birds', the first individual is intended as the interpretation of the entire noun phrase whereas the second individual plays the role of the context against which the noun phrase is interpreted.",
        "The context individual can be restricted by extralinguistic circumstances (e.g., the situation in which a noun phrase is produced) and by linguistic means (as in 'most of the birds on the beach', where 'the birds on the beach' supplies the contextual individual).",
        "Let us focus on the pits condition which is interpreted in the models in terms of Quant.",
        "This condition functions as a substitute for the duplex conditions of standard DRT6 The condition in question is: 51-lere we follow the 'more than half' interpretation of `most' common from the literature on Generalized Quantifiers (see, e.g, 13arwise & Cooper, 1981; Keenan & Westerstiihl, 1997).",
        "This interpretation is not entirely unproblematic; see, for instance, (Kamp & Reyle, 1993).",
        "Our use of the interpretation is, however, solely for illustrative purposes.",
        "We can also accommodate for alternative mappings for Quant(Most).",
        "Similarly we cannot go into detailed discussions of other quantifiers such as, for instance, 'many' (cf. Lappin, 1988).",
        "The verification condition for this condition is:",
        "(5) M f DETt(x) (II 3; Ili\" )ii t 11MJ) E° flan': ,DET, Let us illustrate these definitions with a simple example.",
        "Consider: (6) At most two men walk.",
        "The NP 'At most two men' introduces a plural discourse referent X, together with a number of conditions on that referent.",
        "Additionally, the verb 'walk' supplies a condition to the effect that all the members of X walk.7,8 The first condition says that X consists of a subset of the set of all men (cm,„, alternatively, we could use a set of contextually given men) and that X should consist of at most 2 individuals belonging to that set.",
        "The implicative condition is there to make sure there is no other set apart from X with (other) men who are also walking.",
        "Such a closure condition is particularly useful for the direct representation of monotonically decreasing quantifiers.10 A quantor Q is monotonically decreasing if and only if for all",
        "10 In Van Eijck (1983), an alternative approach is proposed within a framework which also allows for the direct representation of plural referents in DRT.",
        "He proposes to reanalyse monotonically decreasing quantifiers in terms of negation and monotonically increasing ones.",
        "This, however, means that we no longer have a direct correlation between plural discourse referents and monotonically decreasing quantifiers.",
        "Furthermore, it prevents such quantifiers from any anaphoric uptake as in `Fewer than ten students took the test.",
        "They all passed it'.",
        "X, Y, Z it holds that: if QXY and Z C Y, then Q X Z.",
        "Thus, for instance, (a) 'At most two men walk and talk' does not imply that (b) 'At most two men walk'.",
        "If we would represent (a) without the closure condition (i.e., there is a set of at most Iwo men and each of them walks and talks), then (b) (i.e., there is a set of at most two men and each of them walks) would follow from (a).",
        "However, if we add to the representation of (a) that there are no other sets of men who walk and talk and to the representation of (b) that that there are no other sets of men who walk, then (a) no longer follows from (b); the additional information in (a) that there are no other sets of men who both walk and talk, does not entail that there are no other sets of men who walk.",
        "Scoped Semantic Networks A scoped semantic network (SSN) is a triple (D, L, f), consisting of a typed DAG (Directed Acyclic Graph) D, a sef of logical contexts L and a function f which assigns a logical context (which are treated as primitive objects separate from those in the DAG) to each of the objects in the DAG.",
        "In the DAG, there are objects which correspond with logical operators, such as implication and negation, and non-logical objects, such as physical objects and events.",
        "The function f, which assigns logical contexts to objects in a typed DAG D, satisfies the following constraints: (I) The root object and all the objects which arc direct descendants of a logical operator are assigned a unique logical context.",
        "These contexts inherit the partial ordering (in the DAG) of the objects with which they are associated.",
        "Furthermore, this set of logical contexts constitutes the range of f .",
        "(II) Logical operators which have not been assigned a context by clause 1. are mapped to the logical context of their nearest ancestor to which clause 1. applies.",
        "(III) Objects which arc not assigned to a logical context by the clauses I. and 2. arc assigned to a logical context in accordance with DRT's accessibility rules.",
        "Consider, for instance, the following sentence: (8) If a man is happy, then he whistles.",
        "We can represent this sentence by means of the SSN in Figure 1.",
        "In this representation, the dots represent objects, the circles represent logical contexts (an object inside a circle belongs to the corresponding logical context), the solid arrows represent attributes and the dotted arrows represent that the object from which the arrow originates belongs to the context to which the arrow points.",
        "There is a straightforward procedure for mapping a SSN into a DRS:",
        "(I) Logical contexts are mapped into boxes, where the nesting of the boxes is isomorphic to the partial ordering of the corresponding logical contexts.",
        "(II) Objects are inserted into the box which corresponds with their logical context, except for logical operators.",
        "The latter are mapped onto the appropriate operators on the boxes of their directly subordinate objects.",
        "(III) Typing statements T (z) of a non-logical object are added to the same box as the object x itself.",
        "(IV) Attributions Mx, y), where x and y are non-logical objects, are added to the same box as x.",
        "• ■ implication",
        "By applying these rules, we obtain the following DRS for the SSN in Figure 1: Note how the three circles in the SSN correspond with the three boxes of the DRS.",
        "Furthermore, the discourse referent x corresponds to the object in the SSN of the type man and inhabits the same box as the conditions which correspond to the object of type happy and the attribute agent.",
        "SSNs with Plurals In this section, we describe an extension of ssNs for countable plural objects.",
        "This extension requires no changes to the format of SSNs.",
        "Rather, we introduce a number of special-purpose",
        "attributions and types.",
        "Subsequently, we specify their mapping to appropriate terms in a DRS.",
        "We introduce two attributes on countable objects:",
        "(I) quant.",
        "The value of this feature is restricted to an object of the type det_type.",
        "Examples of the subtypes of deLtype arc 2, > 1, < 3, all, few, etc.",
        "(II) part_of .",
        "The value of this feature is restricted to countable objects.",
        "The mapping of SSNs which include these special-purpose attributions and types to a DRS is defined as follows:",
        "(I) For typing statements T(a:), where T is a subtype of det _type: ignore the statement T GO and the object x; (H) For attributions quant(x, y) such that 3z :",
        "part_o (a:, z) & z is an anchor& Ti(x) & y ) , add to the box in which also a: lives the following condition: = T2 (CTi) .",
        "Note that in this case T2 is subtype of det_type.",
        "The role of contextual individual is played by eT, , i.e., a constant which denotes the supremum of the denotation of 2).",
        "Furthermore, we add a closure condition; For attributions quant(x , y) such that ]z : parLo f z) & Ti(a) & T2 (y) add to the box in which also X lives the following condition: a: = T2(z) • Furthermore, we add a closure condition; (IV) Otherwise apply the standard mapping rules for SSNs (see the previous section).",
        "Consider, for instance, the (plural) SSN for the sentence 'At most two men walk' in Figure (2).",
        "• ) walk V • man",
        "stantiated in this case.",
        "This is represented by means of the empty box.",
        "When we apply the rules for mapping SSNs to DRss, we obtain the following representation:",
        "The first four conditions correspond to the types of the nodes and the attributes of the SSN.",
        "They are followed by the closure condition."
      ]
    },
    {
      "heading": "3 Editing Plurals",
      "text": [
        "In this section, we describe how plural SSNs can be used for WYSIWYM editing (Power et al., 1998).11 WYSIWYM stands for What You See Is What You Meant.",
        "It is a technology for directly manipulating knowledge representations using natural language feedback.",
        "WYSIWYM has been used in various systems for (multilingual) document authoring and query formulation.",
        "The proposal which is presented in this paper has been implemented as part of the MILE query-answering system (e.g., Piwek et al., 2000).",
        "The basic idea underlying WYSIWYM editing can be presented by means of a simple diagram.",
        "This SSN contains only one logical context which is inhabited by the objects of type man and walk.",
        "The object of type man is possibly plural: its (pant attribute points to an object of type at most 2.",
        "The value of the other attribute, i.e., part _of; is not in",
        "Semantic Network (SN) in a knowledge base (KB), the system generates a description of the SN in the form of a 'feedback text' containing 'anchors' representing places where the knowledge base can be extended.",
        "Each anchor is associated with pop-up menus, which present the possible editing operations on the SN.",
        "On the basis of the operation that the user selects, the knowledge base is updated and a new feedback text is generated from the new contents of the SN.",
        "on this span, the menu of Figure 5. pops up.",
        "Let us assume that the user selects 'copy'.",
        "In that case, the object which is associated with the span is saved in a buffer.",
        "Subsequently, the user can click on the span 'Some equipment'.",
        "This causes the following menu to pop up:",
        "Now, the user can paste the object from the buffer into the location in the network which is associated with 'Some equipment'.",
        "This gives rise to the network in figure 6 and the following feedback text: (12) A solid bulk carrier is fitted with three bilge pumps.",
        "They are used for firefighting.",
        "Some states, *conjunction",
        "Let us now go through an example of editing plurals as it is supported by our prototype system.",
        "Let us join in at a point where the network in figure 4 has been constructed.12 This network is presented to the user by means of the following feedback text:",
        "The spans in bold face indicate where the network is still incomplete.",
        "Other spans of text represent specific objects in the network.",
        "For instance, the span `three bilge pumps' is associated with a plural object of the type 'bilge pump'.",
        "When the user clicks",
        "Note that now the first attributes of both 'fitted_witlf and 'purpose' point to the same object.",
        "In the feedback text, this is expressed by using a pronoun for the second reference to the object.",
        "Van Deemter and Power (1998) originally defined the 'copy' operation for singular objects.",
        "When we move to plurals, alternatives to a simple copy operation become available.",
        "Here, we want to discuss one of those operations, i.e., copying part of an object, instead of the entire object.",
        "Let us return to (11).",
        "Suppose that the user had chosen 'copy some' on the menu of Figure 5.",
        "The effect would have been that a new object would have been created in the buffer with its attribute `part_or pointing to the object corresponding to 'three bilge pumps' (its `quant' attribute would still have to be filled in).",
        "Pasting this object into the location marked by `Some equipment' would have yielded the following result:",
        "(13) A solid bulk carrier is fitted with three bilge pumps.",
        "Some number of them is used for firefighting.",
        "Some states.",
        "Note that the text contains an anchor for the yet to be specified value of the *ant' attribute.",
        "Clicking on the anchor activates the following menu: some most few one two Selection of 'one' yields the following text, which is generated from the network in Figure 7:",
        "(14) A solid bulk carrier is fitted with three bilge pumps.",
        "One of them is used for firefighting.",
        "Some states.",
        "• conjunction"
      ]
    },
    {
      "heading": "4 Conclusions",
      "text": [
        "In this paper, we have described some editing operations on object-oriented networks with plural objects and provided a precise formal interpretation for these networks in terms of a version of Discourse Representation Theory.",
        "The networks which we have used are an extension of commonly used 00 networks for natural language generation.",
        "In particular, our networks cover quantificational plural noun phrases such 'most N', 'few N', etc.",
        "Acknowledgements The research reported in this paper was carried out as part of the EC Esprit funded CLIME project (EP 25.414).",
        "Thanks are due to Lynne Cahill, Roger Evans and Neil Tipper for stimulating cooperation within the CLIME team at the University of Brighton.",
        "Furthermore, I would like to thank Alexander Boer, Kees van Deciliter, Rodger Kibble, Richard Power and two anonymous COL1NG reviewers for commenting on earlier versions of this paper."
      ]
    }
  ]
}
