{
  "info": {
    "authors": [
      "Xiang Li",
      "Wenbin Jiang",
      "Yajuan Lü",
      "Qun Liu"
    ],
    "book": "ACL",
    "id": "acl-P13-2105",
    "title": "Iterative Transformation of Annotation Guidelines for Constituency Parsing",
    "url": "https://aclweb.org/anthology/P13-2105",
    "year": 2013
  },
  "references": [
    "acl-D09-1086",
    "acl-D09-1087",
    "acl-D10-1082",
    "acl-D12-1038",
    "acl-H01-1014",
    "acl-J05-1003",
    "acl-N06-1020",
    "acl-N07-1051",
    "acl-P04-1015",
    "acl-P05-1022",
    "acl-P06-1043",
    "acl-P06-1055",
    "acl-P07-1106",
    "acl-P09-1006",
    "acl-P09-1059",
    "acl-P11-2126",
    "acl-P12-1025",
    "acl-P12-1071",
    "acl-P94-1034",
    "acl-P99-1065",
    "acl-W02-1001",
    "acl-W10-4144"
  ],
  "sections": [
    {
      "text": [
        "T to CTB, in order to obtain additional treebank to improve a parser.",
        "Experiments on Chinese constituent parsing show that, the iterative training strategy outperforms the basic annotation transformation baseline.",
        "With addidional transformed treebank, the improved parser achieves an F-measure of 0.95% absolute improvement over the baseline parser trained on CTB only."
      ]
    },
    {
      "heading": "2 Automatic Annotation Transformation",
      "text": [
        "In this section, we present an effective approach that transforms the source treebank to another compatible with the target annotation guideline, then describe an optimization strategy of iterative training that conducts several rounds of bidirectional annotation transformation and improves the transformation performance gradually from a global view."
      ]
    },
    {
      "heading": "2.1 Principle for Annotation Transformation",
      "text": [
        "In training procedure, the source parser is used to parse the sentences in the target treebank so that there are k-best parse trees with the source annotation guideline and one gold tree with the target annotation guideline for each sentence in the target treebank.",
        "This parallel data is used to train a source-to-target tree transformer.",
        "In transformation procedure, the source k-best parse trees are first generated by a parser trained on the target treebank.",
        "Then the optimal source parse trees with target annotation are selected by the annotation transformer with the help of gold source parse trees.",
        "By combining the target treebank with the transformed source treebank, it can improve parsing accuracy using a parser trained on the enlarged treebank.",
        "Algorithm 1 shows the training procedure of treebank annotation transformation.",
        "treebanks and treebankt denote the source and target treebank respectively.",
        "parsers denotes the source parser.",
        "transformers?t denotes the annotation transformer.",
        "treebanknm denotes m treebank re-labeled with n annotation guideline.",
        "Function TRAIN invokes the Berkeley parser (Petrov et al., 2006; Petrov and Klein, 2007) to train the constituent parsing models.",
        "Function PARSE generates k-best parse trees.",
        "Function TRANSFORMTRAIN invokes the perceptron algorithm (Collins, 2002) to train a discriminative annotation transformer.",
        "Function TRANSFORM selects the optimal transformed parse trees with the target annotation."
      ]
    },
    {
      "heading": "2.2 Learning the Annotation Transformer",
      "text": [
        "To capture the transformation information from the source treebank to the target treebank, we use the discriminative reranking technique (Charniak and Johnson, 2005; Collins and Koo, 2005) to train the annotation transformer and to score k-best parse trees with some heterogeneous features.",
        "In this paper, the averaged perceptron algorithm is used to train the treebank transformation model.",
        "It is an online training algorithm and has been successfully used in many NLP tasks, such as parsing (Collins and Roark, 2004) and word segmentation (Zhang and Clark, 2007; Zhang and Clark, 2010).",
        "In addition to the target features which closely follow Sun et al. (2010).",
        "We design the following quasi-synchronous features to model the annotation inconsistencies.",
        "?",
        "Bigram constituent relation For two consecutive fundamental constituents si and sj in the target parse tree, we find the minimum categories Ni and Nj of the spans of si and sj in the source parse tree respectively.",
        "Here",
        "Algorithm 1 Basic treebank annotation transformation.",
        "1: function TRANSFORM-TRAIN(treebanks, treebankt) 2: parsers ?",
        "TRAIN(treebanks) 3: treebankst ?",
        "PARSE(parsers, treebankt) 4: transformers?t ?",
        "TRANSFORMTRAIN(treebankt, treebankst ) 5: treebankts ?",
        "TRANSFORM(transformers?t, treebanks) 6: return treebankts ?",
        "treebankt Algorithm 2 Iterative treebank annotation transformation.",
        "1: function TRANSFORM-ITERTRAIN(treebanks, treebankt) 2: parsers ?",
        "TRAIN(treebanks) 3: parsert ?",
        "TRAIN(treebankt) 4: treebankst ?",
        "PARSE(parsers, treebankt) 5: treebankts ?",
        "PARSE(parsert, treebanks) 6: repeat 7: transformers?t ?",
        "TRANSFORMTRAIN(treebankt,treebankst ) 8: transformert's ?",
        "TRANSFORMTRAIN(treebanks,treebankts) 9: treebankts ?",
        "TRANSFORM(transformers?t, treebanks) 10: treebankst ?",
        "TRANSFORM(transformert?s, treebankt) 11: parsert ?",
        "TRAIN(treebankts ?",
        "treebankt) 12: until EVAL(parsert) converges 13: return treebankts ?",
        "treebankt",
        "a fundamental constituent is defined to be a pair of word and its POS tag.",
        "IfNi is a sibling of Nj or each other is identical, we regard the relation between si and sj as a positive feature.",
        "?",
        "Consistent relation If the span of a target constituent can be also parsed as a constituent by the source parser, the combination of target rule and source category is used.",
        "?",
        "Inconsistent relation If the span of a tar",
        "get constituent cannot be analysed as a constituent by the source parser, the combination of target rule and corresponding treelet in the source parse tree is used.",
        "?",
        "POS tag The combination of POS tags of same words in the parallel data is used."
      ]
    },
    {
      "heading": "2.3 Iterative Training for Annotation Transformation",
      "text": [
        "Treebank annotation transformation relies on the parallel training data.",
        "Consequently, the accuracy of source parser decides the accuracy of annotation transformer.",
        "We propose an iterative training method to improve the transformation accuracy by iteratively optimizing the parallel parse trees.",
        "At each iteration of training, the treebank transformation of source-to-target and target-to-source are both performed, and the transformed treebank provides more appropriate annotation for subsequent iteration.",
        "In turn, the annotation transformer can be improved gradually along with optimization of the parallel parse trees until convergence.",
        "Algorithm 2 shows the overall procedure of iterative training, which terminates when the performance of a parser trained on the target treebank and the transformed treebank converges."
      ]
    },
    {
      "heading": "3 Experiments",
      "text": []
    },
    {
      "heading": "3.1 Experimental Setup",
      "text": [
        "We conduct the experiments of treebank transformation from TCT to CTB.",
        "CTB 5.1 is used as the target treebank.",
        "We follow the conventional corpus splitting of CTB 5.1: articles 001-270 and 400-1151 are used for training, articles 271- 300 are used as test data and articles 301-325 are used as developing data.",
        "We use slightly modified version of CTB 5.1 by deleting all the function tags and empty categories, e.g., *OP*, using Tsur-geon (Levy and Andrew, 2006).",
        "The whole TCT 1.0 is taken as the source treebank for training the annotation transformer.",
        "The Berkeley parsing model is trained with 5 split-merge iterations.",
        "And we run the Berkeley parser in 100-best mode and construct the 20-fold cross validation training as described in Charniak and Johnson (2005).",
        "In this way, we acquire the parallel parse trees for training the annotation transformer.",
        "In this paper, we use bracketing F1 as the Par-seVal metric provided by EVALB 1 for all experiments."
      ]
    },
    {
      "heading": "3.2 Basic Transformation",
      "text": [
        "We conduct experiments to evaluate the effect of the amount of target training data on transformation accuracy, and how much constituent parsers can benefit from our approach.",
        "An enhanced parser is trained on the CTB training data with the addition of transformed TCT by our annotation transformer.",
        "As comparison, we build a baseline system (direct parsing) using the Berkeley parser only trained on the CTB training data.",
        "In this experiment, the self-training method (M-cClosky et al., 2006a; McClosky et al., 2006b) is also used to build another strong baseline system, which uses unlabelled TCT as additional data.",
        "Figure 2 shows that our approach outperforms the two strong baseline systems.",
        "It achieves a 0.69% absolute improvement on the CTB test data over the direct parsing baseline when the whole CTB training data is used for training.",
        "We also can find that our approach further extends the advantage over the two baseline systems as the amount of CTB training data decreases in Figure 2.",
        "The figure confirms our approach is effective for improving parser performance, specially for the scenario where the target treebank is scarce."
      ]
    },
    {
      "heading": "3.3 Iterative Transformation",
      "text": [
        "We use the iterative training method for annotation transformation.",
        "The CTB developing set is used to determine the optimal training iteration.",
        "After each iteration, we test the performance of a parser trained on the combined treebank.",
        "Fig",
        "ure 3 shows the performance curve with iteration ranging from 1 to 10.",
        "The performance of basic annotation transformation is also included in the curve when iteration is 1.",
        "The curve shows that the maximum performance is achieved at iteration 5.",
        "Compared to the basic annotation transformation, the iterative training strategy leads to a better parser with higher accuracy.",
        "Table 1 reports that the final optimized parsing results on the CTB test set contributes a 0.95% absolute improvement over the directly parsing baseline."
      ]
    },
    {
      "heading": "4 Related Work",
      "text": [
        "Treebank transformation is an effective strategy to reuse existing annotated data.",
        "Wang et al. (1994) proposed an approach to transform a treebank into another with a different grammar using their matching metric based on the bracket information of original treebank.",
        "Jiang et al. (2009) proposed annotation adaptation in Chinese word segmentation, then, some work were done in parsing (Sun et al., 2010; Zhu et al., 2011; Sun and Wan, 2012).",
        "Recently, Jiang et al. (2012) proposed an advanced annotation transformation in Chinese word segmentation, and we extended it to the more complicated treebank annotation transformation used for Chinese constituent parsing.",
        "Other related work has been focused on semi-supervised parsing methods which utilize labeled data to annotate unlabeled data, then use the additional annotated data to improve the original model (McClosky et al., 2006a; McClosky et",
        "al., 2006b; Huang and Harper, 2009).",
        "The self-training methodology enlightens us on getting annotated treebank compatibal with another annotation guideline.",
        "Our approach places extra emphasis on improving the transformation performance with the help of source annotation knowledge.",
        "Apart from constituency-to-constituency treebank transformation, there also exists some research on dependency-to-constituency treebank transformation.",
        "Collins et al. (1999) used transformed constituency treebank from Prague Dependency Treebank for constituent parsing on Czech.",
        "Xia and Palmer (2001) explored different algorithms that transform dependency structure to phrase structure.",
        "Niu et al. (2009) proposed to convert a dependency treebank to a constituency one by using a parser trained on a constituency treebank to generate k-best lists for sentences in the dependency treebank.",
        "Optimal conversion results are selected from the k-best lists.",
        "Smith and Eisner (2009) and Li et al. (2012) generated rich quasi-synchronous grammar features to improve parsing performance.",
        "Some work has been done from the other direction (Daum et al., 2004; Nivre, 2006; Johansson and Nugues, 2007)."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "This paper propose an effective approach to transform one treebank into another with a different annotation guideline.",
        "Experiments show that our approach can effectively utilize the heterogeneous treebanks and significantly improve the state-of-the-art Chinese constituency parsing performance.",
        "How to exploit more heterogeneous knowledge to improve the transformation performance is an interesting future issue."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors were supported by National Nat",
        "part of the CNGL at Dublin City University.",
        "Sincere thanks to the three anonymous reviewers for their thorough reviewing and valuable suggestions!"
      ]
    }
  ]
}
