{
  "info": {
    "authors": [
      "Birte Lönneker-Rodman"
    ],
    "book": "European Workshop on Natural Language Generation ENLG",
    "id": "acl-W05-1610",
    "title": "Narratological Knowledge for Natural Language Generation",
    "url": "https://aclweb.org/anthology/W05-1610",
    "year": 2005
  },
  "references": [
    "acl-P88-1016",
    "acl-W04-2324",
    "acl-W94-0319"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The paper proposes an architecture for advanced NLG systems that handle narratives.",
        "Special attention is paid to document planning.",
        "Domain modelling and meta-knowledge modelling for a narratological structurer are exemplified."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Natural Language Generation (NLG) systems usually focus on descriptive text types.",
        "Narrative structures are underrepresented in NLG.",
        "However, they are encountered in many naturally occurring texts, and not only in fiction.",
        "Often, texts are composed of segments with different prevailing functions: some are descriptive, some argumentative, others narrative.",
        "Therefore, knowledge about narratives can be useful also for NLG systems that deal with “classical” NLG tasks.",
        "For example, a system that is expected to describe and compare objects in a museum could include narrative passages about their use, history or discovery.",
        "The discipline concerned with the structure of narrative [Barthes, 1966] and narrative discourse [Genette, 1980] is called narratology.",
        "Narratologists distinguish between two main representational domains of narratives: 1. the story (histoire) as the totality of the narrated events, abstracted from their disposition in the text; and 2. the discourse (récit) that narrates them [Genette, 1988:13].",
        "Narratology has identified a number of descriptive parameters.",
        "As can be seen from the explanations in Table 1 (see Appendix), many parameters describe phenomena that relate discourse to story in a specific way.",
        "This paper envisages an NLG system with improved abilities to deal with narrative discourse.",
        "Section 2 summarises the relation between Story Generation and NLG.",
        "In Section 3, an architecture for a narratologically enhanced NLG system is proposed.",
        "Section 4 outlines one of the descriptive parameters, illustrating the kind of knowledge that can be acquired from narratology.",
        "Section 5 exemplifies the domain modelling, a prerequisite for modelling narratological knowledge.",
        "Section 6 formalises the selected narratological parameter, discusses its mapping onto discourse graphs used in NLG, and exemplifies its use in a system.",
        "Section 7 concludes the paper and mentions future work."
      ]
    },
    {
      "heading": "2 Story Generation and NLG",
      "text": [
        "This section gives a brief overview of the relationship between Story Generation (SG) and NLG.",
        "Subsection 2.1 describes the architectural gap between SG and NLG.",
        "Subsection 2.2 discusses the contribution of an existing system to fill that gap.",
        "An extended account of work in SG cannot be provided here.",
        "Pérez y Pérez and Sharples [2004] compare and evaluate three recent SG systems.",
        "For a discussion of earlier systems, see [Ryan, 1991:233–248]."
      ]
    },
    {
      "heading": "2.1 The Story Generation-NLG Gap",
      "text": [
        "Story Generators aim to produce interesting, understandable, artistic, and creative stories [Turner, 1994:15].",
        "In doing so, they focus on the story (histoire) representational domain.",
        "For example, the generator MINSTREL [Turner, 1994] achieves not only thematic and consistency goals, but also “dramatic” and “presentational” goals solely by adding or transforming story events and background information.",
        "The story content is directly mapped onto the output text.",
        "SG faces the difficult problem of finding an interesting and logically coherent event sequence (story).",
        "Less energy is spent on other tasks, especially at discourse and surface level.",
        "In fact, most implemented SG systems use templates of different varieties for NLG.",
        "Document structuring and microplanning as NLG processing stages [Reiter, 1994; Reiter and Dale, 2000:60] are usually skipped in SG, so that SG and NLG architectures can be confronted as in Figure 1."
      ]
    },
    {
      "heading": "2.2 STORYBOOK",
      "text": [
        "The existence of a gap between SG and NLG has also been discussed by Callaway and Lester [2002].",
        "To remedy the situation, they implemented STORYBOOK, an “architecture for narrative prose generation” [2002:228].",
        "The input to STORYBOOK must be a “narrative stream that reflects the orderly progression of events, descriptions and states” [Callaway and Lester, 2002:231], produced by a hypothetical Story Generator.",
        "STORYBOOK expects this input stream to contain so-called narrative primitives that specify scene changes and other aspects such as:",
        "• narrative person and focalization (“person, omniscience” [Callaway and Lester, 2002:221]); • details about dialogue realization (e.g. whether an",
        "inquit phrase such as “he said” should precede, follow or interrupt direct speech, or whether it should be omitted altogether [Callaway and Lester, 2002:225]).",
        "Person and focalization are classical narratological parameters [Genette, 1980].",
        "It is not clear from Callaway and Lester [2002] how many different values STORYBOOK actually implements for these parameters; their example tale is invariably rendered by a “third person disembodied” narrator [2002:230].",
        " – The question of whether or not a character utterance is to be provided with an inquit phrase is sometimes subsumed under the narrative distance parameter (cf. Table 1): Direct speech framed by inquit phrases is definitely considered as imitating, but the highest level of imitation is achieved by the reproduction of unframed direct speech [Fludernik, 2005; Genette, 1988:56].",
        "In STORYBOOK, many decisions concerning discourse still lie with the Story Generator that is supposed to produce a stream with narrative primitives.",
        "STORYBOOK itself neither decides about narrative person, focalization, or distance for any given passage, nor is it concerned with any other narratological parameters listed in Table 1.",
        "Rather, STORYBOOK focuses on microplanning and surface phenomena with special attention to features particular to narrative.",
        "The architectural contribution of STORYBOOK can thus be seen as reducing the gap between SG and NLG to approximately the microplanner level, where STORYBOOK, as a specialized NLG system, takes over from a hypothetical Story Generator (see Figure 2)."
      ]
    },
    {
      "heading": "3 Narratology for NLG",
      "text": [
        "Narratological aspects influence on all architectural modules [Reiter, 1994] or representation levels [Cahill et al., 2000] of NLG.",
        "The most important decisions of a narratologically enhanced system concern the document planner with its content determination and document structuring subtasks (Subsections 3.1–3.2).",
        "Microplanning and surface realization (Subsection 3.3) are supposed to resemble classical NLG processes.",
        "As further explained below, the architecture of the envisaged system corresponds to Figure 3."
      ]
    },
    {
      "heading": "3.1 Content Determination",
      "text": [
        "In a narratologically enriched NLG system, a “narrative content determination module” might be implemented as a Story Generator.",
        "The Story Generator decides",
        "• what it considers to be a minimal story [Prince, 1973], • what it considers a good story (cf. Subsection 2.1), • how to select the content that represents the story:",
        "events, participants, and their relations.",
        "However, if narratological discourse parameters are to be applied, certain story events or participants are required.",
        "For example, the narrative levels parameter presupposes the existence of at least one NARRATING action among the story events of the (first) narrative (see Sections 4–6).",
        "This means that an entirely data-driven, pipelined process where content determination precedes document structuring [Reiter and Dale, 2000:111] will not use the full potential of a narratologically enhanced document planner.",
        "Rather, the content determination module (the Story Generator) should be able to satisfy constraints issued by the document structurer.",
        "These constraints might well take the form of modification requests after a first output attempt of the Story Generator.",
        "Therefore, a hypothesis-driven architecture in which the system switches back and forth between content determination and document structuring seems well suited for the task at hand (see the double arrow in Figure 3)."
      ]
    },
    {
      "heading": "3.2 Document Structuring",
      "text": [
        "In the envisaged architecture, the document structurer receives the narrative content representation from the Story Generator.",
        "In its simplest form, this input is a sequence of events together with their participants.",
        "The structurer shares a domain model with the Story Generator, where the semantics of events and participants are represented.",
        "By default, the incoming event sequence is considered as corresponding to a discourse related by the NarrativeSe-quence discourse relation1 (for discourse relations, cf. Subsection 6.3).",
        "The sequence might have additional internal structure, because most Story Generators represent consequences of events and/or episodes, and therefore some kind of causality [e.g. Gervás et al., 2004; Pérez y Pérez and Sharples, 2004; Turner, 1994].",
        "Combining this information with information from the ontology and with narratological knowledge, the narratological document structurer creates variation in discourse.",
        "Most narrative parameters presented in Table 1 influence on this representational domain.",
        "Amongst others, the Narratological Structurer can perform the following tasks, some of them in interaction with the Story Generator:",
        "• modify the order of events or episodes, tag the shifted elements as flashbacks or flashforwards, and accordingly modify the discourse relations (a Cause relation might become an Explanation relation because of the inverted event order); • create ellipsis by suppressing events or episodes that the reader might as well infer; • add or remove narrative levels (Sections 4–6); • decide about point of view and focalization for the",
        "entire narrative or, rather, for certain episodes, and accordingly present or suppress events and relations.",
        "The produced document plan contains discourse relations and narratological information for nodes and leaves, which can be further used in microplanning and surface realization."
      ]
    },
    {
      "heading": "3.3 Nficroplanning and Surface Realization",
      "text": [
        "The microplanner performs lexicalisation and aggregation and generates referring expressions.",
        "Besides the usual constraints, it respects narratological contraints.",
        "For example, certain values of focalization and point of view can cause “unusual” referring expressions: personal pronouns might be used for initial reference [Harweg, 1968: 163– 166], or indefinite referring expressions for subsequent reference [Ushie, 1986; Wiebe and Rapaport, 1988].",
        "The choice of vocabulary, tense, and syntactic complexity can as well depend on narratological factors.",
        "The surface realizer turns the microplanner output into natural language text.",
        "See [Callaway and Lester, 2002:224] for narrative-related issues in surface realization."
      ]
    },
    {
      "heading": "4 The Narrative Levels Parameter",
      "text": [
        "The narrative levels parameter will be used to illustrate the kind of knowledge that can be acquired from narratology for integration into a narratologically enhanced NLG system.",
        "Narratives can consist of different levels: There are “tales within tales within tales” [Barth, 1984].",
        "Genette [1988:85] illustrates this phenomenon by a figure similar to Figure 4,",
        "in which person i produces an utterance a that contains the production of another utterance b by person j.",
        "Talking about narratives, the “persons” in Genette’s drawing correspond to narrative instances (narrators).",
        "Narrative instance i might not be identified by any referring expression throughout the utterances produced by i (and j): i can be “absent from the story” or heterodiegetic [Genette, 1980:244–245].",
        "Narrative instance j, on the other hand, necessarily has to be identical to a character in story a.",
        "Finally, j might be absent (or not) from the “inner” narration b that he himself produces (see Table 1 on Person).",
        "The generation of a narration within a narration presupposes the existence of a NARRATING action in the “outer” narration: in Figure 4, a NARRATING action (where j tells b) occurs within outer narration a.",
        "Therefore, before narrative levels will be modelled in detail (Section 6), Section 5 will be concerned with a definition of NARRATING.",
        "Genette’s [1980:244] considerations suggest that narrative levels is one of the simpler narratological parameters.",
        "For example, he claims that any narrative can be converted into an inner narration by adding “presentational” outer narrations [Genette, 1988:95].",
        "It should thus be possible to enable a generation system to create narrativel levels."
      ]
    },
    {
      "heading": "5 NARRATING and Related Frames",
      "text": [
        "This section proposes representation structures for NARRATING (Subsection 5.1) and related frames, especially the NARRATED frame (Subsection 5.2).",
        "A frame is considered to represent structured knowledge about a given concept.",
        "In terms of NLG tasks, this modelling corresponds to setting up part of a domain model for content determination [Reiter and Dale, 2000:86–89].",
        "The modelling is supported by concordances from the German DWDS corpus.",
        "Contexts of verb forms of erzählen (‘tell; narrate’) were investigated, because they “evoke” the target frame NARRATING.",
        "As DWDS texts are of several types, the results reflect general (not only literary) language use.",
        "The analysed corpus material stems from texts published between 1990 and 1999.",
        "The modelling is also partly inspired by the SUMO4 upper ontology [Niles and Pease, 2001 ].",
        "SUMO does not yet include the NARRATING concept."
      ]
    },
    {
      "heading": "5.1 The NARRATING Frame",
      "text": [
        "The NARRATING frame is an indirect subframe of ACTION.",
        "Narratological theories [Chatman, 1978:44–45] agree with",
        "current ontologies like SUMO on the fact that an action is performed intentionally by a cognitive agent.",
        "The NARRATING frame thus inherits an Agent slot which I relabel NarrativeInstance for better orientation (cf. Table 5).",
        "The NARRATING frame is related to other frames subsumed under the superframe COMMUNICATION_ACTION.",
        "That superframe represents an action in which typically at least two participants exchange messages.",
        "In the present investigation, NARRATING actions are assumed to express this content linguistically; therefore, NARRATING is here also a subframe of LINGUISTIC_COMMUNICATION (cf.",
        "Figure 5).",
        "In the NARRATING frame, the content is represented as complex filler of the Narrated slot; a more detailed modelling of the NARRATED frame follows in Subsection 5.2.",
        "NARRATING is a special subframe of COMMUNICA-TION_ACTION insofar as it usually restricts the direction of the information flow between the participants: One of them is the (main) producer, the other one the (main) recipient of NARRATED.",
        "The respective participant slots are the above mentioned NarrativeInstance, and the Addressee.",
        "Typically, the Addressee or “narratee” [Genette, 1980] is a cognitive agent different from NarrativeInstance.",
        "Nevertheless, the current model also allows the same individual to act simultaneously as both NarrativeInstance and Addressee: cognitive agents may “tell a story to themselves”.",
        "Comments and questions produced by the Addressee, concerning the Narrated, deserve some attention.",
        "The present conceptualization considers that even if comments and questions interrupt of the flow of Narrated, they do not necessarily mark the end of a NARRATING action (see also Subsection 5.2).",
        "Some other slots of NARRATING are inherited from the ACTION or EVENT frames.",
        "In the DWDS corpus material (cf. Table 2, Appendix), examples of fillers of Motivation, Consequence/Aim, ParallelEvent, Time, Place, and Manner are encountered.",
        "Typically, one of the Consequences of NARRATING is a change of the Addressee’s mental state: the Narrated is added to her or his knowledge.",
        "This consequence seems to belong to the lexico-semantic knowledge about NARRATING or, probably, COMMUNICATION _ACTIONS in general, and is rarely mentioned explicitly in texts.",
        "Table 3 gives an overview of the NARRATING frame.",
        "It also maps slot names on binary relation labels and formulates restrictions for the fillers.",
        "However, as a representation of a conceptual entity, it does not specify linguistic restrictions such as “addressee-oriented, non-message-oriented” which are considered to hold language-specifically for individual verbs [Bateman et al., 1994].",
        "For the use in a specific NLG system, the frame and its slots thus need to be mapped onto the lexicon used by that system during lexicalisation."
      ]
    },
    {
      "heading": "5.2 The NARRATED Frame",
      "text": [
        "A text can refer to different aspects of what is narrated in a NARRATING action.",
        "Hence, instead of introducing further slots within the NARRATING frame, the filler of Narrated will itself be represented as a frame (cf. Table 4, Appendix).",
        "One way of referring to the NARRATED_LINGUISTIC_MESSAGE, abbreviated as NARRATED, is to mention the Text",
        "Type of the narrated material.",
        "Typically, this is a literary genre, or one of its parts.",
        "Further, the NARRATED uses a MessageSupport, which might be written (e.g. book, letter), spoken (e.g. speech, song) or thought (e.g. dream).",
        "Thought seems to lend itself to somewhat problematic subdivisions; see e.g. [Genette, 1980:231] on “retrospections”.",
        "The abstract content of NARRATED is represented linguistically through a LinguisticSurfaceForm.",
        "As can be seen from the DWDS corpus, the LinguisticSurfaceForm occurs as a new sentence or clause, and can be more or less “direct”.",
        "Research on the reproduction of speech is an area of both narratology and linguistics.",
        "Usually, the forms direct speech (D in Table 4), free indirect speech and indirect speech (I in Table 4) are distinguished in increasing order of narrative distance (see Table 1) [Fludernik, 2005].",
        "Comments and questions produced by the Addressee of a NARRATING action, concerning the Narrated, should also be part of the LinguisticSurfaceForm: Metaphorically speaking, they might be seen as discursive catalysts or parasites of that surface form.",
        "Finally, the Topic slot of the NARRATED frame is typically filled by sentence constituents like objects or prepositional phrases.",
        "Since these constituents can themselves be complex, the topic might be quite detailed, taking the form of a summary.",
        "Still, it does not provide access to the “original” linguistic surface form.",
        "With respect to narrative, this category is also referred to as narrative report of discourse or content summary [Fludernik, 2005].",
        "At a meta-level, the NARRATED frame can be mapped onto representation structures of the envisaged system that combines SG and NLG (cf.",
        "Figure 3 above).",
        "The TextType is implicitly given in the goal of the Story Generator; also the Topic or a topic restriction is often given at this stage.",
        "The Support is, depending on the stage of processing, some digital entity, written (printed), or possibly speech.",
        "The Ab-stractContent is the “abstract” output of a Story Generator (the product of content determination).",
        "The LinguisticSurfaceForm corresponds to the final NLG output based on this abstract content.",
        "Using knowledge and reasoning procedures, a system might additionally or alternatively summarise AbstractContent into a phrase that represents Topic."
      ]
    },
    {
      "heading": "6 Representing Narrative Levels",
      "text": [
        "This section is concerned with describing a formalism that should enable a discourse planner to handle narrative levels (see Section 4).",
        "Via the formalism, the system can be told",
        "• how many levels a generated narrative should have, • which narrative instance should be the “direct” mediator to the reader, and • how outer and inner narrations, or parts thereof,",
        "should follow each other in discourse.",
        "The basic ingredients for the formalism (Subsection 6.1) are applied to a description of example constellations (Subsection 6.2) and mapped onto discourse relations (Subsection 6.3).",
        "Subsection 6.4 briefly exemplifies the cooperation between Story Generator and Narratological Structurer."
      ]
    },
    {
      "heading": "6.1 Basic Ingredients: Classes and Relations",
      "text": [
        "Three classes and two relations need to be modelled to represent possible structures of global narratives with respect to their levels."
      ]
    },
    {
      "heading": "NARRATION",
      "text": [
        "An instance of NARRATED is a NARRATION if its LinguisticSurfaceForm is of the subtype DirectLinguisticSurfaceForm (and is, as such, explicitly present in the output text).",
        "This narratological constraint correctly excludes from opening a new narrative level such NARRATING actions which are merely mentioned, or whose NARRATED is reproduced indirectly.",
        "NARRATIVE_INSTANCE A NARRATIVE_INSTANCE is a cognitive agent that occupies the agent role (NarrativeInstance slot) of a NARRATING action.",
        "Neither the instance itself nor the action needs to be referred to directly in the surface form of any NARRATION.",
        "For example, if i isA NARRATIVE _INSTANCE, the variable i is not necessarily “resolved” against a character name.",
        "toldBy(NARRATION, NARRATIVE_INSTANCE) The relation toldBy(a,i) holds if there is a NARRATING action x, a NARRATION a and a NARRATIVE_INSTANCE i such that both isCausedBy(x,i) and produces(x,a) are true (Table 3)."
      ]
    },
    {
      "heading": "toldIn(NARRATION, NARRATION)",
      "text": [
        "ToldIn(b,a) or “b is told in a” holds if there is a NARRATION b, a NARRATION a, and a NARRATING action x such that:",
        "• a is not b; • a is an event sequence such that one of its events is x; • produces(x, b)."
      ]
    },
    {
      "heading": "DISCOURSE_SEQUENCE",
      "text": [
        "A DISCOURSE_SEQUENCE is an ordered list of variables standing for different NARRATIONS, as they sequentially occur within the discourse of a global narrative.",
        "In a DIS-COURSE_SEQUENCE, the same variable may appear more than once: for example, an outer narration can frame an inner narration at the start and the end of a discourse.",
        "Variables for separated parts of the same narration receive numbered subscripts (see a1 and a2 in Figure 7 below)."
      ]
    },
    {
      "heading": "6.2 Example Constellations Type 0: Zero-Instantiation",
      "text": [
        "Zero instantiation of the narrative levels parameter occurs if there is no change in level.",
        "There is only one narration, told by a narrative instance.",
        "An example of this type is the fable The Fox and the Crow by Aesop, because neither the fox nor the crow produce any narrations.",
        "The instantiation of the classes and relations corresponds to the scenario in Table 5.",
        "I am not aware of any Story Generator (cf.",
        "Section 2) that exceeds the zero instantiation.",
        "This would mean that contemporary Story Generators ignore narrative levels."
      ]
    },
    {
      "heading": "Type 1: Outer and one Inner Narration",
      "text": [
        "A typical pattern of Type 1 is as follows: An outer narration contains a NARRATING action whose agent is a narrative instance different from that of the outer narration.",
        "The NARRATED of this action is the inner narration.",
        "After the NARRATING action, the rest of the outer narration is told (Table 6).",
        "An example is Heart of Darkness (1902) by Joseph Conrad.",
        "A homodiegetic narrative instance i (= “I') tells outer narration a, while j (= “Marlow') tells inner b:",
        "The “implicit inquit” phrase he began [...] is a comment by i concerning the Manner of NARRATING.",
        "It is not modelled in the discourse_sequence (see also Subsections 5.1– 5.2 on comments).",
        " – The closing part of outer narrative a in Heart of Darkness is very short (cf.",
        "Figure 8, Appendix).",
        "Type 1 has some variants.",
        "For instance, an outer narration might not be resumed at the end of the discourse (Table 7, Appendix), as in Abbé Prévost’s Manon Lescaut (1731).",
        "In contrast, an outer narration (here: b) might manifest itself in discourse only after the NARRATED (here: a) produced in the NARRATING action it contains (Table 8, Appendix).",
        "Philip Roth’s novel Portnoy's Complaint (1969) shows this pattern.",
        "Yet another variant occurs when the narrative instances of outer and inner narration are identical (Table 9, Appendix).",
        "An example is Balzac’s Sarrasine (1831), where a homodiegetic narrator (i) tells a first narration (a) to an “unknown” addressee (the “reader”).",
        "In the course of a, a NARRATING action is performed by i himself, but with a different addressee, namely a character in a (cf.",
        "Figure 9, Appendix)."
      ]
    },
    {
      "heading": "Other Types: More Than Two Narrations",
      "text": [
        "More than two NARRATIONS can easily be combined extending the patterns presented above.",
        "Common “outward” extensions of levels include explicit introductory or closing NARRATING actions, often produced on written support by (fictional) editors, translators or “discoverers” of the inner narration.",
        "An example is the",
        "novel Der goldne Spiegel (‘The golden mirror’, 1772) by Christoph Martin Wieland, for which a structure with three opening narrations “leading to” the innermost narration d, has been identified6 (cf. Table 10, Appendix).",
        "At least equally common are “inward” extensions of the levels.",
        "While several NARRATING actions within one and the same outer narration are considered to produce parallel inner narrations at the same level, further levels are added when a narration is produced within an inner narration.",
        "In The 1001 Nights, Scheherazade entertains King Shahryar with parallel inner narrations.",
        "In these narrations, the characters sometimes tell one another stories, which are inner narrations at the next level.",
        "Table 11 (Appendix) shows a simplified version of The 1001 Nights, in which Scheherazade (j) tells only three stories (b,c,d).",
        "The third level is added by narration e, told by a character (k) of narration d."
      ]
    },
    {
      "heading": "6.3 Discourse Graphs",
      "text": [
        "The basic assumption underlying discourse graphs is that discourse relations (e.g. [Mann and Thompson, 1988; Hobbs, 1990:83–111; Asher and Lascarides, 2003]) exist between discourse segments, where a segment is either a proposition or a graph consisting of already related propositions.",
        "Most theories assume that a limited set of discourse relations covers all semantic links that might exist between discourse segments.",
        "Based on the status of segments they relate, multinuclear and nucleus-satellite discourse relations can be distinguished.",
        "The definition of nuclearity by Mann and Thompson [1988:266] is centered around the notions of comprehensibility (a text is less understandable if a nucleus is deleted), substitutability (satellites can more easily be replaced) and writer's purpose (nuclei are more essential).",
        "Similarly, Hobbs [1990:104] subdivides discourse relations into coordinating and subordinating.",
        "There are correspondences to narratological theory (e.g. [Barthes, 1966; Pavel, 1985; Chatman, 1978]).",
        "Chatman subdivides events, as constituting elements of story, into kernels and satellites.",
        "Kernels cannot be deleted without disturbing the logic of the plot.",
        "Satellites contribute first of all aesthetically, so that their deletion is logically possible.",
        "A difference lies in the size of the analysed segments.",
        "Linguistically inspired theories include propositions (clauses) as basic level, but descriptions using these theories often stop at the level of one or several paragraphs (an exception is [Longacre, 2003]).",
        "Narratological analyses usually concentrate on larger segments, represented by paraphrases of their propositions [Chatman, 1978:54]."
      ]
    },
    {
      "heading": "Discourse Graphs for Type 1 Narrative Levels",
      "text": [
        "To a certain degree, the narratological description of narrative levels constrains which relations might hold between narrations of a “levelled” global narrative.",
        "Still, it does not completely disambiguate the global discourse structure.",
        "In fact, in a typical Type 1 narrative (Table 6), the inner narration b might be related in two competing ways to nar",
        "ration a.",
        "The first analysis relates a and b based on a local, lexical consideration: a NARRATION is regarded as an argument of the verb phrase that evokes NARRATING.",
        "This is illustrated by Example (1).",
        "If NARRATED TextType filler (e.g. “a story”) is present in a sentence, the English verb tell allows an implicit LinguisticSurfaceRealization (1a).",
        "This – initially underspecified – argument of tell might then be realized in a subsequent sentence (1b), so that an Elaboration relation holds between (1a) and (1b).",
        "In nucleus-satellite terms, (1a) is a nucleus elaborated by (1b).",
        "(1) a.",
        "[a toldBy i] John told a story to Mary.",
        "b.",
        "“[b toldBy j] I was seventeen years old, and [ ... ].”",
        "The proposed analysis is in line with Asher and Lascarides [2003:285], who identify an Elaboration relation between the propositions (2a) and (2b) of Example (2).",
        "(2) a. John made a promise to Mary.",
        "b.",
        "He would phone her.",
        "The possibility that the resulting discourse graph (Figure 10) indeed holds for a global narrative increases if the NarrativeSequence representing narration b is relatively short.",
        "This also confirms that in these cases, the DirectLin-guisticSurfaceRepresentation of the content of b is an aesthetical choice rather than a “plot-logical” necessity.",
        "The presented analysis based on local features does not always seem globally appropriate as well.",
        "Outer narrations often set the background for a (longer) inner narration at the start of the discourse_sequence, and draw conclusions, interpret or evaluate it at the end.",
        "Figure 11 shows the corresponding graph, in which the segment representing narration b is nucleus of two relations.7 This corresponds to a “schema” identified by Mann and Thompson [1988:247].",
        "Danlos [2004:130] presents similar double-nuclear structures (“factorized” nuclei) at the sentence level.",
        "Both presented graphs are plausible.",
        "The final choice for a given global narrative depends not on narratological discourse description alone, but on story contents as well."
      ]
    },
    {
      "heading": "6.4 Processing Examples",
      "text": [
        "This subsection briefly sketches two examples of how the Story Generator and the Narratological Structurer (cf.",
        "Figure 3) could cooperate during the creation of typical Type 1 narrative levels (cf. Subsection 6.2)."
      ]
    },
    {
      "heading": "Adding an Outer Narration",
      "text": [
        "The Story Generator creates Story A. Respecting the conditions for a Type 1 narrative, the Narratological Structurer requests an additional Story B, with some restrictions:",
        "• B is shorter than A; • B contains a NARRATING event.",
        "The Story Generator generates Story B.",
        "This might be a minimal story consisting of the events MEETING (of characters c1 and c2), NARRATING (of a story by c1), REACTION (of c2).",
        "Upon receipt of B, the Narratological Structurer fills",
        "Story A into the Narrated slot of the NARRATING event in B, tags it as direct speech for the subsequent processing modules, and arranges all contents into a discourse tree corresponding to Figure 11.",
        "Story A has become an inner narration and a nucleus, Story B is the outer narration."
      ]
    },
    {
      "heading": "Adding an Inner Narration",
      "text": [
        "The Story Generator creates Story A which contains a NARRATING event.",
        "The Narratological Structurer requests an additional Story B, with the following restrictions:",
        "• B is shorter than A; • the contents of B illustrate a part of A, for example an",
        "event present in A, or a character trait of the NarrativeInstance of the NARRATING event.",
        "The Story Generator generates Story B.",
        "For instance, the illustration of A might be achieved by similarity: if Story A contains a CRIME event (e.g. KIDNAPPING), Story B can contain a CRIME event as well (e.g. ROBBERY).",
        "The Narratological Structurer now fills the new Story B into the Narrated slot of the NARRATING event in A, tags it as direct speech, and arranges all contents into a discourse tree, this time corresponding to Figure 10.",
        "Story A has become an outer narration, Story B is the inner narration and a satellite."
      ]
    },
    {
      "heading": "7 Conclusions and Future Work",
      "text": [
        "The proposed system architecture combines Story Generation, narratological structuring and traditional NLG components into an advanced NLG system for the production of narratives.",
        "Starting with the narrative levels parameter, domain modelling and meta-knowledge modelling for the Narratological Structurer were exemplified.",
        "Future work will include comments by narrators, some of which can be compared to “global level” discourse markers.",
        "Further narratological parameters will be modelled, and constraints will be formulated for their accumulation.",
        "A cognitive approach might work out their aesthetical effects.",
        "For example, certain receptional states or strategies could be identified as “prototypically” activated, enabled, or blocked by a given combination of narratological parameter instantiations.",
        "Finally, content-related studies will lead to concrete proposals for the interaction between a Narratological Structurer and one of the existing Story Generators."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research is supported by DFG (German Research Foundation) grant ME 1546/2-1.",
        "Thanks go to all members of the Narratology Research Group Hamburg, especially to Rolf Krause, Jan Christoph Meister and Stefanie Thiedig, as well as to three anonymous reviewers for their comments."
      ]
    }
  ]
}
