{
  "info": {
    "authors": [
      "Christian Jacquemin"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P99-1044",
    "title": "Syntagmatic and Paradigmatic Representations of Term Variation",
    "url": "https://aclweb.org/anthology/P99-1044",
    "year": 1999
  },
  "references": [
    "acl-J92-4004",
    "acl-P97-1004",
    "acl-P98-1082"
  ],
  "sections": [
    {
      "heading": "BP 133 91403 ORSAY Cedex FRANCE",
      "text": []
    },
    {
      "heading": "Abstract",
      "text": [
        "A two-tier model for the description of morphological, syntactic and semantic variations of multi-word terms is presented.",
        "It is applied to term normalization of French and English corpora in the medical and agricultural domains.",
        "Five different sources of morphological and semantic knowledge are exploited (MULTEXT, CELEX, AGROVOC, Word-Net1.6, and Microsoft Word97 thesaurus)."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In the classical approach to text retrieval, terms are assigned to queries and documents.",
        "The terms are generated by a process called automatic indexing.",
        "Then, given a query, the similarity between the query and the documents is computed and a ranked list of documents is produced as output of the system for information access (Salton and McGill, 1983).",
        "The similarity between queries and documents depends on the terms they have in common The same concept can be formulated in many different ways, known as variants, which should be conflated in order to avoid missing relevant documents.",
        "For this purpose, this paper proposes a novel model of term variation that integrates linguistic knowledge and performs accurate term normalization.",
        "It relies on previous or ongoing linguistic studies on this topic (Sparck Jones and Tait, 1984; Jacquemin et al., 1997; Hamon et al., 1998).",
        "Terms are described in a two-tier framework composed of a paradigmatic level and a syntagmatic level that account for the three linguistic dimensions of term variability (morphology, syntax, and semantics).",
        "Term variants are extracted from tagged corpora through FASTR1, a unification-based transformational parser described in (Jacquemin et al., 1997).",
        "Four experiments are performed on the French and the English languages and a measure of precision is provided for each of them.",
        "Two experiments are made on a French corpus [AGRIC] composed of 1.2 x 106 words of scientific abstracts in",
        "www .",
        "lime i .",
        "f r / Individu/ j acquemi /FASTR.",
        "the agricultural domain and two on an English corpus [MEDIC] composed of 1.3 x 106 words of scientific abstracts in the medical domain.",
        "The two experiments in the French language are [AGRIC] + Word97 and [AGRIC] + AGROVOC.",
        "In the former, synonymy links are extracted from the Microsoft Word97 thesaurus; in the latter, semantic classes are extracted from the AGROVOC thesaurus, a thesaurus specialized in the agricultural domain (AGROVOC, 1995).",
        "In both experiments, morphological data are produced by a stemming algorithm applied to the MULTEXT lexical database (MULTEXT, 1998).",
        "The two experiments on the English language are [MEDIC] + WordNet 1.6 or [MEDIC] + Word97; they correspond to two different sources of semantic knowledge.",
        "In both cases, the morphological data are extracted from CELEX (CELEX, 1998)."
      ]
    },
    {
      "heading": "2 Term Variation: Representation and Exploitation",
      "text": [
        "Terms and variations are represented into two parallel frameworks illustrated by Figure 1.",
        "While terms are described by a unique pair composed of a structure – at the syntagmatic level – and a set of lexical items – at the paradigmatic level – , a variation is represented by a pair of such pairs: one of them is the source term (or normalized term) and the other one is the target term (or variant).",
        "The syntagmatic description of a term is a context free rule; it is complemented with lexical information embedded in a feature structure denoted by constraints between paths and values.",
        "For instance, the term speed measurement is represented by:",
        "This term is a noun phrase composed of a head noun N1 and a modifier N2; the lemmas are given by the constraints at the paradigmatic level.",
        "This framework is similar to the unification-based representation of context-free grammars of (Shieber, 1992).",
        "At the syntagmatic level, variations are represented by a source and a target structure.",
        "At the paradigmatic level, the lexical elements of variations are not instantiated in order to ensure higher generality.",
        "Instead, links between lexical elements are provided.",
        "They denote morphological and/or semantic relations between lexical items in the source and target structures of the variation.",
        "For example, the variation that associates a Noun-Noun term such as the preceding term speedN, measurementN, with a verbal form of the head word and a synonym of the argument such as measuringvi maximal A shorten",
        "If this variation is instantiated with the term given in (1), it recognizes the lexico-syntactic structure V1 (Prep?",
        "Det?",
        "(A INIPart)*) NI2 (3) in which V1 and measurement are morphologically related, and N'2 and speed are semantically related.",
        "The target structure is underspecified in order to describe several possible instantiations with a single expression and is therefore called a candidate variation.",
        "In this example, a regular expression is used to under-specify the structure2; another solution would be to use quasi-trees with extended dependencies (Vijay-Shanker, 1992)."
      ]
    },
    {
      "heading": "3 Paradigmatic relations",
      "text": [
        "As illustrated by Figure 2 and Formula (2), there are two types of paradigmatic relations between lemmas",
        "involved in the definition of term variations: morphological and semantic relations.",
        "The morphological family of a lemma 1 is denoted by the set Fm(/) and its semantic family by the set Fs,, (/) or Fs,(1).",
        "Roughly speaking, two words are morphologically related if and only if they share the same root.",
        "In the preceding example, to measure and measurement are in the same morphological family because their common root is to measure.",
        "Let L be the set of lemmas, morphological roots define a binary relation M from to that associates each lemma with its root(s): M E 44 G. M is not a function because compound lemmas have more than one root.",
        "The morphological family Fm(1) of a lemma 1 is the set of lemmas (including 1) which share a common root with 1:",
        "(Ine) is the power-set of G, the set of its subsets.)",
        "There are principally two types of semantic relations: direct links through a binary relation SL E 44 E or classes C E P(G)).",
        "In the case of semantic links, the semantic family Fsi, (1) of a lemma 1 is the set of lemmas (including 1) which are linked to 1:",
        "In the case of semantic classes, the semantic family Fs, (1) of a lemma l is the union of all the classes to which it belongs:",
        "Links and classes are equivalent, the choice of either model depends on the type of available semantic data.",
        "In the experiments reported here, direct links are used to represent data extracted from the word processor Microsoft Word97 because they are provided as lists of synonyms associated with each lemma.",
        "Conversely, the synsets extracted from WordNet 1.6 (Fellbaum, 1998) are classes of disambiguated lemmas and, therefore, correspond to the second technique.",
        "With respect to the definitions of semantic and morphological families given in this section, the candidate variant (3) is such that V1 E Fm(measurement) and INT12 E FsL(speed) or 1\\112 E Fsc(speed)."
      ]
    },
    {
      "heading": "4 Morphological and Semantic Families",
      "text": [
        "In the experiments on the English corpora, the CELEX database is used to calculate morphological families.",
        "As for semantic families, either WordNet 1.6 or the thesaurus of Microsoft Word97 are used."
      ]
    },
    {
      "heading": "Morphological Links from CELEX",
      "text": [
        "In the CELEX morphological database (CELEX, 1998), each lemma is associated with a morphological structure that contains one or more root lemmas.",
        "These roots are used to calculate morphological families according to Formula (4).",
        "For example, the morphological family Fm(measurementN) of the lemmas with measurev as root word is"
      ]
    },
    {
      "heading": "Semantic Classes from WordNet",
      "text": [
        "Two sources of semantic knowledge are used for the English language: the WordNet 1.6 thesaurus and the thesaurus of the word processor Microsoft Word97.",
        "In the WordNet thesaurus, disambiguated words are grouped into sets of synonyms – called synsets – that can be used for a class-based approach to semantic relations.",
        "For example, each of the five disambiguated meanings of the polysemous noun speed belongs to a different synset.",
        "In our approach, words are not disambiguated and, therefore, the semantic family of speed is calculated as the union of the synsets in which one of its senses is included.",
        "Through Formula (6), the semantic family of speed based on WordNet is: Fsc(speedN) = {speedN, speedingN, hurryingN, hastening, swift-nessN, fastnessN, velocityN, amphetamines}."
      ]
    },
    {
      "heading": "Semantic Links from Microsoft Word97",
      "text": [
        "For assisting document edition, the word processor Microsoft Word97 has a command that returns the synonyms of a selected word.",
        "We have used this facility to build lists of synonyms.",
        "For example, FsL(speedN) = {speedN, swiftnessN, velocityN, guicknessN rapidityN, accelerationN, alacritYN) celerityN} (Formula (5)).",
        "Eight other synonyms of the word speed are provided by Word97, but they are not included in this semantic family because they are not categorized as nouns in CELEX."
      ]
    },
    {
      "heading": "5 Variations",
      "text": [
        "The linguistic transformations for the English language presented in this section are somehow simplified for the sake of conciseness.",
        "First, we focus on binary terms that represent 91.3% of the occurrences of multi-word terms in the English corpus [MEDIC].",
        "Then, simplifications in the combinations of types of variations are motivated by corpus explorations in order to focus on the most productive families of variations.",
        "The 3 Dimensions of Linguistic Variations There are as many types of morphological relations as pairs of syntactic categories of content words.",
        "Since the syntactic categories of content words are noun (N), verb (V), adjective (A), and adverb (Adv), there are potentially sixteen different pairs of morphological links.",
        "(Associations of identical categories must be taken into consideration.",
        "For example, Noun-Noun associations correspond to morphological links between substantive nouns such as agent/process: promoter I promotion.)",
        "Morphological relations are further divided into simple relations if they associate two words in the same position and crossed relations if they associate a head word and an argument.",
        "Combining categories and positions, there are, in all, 64 different types of morphological relations.",
        "In (Hamon et al., 1998), three types of semantic relations are studied: a link between the two head words, a link between the two arguments, or two parallel links between heads and arguments.",
        "These authors report that double links are rare and that their quality is low.",
        "They only represent 5% of the semantic variations on a French corpus and they are extracted with a precision of 9% only.",
        "We will therefore focus on single semantic links.",
        "Since we are only concerned with synonyms, only two types of semantic links are studied: synonymous heads or synonymous arguments.",
        "The last dimension of term variability is the structural transformation at the syntagmatic level.",
        "The source structure of the variation must match a term structure.",
        "There are basically two structures of binary terms: X1 N2 compounds in which X1 is a noun, an adjective or a participle, and N1 Prep N2 terms.",
        "According to (Jacquemin et al., 1997), there are three types of syntactic variations in French: coordinations (Coor), insertions of modifiers (Modif), and compounding/decompounding (Comp).",
        "Each of these syntactic variations is further subdivided into finer categories."
      ]
    },
    {
      "heading": "Multidimensional Linguistic Variations",
      "text": [
        "The overall picture of term variations is obtained by combining the 64 types of morphological relations, the two types of semantic relations and the three types of syntactic variations (and their sub-types).",
        "There are different constraints on these combinations that limit the number of possible variations:",
        "1.",
        "Morphological and semantic links must operate on different words.",
        "For example, if the head word is transformed by a morphological link, the only word available for a semantic link is the argument word.",
        "2.",
        "The target syntactic structure must be compatible with the morphological transformations.",
        "For example, if a noun is transformed into a verb, the target structure must be a verb phrase.",
        "These two constraints influence the way in which a variation can be defined by combining different types of elementary modifications.",
        "Firstly, lexical relations are defined at the paradigmatic level: morphological links, semantic links or identical words.",
        "Then a syntactic structure that is compatible with the categories of the target words is chosen.",
        "The list of variations used for binary compound terms in English is given in Table 1.3 It has been experimentally refined through a progressive corpus-based tuning.",
        "The Synt column gives the target syntactic structure.",
        "The Morph column describes",
        "the morphological link: a source and a target syntactic category and the syntactic positions of the source and target lemmas.",
        "The Sem column indicates whether the variation involves a semantic link and the position of the lemmas concerned by the link (both lemmas must have an identical position).",
        "The Pattern column gives the target syntactic structure as a function of the source structure which is either",
        "N1 is a noun in the morphological family of A1 (noted Fm (Ai )N) and 1•112 is semantically related with N2 (noted Fs (N2)).",
        "This variation recognizes malignancy in orbital tumours as a variant of malignant tumor because malignancy and malignant are morphologically related, tumour and tumor are semantically related, and malignancyN nprep orbitalA tumoursN matches the target pattern.",
        "Variation #56 is a more elaborated version of variation (2) given in Section 2."
      ]
    },
    {
      "heading": "Sample Syntactico-semantic Variants from [MEDIC]",
      "text": [
        "The first 36 variations in Table 1 do not contain any morphological link.",
        "They are built as follows.",
        "Firstly, the different structures of noun phrases are used as target structures.",
        "Twelve structures are proposed: head coordination (#1), argument coordination (#4), enumeration with conjunction (#7), enumeration without conjunction (#10), etc.",
        "Then each transformation is enriched with additional semantic links between the head words or between the argument words.",
        "Semantic links between argument words are found in variations #(3n + 2)0<n<11 and between head words in variations #(3n)1<n<12.",
        "(Due to the lack of space, only variations #2 and #3 constructed on top of variation #1 are shown in Table 1.)",
        "Sample variants from [MEDIC] for the first 36 variations are given in Table 2.",
        "Some variations have not matched any variant in the whole corpus."
      ]
    },
    {
      "heading": "Sample Morpho-syntactico-semantic Variants",
      "text": [
        "Morpho-syntactico-semantic variations are numbered #37 to #62 in Table 1.",
        "Only 10 of the 64 possible morphological associations are found in the list of morphological links: Noun to Adjective on arguments (#37), Adjective to Noun on arguments (#39), etc.",
        "Each of these variations is doubled by adding a semantic link between the words that are not morphologically related.",
        "For example, variation (#40) is deduced from variation (#39) by adding a semantic link between the head words.",
        "Sample variants are given in Table 3."
      ]
    },
    {
      "heading": "6 Evaluation",
      "text": [
        "We provide two evaluations of term variant conflation.",
        "First, we calculate precision rates through a manual scanning of the variants.",
        "Secondly, we evaluate the numbers of variations extracted through the four experiments.",
        "Precision Because of the large volumes of data, only experiments on the French corpus are evaluated.",
        "[AGRIC] + AGROVOC produces 2,739 variations and 2,485 of them are selected as correct.",
        "Since the number of synonym links proposed by Word97 is higher, the number of variants produced by [AGRIC] + Word97 is higher: 3,860.",
        "3,110 of them are accepted after human inspection.",
        "The two experiments produce the same set of non-semantic variants (syntactic and morpho-syntactic variants).",
        "Associated values of precision are reported in Tables 4 and 5.",
        "The semantic variations are divided into two subsets: \"pure\" semantic variations and semantic variations involving a syntactic transformation and/or a morphological link.",
        "Their precisions are given in Tables 6 and 7.",
        "As far as precision is concerned, these tables show that variations are divided into two levels of quality.",
        "On the one hand, syntactic, morpho-syntactic and pure semantic variations are extracted with a high level of precision (above 78%, see the \"Total\" values in Tables 4 to 6).",
        "On the other hand, the",
        "combination of semantic links with syntax or with morphology results in poor precision (55% precision in average with the AGROVOC semantic links and 29.4% precision with the Word97 links, see line \"Total\" in Table 7).",
        "The lower precision of hybrid variations is due to a cumulative effect of semantic shift through combined variations.",
        "For instance, former un reseau continu (build a continuous network) is incorrectly extracted as a variant of formation permanente (continuing education) through a Noun-to-Verb variation with a semantic link between argument words.",
        "The verb former and the associated deverbal noun formation are two polysemous words.",
        "In formation permanente, the meaning is related to a human activity (to train) while, in former un reseau continu, the meaning is related to a physical construction (to build).",
        "Despite the relatively poor precision of hybrid variations, the average precision of term conflation is high because hybrid variations only represent a small fraction of term variations (5.4% and 0.9%, see lines \"+ sem\" in Table 8 below).",
        "The average precision on [AGRIC] + Word97 is 79.8% and the average precision on [AGRIC] + AGROVOC is 91.1%.",
        "The exploitation of semantic links extracted from WordNet in term variant extraction does not suffer from the problem of ambiguity pointed out for query expansion in (Voorhees, 1998).",
        "The robustness to polysemy is due to the fact that we are dealing with multiword terms that build restricted linguistic contexts in which words are disambiguated."
      ]
    },
    {
      "heading": "Numbers of Variants",
      "text": [
        "Table 8 shows the numbers of term variants extracted by the four experiments.",
        "For each experiment and for each type of variation, three values are reported: the number of variants v of this type and two percentages indicating the ratio of these variants.",
        "The first percentage is f in which V is the total number of variants produced by this experiment.",
        "The second percentage is in in which T is the number of (non-variant) term occurrences extracted by this experiment.",
        "The last line of Table 8 shows that variants represent a significant proportion of term occurrences (from 27.3% to 37.3%).",
        "The distribution of the different types of variants depends the semantic database and on the language under study.",
        "WordNet 1.6 is a productive source of knowledge for the extraction of semantic variants: In the experiment [MEDIC] WordNet, semantic variants represent 58.6% of the variants, while they only represent 4.9% of the variants in the [AGRIC] + AGROVOC experiment.",
        "These values are reported in the line \"Tot.",
        "Sem\" of Table 8.",
        "Such results confirm the relevance of non-specialized semantic links in the extraction of specialized semantic variants (Hamon et al., 1998)."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "The model proposed in this study offers a simple and generic framework for the expression of complex term variations.",
        "The evaluation proposed at the end of this paper shows that term variations are extracted with an excellent precision for the three types of elementary variations: syntactic, morpho-syntactic and semantic variations.",
        "The best performance is obtained with WordNet as source of semantic knowledge.",
        "Ongoing work on German, Japanese and Spanish shows that such a transformational and paradigmatic description of term variability applies to other languages than French and English reported in this study."
      ]
    },
    {
      "heading": "Acknowledgement",
      "text": [
        "We would like to thank Jean Royaute and Xavier Polanco (INIST-CNRS) for their helpful collaboration.",
        "We are also grateful to Beatrice Daille (IRIN) for running her termer ACABIT on the data and to Olivier Ferret (LIMSI) for the Word97 macro-function used to extract the thesaurus."
      ]
    }
  ]
}
