{
  "info": {
    "authors": [
      "Wu-Guang Shi"
    ],
    "book": "Proceedings of the Fourth SIGHAN Workshop on Chinese Language Processing",
    "id": "acl-I05-3034",
    "title": "Chinese Word Segmentation Based on Direct Maximum Entropy Model",
    "url": "https://aclweb.org/anthology/I05-3034",
    "year": 2005
  },
  "references": [
    "acl-P02-1038",
    "acl-P03-1035"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Chinese word segmentation is a fundamental and important issue in Chinese information processing.",
        "In order to find a unified approach for Chinese word segmentation, the author develop a Chinese lexical analyzer PCWS using direct maximum entropy model.",
        "The paper presents the general description of PCWS, as well as the result and analysis of its performance at the Second International Chinese Word Segmentation Bakeoff."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Och and Ney(2002) present a framework based on direct maximum entropy model to construct the machine translation system.",
        "The model treats knowledge sources as feature functions, and allows the system to be extended easily by adding new feature functions.",
        "We think the model can be used to provide a unified approach for Chinese word segmentation.",
        "PCWS is the system based on this thinking.",
        "of the unknown words.",
        "The unknown words handled by the system involve numeric expression, time expression, personal name, location name and organization name.",
        "PCWS can recognize the abbreviation of person name, and fail to find the abbreviation of location name and organization name.",
        "PCWS constructs an integrated segmentation graph.",
        "The node in the graph is the minimal segmentation unit that cannot be split in any stage that follows.",
        "The unit consists of Chinese character, punctuation, Arabic numeral string and English character string.",
        "Every word that be generated is an edge in the graph.",
        "Making the integrated segmentation graph is to avoid the blind spots in segmentation, but it brings the graph more complex, and make the system’s speed slow.",
        "Every word will belong to a class.",
        "Given a word Wi, its class is defined by Figure 1."
      ]
    },
    {
      "heading": "2 System Description",
      "text": [
        "PCWS consists of four components: Word generation, Disambiguation, Select the best word sequence and Output the result.",
        "They are described below."
      ]
    },
    {
      "heading": "2.1 Word Generation",
      "text": [
        "The procedure of word generation involves two steps: (1) generation of the common words which are listed in the Dictionary.",
        "(2) generation"
      ]
    },
    {
      "heading": "2.2 Disambiguation",
      "text": [
        "In constructing the graph, PCWS detect the ambiguities of the segmentation and classify the ambiguities into two classes: the false ambiguity and the true ambiguity.",
        "The former is simply solved by querying a table.",
        "The segmentation information around the true ambiguities will be collected and PCWS will give an estimate of each possible segmentation mode of the true",
        "ambiguities.",
        "These estimates will be used by selecting the best path."
      ]
    },
    {
      "heading": "2.3 Select the Best Word Sequence",
      "text": [
        "The procedure of this part consists of two processes: generating the candidate word sequences and finding the best word sequence.",
        "If S is a Chinese sentence which is a character sequence, W is the all possible word sequences given S, w# = {W1 W2 ... WN} is a word sequence, G={C1 C2 ... CN} is a corresponding class sequence of #.",
        "We use Viterbi algorithm to generate the candidate paths.",
        "In order to control the search space, all the paths will be ranked by a class mode score.",
        "The maximum number of the candidate paths generated by each node in the graph cannot be larger than a Number threshold we give.",
        "The class mode score we used can be written as Score(w#) =Pgenerate (w# |c) Pctext (c) The P(C) and P(w# C) is similar to the one defined by Gao et al.(2003).",
        "We use the direct maximum entropy model to find the best word sequence.",
        "If is the best path we need.",
        "W* is the candidate set.",
        "Giving the direct maximum entropy model and neglecting its renormalization, we can obtain the following decision rule:",
        "hi (W# S) is the feature function of the word sequence.",
        "The parameter i is the power of the feature.",
        "In PCWS, we define five feature functions:",
        "1) Context feature h1 (w#, s) = log Pcontext (c) 2) Candidate person name feature",
        "The component outputs the best word sequence and adjusts the result form based on the standard of test corpora.",
        "In PCWS, we only adjust the form of the unknown words the system recognizes.",
        "Base on the standard of Msr corpora, we combine the continuous words which belong to the class TIME.”"
      ]
    },
    {
      "heading": "3 Evaluation",
      "text": [
        "Because of the bakeoff’ s rule and the limit of time, we only attend the track of Msr_open.",
        "Table 1 is the result of PCWS in this bakeoff.",
        "Form the table, we can know the system is remarkable in OOV recognize.",
        "Due to only small named entity words are included in the PCWS’s dictionary, most of named entity words are generated by the system.",
        "However, the system’s overall performance is not in balance with its good Roov.",
        "We notice Riv of the result is low.",
        "The main reason causes Riv low is the difference between the segmentation standard of PKU training corpora and the segmentation standard of MSR test corpora.",
        "The difference is so distinctly even in the segmentation standard of common words.",
        "For instance:",
        "Before we get the result, we neglected the problem.",
        "We put our attention in named entity recognize, which need the training corpora with the label information, so we use six month PKU corpora to construct our system and not use well the MSR training corpora in the bakeoff.",
        "In order to know the influence of the problem, we test our system in PKU test corpora, Table 2 is the result of PCWS in the test.",
        "It’s an excellent result and powerful proves our suppose.",
        "We wish to make our system more adaptable to different standards in the near future."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "We have presented our Chinese word segmentation system PCWS and its result for Msr_open track.",
        "We are glad to see its good performance of OOV recognize.",
        "In the course of the bakeoff, we find some problems in PCWS.",
        "We will try to select more useful feature functions into the existing segmentation model in future work.",
        "We are confident the system’s performance will have a big progress next time."
      ]
    },
    {
      "heading": "5 Acknowledgement",
      "text": [
        "Thank Prof. Hou-Feng Wang for his attention and aid.",
        "The author would especially express gratitude to his family, their encouragement and support make the author to hold the line."
      ]
    }
  ]
}
