{
  "info": {
    "authors": [
      "Salvador Climent"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-1042",
    "title": "Semantics of Portions and Partitive Nouns for NLP",
    "url": "https://aclweb.org/anthology/C96-1042",
    "year": 1996
  },
  "references": [
    "acl-T78-1003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes a system of representation of nouns denoting portions, segments and relative quantities of entities, in order to account for this case of part-whole relationship.",
        "The semantics of both constructions denoting portions and nouns used to build them are discussed and eventually formalised in a unification-based formalism (LKB-LRL) in terms of Pustejovsky's Theory of Qualia and Jackendoff's Conceptual Semantics.",
        "I.",
        "Introduction and Motivation Processes of inference of meaning concerning part-whole relations can be drawn from a lexicon bearing meronymic links between words (cf. [WAI.881) e.g. component-whole links (hand-arm), member-collection (tree-forest) and so.",
        "The case of portions, segments and relative quantities of objects or substances (slices, lumps, buckets, spoonfuls, grains, tops or tips of things) is the exception, since this is a relation which is encoded in the language by means of constructions.",
        "Contrary to that which some authors posit (ICIIA881, MIN871), it doesn't seem to be a productive linguistic generalisation to set in a lexicon some part-of link between slice and cake.",
        "In any case, such relation would exist between cake and slice of cake -namely, the part-of relation should stand between slice and any sliceable thing.",
        "Generally speaking, the relation portion may be characterised, semantically, in that the whole preexists the part and the part retains most of the properties of the whole ([110881), and, syntactically, as surfacing in <X of NP> structures, being potentially <X> an apparently heterogeneous collection of words which, henceforth, following [COP921 We will refer to as Partitive Nouns (PNs).",
        "On the other hand, portions denoted by such constructions differ from their wholes in sonic aspects, basically individuation, quantity, process of bringing about, and shape.",
        "Such properties, since they are present in <X of NP> but they were not in <NP>, are assumed to be carried to the construction by the noun (<X>).",
        "I'll try to show here that it is plausible to give a global account of such heterogeneous set of words, since they hear a range of common and distinctive linguistic features, and I'll try to provide a representation feasible for NLP which account both for PNs as a general class and for the homogeneous subclasses which within them could he distinguished and definedl."
      ]
    },
    {
      "heading": "2. Framework",
      "text": [
        "We assume some general familiarity with the framework We work within: LKB-LRI, ([COIXJ21) as a formalism of computational representation, The Generative Lexicon ([PUS95]) as a theoretical ground for the formalisation of lexical signs, and Conceptual Semantics (lJAC911) for the conceptualisation of parts and boundaries of entities.",
        "LKB-LRL is an IIPSG-like formalism based on typed feature structures (ICAl2921) developed within the Acquilex Project which makes use of unification and mechanisms of default inheritance.",
        "There arc four basic levels of representation: ORTII, CAT, SEM and RQS.",
        "CAT encodes syntax using a categorial grammar approach, so there are simple (e.g. noun: N) and complex (e.g. adjective: N/N) categories.",
        "It is to he noticed that in complex categories the active element is not a category hut a lexical sign, in a way that selective restrictions may he set at this level by specifying the semantic type or other features of the selected sign.",
        "SEM encodes logical semantics.",
        "RQS is basically equivalent to Pustejovsky's Qualia Structure (henceforth QUALIA).",
        "'the Theory of Qualia is embedded in that of the Generative Lexicon and has as a basic aim to improve compositionality by endowing lexical signs with a rich internal structure which accounts for different facets of human knowledge about lexical-semantic content., in a way that, in many cases, it allows for avoiding listing separate entries to account for lexical polysemy.",
        "[PUS951 posits the lexical entry to be constituted by four structures: Event, Argument, Lexical-Inheritance and QUALIA.",
        "The latter consists of four Quales: Agentive (origin or 'bringing alvue of objects), Telic (purpose and function), Formal (that which distinguishes it within a larger domain: magnitude, shape, dimensionality) and Constitutive (relation between an object and its constituents or This work has been developped for Spanish.",
        "Notwithstanding, for ease of exposition, I'll exemplify the discussion by means of examples of English when possible.",
        "In any case, for what concerns us here, Spanish and English are, both semantically and structurally, strongly comparable the kernel <PN of NY> comes out in Spanish as a literal translation, <PN de NP>.",
        "proper parts).",
        "[JAC9 I] posits that speakers understand and schematise a range of phenomena such as mass-count distinction, plurality, partitive constructions and boundary words in terms of elementary conceptual features such as dimensionality, idealised boundaries and internal structure.",
        "Ile introduces features [B] (boundaries being or not in view or of concern) and [I] (entailment or not about internal structure) for both objects and events as expressing the generality of phenomena of boundedness and plurality the notion of I is present in one or another way in l7'AL781 (cf. PAC911), IKRI871 (cf. [CON2]) and IILAK871; that of boundedness in [LAN91].",
        "This feature system comes out as: +B -I: individuals (a pig)/closed events (John ran to the store) +B+I: groups (a committee)lbounded iterative events (the light flashed until down) -B-I: substances (water)/ unbounded homogeneous processes (John slept) -B+I: aggregates (buses, cattle)!",
        "unbounded iterative processes (the light flashed continually) Moreover, he posits that boundaries of entities are conceptualised as minimal elaborations (notated e) of their ideal topological boundaries (i.e.the tip of the tongue is the portion which corresponds to a minimal elaboration of the 0-dimensional point which would ideally be the tongue's tip)."
      ]
    },
    {
      "heading": "3. Portions and Partitive Nouns",
      "text": [
        "A portion designs a bounded region within a domain ([LAN91]), hence the portion is an individuated entity (even in the case the whole be a substance or mass).",
        "The syntactic effect is that, as pointed out in [VOS94], the construction which denotes the portion is syntactically countable.",
        "A portion, an individuated (bounded), object has a shape different from that of the whole.",
        "This information is contributed to the construction by the PN.",
        "There are PNs which clearly specify shape (RODAJA, lump) while others underspecify it (fragment).",
        "In many cases, PNs, as adjectives do, predicate properties of the portion, specially shape (the translation of Spanish RODAJA must he the paraphrase round slice; a lath of anything is saliently elongated) or size, but also thickness, consistency or others (as in the case of MENDRUGO, equivalent to portion (of bread) except for the fact that.",
        "entails that the bread is not fresh but stale).",
        "A portion always conveys a measure with relation to the total magnitude of the whole.",
        "Therefore, nouns such as bucket, ,slice, lump or grain are relative quantifiers in the sense of [LAN9 a relative quantifier is so-called because it specifies a quantity in relation to a reference mass; in the default-case interpretation, this reference mass consists of the maximal instantiation of the pertinent category (i.e. its full extension in all conceivable worlds).",
        "A portion has been obtained by a different process than the whole: a cake has been obtained by baking it, hut a slice of cake by cutting it off the cake.",
        "The meaning of portions is many times tightly related to such agentive process if one has obtained 'slices' it necessarily has been by cutting something; there even exists the verb to slice.",
        "As pointed out in IPUS951, knowledge of 'coming into being' is a property of nominals which has remarkable linguistic consequences since it can account for a reduction of lexical polysemy.",
        "For instance, the Spanish phrase HACER PAN [to-make bread] means baking bread, whilst HACER REBANADAS (DP PAN) [to-make slices (of bread)] means slicing (bread).",
        "This way, the very same verb IIACER shows two radically different meanings, which in principle should be listed separately in the lexicon.",
        "Nevertheless, both can be accounted for in a single entry which selects the Agentive Role of the complement.",
        "More specifically talking about the lexical signs we call PNs, [LY077] shows that they correspond to the classifiers in languages as Tzeltal, Mandarin Chinese or Vietnamese.",
        "In languages with classifiers, these words, semantically strongly similar to determiners and quantifiers, have functions of individuation and enumeration, making surface notions such as sort of entity, shape or measure.",
        "E.g. the Chinese phrase SAN BEN SIR) is translatable by three plane-entity book; three whiskies would be constructed with a mensural classifier, being the translation paraphrasable by three unit/doses whisky.",
        "[LY077] makes notice that words such as head (of cattle), sheet (of paper) or lump (of sugar) stand for exactly the same function as classifiers in those languages.",
        "Specifically, 1 u nap operates simultaneously as both a mensural (meaning conventional dose) and classal (denoting a certain type of aggregate) classifier.",
        "Some have assumed that PNs select mass nouns (slice of cake, glass of wine), being mass nouns the way in which substances tipically surface in the language.",
        "Instead, we posit that PNs select both kinds of nouns (count or mass) denoting both kinds of things (individuals or substances), but in any case, crucially, surfacing as expressing cumulative reference.",
        "Let's consider RODAJA DE LIMON [round-slice of lemon].",
        "To assume that LIMON here is mass entails assuming that it has undergone a derivational 'grinding' rule which converts countable individuals in masses.",
        "Nevertheless, a round-slice of lemon is always a slice of some individual lemon, not a special measure of substance which some time in the past was 'lemon'.",
        "In any case, if a 'lemon' weren't an individuated and bounded thing, it couldn't be sliced and the shape of the portion wouldn't depend on that of the whole.",
        "The confusing point is that LIMON in the example, RODAJA DE LIMON, surfaces grammatically as substances usually do -namely, zero-determined.",
        "But zero-determination is not exclusively a ressource to refer to substances, it is the way of expressing cumulative reference.",
        "Both individuals and substances may he refered to cumulatively, that is, he construed as an indifferentiated amassment.",
        "This surfaces in the language as a zero-determiner plus the",
        "in: noun in singular in the case of substances (a glass of wine), and either in singular or plural in the case of individuals (a slice of lemon, a basket of lemons).",
        "So, in our point of view PNs tipically select the noun of the whole as it surfaces when construing cumulative reference hut this doesn't compulsorily entails neither the referent is a substance nor it is refered to by means of a mass noun.",
        "In the case of individuals, referents still are hounded things, hence both they can be sliced and the shape of their portions still can depend on that of the original whole.",
        "We can't go further with the issue here hut, at last, what the discussion above stands for is that human conceptualisation is considered as the cause, and the mass-count distinction, as the surface effect.",
        "PNs are not straightforwardly referential, as they predicate with reference to another entity.",
        "'ibis may be noticed considering sentences such as ?",
        "?John ate a slice or ?",
        "?I draught three cups.",
        "They are semantically uncomplete as they don't allow the hearer to retrieve from them the information the speaker wants to convey.",
        "Further information as in John ate a slice of cake or It was an excellent coffee.",
        "I draught three cups is needed to do the task.",
        "When appearing in the discourse, PNs need of further specification of the referent, either via of-complementation or via ellipsis or anaphora.",
        "Consequently, they can not he unary but relational predicates in the sense of II,AN911, that is, terms which are predicates only with reference to some other entity.",
        "A basic linguistic feature of PNs is that they, as relational predicates, bear selectional restrictions.",
        "Namely, each kind of PN can combine with certain referential nouns but can not combine with others, depending on certain features of the referential noun.",
        "These features are mostly linguistic (type, countability, singular or plural) but also can depend on knowledge of the world (physical state, etc.).",
        "We hypothesise that, in general, distinctions between classes of PNs concerning selectional restrictions must be due to linguistic reasons, while further specifications within each class would he due to properties of the referent.it could be assumed that containers (cups, baskets) select items (substances and plurals), and more specifically, cups",
        "select liquids and baskets non-liquids.",
        "4.",
        "Sorts of PNs",
        "We are not committed here to represent individuation of groups (tetun, committee) or aggregates (cattle, furniture).",
        "In our background ontology, which is intended to represent things in the world as conceptualised by humans (fig.1), these constitute a different class since, in this class of words, speakers' conceptualisation focuses not on the element entities but in their aggregation.",
        "Plurals are considered as representing an aggregation (therefore a -B+I concept)",
        "of bounded things (therefore either individuals or groups) by means of a derivative (lexical) rule applied on signs denoting those elements (fig.2) - e.g. cow --> cows, team --> teams; but gold,cattle --> *golds/*catt les).",
        "Entity-portioning terms have been sorted as follows: Contents (henceforth CUNT) (a bucket of water, a basket of wheat, a basket of lemons).",
        "They me metonymies of containers expressing a conventionalised measure or quantity of a [-B] entity.",
        "Shape is not relevant a bathtub may contain a bucket of water without there being any bucket in it",
        "Elements (1',l:1') (UN GA.10 DO LIMON [an 'inner-preexistent-division-of-some-fruitsW lemon], a grain of rice).",
        "They are individuations of preexisting parts of the whole.",
        "They selectentities, either individuals or substances.",
        "They are not committed to an Agentive process as they may remain attached to the whole.",
        "Shape and measure, if considered relevant, are inherent to the portion itself.",
        "Boundaries (BOUND) (the tip of the tongue, the surface of the sea, the top of a box).",
        "They are idealisations of physical boundaries of the whole.",
        "Select [+B] entities.",
        "They are non-Agentive either.",
        "Their shape is tightly related to that of the whole but one of their dimensions is conceptualised as close to non-existence (l,f AC9 ID.",
        "Analogously, they denote a minimal quantity of the whole.",
        "Both Detached (DTCII) (a slice of cake, a slice of lemon) and Modelled (MILD) portions (a lump of sugar, a sheet of paper) have been drawn out of the whole and bear a shape straightforwardly determined by such Agentive process.",
        "The meaning of the former focus on the Agentive, which is a process of cut or fragmentation of a [+B solid.",
        "The latter focus on shape, which is often conceptualised schematically(sheet: a plane; lump, ingot: brick-shaped).",
        "The Agentive is a process of modelling of a LB] substance.",
        "Summarising about selectional restrictions of these sorts of PNs, they come out as follows: ELT: select [+1] entities (=individuated or substance)",
        "a tongue, box, cake, LIMON) CONT: [-B] things (=substances, plurals/aggregates) (a 'container' of wheat, sugar, water, paper, cakes, tongues, boxes) DTCHD: [+B] entities (=individuated) (a 'detached portion' of a lemon, cake) MDLD: [-B] entities (=substances) (a 'shaped mass' of sugar, wheat, paper) With respect to shape, it has to be noticed that while that of ELT and MDLD is inherent to the portion itself (in ELT because the portion preexisted as an individual; in MDLD because the whole was an amorphous mass and it is the process of portioning what has bounded the new thing), in BOUND and DTCHD shape is somehow relative to the whole.",
        "This way, a RODAJA is round because it is a cross-cut of either approximately-spherical (lemon) or cylindrical (sausage) objects; a slice of bread will be elliptic or square depending on whether the 'bread' is the classical loaf or the modern polyhedric-shaped one; top of a box will show identical behaviour.",
        "Something similar happens with relative quantification.",
        "While the measure conveyed by CONT, ELT and MDLD is absolute, that of BOUND and DTCHD is relative: a top of a box or a slice of bread will be bigger or smaller depending on the magnitude of the box or the loaf of bread."
      ]
    },
    {
      "heading": "5. Representation",
      "text": [
        "To represent PNs in the LKB we have made some interpretations for FORMAL and CONST Quales of the QUALIA.",
        "We assume that the minimal and most basic FORMAL distinction among entities (as conceptualised by speakers) is that of their boundedness or not in terms of [JAC91].",
        "Therefore, this Quale will be assigned to one of both types (or a coherent subtype).",
        "Similarly, the minimal constitutive distinction to be done is assumed to be that of entailment or not about internal structure of QUALIA: [ TELIC: eat AGENTIVE: bake Composition things.",
        "Therefore, the CONST role will be assigned to one of both [I] types (i_str_true/i_str False).",
        "In this way, selectional restrictions of PNs will be basically defined as selection of signs bearing appropriate types for their FORMAL and CONST Quales.",
        "As defined in [PUS95], SHAPE and magnitude (MAGN) are features of the FORMAL Role.",
        "Their values can be, as discussed above, either absolute or relative, depending on the kind of portion.",
        "In the latter cases, SHAPE and MAGN of portions will be a function of the corresponding values of the QUALIA of the whole2.",
        "This interpretation of the MAGN feature accounts for the nature of relative quantifiers of PNs.",
        "At their turn, [+I] CONSTs bear the feature ELTS e.g. rice:QUALIA:CONST:ELTS:grain.",
        "(vid.",
        "[JAC91], also [COP92]).",
        "[PUS95] (assuming [VIK94] interpretation) attributes the CONST Role the function of representing the predicative relation Part-Of.",
        "Coherently, we assume CONST as encoding a relational predicate R(x,y), being R a type taxonomically daughter of Part-Of.",
        "In the default case, R will be 'Portion' and in more fine-grained cases, a daughter type of it -e.g. 'Slice'.",
        "The Logical Semantics of PNs (SEM) will account for their both partitive and relational nature by adopting as predicate-argument structure that of their CONST Role.",
        "For the sake of unification, in the LKB, SEM will be the conjunction of this predicate and the SEM value of the sign denoting the whole.",
        "This way (vid.fig.3), that of 'slice of cake' will result in SLICE(x,y) & CAKE(y) thus accounting for the logics of John eats a slice of cake as EAT(e,John,x) & SLICE(x,y) & CAKE(y) versus that of John eats cake as EAT(e,John,x) & CAKE(x).",
        "2 [JAC91] develops a method to formalise relative shapes including judgements about dimensionality.",
        "For ease of exposition, the syntax (CAT) of PNs is represented here as the complex category N/NP_sign, where the NP_sign is appropriately",
        "specified to account for selectional restrictions and transitivity of properties between the whole and the portion via feature reentrancies.",
        "This way, the composition of slice (N/NP) and cake (NP) will result in an N (slice of cake).",
        "This accounts for the fact that partitive constructions (e.g. slice of cake) do bear the combinatorial possibilities of nouns, while those of PNs are distinct and specific.",
        "The preposition (of) is omitted here not in the LKB implementation since it is unrelevant as it lacks semantic content.",
        "We assume so [CH081] analysis which considers of in this kind of constructions a mere surface case-marker.",
        "This view is confirmed by data of Spanish OW VAS() VINO = UN VAS() ph VINO, UN TROZO PAN = UN TROZO DE PAN) ['a glass wine' = 'a glass of wine', 'a portion bread' = 'a portion of bread'] in which the preposition is elidible something which is not possible in the case of contentful prepositions (VENGO E BARCELONA-> *VENGO BARCELONA) ['I-come from Barcelona' -> *1-come Barcelona_].",
        "Moreover, CAT bears the feature COUNT standing, as well for ease of exposition, fro the range of (surface) grammatical behaviour of lexical signs usually referred to as countability/uncountability (see",
        "Provided all which has been discussed up to here, the general lex-PORTION-sign is defined as in fig.4; that is, as selecting NPs and resulting in FORMAL:[+B] entity-denoting signs (therefore individuated and syntactically countable) where the only QUALM feature which percolate from the whole is the TELIC Role the rest of Quales may be overridden by that of the PN.",
        "Specific subtypes are shown in figs.",
        "5 to 9.",
        "BOUND PNs (fig.5) select [+B] entities (therefore individuated and countable) (the tip of the tongue).",
        "Being [+B], such wholes bear definite shape and magnitude; therefore such values for the portion will be functions of those of the whole.",
        "MAGN, specifically, is assumed to be conceptualised as somehow minimal, therefore notated 'e' ([JAC91]).",
        "is that the MAGN value doesn't tend to be minimal.",
        "The ACiENTIVE Role is here relevant as it as well is in MDLD PNs.",
        "What is more remarkable in MDLD PNs (fig.7) it that the CONST type of the whole (therefore its value for CONST:ELTS) is inherited by the portion -e.g., if 'sugar 'is [+1] and consists of grains, a lump of sugar so; if 'paper 'has no entailment about internal structure, a sheet of paper has not either.",
        "MAGN is absolute (i.e., not related to that of the whole, since that is [-B1; e.g., in broad outline, 'all the sugar/paper of the world').",
        "SHAPE is assumed to be schematic (vid.",
        "4).",
        "SHAPE and MAGN of ELT portions (fig.8) are also non-relative.",
        "These PNs select [44] entities, usually substances ('wheat', 'rice') but also possibly individuals ('lemon', as conventionalised in Spanish as internally-structured in GAJOS).",
        "The value for CONST:ELTS of the whole will be the CONST CAT: I N / N1' SIGN =CAT: NP",
        "nouns according to the properties of the referent wholes as conceptualised by speakers PNs have been classified according to the semantic regularities they show, resulting in a system of five basic types, which have been represented in a unification formalism, LKB-LRL ([COP921), allowing for composition of PNs (e.g. slice) and NPs (e.g. cake) (plus the semantically void preposition 'or; in Spanish, DE) into portion-denoting signs (e.g. slice of cake).",
        "Acknowledgements.",
        "I'd like to thank Drs.",
        "Toni Marti and Horacio Rodriguez for their comments and support.",
        "This research is funded by the project PB-940830 of the DGICYT."
      ]
    },
    {
      "heading": "6. Concluding Remarks",
      "text": [
        "In this paper we presented a system of representation of relational nouns denoting portions, segments and relative quantities of entities according to the Theory of Qualia ([PUS95]), which has been partially reinterpreted and adapted to the insights of Conceptual Semantics ([JAC91]).",
        "This system accounts for a range of linguistic facts, being the most remarkable",
        "the following: 1.",
        "Portions are mainly encoded in the language by means of constructions instead of by single lexical units 2.",
        "Portions are both hounded entities and relative measures of the wholes of reference 3.",
        "Portions inherit from their wholes their purpose",
        "or function, but, on the contrary, they show distinctive shape, magnitude and origin 3 Possibly also 1-131 collections (groups) (a wagon of cattle), but, as said before, we're not columned here to discuss individuation of collections."
      ]
    }
  ]
}
