{
  "info": {
    "authors": [
      "Amitava Das",
      "Sivaji Bandyopadhyay"
    ],
    "book": "Proceedings of the 2nd Workshop on Cognitive Aspects of the Lexicon",
    "id": "acl-W10-3402",
    "title": "SemanticNet-Perception of Human Pragmatics",
    "url": "https://aclweb.org/anthology/W10-3402",
    "year": 2010
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Amitava Das and Sivaji Bandyopadhyay",
        "SemanticNet is a semantic network of lexicons to hold human pragmatic knowledge.",
        "So far Natural Language Processing (NLP) research patronized much of manually augmented lexicon resources such as WordNet.",
        "But the small set of semantic relations like Hypernym, Holonym, Meronym and Synonym etc are very narrow to capture the wide variations human cognitive knowledge.",
        "But no such information could be retrieved from available lexicon resources.",
        "SemanticNet is the attempt to capture wide range of context dependent semantic inference among various themes which human beings perceive in their pragmatic knowledge, learned by day to day cognitive interactions with the surrounding physical world.",
        "SemanticNet holds human pragmatics with twenty well established semantic relations for every pair of lexemes.",
        "As every pair of relations cannot be defined by fixed number of certain semantic relation labels thus additionally contextual semantic affinity inference in SemanticNet could be calculated by network distance and represented as a probabilistic score.",
        "SemanticNet is being presently developed for Bengali language."
      ]
    },
    {
      "heading": "1. Historical Motivation",
      "text": [
        "Semantics (from Greek \"on/uavriKÔç\" - seman-tikos) is the study of meaning, usually in language.",
        "The word \"semantics\" itself denotes a range of ideas, from the popular to the highly technical.",
        "It is often used in ordinary language to denote a problem of understanding that comes down to word selection or connotation.",
        "We studied with various Psycholinguistics experiments to understand how human natural intelligence helps to understand general semantic from nature.",
        "Our study was to understand the human psychology about semantics beyond language.",
        "We were haunting for the intellectual structure of the psychological and neurobiological factors that enable humans to acquire, use, comprehend and produce natural languages.",
        "Let's come with an example of simple conversation about movie between two persons.",
        "Person A: Have you seen the movie 'No Man's Land'?",
        "How is it?",
        "Person B: Although it is good but you should see 'The Hurt Looker'?",
        "May be the conversation looks very casual, but our intension was to find out the direction of the decision logic on the Person B's brain.",
        "We start digging to find out the nature of human intelligent thinking.",
        "A prolonged discussion with Person B reveals that the decision logic path to recommend a good movie was as the Figure 1.",
        "The highlighted red paths are the shortest semantic affinity distances of the human brain.",
        "We call it semantic thinking.",
        "Although the derivational path of semantic thinking is not such easy as we portrait in Figure 1 but we keep it easier for understandability.",
        "Actually a human try to figure out the closest semantic affinity node into his pragmatics knowledge by natural intelligence.",
        "In the previous example Person B find out with his intelligence that No Man's Land is a war movie and got Oscar award.",
        "Oscar award generally cracked by Hollywood movies and thus Person B start searching his pragmatics network to find out a movie fall into war genre, from Hollywood and may be got Oscar award.",
        "Person B finds out the name of a movie The Hurt Locker at nearer distance into his pragmatics knowledge network which is an optimized recommendation that satisfy all the criteria.",
        "Noticeably Person B didn't choice the other paths like Bollywood, Foreign movie etc.",
        "Figure 1 : Semantic Thinking And thus our aim was to develop a computational lexicon structure for semantics as human pragmatics knowledge.",
        "We spare long time to find out the most robust structure to represent pragmatics knowledge properly and it should be easy understandable for next level of search and usability.",
        "We look into literature that probably direct to the direction of our ideological thinking.",
        "We found that in the year of 1996 Push Singh and Marvin Minsky proposed the field has shattered into subfields populated by researchers with different goals and who speak very different technical languages.",
        "Much has been learned, and it is time to start integrating what we've learned, but few researchers are widely versed enough to do so.",
        "They had a proposal for how to do so in their ConceptNet work.",
        "They developed lexicon resources like Con-ceptNet (Liu and Singh, 2004).",
        "ConceptNet-ConceptNet is a large-scale semantic network (over 1.6 million links) relating a wide variety of ordinary objects, events, places, actions, and goals by only 20 different link types, mined from corpus.",
        "The present task of developing SemanticNet is to capture semantic affinity knowledge of human pragmatics as a lexicon database.",
        "We extend our vision from the human common sense (as in ConceptNet) to human pragmatics and have proposed semantic relations for every pair of lexemes that cannot be defined by fixed number of certain semantic relation labels.",
        "Contextual semantic affinity inference in Se-manticNet could be calculated by network distance and represented as a probabilistic score.",
        "SemanticNet is being presently developed for Bengali language."
      ]
    },
    {
      "heading": "2. Semantic Roles",
      "text": [
        "The ideological study of semantic roles started age old ago since Panini's karaka theory that assigns generic semantic roles to words in a natural language sentence.",
        "Semantic roles are generally domain specific in nature such as FROM_DESTINATION,TO_DESTINATION, DEPARTURE_TIME etc.",
        "Verb-specific semantic roles have also been defined such as",
        "EATER and EATEN for the verb eat.",
        "The standard datasets that are used in various English SRL systems are: PropBank (Palmer et al., 2005), FrameNet (Fillmore et al., 2003) and VerbNet (Kipper et al., 2006).",
        "These collections contain manually developed well-trusted gold reference annotations of both syntactic and predicate-argument structures.",
        "PropBank defines semantic roles for each verb.",
        "The various semantic roles identified (Dowty, 1991) are Agent, patient or theme etc.",
        "In addition to verb-specific roles, PropBank defines several more general roles that can apply to any verb (Palmer et al., 2005).",
        "FrameNet is annotated with verb frame semantics and supported by corpus evidence.",
        "The frame-to-frame relations defined in FrameNet are Inheritance, Perspective_on, Subframe, Precedes, Inchoative_of, Causative_of and Using.",
        "Frame development focuses on pa-raphrasability (or near paraphrasability) of words and multi-words.",
        "VerbNet annotated with thematic roles refer to the underlying semantic relationship between a predicate and its arguments.",
        "The semantic tagset of VerbNet consists of tags as agent, patient, theme, experiencer, stimulus, instrument, location, source, goal, recipient, benefactive etc.",
        "It is evident from the above discussions that no adequate semantic role set exists that can be defines across various domains.",
        "Hence proposed SemanticNet does not only rely on fixed type of semantics roles as ConceptNet.",
        "For semantic relations we followed the 20 relations defined in ConceptNet.",
        "Additionally we proposed semantic relations for every pair of lexicons cannot be defined by exact semantic role and thus we formulated a probabilistic score based technique.",
        "Semantic affinity in Seman-ticNet could be calculated by network distance.",
        "Details could be found in relevant Section 8."
      ]
    },
    {
      "heading": "3. Corpus",
      "text": [
        "Present SemanticNet has been developed for Bengali language.",
        "Resource acquisition is one of the most challenging obstacles to work with electronically resource constrained languages like Bengali.",
        "Although Bengali is the sixthpopular language in the World, second in India and the national language in Bangladesh.",
        "There was another issue drive us long way to find out the proper corpus for the development of SemanticNet.",
        "As the notion is to capture and store human pragmatic knowledge so the hypothesis was chosen corpus should not be biased towards any specific domain knowledge as human pragmatic knowledge is not constricted to any domain rather it has a wide spread range over anything related to universe and life on earth.",
        "Additionally it must be larger in size to cover mostly available general concepts related to any topic.",
        "After a detail analysis we decided it is better to choose NEWS corpus as various domains knowledge like Politics, Sports, Entertainment, Social Issues, Science, Arts and Culture, Tourism, Advertisement, TV schedule, Tender, Comics and Weather etc are could be found only in NEWS corpus._ http://en.wikipedia.org/wiki/List_of_languages_by_ number_of_native_speakers",
        "Fortunately such corpus development could be found in (Ekbal and Bandyopadhyay, 2008) for Bengali.",
        "We obtained the corpus from the authors.",
        "The Bengali NEWS corpus consisted of consecutive 4 years of NEWS stories with various sub domains as reported above.",
        "For the present task we have used the Bengali NEWS corpus, developed from the archive of a leading Bengali NEWS paper available on the Web.",
        "The NEWS corpus is quite larger in size as reported in Table 1."
      ]
    },
    {
      "heading": "4. Annotation",
      "text": [
        "From the collected document set 200 documents have been chosen randomly for the annotation task.",
        "Three annotators (Mr. X, Mr. Y and Mr. Z) participated in the present task.",
        "Annotators were asked to annotate the theme words (topical expressions) which best describe the topical snapshot of the document.",
        "The agreement of annotations among three annotators has been evaluated.",
        "The agreements of tag values at theme words level is reported in Table 2.",
        "words level"
      ]
    },
    {
      "heading": "5. Theme Identification",
      "text": [
        "Term Frequency (TF) plays a crucial role to identify document relevance in Topic-Based Information Retrieval.",
        "The motivation behind developing Theme detection technique is that in many documents relevant words may not occur frequently or irrelevant words may occur frequently.",
        "Moreover for the lexicon affinity inference, topic or theme words are the only strong clue to start with.",
        "The Theme detection technique has been proposed to resolve these issues to identify discourse level most relevant thematic nodes in terms of word or lexicon using a standard machine learning technique.",
        "The machine learning technique used here is Conditional Random Field (CRF).",
        "The theme word detection has been defined as a sequence labeling problem using various useful depending features.",
        "Depending upon the series of input features, each word is tagged as either Theme Word (TW) or Other (O).",
        "Annotators",
        "X vs. Y",
        "X Vs. Z",
        "Y Vs. Z",
        "Avg",
        "Percentage",
        "82.64%",
        "71.78%",
        "80.47%",
        "78.3%",
        "All Agree",
        "75.45%",
        "Statistics",
        "NEWS",
        "Total no.",
        "of news documents in the corpus",
        "108,305",
        "Total no.",
        "of sentences in the corpus",
        "2,822,737",
        "Avg no.",
        "of sentences in a document",
        "27",
        "Total no.",
        "of wordforms in the corpus",
        "33,836,736",
        "Avg.",
        "no.",
        "of wordforms in a document",
        "313",
        "Total no.",
        "of distinct wordforms in the corpus",
        "467,858",
        "The set of features used in the present task have been categorized as Lexico-Syntactic, Syntactic and Discourse level features.",
        "These are listed in the Table 3 below and have been described in the subsequent subsections.",
        "It has been shown by Das and Bandyopadhyay, (2009), that theme bearing words in sentences are mainly adjective, adverb, noun and verbs as other POS categories like pronoun, preposition, conjunct, article etc.",
        "have no relevance towards thematic semantic of any document.",
        "The detail of the POS tagging system chosen for the present task could be found in (Das and Bandyopadhyay 2009).",
        "Frequency always plays a crucial role in identifying the importance of a word in the document or corpus.",
        "The system generates four separate high frequent word lists after function words are removed for four POS categories: adjective, adverb, verb and noun.",
        "Word frequency values are then effectively used as a crucial feature in the Theme Detection technique.",
        "Several words in a sentence that carry thematic information may be present in inflected forms.",
        "Stemming is necessary for such inflected words before they can be searched in appropriate lists.",
        "Due to non availability of good stemmers in Indian languages especially in Bengali, a stemmer based on stemming cluster technique has been used as described in (Das and Bandyopadhyay, 2010).",
        "This stemmer analyzes prefixes and suffixes of all the word forms present in a particular document.",
        "Words that are identified to have the same root form are grouped in a finite number of clusters with the identified root word as cluster center.",
        "We found that Chunk level information is very much effective to identify lexicon inference affinity.",
        "As an example:",
        "The movies released by Satyajit Roy are excellent.",
        "In the above example two lexicons \"^fè>/release\" and \"^fà/movie\" are collocated in a chunk and they are very much semantically neighboring in human pragmatic knowledge.",
        "Chunk feature effectively used in supervised classifier.",
        "Chunk labels are defined as BX (Beginning), IX (Intermediate) and EX (End), where X is the chunk label.",
        "In the task of identification of Theme expressions, chunk label markers play a crucial role.",
        "Further details of development of chunking system could be found in (Das and Bandyopadhyay 2009).",
        "Dependency depth feature is very useful to identify Theme expressions.",
        "A particular Theme word generally occurs within a particular range of depth in a dependency tree.",
        "Theme expressions may be a Named Entity (NE: person, organization or location names), a common noun (Ex: accident, bomb blast, strike etc) or words of other POS categories.",
        "It has been observed that depending upon the nature of Theme expressions it can occur within a certain depth in the dependency tree in the sentences.",
        "A statistical dependency parser has been used for Bengali as described in (Ghosh et al., 2009).",
        "Types",
        "Features",
        "Lexico-Syntactic",
        "POS",
        "Frequency",
        "Stemming",
        "Syntactic",
        "Chunk Label",
        "Dependency Parsing Depth",
        "Discourse Level",
        "Title of the Document",
        "First Paragraph",
        "Term Distribution",
        "Collocation",
        "Depending upon the position of the thematic clue, every document is divided into a number of zones.",
        "The features considered for each document are Title words of the document, the first paragraph words and the words from the last two sentences.",
        "A detailed study was done on the Bengali news corpus to identify the roles of the positional aspect features of a document (first paragraph, last two sentences) in the detection of theme words.",
        "The importance of these positional features has been described in the following section.",
        "It has been observed that the Title words of a document always carry some meaningful thematic information.",
        "The title word feature has been used as a binary feature during CRF based machine learning.",
        "People usually give a brief idea of their beliefs and speculations about any related topic or theme in the first paragraph of the document and subsequently elaborate or support their ideas with relevant reasoning or factual information.",
        "Hence first paragraph words are informative in the detection of Thematic Expressions.",
        "It is a general practice of writing style that every document concludes with a summary of the overall story expressed in the document.",
        "We found that it is very obvious that every document ended with dense theme/topic words in the last two sentences.",
        "An alternative to the classical TF-IDF weighting mechanism of standard IR has been proposed as a model for the distribution of a word.",
        "The model characterizes and captures the informativeness of a word by measuring how regularly the word is distributed in a document.",
        "Thus the objective is to estimate that measures the distribution pattern of the k occurrences of the word wt in a document d. Zipfs law describes distribution patterns of words in an entire corpus.",
        "In contrast, term distribution models capture regularities of word occurrence in subunits of a corpus (e.g., documents, paragraphs or chapters of a book).",
        "A good understanding of the distribution patterns is useful to assess the likelihood of occurrences of a theme word in some specific positions (e.g., first paragraph or last two sentences) of a unit of text.",
        "Most term distribution models try to characterize the informativeness of a word identified by inverse document frequency (IDF).",
        "In the present work, the distribution pattern of a word within a document formalizes the notion of theme inference informativeness.",
        "This is based on the Poisson distribution.",
        "Significant Theme words are identified using TF, Positional and Distribution factor.",
        "The distribution function for each theme word in a document is evaluated as follows:",
        "where n=number of sentences in a document with a particular theme word Si=sentence id of the current sentence containing the theme word and Si-1=sentence id of the previous sentence containing the query term, TWi is the positional id of current Theme word and TWi-1 is the positional id of the previous Theme word.",
        "Collocation with other thematic words/expressions is undoubtedly an important clue for identification of theme sequence patterns in a document.",
        "As we used chunk level collocation to capture thematic words (as described in 5.5.1) and in this section we are introducing collocation feature as inter-chunk collocation or discourse level collocation with various granularity as sentence level, paragraph level or discourse level."
      ]
    },
    {
      "heading": "6. Theme Clustering",
      "text": [
        "Theme clustering algorithms partition a set of documents into finite number of topic based groups or clusters in terms of theme words/expressions.",
        "The task of document clustering is to create a reasonable set of clusters for a given set of documents.",
        "A reasonable cluster is defined as the one that maximizes the within-cluster document similarity and minimizes between-cluster similarities.",
        "There are two principal motivations for the use of this technique in the theme clustering setting: efficiency, and the cluster hypothesis.",
        "The cluster hypothesis (Jardine and van Rijsbergen, 1971) takes this argument a step further by asserting that retrieval from a clustered collection will not only be more efficient, but will in fact improve retrieval performance in terms of recall and precision.",
        "The basic notion behind this hypothesis is that by separating documents according to topic, relevant documents will be found together in the same cluster, and non-relevant documents will be avoided since they will reside in clusters that are not used for retrieval.",
        "Despite the plausibility of this hypothesis, there is only mixed experimental support for it.",
        "Results vary considerably based on the clustering algorithm and document collection in use (Willett, 1988).",
        "We employ the clustering hypothesis only to measure inter-document level thematic affinity inference on semantics.",
        "Application of the clustering technique to the three sample documents results in the following theme-by-document matrix, A, where the rows represent various documents and the columns represent the themes politics, sport, and travel.",
        "election cricket hotel A = parliament sachin vacation governor soccer tourist",
        "The similarity between vectors is calculated by assigning numerical weights to these words and then using the cosine similarity measure as specified in the following equation.",
        "This equation specifies what is known as the dot product between vectors.",
        "Now, in general, the dot product between two vectors is not particularly useful as a similarity metric, since it is too sensitive to the absolute magnitudes of the various dimensions.",
        "However, the dot product between vectors that have been length normalized has a useful and intuitive interpretation: it computes the cosine of the angle between the two vectors.",
        "When two documents are identical they will receive a cosine of one; when they are orthogonal (share no common terms) they will receive a cosine of zero.",
        "Note that if for some reason the vectors are not stored in a normalized form, then the normalization can be incorporated directly into the similarity measure as follows.",
        "Of course, in situations where the document collection is relatively static, it makes sense to normalize the document vectors once and store them, rather than include the normalization in the similarity metric.",
        "i=1 wi,k X wi",
        "Calculating the similarity measure and using a predefined threshold value, documents are classified using standard bottom-up soft clustering k-means technique.",
        "The predefined threshold value is experimentally set as 0.5 as shown in Table 4.",
        "A set of initial cluster centers is necessary in the beginning.",
        "Each document is assigned to the cluster whose center is closest to the document.",
        "After all documents have been assigned, the center of each cluster is recomputed as the centroid or mean ß (where ß is the clustering coefficient) of its members that isß = (1/|cjI)£xecx.",
        "The distance function is the cosine vector similarity function.",
        "ID",
        "Theme",
        "1",
        "2",
        "3",
        "1",
        "»Hin«)",
        "(administration)",
        "0.63",
        "0.12",
        "0.04",
        "1",
        "(good-government)",
        "0.58",
        "0.11",
        "0.06",
        "1",
        "(society)",
        "0.58",
        "0.12",
        "0.03",
        "1",
        "(law)",
        "0.55",
        "0.14",
        "0.08",
        "2",
        "(research)",
        "0.11",
        "0.59",
        "0.02",
        "2",
        "<K«1>ïi (college)",
        "0.15",
        "0.55",
        "0.01",
        "2",
        "(higher study)",
        "0.12",
        "0.66",
        "0.01",
        "3",
        "(jehadi)",
        "0.13",
        "0.05",
        "0.58",
        "3",
        "(mosque)",
        "0.05",
        "0.01",
        "0.86",
        "3",
        "(New Delhi)",
        "0.12",
        "0.04",
        "0.65",
        "3",
        "+ 1*51^",
        "(Kashmir)",
        "0.03",
        "0.01",
        "0.93",
        "Table 4 gives an example of theme centroids by the K-means clustering.",
        "Bold words in Theme column are cluster centers.",
        "Cluster centers are assigned by maximum clustering coefficient.",
        "For each theme word, the cluster from Table 4 is still the dominating cluster.",
        "For example, \"a\"ii*i«T has a higher membership probability in cluster1 than in other clusters.",
        "But each theme word also has some non-zero membership in all other clusters.",
        "This is useful for assessing the strength of association between a theme word and a topic.",
        "Comparing two members of the cluster2, \"««rJîlfi\" and \"««*JlftTTl\", it is seen that \"«H^lftgTl\" is strongly associated with cluster2 (p=0.65) but it has some affinity with other clusters as well (e.g., p =0.12 with the cluster1).",
        "This is a good example of the utility of soft clustering.",
        "These non-zero values are still useful for calculating vertex weight during Semantic Relational Graph generation."
      ]
    },
    {
      "heading": "7. Semantic Relational Graph",
      "text": [
        "Representation of input text document(s) in the form of graph is the key to our design principle.",
        "The idea is to build a document graph G=<V,E> from a given source document d e D .",
        "At this preprocessing stage, text is tokenized, stop words are eliminated, and words are stemmed.",
        "Thus, the text in each document is split into fragments and each fragment is represented with a vector of constituent theme words.",
        "These text fragments become the nodes V in the document graph.",
        "The similarity between two nodes is expressed as the weight of each edge E of the document graph.",
        "A weighted edge is added to the document graph between two nodes if they either correspond to adjacent text fragments in the text or are semantically related by theme words.",
        "The weight of an edge denotes the degree of the semantic inference relationship.",
        "The weighted edges not only denote document level similarity between nodes but also inter document level similarity between nodes.",
        "Thus to build a document graph G, only the edges with edge weight greater than some predefined threshold value are added to G, which basically constitute edges E of the graph G.",
        "The Cosine similarity measure has been used here.",
        "In cosine similarity, each document d is denoted by the vector V ( d ) derived from d, with each component in the vector for each Theme words.",
        "The cosine similarity between two documents (nodes) dl and d2 is computed using their vector representations V (d1) and V (d 2) as equation (1) and (2) (Described in Section 6).",
        "Only a slight change has been done i.e. the dot product of two vectors V(d1) • V(d2) is defined as £v(d1)V(d2).",
        "The Euclidean length of d is defined to be J£ v (d) where M is the total number of documents in the corpus.",
        "Theme nodes within a cluster are connected by vertex, weight is calculated by clustering coefficient of those theme nodes.",
        "Additionally inter cluster vertexes are there.",
        "Cluster centers are interconnected with weighted vertex.",
        "The weight is calculated by cluster distance as measured by cosine similarity measure as discussed earlier.",
        "To better aid our understanding of the automatically determined category relationships we visualized this network using the Fruchterman-Reingold force directed graph layout algorithm (Fruchterman and Reingold, 1991) and the NodeXL network analysis tool (Smith et al., 2009).",
        "A theme relational model graph drawn by NoddeXL is shown in Figure 1."
      ]
    },
    {
      "heading": "8. Semantic Distance Measurement",
      "text": [
        "Finally generated semantic relational graph is the desired SemanticNet that we proposed.",
        "Generated Bengali SemanticNet consist of almost 90K high frequent Bengali lexicons.",
        "Only four categories of POS (noun, adjective, adverb and verb) considered for present generation as reported in Section 5.2.1.",
        "In the generated Bengali SemanticNet all the lexicons are connected with weighted vertex either directly",
        "Available from http://www.codeplex.com/NodeXL or indirectly.",
        "Semantic lexicon inference could be identified by network distance of any two nodes by calculating the distance in terms of weighted vertex.",
        "We computed the relevance of semantic lexicon nodes by summing up the edge scores of those edges connecting the node with other nodes in the same cluster.",
        "As cluster centers are also interconnected with weighted vertex so inter-cluster relations could be also calculated in terms of weighted network distance between two nodes within two separate clusters.",
        "As an example:",
        "Figure 2: Semantic Affinity Graph The lexicon semantic affinity inference from Figure 2 could be calculated as follows:",
        "where Sd (wi, w. ) = semantic affinity distance between two lexicons wi and wj.",
        "Equation (1) and (2) are for intra-cluster and inter-cluster semantic distance measure respectively.",
        "k=number of weighted vertex between two lexicons wi and wj.",
        "vk is the weighted vertex between two lexicons.",
        "m=number of cluster centers between two lexicons.",
        "lc is the distance between cluster centers between two lexicons.",
        "For illustration of present technique let take an example:",
        "It is evident from the previous example that the score based semantic distance can better illustrate lexicon affinity between Argentina and goal but is no lexicon affinity relation between gun and goal.",
        "Instead of giving only certain semantic relations like WordNet or ConceptNet the present relative probabilistic score based lexicon affinity distance based technique can represent best acceptable solution for representing the human pragmatic knowledge.",
        "Not only ideologically rather the SemanticNet provide a good solution to any type of NLP problem.",
        "A detail analysis of Information retrieval system using Seman-ticNet is detailed in evaluation section.",
        "Although every lexicon pair cannot be labeled by exact semantic role but we try to keep a few semantic roles to establish a crossroad from previous computational lexicon techniques to this new one.",
        "These semantic relations may be treated as a bridge to traverse SemanticNet by gathering knowledge from other resources WordNet and ConceptNet.",
        "Approximately 22k (24% of overall Seman-ticNet) lexicons are tagged with appropriate semantic roles by two processes as described below."
      ]
    },
    {
      "heading": "9. Semantic Role Assignment",
      "text": [
        "Two types of methods have been taken to assign pair wise lexicon semantic affinity relations.",
        "First one is derived from ConceptNet.",
        "In the second technique sub-graph is identified consisting of a nearest verb and roles are assigned accordingly.",
        "A ConceptNet API written in Java has been used to extract pair wise relation from Con-ceptNet.",
        "A Bengali-English dictionary (approximately 102119 entries) has been developed using the Samsad Bengali-English dictionary used here for equivalent lookup of English meaning of each Bengali lexicon.",
        "Obtained semantic relations from ConceptNet for any lexicon English pair are assigned to source Bengali pair lexicons.",
        "As an example:",
        "❖ OftenNear",
        "❖ PartOf",
        "❖ PropertyOf",
        "It is an automatic process using manually augmented list of only 220 Bengali verbs.",
        "This process starts from any arbitrary node of any cluster and start finding any nearest verb within the cluster.",
        "The system uses the manually augmented list of verbs as partly reported in",
        "Table 5.",
        "The semantic relation labels attached with every verb in the manually augmented list (as reported in Table 5) is then automatically assigned between each pair of lexicons."
      ]
    },
    {
      "heading": "10. Evaluation",
      "text": [
        "It is bit difficult to evaluate this type of lexicon resources automatically.",
        "Manual validation may be suggested as a better alternative but we prefer for a practical implementation based evaluation strategy.",
        "For evaluation of Bengali SemanticNet it is used in Information Retrieval task using corpus from Forum for Information Retrieval Evaluation (FIRE) ad-hoc monolingual information retrieval task for Bengali language.",
        "Two different strategies have been taken.",
        "First a standard IR technique with TF-IDF, zonal indexing and ranking based technique (Ban-dyopadhyay et al., 2008) has been taken.",
        "Second technique uses more or less same strategy along with query expansion technique using SemanticNet (Although the term Seman-ticNet was not mentioned there) as a resource (Bhaskar et al., 2010).",
        "Only the following evaluation metrics have been listed for each run: mean average precision (MAP), Geometric Mean Average Precision (GM-AP), (document retrieved relevant for the topic) R-Precision (R-Prec), Binary preferences (Bpref) and Reciprical rank of top relevant document (Recip_Rank).",
        "The evaluation strategy follows the global standard as Text Retrieval Conference (TREC) metrics.",
        "It is clearly evident from the system results as reported in Table 6 that SemanticNet is a better way to solve lexicon semantic affinity.",
        "Evaluation result shows effectiveness of developed SemanticNet in IR.",
        "Further analysis revealed that general query expansion technique generally used WordNet synonyms as a resource.",
        "But in reality \"^H^r\" and '\"TST'T could not be clustered in one cluster though they represent same semantic of 'heart'.",
        "First one used in general context whereas the second one used only in literature.",
        "If there is any problem to understand Bengali let come with an example of English.",
        "Conceptually \"you\" and \"thy\" could be mapped in same cluster as they both represent the semantic of 2nd person but in reality \"thy\" simply refers to the literature of the great English poet Shakespeare.",
        "Standard lexicons cannot discriminate this type of fine-grained semantic differences.",
        "Scores",
        "Bengali IR using",
        "IR",
        "SemanticNet",
        "MAP",
        "0.0200",
        "0.4002",
        "GM_AP",
        "0.0004",
        "0.3185",
        "R-Prec",
        "0.0415",
        "0.3894",
        "Bpref",
        "0.0583",
        "0.3424",
        "Recip_Rank",
        "0.4432",
        "0.6912",
        "Verb",
        "English Gloss",
        "Probable Relations",
        "5^",
        "Be",
        "IsA",
        "öTK^",
        "Have",
        "CapableOf",
        "Wf",
        "Have",
        "CapableOf",
        "Made",
        "MadeOf",
        "Live",
        "LocationOf"
      ]
    },
    {
      "heading": "11. Conclusion and Future Task",
      "text": [
        "Experimental result of Information Retrieval using SemanticNet proves it is a better solution rather than any existing lexicon resources.",
        "The development strategy employs less human interruption rather a general architecture of Theme identification or Theme Clustering technique using easily extractable linguistics knowledge.",
        "The proposed technique could be replicated for any new language.",
        "SemanticNet could be useful any kind of Information Retrieval technique, Information Extraction technique, and topic based Summarization and we hope for newly identified NLP sub disciplines such as Stylometry or Authorship detection and plagiarism detection etc.",
        "Our future task will be in the direction of different experiments of NLP as mentioned above to profoundly establish the efficiency of SemanticNet.",
        "Furthermore we will try to develop SemanticNet for many other languages."
      ]
    }
  ]
}
