{
  "info": {
    "authors": [
      "Petr Sgall",
      "Eva Hajicová"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C69-7501",
    "title": "Some Remarks on J. L. Mey's Paper (Preprint No. 20)",
    "url": "https://aclweb.org/anthology/C69-7501",
    "year": 1969
  },
  "references": [
    "acl-C69-2001"
  ],
  "sections": [
    {
      "text": [
        "Some Remarks on J.L.Mey's Paper for the International Conference on Computational Linguistics, Sweden 1969 P.Sgall, E.Hajieove Mey's criticism of the functional approach to generative description concerns (1) the formal properties of the system proposed by Sgall et al.",
        "(its weak generative power, recursivity), and (2) some iuforuel questions connected with the mentioned approach.",
        "(1) From the formal point of view, Mey's paper contains many quite unclear points and errors, which make his claims unfounded.",
        "Some of those may be due to a mere unpreciseness and carelessness in formulations (cf. for instance p.7, where he speaks t,,bout \"a language that is not CF, or may be not even regular\", wlich is as if one says 'This mineral-is not found in Europe, not even in whole Switzerland\") but others have a more consequential bearing on his further argumentation.",
        "He confuses (p.3) the translation by the means of a push-down store transducer in Evey's sense (henceforth pdt) with the question of CF-preservation in the sense of Ginsburg (and Rose); he dose not seem to realize fully (pp.3-4) that Sgall et al. use only the notion of pdt in the sense of Evey and not in that of Ginsburg.",
        "Ginsburg and Rose's theorem is not identical with Evey's theorem 2.6.6, which is based on a different definition of pdt, connected with notions of input and output languages defined by the means .of the notion of computation.",
        "Although the theorem of Ginsburg and Rose, partly inspi-- 2 - red by that of Evey, needed a correction, it does not follow that Evey's theorem is wrong.",
        "Of course, it would be of interest to analyze the relationships between Evey's system of notions and that of Ginsburg, as well as to give an explicit account of the eventual bearing of Ginsburg and Roses result with respect to the theorems and proofs contained in Sgall et al.",
        "But Mey does not undertake any such analysis in, his paper; without giving any proofs he simply assumes that one of these results is contradicted by the others.",
        "Thus we can state that Mey has not shown that a system of the discussed type generates a language that is not context-free, to say nothing about his clearly exaggerated claim (p.7) of having \"shown\" that the language generated by such a system \"simply never\" is context-free (cf. the bottom of p.4, where Ginsburg and Rose's formulations are rendered in a rather confused way).",
        "Further, Mey is not right in claiming that a device of the discussed type is \"practically equivalent\" to a (universal) Turing machine (p.5), or that its output language is not necessarily a recursive set (pp.4, 5, 9).",
        "As shown in Atha (1966), quoted in Sgall (1967), and as stated again in Chapter 5, of Sgall et al., a recognition procedure for the system under consideration does exist (this is ensured by the preservation of the length of the strings).",
        "- 3 - (2) The informal parts of Mey criticism contain first of all his question \"what about the remaining input, where does it all come from?\" (p.7); in case that the output language of a device in our system (or the terminal language of the grammar) is a proper subset of the input language of its successor in the sequence of devices, the difference between these two languages should be taken as a formal counterpartYspecfic syntax of a given level ( cf. the distinction between ftik and blik, or that between or corned at home and golf played John;cf.",
        "Sections 2.1.4 and 2.2.5 in Sgall et al.).",
        "We cannot discuss here at length questions of this kind, as well as other items, which are,under the given conditions, rather questions of taste.",
        "Certainly, the significance of the eventual possibility (not claimed by us) to use the existing CF-recognition routines (Mey, p.5) or the significance of the results obtained by European traditional and structural linguistics may be appreciated differently.",
        "We do not take the \"time-honored\" European linguistic tradition as a linguistic argument, but we do not want to give a mere preference to American traditional high-school grammar over the European one.",
        "We would like only to recall that in the development of the transformational theory there are various points showing that a more careful attitude to the \"classical\" linguistics could have saved some detours; so one would have been able e.g. to see earlier the ne – 4 – cessity to distinguish between a deep (or semantic) structure and a surface one (and not to provide the transfomiational component with recursive properties); Is it not clear that the transformational description does lose, successively, at least some of the properties distinsuisl-ing it from a description of the stratifies-tional or functional type?"
      ]
    },
    {
      "heading": "Reference:",
      "text": []
    }
  ]
}
