{
  "info": {
    "authors": [
      "Jun'ichi Fukumoto",
      "Jun'ichi Tsujii"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2192",
    "title": "Breaking Down Rhetorical Relations for the Purpose of Analysing Discourse Structures",
    "url": "https://aclweb.org/anthology/C94-2192",
    "year": 1994
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In Rhetorical Structure 'llieory (R ST) the definitions of some relations are rather vague because they are given on a pragmatic basis.",
        "This paper presents another way of seeing the relations which leads to a more precise specification of the relations.",
        "The relations are associated with constraints on the semantic relationships between the propositional contents of two clauses, their Modality and Tense/Aspect."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The Rhetorical Structure Theory (11,ST) by Mann and Thompson [Mann and Thompson, 1987] is a theory of inter-sentential (or inter-clausal) relationships in a text.",
        "Although is intended to serve both as a framework for text analysis and text generation, it has so far been used exclusively in text.",
        "generation [Ilovy et al., 1992] [Linden et al., 1992] [R6sner and Stede, 1992].",
        "Several researchers recognise that, RST has defects as an analytical framework.",
        "Moore and :Pollack [Moore and Pollack, 1992J, for example, claim that the assumption of a single relation between discourse elements is one of the reasons why RST analyses are inherently ambiguous.",
        "They also claim that, the under specificity of the rhetorical relation definitions causes problems.",
        "Our claim is that the niain cause of the difficulties of applying RST to text processing systems is that, some of the relations are defined on the basis of the effects which they have on a reader.",
        "This is particularly the case for the relations chissified as presentational relations, the relations whose intended effects are to increase SOW C inclination in a reader.",
        ":Background relation, for example, is defined as a relation whose Satellite increases the ability of a reader to comprehend an element, in Nucleus and the reader will not fully comprehend Nucleus before reading the text, of Satellite, 'riffs definition is problematic because there are many ways of increasing the ability of a reader to comprehend Nucleus.",
        "More seriously, the definition *Supported by Oki Electric Industry Co., Ltd. itself' does not predict, atabout textual fOrnis of Nucleus and Satellite.",
        "In order to use RST in actual text processing systeins, we have to break down such if to relate them with textual forms, in this paper, we show how the definitions can be broken down and be associated with semantic constraints between constituents (clauses), in order to relate them with constraints on surface linguistic forms.",
        "Among the 24 rhetorical relations defined in [Mann and Thompson, 1987], we focus on presentational re/ations (7 relations are classified as such) which are the most problematic.",
        "The results of applying our method to leading articles in a Japanese newspaper are also discussed."
      ]
    },
    {
      "heading": "2 Basic Frarnework",
      "text": [
        "In RST, 24 relations are divided into two groups: presentational relations and subject matter relations.",
        "According to Mann and Thompson [Mann and 'thoinpson, 1987], subject matter relations are those whose intended effect is that the reader recognises the relation in question and presentational relations are those whose intended effect is to increase SOMC 111C lination in the reader.",
        "Moore and :Pollack [Moore and Pollack, 1992] comnient that subject matter relations are informational and presentational relations are intentional.",
        "Table 1 shows what kind of inclination each presentational relation is intended to increase.",
        "Onc can sec that the definitions are highly abstract and have nothing to do with the surface realisations of the relations.",
        "On the other hand, it has been observed that there are various surface cues in texts which are useful for identifying inter-sentential (or inter-clausal) units.",
        "Ilalliday and flasan [Halliday and Hasan, 1985] identified a set of linguistic devices for linking one part, of a text to another, such as reference, substitution and ellipsis, conjunction, and lexical cohesion, From the view point of text, processing, these huginstic devices call be used as cues for segmenting a text into structural units (Satellite and Nucleus).",
        "However, these cues hardly give any clue about which clause of a unit is Satellite, which clause is Nucleus, and which"
      ]
    },
    {
      "heading": "4.2 Subschemas of Presentational Relations in RsT",
      "text": [
        "We show breakdowns of four typical presetitational relations into their subschemas and state their constraints inure formally.",
        "lite subscripts of \"00\" and \"so\" means Nucleus and Satellite, respectively.",
        "1.",
        "Tittle and space situations are stated by an action in Satellite, and under these situations all action in Nucleus becomes possible.",
        "(a) So-(A,)-^ Si, Si 1-_=.",
        "A (b) A s a < Ann (A,, becomes true while SI is true.",
        "Then, the time of A, is before A,,.)",
        "(.0 A,,,Anu, 1W,,, C iM-c1) e,vilconlin j. la sin} (if A, becomes possible in the environment given by A,, then the modality of A, should be more certain than that of A.)",
        "2.",
        "Time and space situation are stated in Satellite, and wider the situation an action in Nucleus becomes possible.",
        "(a) SsA (b) S s a < Anu (c)A 1,71 11/10.3101 3.",
        "Satellite presents additional information to understand Contents in Nucleus.",
        "(a)s r=> C7 LI!",
        "(b) no (c)11\"-cPc,ikonli,,flasml, m e Moth Clauses will be understood as true, 50 they have to have truth value.)",
        "1.",
        "An action in Nucleus has the possibility to resolve an undesirable situation which is caused by an action in Satellite.",
        "(a) So -( /1,0- St [919 bad], A c-;^ (b)< Aiot (c)E (A , is an event which has occurred or is occurring, or a writer is confident about the event.",
        "A writer intends to do A to resolve a problem caused 5.",
        "Nucleus states an undesirable situation caused by another undesirable situation stated in Satellite.",
        "(a) S[qty : bad] I S[qty : bad] (b) Ssa < Sat, (e) Ss.IM-ePevileonlmf smb M nu Ceuilconlinflasm) G. An action in Nucleus can resolve an undesirable situation stated in Satellite.",
        "(a) S,[qty : bad] --(A)--, Si [qty : flood] (b)< Snit (c)11\"-cPevi1,,m1 qiastn} 7.",
        "An action in Nucleus is caused by a situation in Satellite.",
        "(a) Ss A (h) 5',,, (c)A7,11, MS a e (M-CPeuilconlin lasm} \"-nu (-1\" {1\"-,Tcoilconlinf la3m 8.",
        "Based on 0 situation which is caused by an action in Satellite, a writer's attitude stated in Nucleus is acceptable.",
        "(a) St\"r ,Cl,,,,CltttiCl,,,, (b) no (c) S sa87LU M .5 C {1\\11-cP ay ileonlin la sm.}",
        ", Mnu Cel, all, oildiricomircq) 9.",
        "Based on a judgement stated in Satellite, a writer's attitude stated in Nucleus is acceptable.",
        "(a) Cl,,, l= CitcitC1.4 a.\"7, II (b) no (c) M, C kl-dcci, Al,,,, e {M-dc,0,01kticicomft,0/} 4.2.2 Enaidement 1.",
        "Nucleus states an action which will be periOrmed by a reader, and the action becomes possible by presenting the situation in Satellite.",
        "(a)ATII/ (b) Ss < A1111.",
        "When Ss is presented, A,, becomes possible.",
        "So, the tine of S', is before A.)",
        "(c)C -(M-cp,001,0t),C IM-dedicircqi (5, already exists or will exist., so S., has the possibility to have truth value.",
        "if S,,, is true, A becomes Possible, So';, should be more certain than A,,.)",
        "2 Nucleus states an action which will be performed by a reader, and the action becomes possible by presenting the situation winch is caused by an lion in Satellite.",
        "(a) S0---(As0--' Si, StAnt/ b) A < Ant, (c) M, C1W,",
        "Contents of a clause is defined as the part which remains after removal of the modal expression.",
        "Contents c.ontain expressitnis concerning tense and aspect, which also contribute to the specification of constraints on HS relations.",
        "The same discussion as the above can be applied to Tense and Aspect, so that all expressions whose function is to express temporal aspects of clauses are, regardlessly of their actual forms, treated in the same classification schemas.",
        "Tense/Aspect are represented as properties of Contents (See Section_ 3.2)."
      ]
    },
    {
      "heading": "3.2 Properties of Contents",
      "text": [
        "Contents is the main part of Clause of which a truth value can be established.",
        "Contents is characterised by three attributes: Type, Tinte and Quality.",
        "(a) Type The truth value of Contents changes according to the time axis.",
        "We can think of two time points, J., and tb, where the Contents C is true during the tinie interval between i, and it,.",
        "Depending on the temporal nature, we classify Contents into the following lour classes.",
        "In the above, 1/bundef in Static means that the truth value of Contents does not change.",
        "1.",
        "An action stated in Nucleus causes a good situation stated in Satellite.",
        "It is considered that the situation motivates the reader to perform the action.",
        "(a) So--(Anii)--S.,[qty :good], actor(A, Reader) (b) A,, < S, a (c) 111 c {M-CPconlinflasrn M C {M-de,vap, olldirkondr eq} 2.",
        "An action stated in Nucleus causes a bad situation stated in Satellite.",
        "It is considered that the situation motivates the reader not to perform the action.",
        "(a) So (A )-/-* .5 , 5',,, [qly : bad], actor(A, Reader) (b) A,0,< S.,,, (c) Ms a E5lasin} M00 e fiVI-derralvolblidemaireq) 3.",
        "Satellite states some attributive information related to an action in Nucleus, and the information may be desirable for Reader.",
        "(a) 5\",[qty good]A,,,, (b) no (c) Msa E {M-cP,viHonl tfjasai} 4.2.4 Evidence (a) C,,, h Cnu (11) C,,, a < Crt (c) IVf,, E (I14-cp,1110 EePe ott f"
      ]
    },
    {
      "heading": "5 Examples",
      "text": [
        "We will show an example of a text structure analysis.",
        "Figure 1 shows a sample text front a leading article in a Japanese newspaper\" and Table 2 shows the attributes of each sentence.",
        "The discourse structure of the sample text is shown in Figure 2.",
        "In this example, the following relations are analysed as presentational relations.",
        "The number attached to a relation name shows the subschema number of the relation.",
        "Background(8) between '1-2' and '3' Sentence 3 has Evaluative modality about the situation '3' (economic crisis) and it is based on the situation of '1-2' (drop of dollar).",
        "These satisfy the constraints of the 8th subschema of Background.",
        "5 This article appeared in the October 30th, 1087, morning edition of the Asahi Shinahun.",
        "\"fAteral translations are made by the authors.",
        "Figure 1: Sample text Background(6) between '4' and '5-6' The semantic relation is that a bad situation in sentence '4' (unsettle market) will be resolved by performing an action in '5-6' (show a resolute attitude).",
        "Sentence '5-6' has Directive modality, These satisfy the constraints of the 6th subschema of Background.",
        "13ackground(7) between '7' and '8-9' The situation '7' (dollar is a key) is held true, so Contents '8-9' (effect of had influence) is true.",
        "These satisfy the constraints of the 7th subschema of Background.",
        "BS relation combines the two clauses into a single unit.",
        "For determining these, we have to look for other kinds of surface cues.",
        "Because RS relations are defined pragmatically, their ultimate recognition requires understanding of texts which in turn requires detailed knowledge about the world.",
        "Furthermore, the condition that the presentational relations are inherently inica tional, implies that their recognition requires knowledge about the writer's intention, plans, etc.",
        "Because tins kind of information is implicit in texts, its recognition often causes problems.",
        "However, though the writer's intention is implicit, certain linguistic devices give us clues to infer it.",
        "Modality information in a clause, for example, expresses the writer's attitude toward an event/state described, and therefore, often gives us clues to recognise a RS relation.",
        "Let us consider the following two examples: [Example 1] (1) I prepared documents for a meeting.",
        "(2) I sent then' to the head office.",
        "[Example 2] (1)' I ant preparing documents for a meeting.",
        "(2)' I have to send them to the head office.",
        "Though these two examples describe pairs of similar events, the relation between (1) and (2) in Example 1 is (temporal) Sequence (a subject matter relation) because they simply describe two events which happened in sequence.",
        "On the other band, in Example 2, (1)' describes an event occurring simultaneously with the utterance, and (2)' concerns what the writer plans to do.",
        "While the two events, preparing documents and sending them, may happen in this sequence, the relation is not regarded as Sequence but as Background.",
        "(2)' gives the reason why the writer is performing the action described by (1)'.",
        "This change of HS relation occurs due to the difference of modality of (2) and (2)'.",
        "Our basic claim ii is that, though they cannot determine RS relations uniquely, information of modality and tense of clauses imposes significant constraints on possible RS relations, and, being used together with other surface cues like clausal conjunctions, it can reasonably restrict a set of possible discourse structures of texts without re:- sorting to detailed knowledge about the world and the writer's plan.",
        "However, the contribution of modality and tense to the constraints of RS relations is not straightforward.",
        "Both these grammatical features are intertwined with the propositional content of clauses.",
        "Therefore, in order to formulate the constraints on them t properly, we have first to reveal how the intended effects of RS relations can be attained.",
        "This leads to our breaking down single RS relations into sets of subschemas, each of which is formulated in terms of the semantic relationships between propositional contents of clauses, their modality and temporal relationships."
      ]
    },
    {
      "heading": "3 Properties of Clauses",
      "text": [
        "Like Mann and Thompson, we use clauses as the basic constituents which are related by RS relations, except that clausal subjects and complements and restrictive relative clauses are considered parts of their host clause.",
        "The constraints which we formulate for each RS relation are expressed in terms of properties of clauses.",
        "In order to express these constraints formally, we first introduce the basic terms."
      ]
    },
    {
      "heading": "3.1 Contents and Modality",
      "text": [
        "A clause comprises its Contents and Modality.",
        "Modality is the part, which expresses the writer's attitude toward the Contents.",
        "While individual languages have their own linguistic devices or grammatical forms of modality, what sorts of modality are expressed by such linguistic devices does not vary from one language to another.",
        "For example, although the major linguistic device for modality are modal auxiliary verbs both in :English and in Japanese, some kinds of modality expressed in Japanese by modal auxiliary verbs are expressed by lexical verbs in English, and vice versa.1 Furthermore, we find many phrasal or quasi-phrasal expressions which consist of several words, and which collectively express the writer's attitude toward the event/state described.",
        "In order to treat them, we adopt a semantics-based view for the definition of Modality.",
        "That is, we treat expressions which concern the writer's at as modal expressions, whichever linguistic forms they may take.",
        "We first establish a. classification schema of Modality based on semantic considerations (See Section 3.3) and then treat all expressions whose functions can be classified under thus schema as modal expressions.",
        "Motivation( 2) between '7-9' and '10' Sentence '7-9' states a had situation (effect of bad influence), and the action in '10' (re-solidify their cooperation) has the possibility to change the situation.",
        "'1'he writer is requesting the other countries to take this action.",
        "'lliese satisfy the constraints of the 21id subschema oF Motivation.",
        "Background(9) between '1-3' and '4-10' The request in '4-10' (re-solidify their cooperation) is based on the judgement of '1-3' (a writer's evaluation of tie economic crisis).",
        "These satisfy lie constraints of the 91,11 subschema of Background."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "In this paper, we propose Further a breakdown of the presentational relations in BST into their subschemas.",
        "The sulischemas represent strategies by which two states/actions/events which stand in certain semantic relationships can be used to attain intended effects on readers.",
        "By associating the definitions of the relations with fOrnially stated constraints, these subschemas help human analysts to recognise them in texts, and thus iniprove ityr as an analytical tool.",
        "Moreover, because characterisation of clauses in Section 3, especially Modality and Tense/Aspect are accompanied by their actual linguistic realisations, some parts of the constraints stated in Section 4 can readily be associated with textual forms and be used for text processing systems.",
        "Although constraints on semantic relations between Contents can only be evaluated by reference to a knowledge base, we expect, that, even without constraints on semantic relations, the other constraints can be used to restrict a set, of possible inter-clausal structures of texts.",
        "We have defined four presentational relations in BST more formally and analysed a sainple text using these definitions.",
        "But the definitions do not cover all the relations in INT and have not been widely tested.",
        "After defining all the relations, we will apply them to analyse full range of' text."
      ]
    }
  ]
}
