{
  "info": {
    "authors": [
      "Kenneth Man-Kam Yip"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P85-1003",
    "title": "Tense, Aspect and the Cognitive Representation of Time",
    "url": "https://aclweb.org/anthology/P85-1003",
    "year": 1985
  },
  "references": [],
  "sections": [
    {
      "text": [
        "This paper explores the relationships between a computational theory of temporal representation (as developed by James Allen) and a formal linguistic theory of tense (as developed by Norbert Hornstein) and aspect.",
        "It aims to provide explicit answers to four fundamental questions: (1) what is the computational lustification for the primitives of a linguistic theory; (2) what is the computational explanation of the formal grammatical constraints: (3) what are the processing constraints imposed on the learnability and markedness of these theoretical constructs; and (4) what are the constraints that a linguistic theory imposes or representations.",
        "We show that one can effectively exploit the interface between the language faculty and the cognitive faculties by using linguistic constraints to determine restrictions on the cognitive representations and vice versa.",
        "Three main results are obtained: (1) We derive an explanation of an observed grammatical constraint on tense -- the Linear Order Constraint from the information monotonicity property of the constraint propagation algorithm of Allen's temooral system; (2) We formulate a principle of markedness for the basic tense structures based on the computational efficiency of the temporal representations: and (3) We snow Allen's interval-based temporal system is not arbitrary, but it can be used to explair, :ridependantly motivated linguistic constraints on tense and aspect interpretations.",
        "We also claim that the methodology of research developed in ties study \"cross-level\" investigation of independently motivated formal grammatical theory and computational models is a powerful paradigm with which to attack representational problems in oasic .",
        "::ogrative domains, e.g.. space.",
        "time, causality.",
        "etc."
      ]
    },
    {
      "heading": "1. Objectives and Main Results",
      "text": [
        "One maior effort in modern linguistics is to limit the class of possible grammars to those that are psychologically real.",
        "A grammar is psychologically real if it is (a) realiza ale possessing a computational model that can reproduce certain psychological resource complexity measures, and (b) learnable capable of being acquired (at least, in principle) despite the poor quality of input linguistic data.",
        "A shift of emphasis from the pure characterization problem of grammar to the realization and learnability problems naturally brings linguistics closer to Al work in natural language understanding concerned with computational models of language use and language acquisition.",
        "Computational study is in principle complementary to more formal and abstract grammatical theory.",
        "Each should contribute to the other.",
        "The purpose of this paper is to work out an example of how formal grammatical theory and computational models can effectively constrain eacn other s representations.",
        "In particular, I seek to explore four fundamental issues:",
        "1.",
        "How is the choice of primitive structures in grammatical theory to be iustifi ea?",
        "2.",
        "What is the explanation of the rules and constraints that have to be stipulated at the grammatical level?",
        "3.",
        "How are these knowledge structures acquired?",
        "4.",
        "What are the theoretical constraints imposed by the grammar on the representational scneme of the computation theory?",
        "What I hope to show is that structures and principles that have to be stipulated at the grammatical level fall out naturally as consequences of the properties of the algorithms and representations of the underfying computational model.",
        "In so doing, I will also restrict the class of plausible computational models to those that can explain or incorporate the constraints imposed by the formal grammatical theory.",
        "There are a numoer of requirements that must be met in order for such \"cross.level\" study to succeed.",
        "First, there is a sizable collection of facts ano data from the target domain to be explained.",
        "Second.",
        "there is independent motivation for the theory of grammar empirically adequate.",
        "And, third, the computational model is also fnaependently motivated by being sufficiently expressive and computationally efficient.",
        "With these considerations, I have chosen two domains: (1) tense arid (2) aspect.",
        "Tense concerns the chronological ordering of situations with respect to some reference moment, usually the moment of speech.",
        "Aspect is the study of situation types and perspectives from which a particular situation can be viewed or evaivated (cf. Comrie75) The point of departure of this study is two papers: (1) for the theory of tense, Hornstein's \"Towards a theory of Tense\" (Hornstein77) and (2) for the cognitive theory of time, James Allen's \"Towards a General Theory of Action and",
        "2.",
        "We derive an explanation of Hornstein's Linear Order Constraint, an observed formal constraint on linguistic tense, from properties of the constraint propagation algorithm of Allen's temporal system.",
        "This shows this formal grammatical constraint need not be learned at all.",
        "We also show that the rule of R-permanence follows from the hypothesis that only tne matrix clause and the subcategorizable SCOMP or VCOMP can introduce distinct S and R points.",
        "Finally, we prove that certain boundedness condition on the flow of information of a processing system leads directly to the locality property of a constraint on sequences of tense.",
        "3.",
        "A principle of markedness for tense structures based on the computational efficiency of the temporal representation.",
        "The principle predicts that (1) of the six basic tenses in English.",
        "future perfect is the only marked tense, and (2) the notion of a distant future tense, lust like the simple future, is also unmarked.",
        "4.",
        "A better account of the state/event/process distinction based on Allen's interval-based temporal logic and the idea that the progressive aspect specifies the perspective from which the truth of a situation is evaluated.",
        "5.",
        "An account of theoretical constraints on the representation of time at the computational level, e.g.. three distinct time points are necessary to characterize an elementary tensed sentence, and the distinction between instantaneous and non-instantaneous time intervals."
      ]
    },
    {
      "heading": "2. Tense",
      "text": [
        "We begin by first outlining Hornstein' s theory of tense.",
        "In section 2.1. we aescribe the primitives and constraints on tense of his theory.",
        "In sections 2.2 and 2.3. we show how the pnmitives and constraints can be derived from computational considerations."
      ]
    },
    {
      "heading": "2.1 Revisions to Hornstein's Theory of Tense",
      "text": [
        "Hornstein develops a theory of tense within the Reicnenbachian framework which postulates tnree theoretical entities: S (the moment of speech), R (a reference point), and E (the moment of event).",
        "The key idea is that certain linear orderings of the three lime points get grammaticalized into the six basic tenses of English) The following is the list cf basic tense structures: I. Hornstein actually lotted none basic tenses.",
        "but I trunk the progressive belongs (O the province of aspect rather than tense.",
        "The notation here demands some explanation.",
        "The underscore symbol \"_\" is interpreted as the \"less-than\" relation among time points whereas the comma symbol \",\" stands for the \"less-than-or-equal-to\" relation.",
        "As an illustration, the present perfect tense denotes a situation in which the moment of speech is either cotemporaneous or precedes the reference point, while the moment of event is strictly before the other two moments.",
        "Note that Hornstein also uses the term \"association\" to refer to the comma symbol Given the basic tense structure for a simple tensed sentence, the interpretation of the sentence that arises from the interaction of tense and time adverbs is represented by the modification of the position of the R or E points to form a new tense structure which we call a derived tense structure.",
        "In two papers (Hornstein77 & Hornstein81), Hornstein proposes three formal constraints that limit the class of derived tense structures that can be generated from the basic tense structures in such a way as to capture the acceptability of sentences containing temporal adverbs (e.g.. now, yesterday, tomorrow).",
        "temporal connectives (e.g., when, before, after), and indirect soeech.",
        "In the rest of this section.",
        "I shall examine the adeauacy of these constraints.",
        "2.1.1 Linear Order Constraint The Linear Order Constraint (LOC) states tnat (p.523-4): (1) The linear oraer of a derived tense structure must be the same as the linear oraer of the basic structure.",
        "(2) No new association is produced in the derived tense structure.",
        "LOC is stipulated to account for examples consisting of a single temporal adverb such as (4a) and those with two time adverbs such as 32).2",
        "4a.",
        "John came home i.",
        "*now, at this very moment ii.",
        "yesterday iii.",
        "*tomorrow 32 a. John left a week ago [from] yesterday.",
        "ti.",
        "[From] Yesterday, John left a week ago.",
        "c. 'A week ago.",
        "John left [from] yesterday.",
        "The basic tense structure for 4(ai) is: E.R_S (simple past: Jonn came home) Now modifies E or R so that they become cotemporaneous with the moment of speech S with the derived tense structure as 2.",
        "The eurneenngs are Hornstein's.",
        "follows: perfect does not work with RTC since it produces the wrong predictions for the following two sentences: E,R.S (BAD: violates LOC since new association is produced) [1] 'John came when we have arrived.",
        "On the other hand.",
        "4(aii) is acceptable because the modifier 121 John comes when we have arrived.",
        "yesterday leaves the tense structure unchanged: For [11 the new analysis is:",
        "The crucial example, however, is 5(c):3 5c.",
        "John has come home i.",
        "?right now 'tomorrow yesterday.",
        "LOC predicts (wrongly) that 5cii is good and 5ciii bad.4 But LOC gives the wrong prediction only on the assumption that the basic tense structures are correct.",
        "To account for Sc.",
        "I propose to save the LOC and change the following SRE association with the present perfect:"
      ]
    },
    {
      "heading": "PRESENT PERFECT E_R,S",
      "text": [
        "With the modified basic tense structure for present perfect, LOC will give the correct analysis.",
        "5cii is bad because:",
        "(OK: no new linear order and no new comma) The question that naturally arises at this point is: Why does Hornstein not choose my proposed SRE structure for the present Perfect?",
        "The answer, I believe, will become apparent when we examine Hornstein's second constraint.",
        "The rule for temporal connectives (RTC) states that (p.539-40): For a sentence of the form P1conn.122.",
        "where \"conn\" is a temporal connective such as \"when\" \"before\", \"after\" etc., line up the S points of P, and P2, that is.",
        "write the tense structure of P1 and P2, lining up the S points.",
        "Move R2 to under RI, placing E2 accordingly to preserve LOC on the basic tense structure.",
        "It car.",
        "be easily seen that my proposed tense structure for present 3, see footnote 7 and 11 of Hornstein's paper.",
        "a There may be doubts as regards the acceptability of 5ciii.",
        "An equivalent form Of 5ciii is =electable is Danish (Jespersen65.",
        "0.271).",
        "Also.",
        "in French, the present perfect can be used tor a situation that held not more than 24 hours before Me Present moment (Comnem, 3.61).",
        "which does not violate the RTC and hence predicts (wrongly) that [11 is acceptable.",
        "Similarly, for [2], the new analysis is:",
        "This may explain why Hornstein decides to use E_S,R for the present perfect because it can account for (11 and [2] with no difficulty.",
        "However.",
        "I suggest that the correct move should be to abandon RTC which has an asymmetrical property, i.e., it matters whether P1 or P2 is put on top, and does not nave an obvious semantic explanation.",
        "(See Hornstein's footnote 20.",
        "13.540).",
        "My second proposal is then to replace RTC with a Rule of R.permanence (RP) stating that: (RP): Both the S and R points of P/ and P2 must be aligned without any manipulation of the tense structure for P2.",
        "Thus sentence [3]: [3] John came when we had arrived, is acceptable because its tense structure does not violate RP:",
        "Now, let us reconsider sentences [1] and [2].",
        "Sentence [1] is not acceptable under RP and the new tense structure for present perfect since: (violates RP: the two R's E R.5 are not aligned) Sentence 12] is still a problem.",
        "Here I shall make my third proposal, namely.",
        "that tne simple present admits two basic tense structures:"
      ]
    },
    {
      "heading": "SIMPLE PRESENT S.R.E and E.R.S",
      "text": [
        "Given this modification.",
        "sentence [2] will now be acceptable since: E.R.S (S and R points are aligned)",
        "To examine the adequacy of RP.",
        "let us look at more examples: sPeech.",
        "To account for the sequence of tense in reported speech, Hornstein proposes the following rule: (SOT): For a sentence of the form \"P1 that P2\", assign S2 with El.",
        "In general, for an n.level embedded sentence.",
        "SOT states that: assign S, with E0.1 (Hornstein81, p.140).",
        "With the SOT rule, (6a1 and (6b1 will be analyzed as follows:",
        "We can see that the proposed theory correctly predicts all of the five cases.",
        "There is.",
        "however, an apparent counterexample to RP which, unlike RTC, is symmetrical.",
        "i.e., it does not matter which of the Pi's is put on the top.",
        "Consider the following two sentences:",
        "[5] i. John will come when we arrive.",
        "'ii.",
        "*John arrives when we will come.",
        "RP predicts both 5i and 5ii will be unacceptable.",
        "but Si seems to be good.",
        "It is examples like 5i and 5ii, I believe, that lead Hornstein to propose the asymmetrical rule RTC.",
        "But I think the data are misleading because It seems to be an idiosyncrasy of English grammar that 5i is acceptable.",
        "In French, we have to say an equivalent of \"John will come when we will arrive\" with the temporal adverbial explicitly marked with the future tense (Jespersen65.",
        "p.264).",
        "Thus, the acceptability of sentences like Si can be explained by a principle of Economy of Speech allowing us to omit the future tense of the temporal adverbial if the matrix clause is already marked with the future tense."
      ]
    },
    {
      "heading": "2.1.3 Sequences of Tense",
      "text": [
        "Now, we describe the third and final grammatical constraint on sequences of tense.",
        "Consider the following sentences:",
        "[6] John said a week ago that Mary (a) will leave in 3 days.",
        "(b) would",
        "In the (a) sentence, the temporal interpretation of the embedded sentence S evaluated with respect to the moment of speech.",
        "Thus, for instance, [6a] means that Mary's leaving is 3 days after present moment of speech.",
        "On the other hand, the (b) sentence has the temporal interpretation of the embedded sentence evaluated with respect to the interpretation of the matrix clause, i.e., (6b) means that Mary's leaving is 4 days before the moment of",
        "The local property of SOT, i.e., linking occurs only between nth and (n-1)th level, has a nice conseouence: it explains why a third level nested sentence like [7]:",
        "has only two temporal readings: (1) in 7(ci).",
        "Mary's leaving is two days after the moment of speech.",
        "and (2) in 7(cii), Mary's leaving is two days before the moment of speech.",
        "In particular, there is not a temporal reading corresponding to the situation in which Mary's leaving is five days before the moment of speech.",
        "We would obtain the third reading if SOT allowed non-local linking, e.g., assigned S3 with El."
      ]
    },
    {
      "heading": "2.2 Explanations of the Formal Constraints",
      "text": [
        "In the previous section, we have examined three formal constraints on the derivation of complex tense structures from the basic tense structures: (1) LOC.",
        "(2) RP, and (3) SOT.",
        "Now, I want to show how the LOC falls out naturally from the computational properties of a temporal reasoning system along the line suggested by Allen (Allen84, Allen83), and also how the RP and SOT constraints have intuitive computational motivation.",
        "The basis of Allen's computational system is a temporal logic based on intervals instead of time points.",
        "The temporal logic consists of seven basic relations and their inverses (A11en84, p.129, figure 1):",
        "The reasoning scheme is a form of constraint propagation in a network of event nodes linked by temporal relationships.",
        "For instance, the situation as described in the sentence \"John arrived when we came\" is represented by the network:",
        "where A = John's arrival and 8 = Our coming This network means that both event A and event B are before now, the moment of speech, while A can be before, alter or simultaneous with B.",
        "When new temporal relationships are added, the system maintains consistency among events by propagating the effects of the new relationships via a Table of Transitivity Relationships that tells the system how to deduce the set of admissible relationships between events A and C given the relationships between A and B, and between B and C. Thus, for instance, from the relationships \"A during B\" and \"B < C\", the system can deduce \"A < C\".",
        "One property of the constraint propagation algorithm generally is that further inlormatton only causes removal of members from the set of admissible labels, i.e., temporal relationships, between any two old events (Allen83.",
        "p.835).",
        "No new label can be added to the admissible set once it is created.",
        "Let us call this property of the constraint propagation algorithm Inc Delete Labei Condition (DLC).",
        "DLC can be interpreted as a kind of information monotonicity condition on the temporal representation.",
        "Let A and B range over ( S. R. E ) and A B.",
        "There are five basic types 01 violations of the LOC:",
        "2.",
        "A_B A.B 3.",
        "A_B B.A 4.",
        "A.B B,A 5, A,B B_A",
        "We can see that each of these cases is a violation of the DLC.",
        "To spell this out.",
        "we have the following operations on the constraint network corresponding to the above violations of the LOC:",
        "In each of these cases.",
        "the operation Involves the addition of new members to the admissible set.",
        "This is ruled out by OLC.",
        "Thus, we have the result that if LOC is violated, then OLC is violated.",
        "In other words.",
        "DLC LOC.5 The second constraint to be accounted for is the RP which effectively states that (a) the S points of the matrix clause and the temporal adverbial must he identical.",
        "and (b) the R points of the matrix clause and the temporal adverbial must be identical.",
        "One hypothesis for this rule is that: (H1) Only the matrix clause introduces distinct S and R points.",
        "In other words, the non-subcategorizable temporal adjuncts do not add new S and R points.",
        "Let us further restrict Allen's temporal logic to Instantaneous intervals.",
        "i.e., each event corresponds to a single moment of time.",
        "H1 has to be modified slightly to take the case of embedded The restricted logic has only one primitive relation, and three sentence into account, namely, other derived relations: <, >, and >.",
        "There is a straightforward translation of Hornstein's SRE notation into the network (Revised RP): Only the matrix clause and the subcategorizable representation, namely, replace each comma symbol \",\" by < (or SCOMP or VCOMP can introduce distinct S and R points.",
        "> witr the event symbols reverse their roles) and each underscore symbol \"_\" by > (or < with similar adjustment on the where SCOMP and VCOMP stand for sentential complement and event symbols).",
        "Thus, a tense structure such as: E_R,S can be",
        "verbal complement respectively.",
        "The interesting point is that both Let us recall our restrictive temporal logic of instantaneous the revised RP and the locality properly of SOT can be easily interval with one primitive relation, <, and three derived relations: < implemented in processing systems which have certain , >, and >.",
        "Represent a SRE configuration as follows: bounaeaneSs constraint on the phrase structure rules (e.g., information cannot move across more than one bounding node).",
        "S E To illustrate this, let us consider the following tense interpretation rules embedded in the phrase structure rules of the Lexical-Functional Grammar: The admissible labels are among C (, <= >, > = ).",
        "So there are altogether 64 possible configurations that can be classified into",
        "The S rule introduces a new S point and sets its value to now.",
        "The VP rule has two effects: (1) it does not introduce new S or R points for the temporal adverbial phrase, thus implicitly incorporating the revised RP rule, and (2) it looks at the tense of the embedded sentential complement, setting the value of its S point to that of the E point of the higher clause if the tense is past, and to now, otherwise.",
        "Thus, in this way, the second effect accomplishes what the SOT rule demands."
      ]
    },
    {
      "heading": "2.3 Implications for Learning",
      "text": [
        "If the revisions to Hornstein's theory of tense are correct, the natural question to oe asked is: How do speakers attain such knowledge?",
        "This question has two parts: (1) How do speakers acquire the formal constraints on SRE derivation?",
        "and (2) How do speakers learn to associate the appropriate SRE structures with the basic tenses of the language?",
        "(3) Label ings that are consistent and the SE link is constrained by the SR and RE link (16), e.g..",
        "If we assume that labelings of the third type correspond to the unmarked SRE configurations, the following division of unmarked and marked configurations is obtained: Let us consider the first sub•question.",
        "In the case of LOC.",
        "UNMARKED MARKED we have a neat answer the constraint need NOT be learned at all!",
        "We have shown that LOC falls out naturally as a consequence of the architecture and processing algorithm of the computational system.",
        "As regards the constraint RP.",
        "the learner has to acquire something similar to HI.",
        "But HI is a fairly simple hypothesis that does not seem to require induction on extensive linguistic data.",
        "Finally, as we have shown in the previous section, the boundeaness of the flow of information of a processing system leads directly to he locality property of the SOT.",
        "The particular linking of S and E points as stipulated by the SOT, however, is a parameter of the Universal Grammar that has to be fixed.",
        "What about the second sub-question?",
        "How do speakers learn to pair SRE configurations with the basic tenses?",
        "There are 24 possible SRE configurations seven of which get grammaticalized.",
        "Here I want to propose a principle of markedness of SRE structures that has a natural computational motivation.",
        "There are only eight unmarked tense structures corresponding to the sixteen SRE network configurations of type 3",
        "because a tense structure can be interpreted by more than one network representations.",
        "e.g., the Past Perfect (E_R_S) has the following two configurations:",
        "The interesting result is that five out of the six basic tenses have unmarked SRE configurations.",
        "This agrees largely with our pretheoretical intuition that the SRE configurations that correspond to the basic tenses should be more \"unmarked\" than Other possible SRE configurations.",
        "The fit, however, is not exact because the future perfect tense becomes the marked tense in this classification.",
        "Another prediction by this principle of markedness is that both the simple future (S_R,E) and distant future (S_R_E) are unmarked.",
        "It would be interesting to find out whether there are languages in which the distant future actually gets grammaticalized.",
        "The final point to be made is about the second type of labelings.",
        "There are two other possible ways of grouping the labelings: (1) given SR and SE.",
        "those labelings in which RE is constrained.",
        "and (2) given SE and RE, those in which SR is constrained.",
        "But these types of grouping are less likely because they would yield the simple present tense as a marked tense.",
        "Thus, they can be ruled out by relatively few linguistic data."
      ]
    },
    {
      "heading": "3. Verb Aspect",
      "text": [
        "In considering the problem of tense, we have restricted ourselves to a subset of Allen*s temporal logic, namely, using a temporal structure <T. <> with linear ordering of time points.",
        "To make use of the full power of Allen's temporal logic.",
        "we now turn to the problem of verb aspect.",
        "The two main problems ot the study of verb aspect are the correct characterization 01 (1) the three fundamental types of verb predication according to the situation types that they signify --state.",
        "process and event.",
        "and (2) the perspectives from which a situation is viewed, or its truth evaluated simple or progressive.6 In the first part of his paper.",
        "Allen attempts to provide a formal account of the state/process/event distinction using a temporal logic.",
        "However.",
        "I believe that his characterization fails to capture well-known patterns of tense implications, and does not make the distinction between situation types and perspective types fundamental to any adequate account of verb aspect.",
        "In the next section, I will °resent some data that any theory of verb aspect must be able to explain.",
        "6.",
        "Some of the Defter works are: Vendie47.",
        "C,onme713.",
        "Mourelatos78.",
        "3.1 Data 3.1.1 Tense Implications 1.",
        "Statives rarely take the progressive aspect7 , I know the answer.",
        "'I am knowing the answer.",
        "2.",
        "For verb predications denoting processes, the progressive of the verb form entails the perfect form, i.e.,"
      ]
    },
    {
      "heading": "distinction Define:",
      "text": [
        "7.",
        "It has often been pointed out that some statwes do lase the Progressive km.",
        "E.g., 1 am masking about Ova exam'.",
        "'The doctor is seeing a pauent.\" However, a statistical study has shown that the familiar statures rarely occur with the progressive aspect -- teas than 2% of me time (0ta63.",
        "section 2-2)",
        "A process verb can be true only at an interval larger than a single moment.",
        "This property differs crucially from that of the statives.",
        "where X and Y are generic symbols denoting state, event or process.",
        "(PROG): OCCUR(PROG(v,t)) •-• mom(t) A – 1 OCCUR(v,t) A (3 t')(t d t' A OCCUR(v,C))9 The progressive aspect is the evaluation of a situation from an interior point t of the situation which has the property that though the sentence is not true at that instantaneous interval, it is true in a non-Instantaneous interval t properly containing t.",
        "(S1): OCCUR(s.t) •-• (V t')(mom(r) A t' C t OCCUR(s,t')) A state verb is true at every instantaneous interval of t. The definition is similar to Allen's H.1 (Allen84, p.130).",
        "The following theorem shows that state verbs do not occur with the progressive aspect.",
        "(S-THEOREM): 'OCCUR(PROG(s.0) aropf OCCUR(PROG(s.0) mom(t) A --10CCUR(s.t) A (3 t')(t d t' A OCCUR(s.r)) OCCURts.t.)",
        "for some t containing t OCCUR(s.t) (by Si) •.",
        "contradiction.",
        "'-This theorem raises the following question: Why do some statives occur with the progressive?",
        "I thirm there are two answers.",
        "First, the verb in question may nave a use other than the stative use (e.g. \"have\" is a stative when it means \"possession\", and not a stative when it means \"experiencing\" as in \"John is having a good time in Paris.\") Second.",
        "the English progressive may have a second meaning in addition to that characterized by FROG above.",
        "A freouent usage of the progressive is to indicate snort duration or temporariness, e.g., in \"They are living in Cambridge\" /\"They live in Cambridge\".",
        "8.",
        "This section benefits from tne insights of Barry Taylor (Taylor TI).",
        "9 reviewer of this aaoer :mints out Mat me PROO axiom seems to imply trtat if Something is in progress, it must complete.",
        "Thus.",
        "if Maxis drawing a circle, then at Some future time.",
        "ne must have arawn me circle.",
        "This interence e dearly false because mere is nothing contradictory avow 'Max was drawing a circle Out he never crew IC For instance.",
        "Max mignt su9er a heart attack and Jen suddenly.",
        "The imertrice problem of me progressive term ot a event verb is known as ine imeertecnve Damex in me literature One way out is to deny that Max was realty drawing a circle yawn ne died Rather he was drawing something %Witch week!",
        "nave been a circle had he not died This type of analysis would involve some machinery froMPossible World semantics.",
        "(P1): OCCUR(p,t) per(t) (P2): OCCUR(p,t) (V r)(per(r) A t' C t OCCUR(p,t')) The following theorem shows that for a process verb, the progressive verb form entails the perfect form.",
        " – 3 m2 E t'.",
        "m1 <m2 < t (by density of time points) Let t\" be the interval 1m1 .m21.",
        "Then, we have t\" <t and t\" C t'.",
        "By (P2), we have OCCUR(p,t\").",
        "That is, p has occurred.",
        " – I.",
        "The characterization of process verb by Allen (his 0.2) is less satisfactory because it combines both the notion of progressive aspect (his \"OCCURRING\") and the process veto Into the same axiom.",
        "Furthermore, the difference between tne predicate \"OCCUR\" and \"OCCURRING\" is not adequately explained in his paper."
      ]
    },
    {
      "heading": "3.2.4 Event",
      "text": [
        "An event verb shares an important property with a process verb, namely.",
        "it can be true only at a non •instantaneous interval.",
        "(El).",
        "OCCUR(e.t) per(t) (E2)• OCCUR(e.t) – (V n(per(r) A t' C t OCCUR(e,r) The following theorem shows that the progressive form of an event verb entails the negation of the perfect form.",
        "(E-THEOREM): OCCUR(PROG(e.t)) – – 1(3 t')(per(r) A t'< t A OCCUR(e,r)) Proof As in the proof of (P-THEOREN1).",
        "we can find a non-instantaneous interval t\" such that 1\" (1 and t\" C t' But tor any such t\", we have",
        "• OCCUR(e.t\") because of (E2).",
        "That is, it cannot be the case that e has oCcurred.",
        "Again the crucial property (El) is not captured by Allen's characterization of events (his 0.1)."
      ]
    },
    {
      "heading": "3.3 Constraint on temporal interpretations involving When",
      "text": [
        "To account for the variety of aspect interpretations as presented in section 3.1.2, I propose the following constraint on",
        "Perspective is a way of looking at the situation type.",
        "For process or event, the simple aspect treats the situation as an instantaneous interval even though the situation itself may not be instantaneous.",
        "For state.",
        "the simple aspect retains its duration.",
        "The progressive aspect essentially views a process or event from its interior, thus requiring a stance in which the situation is a non-instantaneous interval and the admissible temporal relationship to be the C relations.",
        "i.e., s, st, t, fa, d, di, equal.",
        "Let me show graphically how C.ASPECT accounts for the aspect interpretations of sentences (91 to 021.",
        "Another important role of a representation scheme in explaining phenomena that exist on a entirely different -• linguistic -- level is illustrated by the formulation of the C-ASPECT constraint to account for interpretations of sentences containing temporal connectives.",
        "The study of linguistic semantics also sheds light on a representation of time by revealing the fundamental distinctions that must be made.",
        "e.g.. a tensed sentence involves three distinct time points, and the aspectual interpretations require instantaneous/non-instantaneous interval distinction."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "would like to thank Prot Robert C. Berwick for his insightful suggestion that the relationship between a cognitive theory of time and a linguistic theory of tense is a fruitful 'and important area for research.",
        "He also contributed substantially to the presentation of this paper Finally, I also thank Norbert Hornstein who provided useful comments during the revision of this paper."
      ]
    },
    {
      "heading": "5. References",
      "text": []
    },
    {
      "heading": "4. Conclusion",
      "text": []
    }
  ]
}
