{
  "info": {
    "authors": [
      "William Lewis",
      "Sauleh Eetemadi"
    ],
    "book": "Workshop on Statistical Machine Translation",
    "id": "acl-W13-2235",
    "title": "Dramatically Reducing Training Data Size Through Vocabulary Saturation",
    "url": "https://aclweb.org/anthology/W13-2235",
    "year": 2013
  },
  "references": [
    "acl-D07-1103",
    "acl-D10-1061",
    "acl-D11-1033",
    "acl-I08-2088",
    "acl-N09-1047",
    "acl-P03-1021",
    "acl-P05-1034",
    "acl-P09-3009",
    "acl-P10-2041",
    "acl-W08-0509",
    "acl-W09-0401",
    "acl-W12-3131",
    "acl-W13-2809"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Our field has seen significant improvements in the quality of machine translation systems over the past several years.",
        "The single biggest factor in this improvement has been the accumulation of ever larger stores of data.",
        "However, we now find ourselves the victims of our own success, in that it has become increasingly difficult to train on such large sets of data, due to limitations in memory, processing power, and ultimately, speed (i.e., data to models takes an inordinate amount of time).",
        "Some teams have dealt with this by focusing on data cleaning to arrive at smaller data sets (Denkowski et al., 2012a; Rarrick et al., 2011), ?domain adaptation?",
        "to arrive at data more suited to the task at hand (Moore and Lewis, 2010; Axelrod et al., 2011), or by specifically focusing on data reduction by keeping only as much data as is needed for building models e.g., (Eck et al., 2005).",
        "This paper focuses on techniques related to the latter efforts.",
        "We have developed a very simple n-gram counting method that reduces the size of data sets dramatically, as much as 90%, and is applicable independent of specific dev and test data.",
        "At the same time it reduces model sizes, improves training times, and, because it attempts to preserve contexts for all n-grams in a corpus, the cost in quality is minimal (as measured by BLEU ).",
        "Further, unlike other methods created specifically for data reduction that have similar effects on the data, our method scales to very large data, up to tens to hundreds of millions of parallel sentences."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The push to build higher and higher quality Statistical Machine Translation systems has led the efforts to collect more and more data.",
        "The English-French (nearly) Gigaword Parallel Corpus (Callison-Burch et al., 2009), which we will refer to henceforth as EnFrGW, is the result of one such effort.",
        "The EnFrGW is a publicly available corpus scraped from Canadian, European and international Web sites, consisting of over 22.5M parallel English-French sentences.",
        "This corpus has been used regularly in the WMT competition since 2009.",
        "As the size of data increases, BLEU scores increase, but the increase in BLEU is not linear in relation to data size.",
        "The relationship between data size and BLEU flattens fairly quickly, as demonstrated in Figure 1.",
        "Here we see that BLEU scores increase rapidly with small amounts of data, but they taper off and flatten at much larger amounts.",
        "Clearly, as we add more data, the value of the new data diminishes with each increase, until very little value is achieved through the addition of each new sentence.",
        "However, given that this figure represents samples from EnFrGW, can we be more efficient in the samples we take?",
        "Can we achieve near equivalent BLEU scores on much smaller amounts of data drawn from the same source, most especially better than what we can achieve through random sampling?",
        "The focus of this work is three-fold.",
        "First, we seek to devise a method to reduce the size of training data, which can be run independently of particular dev and test data, so as to maintain the independence of the data, since we are not interested here in domain adaptation or selective tuning.",
        "Second, we desire an algorithm that is (mostly) quality preserving, as measured by BLEU, OOV rates, and human eval, ultimately resulting in decreased training times and reduced model sizes.",
        "Reduced"
      ]
    },
    {
      "heading": "from EnFrGW",
      "text": [
        "training times provide for greater iterative capacity, since we can make more rapid algorithmic improvements and do more experimentation on smaller data than we can on much larger data.",
        "Since we operate in a production environment, deploying smaller models is also desirable.",
        "Third, we require a method that scales to very large data.",
        "We show in the sections below the application of an algorithm at various settings to the 22.5M sentence EnFrGW corpus.",
        "Although large, 22.5M sentences does not represent the full total of the English-French data on the Web.",
        "We require an algorithm that can apply to even larger samples of data, on the order of tens to hundreds of millions of sentences."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "In statistical machine translation, selection, preparation and processing of parallel training data is often done to serve one of the following scenarios: ?",
        "Low Resource Languages: In languages with low parallel data availability, a subset of a monolingual corpus is selected for human translation ((Ananthakrishnan et al., 2010), (Eck et al., 2005) and (Haffari et al., 2009)).",
        "?",
        "Mobile device deployment: For many languages, translation model sizes built on all available parallel data are too large to be hosted on mobile devices.",
        "In addition to translation model pruning, a common solution is selecting a subset of the data to be trained on ((Ananthakrishnan et al., 2010) and (Yasuda et al., 2008)).",
        "?",
        "Quick turnaround time during development: A common motivation for training on a subset of a parallel corpus is to reduce training time during the development cycle of a statistical machine translation system ((Lin and Bilmes, 2011) and (Chao and Li, 2011a)).",
        "?",
        "Noise reduction: Simple noise reduction techniques like sentence length and alpha numeric ratio are often used in data preparation.",
        "However, more sophisticated techniques have been developed to filter out noise from parallel data ((Denkowski et al., 2012a) and (Taghipour et al., 2010)).",
        "?",
        "Domain Adaptation: Recently there has been significant interest in domain adaptation for statistical machine translation.",
        "One of the approaches to domain adaptation is selecting a subset of a data that is closer to the target domain ((Moore and Lewis, 2010), (Axelrod et al., 2011)).",
        "?",
        "Improve translation quality: An interesting area of research is selecting a subset of the training data that is more suitable for statistical machine translation learning ((Okita, 2009)).",
        "In comparison, the goal of this work is to efficiently reduce very large parallel data sets (in excess of tens of billions of tokens) to a desired size in a reasonable amount of time.",
        "In the related work referenced above two primary methods have been used.",
        "1.",
        "Maximizing n-gram coverage with minimal data.",
        "2.",
        "Filtering out noisy data based on sentence-pair based features.",
        "One of the earliest and most cited works using the first method is (Eck et al., 2005).",
        "In this work, a greedy algorithm is developed to select a subset of the entire corpus that covers most n-grams with minimum number of words.",
        "In a later work by the same author, the algorithm was modified to give higher weight to more frequent words.",
        "Although this is a greedy algorithm and does not provide the optimum solution, its complexity is quadratic in the number of sentences.",
        "Hence it is not practical to run this algorithm over very large data sets.",
        "Recently (Ananthakrishnan et al., 2010) introduced a new algorithm that is an improvement",
        "over (Eck et al., 2005).",
        "In this work discriminative training is used to train a maximum entropy pairwise comparator with n-gram based features.",
        "The pairwise comparator is used to select the highest scoring sentence followed by discounting features used for the sentence, which are drawn from the global pool of features.",
        "The complexity of this algorithm after training the pairwise comparator is O (N ?K ?",
        "log(F )) where N is the number of sentences in the entire corpus, K is the number of sentences to be selected and F is the size of the feature space.",
        "Although this method works well for a constant K, its complexity is quadratic when K is a fraction of N .",
        "This method is reported to improve the BLEU score close to 1% over the work done by (Eck et al., 2005).",
        "(Denkowski et al., 2012a) have developed relatively scalable algorithms that fit in the second category above.",
        "This algorithm automatically filters out noisy data primarily based on the following feature functions: normalized source and target language model scores, word alignment scores and fraction of aligned words.",
        "Sentences that don't score above a certain threshold (mean minus one or two standard deviations) for all their features are filtered out.",
        "In a similar work, (Taghipour et al., 2010) use an approach where they incorporate similar features based on translation table entries, word alignment models, source and target language models and length to build a binary classifier that filters out noisy data.",
        "Our work incorporates both methods listed above in a scalable fashion where it selects a subset of the data that is less noisy with a reasonable n-gram representation of the superset parallel corpus.",
        "To put the scalability of our work in perspective we compiled Table 1, which shows the maximum size of the data sets reported in each of the relevant papers on the topic.",
        "Despite the public availability of parallel corpora in excess of tens of millions of sentence pairs, none of the related works, using the first method above, exceed couple of millions of sentences pairs.",
        "This demonstrates the importance of developing a scalable algorithm when addressing the data selection problem.",
        "The careful reader may observe that an alternate strategy for reducing model sizes (e.g., useful for the Mobile scenario noted above, but also in any scenario where space concerns are an issue), would be to reduce phrase table size rather",
        "than reduce training data size.",
        "A good example of work in this space is shown in (Johnson et al., 2007), who describe a method for phrase table reduction, sometimes substantial (>90%), with no impact on the resulting BLEU scores.",
        "The principal of our work versus theirs is where the data reductions occur: before or after training.",
        "The primary benefit of manipulating the training data directly is the impact on training performance.",
        "Further, given the increasing sizes of training data, it has become more difficult and more time consuming to train on large data, and in the case of very large data (say tens to hundreds of millions of sentence pairs), it may not even be possible to train models at all.",
        "Reduced training data sizes increases iterative capacity, and is possible in cases where phrase table reduction may not be (i.e., with very big data)."
      ]
    },
    {
      "heading": "3 Vocabulary Saturation Filter (VSF)",
      "text": [
        "The effects of more data on improving BLEU scores is clearly discernible from Figure 1: as more data is added, BLEU scores increase.",
        "However, the relationship between quantity of data and BLEU is not linear, such that the effects of more data diminishes with each increase in data size, effectively approaching some asymptote.",
        "One might say that the vocabulary of the phrase mappings derived from model training ?saturate?",
        "as data size increases, since less and less novel information can be derived from each succeeding sentence of data added to training.",
        "It is this observation that led us to develop the Vocabulary Saturation Filter (VSF).",
        "VSF makes the following very simple assumption: for any given vocabulary item v there is some point where the contexts for v?that is, the n-gram",
        "lecting speech data.",
        "The total number of sentences is not reported.",
        "We given a high-end estimate based on 128K selected tokens.",
        "sequences that contain v?approach some level of saturation, such that each succeeding sentence containing v contributes few or no additional contexts, and thus has little impact on the frequency distributions over v. In other words, at a point where the diversity of contexts for v approach a maximum, there is little value in adding additional contexts containing v, e.g., to translation models.",
        "The optimal algorithm would then, for each v ?",
        "V, identify the number of unique contexts that contain v up to some threshold and discard all others.",
        "An exhaustive algorithm which sets thresholds for all n-gram contexts containing v, however, would take a large amount of time to run (minimally quadratic), and may also overrun memory limitations on large data sets.",
        "For VSF, we made the following simplifying assumption: we set an arbitrary count threshold t for all vocabulary items.",
        "For any given v, when we reach t, we no longer need to keep additional sentences containing v. However, since each instance of v does not exist in isolation, but is rather contained within sentences that also contain other vocabulary items v, which, in turn, also need to be counted and thresholded, we simplified VSF even further with the following heuristic: for any given sentence s, if all v ?",
        "V within s have not reached t, then the sentence is kept.",
        "This has the direct consequence that many vocabulary items will have frequencies above t in the output corpus.",
        "The implementation of VSF is described in Algorithm 1 below.",
        "VSF clearly makes a number of simplifying assumptions, many of which one might argue would reduce the value of the resulting data.",
        "Although easy to implement, it may not achieve the most optimal results.",
        "Assuming that VSF might be defective, we then looked into other algorithms attempting to achieve the same or similar results, such as those described in Section 2, and explored in-depth the algorithms described in (Eck et al., 2005)."
      ]
    },
    {
      "heading": "4 An Alternative: (Eck et al., 2005)",
      "text": [
        "In our pursuit of better and generic data reduction algorithms, we did a number of experiments using the algorithms described in (Eck et al., 2005).",
        "In the n-gram based method proposed by this work the weight of each function is calculated using Equation 1, where j is the n-gram length.",
        "In each iteration of the algorithm, the weight of each Input: ParallelCorpus, N, L Output: SelectedCorpus foreach sp ?",
        "ParallelCorpus do",
        "if selected then",
        "VSF.",
        "L: n-gram length, N: n-gram threshold.",
        "sentence is calculated and the sentence with the highest weight is selected.",
        "Once a sentence is selected, the n-grams in the sentence are marked as seen and have a zero weight when they appear in subsequent sentences.",
        "Therefore, the weights of all remaining sentences have to be recalculated before the next sentence can be selected.",
        "We refer to this algorithm henceforth as the Eck algorithm.",
        "To compare VSF against the Eck algorithm we selected the English-Lithuanian parallel corpus from JRC-ACQUIS (Steinberger et al., 2006).",
        "We selected the corpus for the following reasons: ?",
        "VSF performance on this particular data set was at its lowest compared to a number of other data sets, so there was room for improvement by a potentially better algorithm.",
        "?",
        "With almost 50 million tokens combined (English and Lithuanian) we were able to optimize the Eck algorithm and run it on this data set in a reasonable amount of time.",
        "The experiments run by the original paper in 2005 were run on only 800,000 tokens.",
        "Using the Eck algorithm with n-gram length set to one (j ?",
        "1 in Equation 1) only 10% (5,020,194 tokens total) of the data is sorted, since all n-grams of size one have been observed by that point and the weight function for the remaining sentences returns zero.",
        "In other words, since there are no unseen unigrams after 10% of the data has been sorted, in Equation 1, the numerator becomes zero there after and therefore the remaining 90% of sentence pairs are not sorted.",
        "This must be taken into consideration when examining the comparison between unigram VSF and the Eck algorithm with n-gram length set to one in Figure 2.",
        "VSF with its lowest setting, that is threshold t=1, selects 20% of the data, so this chart may not be a fair comparison between the two algorithms.",
        "In an attempt to do a fairer comparison, we also tried n-grams of length two in the Eck algorithm, where 50% of the data can be sorted (since all unigrams and bigrams are observed by that point).",
        "As seen in Figure 3, the BLEU scores for the Eck and VSF systems built on the similar sized data score very closely on the WMT 2009 test set.3 Further exploring options using Eck, we developed the following two extensions to the Eck algorithm, none of which resulted in a significant gain in BLEU score over VSF with n-gram lengths set up to three.",
        "?",
        "Incorporating target sentence n-grams in addition to source side sentence n-grams.",
        "?",
        "Dividing the weight of an n-gram (its fre-3The careful reader may note that there is no official WMT09 test set for Lithuanian, since Lithuanian is not (yet) a language used in the WMT competition.",
        "The test set mentioned here was created from a 1,000 sentence sample from the English-side of the WMT09 test sets, which we then manually translated into Lithuanian.",
        "quency) by a constant number each time a sentence that contains the n-gram is selected, as opposed to setting the weight of an n-gram to zero after it has been seen for the first time.4 In relatively small data sets there is not a significant difference between the two algorithms.",
        "The Eck algorithm does not scale to larger data sets and higher n-grams.",
        "Since a principal focus of our work is on scaling to very large data sets, and since Eck could not scale to even moderately sized data sets, we decided to continue our focus on VSF and improvements to that algorithm."
      ]
    },
    {
      "heading": "5 Data Order",
      "text": [
        "Unlike the Eck algorithm, VSF is sensitive to the order of the input data due to the nature of the algorithm.",
        "Depending on the order of sentences in the input parallel corpus, VSF could select different subsets of the parallel corpus that would eventually (after training and test) result in different BLEU scores.",
        "To address this concern we use a feature function inspired by (Denkowski et al., 2012a) which is a normalized combined alignment score.",
        "This feature score is obtained by geometric averaging of the normalized forward and backward alignment scores which in turn are calculated using the process described in (Denkowski et al., 2012a).",
        "To keep the algorithm as scalable as possible we use radix sort.",
        "This ordering of the data ensures sentences with high normalized alignment scores appear first and sentences with low normalized alignment appear last.",
        "As a result, for each n-gram, VSF will choose the top-N highest scoring sentence pairs that contain that n-gram.",
        "4Further details of the modifications to the Eck algorithm are not discussed here as they did not yield improvements over the baseline algorithm and the focus of our work presented here was shifted to improvements over VSF."
      ]
    },
    {
      "heading": "5.1 Data Ordering Complexity",
      "text": [
        "Ordering the data based on normalized combined alignment score requires two steps.",
        "First, the normalized combined alignment score is computed for each sentence pair using an existing HMM alignment model.",
        "Next, sentence pairs are sorted based on the calculated score.",
        "The computational complexity of aligning a single sentence pair is O (J + I2) where J is the number of words in the source sentence and I is the number of words in the target sentence (Gao and Vogel, 2008).",
        "Therefore the complexity of calculating the combined alignment score would be O (N ?",
        "(J2 + I + I2 + J)) or",
        ") after simplification.",
        "Since radix sort is used for sorting the data, the data can be sorted in O(d ?",
        "N) where d is the number of significant digits used for sorting.",
        "Since d is kept constant5, the overall computational complexity for data ordering is O (N +N ?max(I, J)2)."
      ]
    },
    {
      "heading": "6 Experiments",
      "text": []
    },
    {
      "heading": "6.1 The Machine Translation and Training Infrastructure",
      "text": [
        "We used a custom-built tree-to-string (T2S) system for training the models for all experiments.",
        "The T2S system that we developed uses technology described in (Quirk et al., 2005), and requires a source-side dependency parser, which we have developed for English.6 We trained a 5 gram French LM over the entire EnFrGW, which we used in all systems.",
        "We used Minimum Error Rate Training (MERT) (Och, 2003) for tuning the lambda values for all systems, tuned using the official WMT2010 dev data."
      ]
    },
    {
      "heading": "6.2 Test and Training Data",
      "text": [
        "In all experiments, we used the EnFrGW corpus, or subsets thereof.",
        "7 We used three test sets",
        "this paper.",
        "The reader is encouraged to refer to the sources provided for additional information.",
        "7Because of some data cleaning filters we applied to the data, the actual full sized corpus we used consisted of slightly less data than that used in the WMT competitions.",
        "Every team has its own set of favorite data cleaning heuristics, and ours is no different.",
        "The filters applied to this data are focused mostly on noise reduction, and consist of a set of filters related to eliminating content that contains badly encoded characters, removing content that is too long (since there is little value in training on very long sentences), removing content where the ratio between numeric versus alphabetic characters",
        "lions) for different thresholds for VSF, VSF after ordering the data based on normalized combined alignment score and random baselines.",
        "in all experiments, as well.",
        "Two consisted of the WMT 2009 and 2010 test sets, used in the WMT competitions in the respective years.",
        "The third consisted of 5,000 parallel English/French sentences sampled from logs of actual traffic received by our production service, Bing Translator (http://bing.com/translator), which were then manually translated.",
        "The first two test sets are publicly available, but are somewhat news focused.",
        "The third, which we will call ReqLog, consists of a mix of content and sources, so can be considered a truly ?general?",
        "test set.",
        "To discern the effects of VSF at different degrees of ?saturation?, we tried VSF with different threshold values t, ranging from 1 to 250.",
        "For each t value we actually ran VSF twice.",
        "In the first case, we did no explicit sorting of the data.",
        "In the second case, we ranked the data using the method described in Section 5.",
        "Finally, we created random baselines for each t, where each random baseline is paired with the relevant VSF run, controlled for the number of sentences (since t has no relevance for random samples).",
        "The different t values and the resulting training data sizes (sentence and word counts) are shown in Tables 2 and 3.",
        "Since our interest in this study is scaling parallel data, for all trainings we used the same LM, which was built over all training data (the French side of the full EnFrGW).",
        "Because monolingual training scales much more readily than parallel, is excessively large, deleting content where the script of the content is mostly not in latin1 (relevant for French), and some additional filters described in (Denkowski et al., 2012b).",
        "If the reader wishes additional material on data filtration, please see (Denkowski et al., 2012b) and (Lewis and Quirk, 2013).",
        "thresholds for VSF, VSF after ordering the data based on normalized combined alignment score and random baselines.",
        "this seemed reasonable.",
        "Further, using one LM controls one parameter that would otherwise fluctuate across trainings.",
        "The result is a much more focused view on parallel training diffs."
      ]
    },
    {
      "heading": "6.3 Results",
      "text": [
        "We trained models over each set of data.",
        "In addition to calculating BLEU scores for each resulting set of models in (Table 5), we also compared OOV rates (Table 6) and performance differences (Table 4).",
        "The former is another window into the ?quality?",
        "of the resulting models, in that it describes vocabulary coverage (in other words, how much vocabulary is recovered from the full data).",
        "The latter gives some indication regarding the time savings after running VSF at different thresholds.",
        "On the WMT09 data set, both sets of VSF models outperformed the relevant random baselines.",
        "On the WMT10 and ReqLog test sets, the presorted VSF outperformed all random baselines, with the unsorted VSF outperforming most random baselines, except at t=60 and t=200 for WMT10.",
        "For the ReqLog, unsorted VSF drops below random starting at t=200.",
        "Clearly, the t=200 results show that there is less value in VSF as we approach the total data size.",
        "The most instructive baseline, however, is the one built over all training data.",
        "It is quite obvious that at low threshold values, the sampled data is not a close approximation of the full data: not enough vocabulary and contextual information is preserved for the data to be taken as a proxy for the full data.",
        "However, with t values around 20- 60 we recover enough BLEU and OOVs to make the datasets reasonable proxies.",
        "Further, because",
        "ferent thresholds for VSF, VSF after model score ordering, and a random baseline we see a relative reduction in data sizes of 32- 44%, model size reductions of 27-39%, and performance improvements of 41-50% at these t values further argues for the value of VSF at these settings.",
        "Even at t=250, we have training data that is 54% of the full data size, yet fully recovers BLEU."
      ]
    },
    {
      "heading": "7 Discussion",
      "text": [
        "VSF is a simple but effective algorithm for reducing the size of parallel training data, and does so independently of particular dev or test data.",
        "It performs as well as related algorithms, notably (Eck et al., 2005), but more importantly, it is able to scale to much larger data sets than other algorithms.",
        "In this paper, we showed VSF applied to the EnFrGW corpus.",
        "It should be noted, however, that we have also been testing VSF on much larger sets of English-French data.",
        "Two notable tests are one applied to 65.2M English-French sentence pairs and another applied to one consisting of 162M.",
        "In the former case, we were able to reduce the corpus size from 65.2M sentences/1.28B words8 to 26.2M sentences/568M words.",
        "The BLEU score on this test was stable on the three test sets, as shown in Table 7.",
        "When applied to the 162M sentence/2.1B word data set, we were able to reduce the data size to 40.5M sentences/674M words.",
        "In this case, sorting the data using model scores produced the most desirable results, actually increasing BLEU by 0.90 on WMT09, but, unfortunately, showing a 0.40 drop on WMT10.",
        "The fact that VSF runs in one pass is both an asset and a liability.",
        "It is an asset since the algorithm is able to operate linearly with respect to the size the data.",
        "It is a liability since the algorithm is",
        "system.",
        "sensitive to the order of the data.",
        "The latter leads to issues of reproducibility: with poorly ordered data, one could easily arrive at a much less than optimal set of data.",
        "However, by adding an additional pass to build model scores, and then ranking the data by these scores, we address the serious issue of reproducibility.",
        "Further, the ranking tends to arrive at a better selection of data.",
        "In an attempt to better understand the behavior of VSF and how VSF changes the n-gram distributions of vocabulary items in a sample as compared to the full corpus, we created log2-scale scatter plots, as seen in Figure 6.",
        "In these plots, uni-gram frequencies of unfiltered data (i.e., the full corpus, EnFrGW) are on the vertical axis, and un-igram frequencies of the VSF filtered data are on the horizontal axis.",
        "The three plots show three different settings for t. There following observations can be made about these plots:",
        "1.",
        "On the horizontal axis before we reach log2(t), all data points fall on the x = y line.",
        "2.",
        "As the threshold increases the scatter plot gets closer to the x = y line.",
        "3.",
        "VSF has the highest impact on the ?medium?",
        "frequency unigrams, that is, those with a frequency higher than the threshold.",
        "The third point speaks the most to the effects that VSF has on data: Very low frequency items, specifically those with frequencies below the threshold t, are unaffected by the algorithm, since we guarantee including all contexts in which they occur.",
        "Low frequency items are at the lower left of the plots, and their frequencies follow the x = y line (point 1 above).",
        "Medium frequency items, however, specifically those with frequencies immediately above t, are the most affected by the algorithm.",
        "The ?bulge?",
        "in the plots shows where these medium frequency items begin, and one can see plainly that their distributions are perturbed.",
        "The ?bulge?",
        "dissipates as frequencies increase, until the effects diminish as we approach much higher frequencies.",
        "The latter is a consequence of a simplifying heuristic applied in VSF (as described in Section 3): t is not a hard ceiling, but rather a soft one.",
        "Vocabulary items that occur very frequently in a corpus will be counted many more times than t; for very high frequency items, their sampled distributions may approach those observed in the full corpus, and converge on the x = y line.",
        "The authors suspect that the BLEU loss that results from the application of VSF is the result of the perturbed distributions for medium frequency items.",
        "Adjusting to higher t values decreases the degree of the perturbation, as noted in the second point, which likewise recovers some of the BLEU loss observed in lower settings."
      ]
    },
    {
      "heading": "8 Future Work",
      "text": [
        "There are several future directions we see with work on VSF.",
        "Because one threshold t for all vocabulary items may be too coarse a setting, we first plan to explore setting t based on frequency, especially for vocabulary in the most affected midrange (at and above t).",
        "If we set t based on unigrams falling into frequency buckets, rather than one setting for all unigrams, we may arrive earlier at a more distributionally balanced corpus, one that may better match the full corpus.",
        "That said, additional passes over the data come at additional cost.",
        "Second, we plan to explore applying the VSF algorithm to higher order n-grams (all experiments thus far have been on unigrams).",
        "Preliminary experiments on bigram VSF, however, show that with even the lowest setting (t=1), we already preserve well over 50% of the data.",
        "In this work we only experimented with sorting the data based on the normalized combined alignment score inspired by (Eck et al., 2005).",
        "A third direction for future work would be to consider ordering the data based on other feature functions presented in Eck, e.g., source and target language model, alignment ratio, as well as and feature functions introduced in (Taghipour et al., 2010), or a combination of all of these feature functions.",
        "In the fourth case, we plan to do more sophisticated statistical analysis of the effects of VSF on n-gram distributions and phrase-table entropy.",
        "We also plan to explore the interactions between VSF and data ?diversity?.",
        "For instance, VSF may have a greater positive impact on more narrowly focused domains than on those that are more generally focused."
      ]
    }
  ]
}
