{
  "info": {
    "authors": [
      "Markus Saers",
      "Dekai Wu"
    ],
    "book": "Proceedings of Fifth Workshop on Syntax, Semantics and Structure in Statistical Translation",
    "id": "acl-W11-1008",
    "title": "Reestimation of Reified Rules in Semiring Parsing and Biparsing",
    "url": "https://aclweb.org/anthology/W11-1008",
    "year": 2011
  },
  "references": [
    "acl-D09-1005",
    "acl-J99-4004",
    "acl-P02-1001",
    "acl-P89-1018"
  ],
  "sections": [
    {
      "text": [
        "Markus Saers and Dekai Wu",
        "Human Language Technology Center Dept.",
        "of Computer Science and Engineering Hong Kong University of Science and Technology",
        "{masaers|dekai}@cs.ust.hk",
        "We show that reifying the rules from hyper-edge weights to first-class graph nodes automatically gives us rule expectations in any kind of grammar expressible as a deductive system, without any explicit algorithm for calculating rule expectations (such as the inside-outside algorithm).",
        "This gives us expectation maximization training for any grammar class with a parsing algorithm that can be stated as a deductive system, for free.",
        "Having such a framework in place accelerates turnover time for experimenting with new grammar classes and parsing algorithms – to implement a grammar learner, only the parse forest construction has to be implemented."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "We propose contextual probability as a quantity that measures how often something has been used in a corpus, and when calculated for rules, it gives us everything needed to calculate rule expectations for expectation maximization.",
        "For labeled spans in context-free parses, this quantity is called outside probability, and in semiring (bi-) parsing, it is called reverse value.",
        "The inside-outside algorithm for rees-timating context-free grammar rules uses this quantity for the symbols occurring in the parse forest.",
        "Generally, the contextual probability is:",
        "The contextual probability of something is the sum of the probabilities of all contexts where it was used.",
        "For symbols participating in a parse, we could state it like this:",
        "The contextual probability of an item is the sum of the probabilities of all contexts where it was used.",
        "... which is exactly what we mean with outside probability.",
        "In semiring (bi-) parsing, this quantity is called reverse value, but in this framework it is also defined for rules, which means that we could restate our boxed statement as:",
        "The contextual probability of a rule is the sum of the probabilities of all contexts where it was used.",
        "This opens up an interesting line of inquiry into what this quantity might represent.",
        "In this paper we show that the contextual probabilities of the rules contain precisely the new information needed in order to calculate the expectations needed to reestimate the rule probabilities.",
        "This line of inquiry was discovered while working on a preterminalized version of linear inversion transduction grammars (litgs), so we will use these preterminalized litgs (Saers and Wu, 2011) as an example throughout this paper.",
        "We will start by examining semiring parsing (parsing as deductive systems over semirings, Section 3), followed by a section on how this relates to weighted hypergraphs, a common representation of parse forests (Section 4).",
        "This reveals a disparity between weighted hypergraphs and semiring parsing.",
        "It seems like we are forced to choose between the inside-outside algorithm for context-free grammars on the one side, and the flexibility of grammar formalism and parsing algorithm development afforded by semiring (bi-) parsing.",
        "It is, however, possible to have both, which we will show in Section 5.",
        "An integral part of this unification is the concept of contextual probability.",
        "Finally, we will offer some conclusions in Section 6."
      ]
    },
    {
      "heading": "2. Background",
      "text": [
        "A common view on probabilistic parsing – be it bilingual or monolingual – is that it involves the construction of a weighted hypergraph (Billot and Lang, 1989; Manning and Klein, 2001; Huang, 2008).",
        "This is an appealing conceptualization, as it separates the construction of the parse forest (the actual hypergraph) from the probabilistic calculations that need to be carried out.",
        "The calculations are, in fact, given by the hypergraph itself.",
        "To get the probability of the sentence (pair) being parsed, one simply have to query the hypergraph for the value of the goal node.",
        "It is furthermore possible to abstract away the calculations themselves, by defining the hypergraph over an arbitrary semiring.",
        "When the Boolean semiring is used, the value of the goal node will be true if the sentence (pair) is a member of the language (or transduction) defined by the grammar, and false otherwise.",
        "When the probabilistic semiring is used, the probability of the sentence (pair) is attained, and with the tropical semiring, the probability of the most likely tree is attained.",
        "To further generalize the building of the hypergraph – the parsing algorithm – a deductive system can be used.",
        "By defining a hand-full of deductive rules that describe how items can be constructed, the full complexities of a parsing algorithm can be very succinctly summarized.",
        "Deductive systems to represent parsers and semirings to calculate the desired values for the parses were introduced in Goodman (1999).",
        "In this paper we will reify the grammar rules by moving them from the meta level to the object level – effectively making them first-class citizens of the parse trees, which are no longer weighted hyper-graphs, but mul/add-graphs.",
        "This move allows us to calculate rule expectations for expectation maximization (Dempster et al., 1977) as part of the parsing process, which significantly shortens turnover time for experimenting with different grammar formalisms.",
        "Another approach which achieve a similar goal is to use a expectation semiring (Eisner, 2001; Eisner, 2002; Li and Eisner, 2009).",
        "In this semiring, all values are pairs of probabilities and expectations.",
        "The inside-outside algorithm with the expectation semiring requires the usual inside and outside calculations over the probability part of the semiring values, followed by a third traversal over the parse forest to populate the expectation part of the semiring values.",
        "The approach taken in this paper also requires the usual inside and outside calculations, but o third traversal of the parse forest.",
        "Instead, the proposed approach requires two passes over the rules of the grammar per em iteration.",
        "The asymptotic time complexities are thus equivalent for the two approaches.",
        "We will use w to mean a monolingual sentence, and index the individual tokens from 0 to |w| – 1.",
        "This means that w = w0,..., W|w| – 1.",
        "We will frequently use spans from this sentence, and denote them Wi„j, which is to be interpreted as array slices, that is: including the token at position i, but excluding the token at position j (the interval [i, j) over w, or wi,..., Wj-1).",
        "A sentence w thus corresponds to the span w0..|w|.",
        "We will also assume that there exists a grammar G = (N, E,S,R) or a transduction grammar (over languages L0 and L1) G = (N, E, A, S, R) (depending on the context), where N is the set of nonterminal symbols, E is a set of (L0) terminal symbols, A is a set of (L1) terminal symbols, S G N is the dedicated start symbol and R is a set of rules appropriate to the grammar.",
        "A stochastic grammar is further assumed to have a parameterization function 6, that assigns probabilities to all the rules in R. For general L0 tokens we will use lower case letters from the beginning of the alphabet, and for L1 from the end of the alphabet.",
        "For specific sentences we will use e = ea |e| to represent an L0 sentence and f = /0^f | to represent an L1 sentence."
      ]
    },
    {
      "heading": "3. Semiring parsing",
      "text": [
        "Semiring parsing was introduced in Goodman (1999), as a unifying approach to parsing.",
        "The general idea is that any parsing algorithm can be expressed as a deductive system.",
        "The same algorithm can then be used for both traditional grammars and stochastic grammars by changing the semiring used in the deductive system.",
        "This approach thus separates the algorithm from the specific calculations it is used for.",
        "where A is the set the semiring is defined over, © is an associative, commutative operator over A, with identity element 0 and <g) is an associative operator over A distributed over ©, with identity element 1.",
        "Semirings can be intuitively understood by considering the probabilistic semiring: (R+, +, x, 0,1), that is: the common meaning of addition and multiplication over the positive real numbers (including zero).",
        "Although this paper will have a heavy focus on the probabilistic semiring, several other exists.",
        "Among the more popular are the Boolean semiring ({T, _L}, V, A, _L, T) and the tropical semiring (R+ U {oo}, min, +, oo, 0) (or (R- U { – oo}, max, +, – oo, 0) which can be used for probabilities in the logarithmic domain).",
        "The deductive systems used in semiring parsing have three components: an item representation, a goal item and a set of deductive rules.",
        "Taking cky parsing (Cocke, 1969; Kasami and Torii, 1969; Younger, 1967) as an example, the items would have the form , which is to be interpreted as the span wi.. j of the sentence being parsed, labeled with the nonterminal symbol A.",
        "The goal item would be S0 |w|: the whole sentence labeled with the start symbol of the grammar.",
        "Since the cky algorithm is a very simple parsing algorithm, it only has two deductive rules:",
        "Bi,fc, Cfc,j, A – BCAi,j",
        "Where Ig( ) is the terminal indicator function for the semiring.",
        "The general form of a deductive rule is that the conditions (entities over the line) yield the consequence (the entity under the line) given that the side conditions (to the right of the line) are satisfied.",
        "We will make a distinction between conditions that are themselves items, and conditions that are not.",
        "The non-item conditions will be called axioms, and are exemplified above by the indicator function (Ig (w^j ) which has a value that depends only on the sentence) and the rules (A - a and A - BC which have values that depends only on the grammar).",
        "The indicator function might seem unnecessary, but allows us to reason under uncertainty regarding the input.",
        "In this paper, we will assume that we have perfect knowledge of the input (but for generality, we will not place it as a side condition).",
        "The function is defined such that:"
      ]
    },
    {
      "heading": "0. otherwise",
      "text": [
        "An important concept of semiring parsing is that the deductive rules also specify how to arrive at the value of the consequence.",
        "Since it is the first value computed for a node, we will call it a, and the general way to calculate it given a deductive rule and the a-values of the conditions is:",
        "a(b) = ®a(ai) iff ai,.y.,an ,.....",
        "If the same consequence can be produced in several ways, the values are summed using the © operator:",
        "The a-values of axioms depend on what kind of axiom it is.",
        "For the indicator function, the a-value is the value of the function, and for grammar rules, the a-value is the value assigned to the rule by the parameterization function 6 of the grammar.",
        "The a-value of a consequence corresponds to the value of everything leading up to that consequence.",
        "If we are parsing with a context-free grammar and the probabilistic semiring, this corresponds to the inside probability.",
        "When we want to reestimate rule probabilities, it is not enough to know the probabilities of arriving at different consequences, we also need to know how likely we are to need the consequences as a condition for other deductions.",
        "These values are called",
        "Figure 2: Deductive system describing a PLITG parser.",
        "The symbols A, B and S are nonterminal symbols, while X represents a preterminal symbol.",
        "the item is a condition.",
        "reverse values in Goodman (1999), and outside probabilities in the inside-outside algorithm (Baker, 1979).",
        "In this paper we will call them contextual values, or ß-values (since they are the second value we calculate).",
        "The way to calculate the reverse values is to start with the goal node and work your way back to the axioms.",
        "The reverse value is calculated to be:",
        "such that",
        "That is: the reverse value of the consequence combined with the values of all sibling conditions is calculated and summed for all deductive rules where",
        "After we introduced stochastic preterminalized litgs (Saers, 2011, splitg), the idea of expressing them in term of semiring parsing occurred.",
        "This is relatively straight forward, producing a compact set of deductive rules similar to that of litgs.",
        "For litgs, the items take the form of bispans labeled with a symbol.",
        "We will represent these bispans as As,t,u,v, where A is the label, and the two spans being labeled are es.. t and /u..v. Since we usually do top-down parsing, the goal item is a virtual item (G) than can only be reached by rewriting a nonterminal to the empty bistring ( e/e ).",
        "Figure 1 shows the deductive rules for litg parsing.",
        "A preterminalized litg promote preterminal symbols to a distinct class of symbols in the grammar, which is only allowed to rewrite into biterminals.",
        "Factoring out the terminal productions in this fashion allows the grammar to define one probability distribution over all the biterminals, which is useful for bilexica induction.",
        "It also means that the litg rules that produce biterminals have to be replaced by two rules in a plitg, resulting in the deductive rules in Figure 2."
      ]
    },
    {
      "heading": "4. Weighted hypergraphs",
      "text": [
        "A hypergraph is a graph where the nodes are connected with hyperedges.",
        "A hyperedge is an edge that can connect several nodes with one node – it has",
        "A0,|e|,0,|f| '",
        "G",
        "Bs',t,u',v, B – X – %",
        "- a/x (",
        "s/fu..u' )",
        "0<s<s',,",
        "As,t,u,v",
        "0<u<u',",
        "Bs,t',u,v', B – [AX], X – %",
        "I a/x ( t'-",
        "t'<t<|e|,,",
        "v'<v<|f |,",
        "As,t,u,v",
        "Bs',t,u,v', B – X – g%",
        "- a/x (",
        "s/fv'..v )",
        "0< s<s',",
        "As,t,u,v",
        "v'<v<|f|",
        "Bs,t',u',v, B – (AX), X – g",
        "X , I a/x (",
        "t'<t<|e|,",
        "As,t,u,v",
        "0< u< u'",
        "CkJ A->BC",
        "Figure 3: A weighted hyperedge between three nodes, based on the rule A – BC.",
        "The tip of the arrow points to the head of the edge, and the two ends are the tails.",
        "The dashed line idicates where the weight of the edge comes from.",
        "one head, but may have any number of tails.",
        "Intuitively, this is a good match to context-free grammars, since each rule connects one symbol on the left hand side (the head of the hyperedge) with any number of symbols on the right hand side (the tails of the hyperedge).",
        "During parsing, one node is constructed for each labeled (bi-) span, and the nodes are connected with hyperedges based on the valid applications of rules.",
        "A hyperedge will be represented as [h : t1,..., tn] where h is the head and tiare the tails.",
        "When this is applied to weighted grammar, each hyperedge can be associated with a weight, making the hypergraph weighted.",
        "Every time an edge is traversed, its weight is combined with the value travelling through the edge.",
        "Weights are assigned to hy-peredges via a weighting function w().",
        "Figure 3 contains an illustration of a weighted hyperedge.",
        "The arrow indicates the edge itself, whereas the dotted line indicates where the weight comes from.",
        "Since each hyperedge corresponds to exactly one rule from a stochastic context-free grammar, we can use the inside-outside algorithm (Baker, 1979) to calculate inside and outside probabilities as well as to reestimate the probabilities of the rules.",
        "What we cannot easily do, however, is to change the parsing algorithm or grammar formalism.",
        "If the weighted hyperedge approach was a one-to-one mapping to the semiring parsing approach, we could, but it is not.",
        "The main difference is that rules are part of the object level in semiring parsing, but",
        "Figure 4: The same hyperedge as in Figure 3, where the rule has been promoted to first-class citizen.",
        "The hyper-edge is no longer weighted.",
        "part of the meta level in weighted hypergraphs.",
        "To address this disparity, we will reify the rules in the weighted hypergraph to make them nodes.",
        "Figure 4 shows the same hyperedge as Figure 3, but with the rule as a proper node rather than a weight associated with the hyperedge.",
        "These hyperedges are agnostic to what the tail nodes represent, so we can no longer use the inside-outside algorithm to reestimate the rule probabilities.",
        "We can, however, still calculate inside probabilities.",
        "In the weighted hyperedge approach, the inside probability of a node is:",
        "Whereas with the rules reified, the weight simply moved into the tail product:",
        "By virtue of the deductive system used to build the hypergraph, we also have the reverse values, which correspond to outside probability:",
        "This means that we have the inside and outside probabilities of the nodes, and we could shoehorn it into the reestimation part of the inside-outside algorithm.",
        "It also means that we have ß-values for the rules, which we are calculating as a side-effect of moving them into the object level.",
        "In Section 5, we will take a closer look at the semantics of the contextual probabilities that we are in fact calculating for the reified rules, and see how they can be used in reestimation of the rules.",
        "Using the hypergraph parsing framework for splitgs turns out to be non-trivial.",
        "Where the standard litg uses one rule to rewrite a nonterminal into another nonterminal and a biterminal, the splitg rewrites a nonterminal to a preterminal and a nonterminal, and rewrites the preterminal into a biterminal.",
        "This causes problems within the hypergraph framework, where each rule application should correspond to one hyperedge.",
        "As it stands we have two options:",
        "1.",
        "Let each rule correspond to one hyperedge, which means that we need to introduce preter-minal nodes into the hypergraph.",
        "This has a clear drawback for bracketing grammars,since it is now necessary to keep different symbols apart.",
        "It also produces larger hypergraphs, since the number of nodes is inflated.",
        "2.",
        "Let hypergraphs be associated with one or two rules, which means that we need to redefine hy-peredges so that there are two different weighting functions: one for the nonterminal weight and one for the preterminal weight.",
        "Although all hyperedges are associated with one nonterminal rule, some hyperedges are not associated with any preterminal rule, making the pretermi-nal weighting function partly defined.",
        "Both of these approaches work in practice, but neither is completely satisfactory since they both represent workarounds to shoehorn the parsing algorithm (as stated in the deductive system) into a formalism that is not completely compatible.",
        "By reifying the rules into the object level, we rid ourselves of this inconvenience, as we no longer differentiate between different types of conditions."
      ]
    },
    {
      "heading": "5. Reestimation of reified rules",
      "text": [
        "As has been amply hinted at, the contextual probabilities (outside probabilities, reverse values or ß-values) contain all new information we need about the rules to reestimate their probability in an expectation maximization (Dempster et al., 1977) framework.",
        "To show that this is indeed the case, we will rewrite the reestimation formulas of the inside-outside algorithm (Baker, 1979) so that they are stated in terms of contextual probability for the rules.",
        "In general, a stochastic context-free grammar can be estimated from examples of trees generated by the grammar by means of relative frequency.",
        "This is also true for expectation maximization with the caveat that we have multiple hypotheses over each sentence (pair), and therefore calculate expectations rather than discrete frequency counts.",
        "We thus compute the updated parameterization function 6 based on expectations from the current parameterization function:",
        "Where p G N and ^ G {E U N}+ (or ^ G {(E* x A*) UN}+ for transduction grammars).",
        "The expectations are calculated from the sentences in a corpus C:",
        "The exact way of calculating the expectation on x given a sentence depends on what x is.",
        "For nonterminal symbols, the expectations are given by:",
        "For nonterminal rules, the expectations are shown in Figure 5.",
        "The most noteworthy step is the last one, where we use the fact that the summation is over the equivalence of the rule's reverse value.",
        "Each ßfej)a(q^fc)a(rkj) term of the summation corresponds to one instance where the rule was used in the parse.",
        "Furthermore, the ß value is the outside probability of the consequence of the deductive rule applied, and the two a values are the inside probabilities of the sibling conditions of that deductive rule.",
        "The entire summation thus corresponds to our definition of the reverse value of a rule, or its outside probability.",
        "In Figure 6, the same process is carried out for terminal rules.",
        "Again, the summation is over all possible ways that we can combine the inside probability of the sibling conditions of the rule with the outside probability of the consequence.",
        "Since the expected values of both terminal and nonterminal rules have the same form, we can generalize the formula for any production y:",
        "Finally, plugging it all into the original rule estimation formula, we have:",
        "Rather than keeping track of the expectations of nonterminals, they can be calculated from the rule expectations by marginalizing the productions:",
        "Since this view of em and parsing generalizes to deductive systems with multiple rules as conditions, we can apply it to the deductive system of splitgs.",
        "It is, however, also interesting to note how the hypergraph view of parsing is changed by this.",
        "We effectively removed the weights from the edges, but kept the feature that values of nodes depend entirely on the values connected by incoming hyperedges.",
        "If we assume the values to be from the Boolean semiring, the hypergraphs we ended up with are in fact and/or-graphs.",
        "That is: each node in the hypergraph corresponds to an or-node, and each hyperedge corresponds to an and-node.",
        "We note that this can be generalized to any semiring, since or is equivalent to © and and is equivalent to <g) for the Boolean semiring, we can express a hypergraph over an arbitrary semiring as a mul/add-graph?",
        "Figure 7 shows how a hyperedge looks in this new graph form.",
        "The a-value of a node is calculated by combining the values of all incoming edges using the operator of the node.",
        "The ß-values are also calculated using the operator of the node, but with the edges reversed.",
        "For this to work properly, the mul-nodes need to behave somewhat different from add-nodes: each incoming edge has to be reversed one at a time, as illustrated in Figure 8."
      ]
    },
    {
      "heading": "6. Conclusions",
      "text": [
        "We have shown that the reification of rules into the parse forest graphs allows for a unified framework where all calculations are performed the same way,",
        "Figure 8: Reverse values (ß) are calculated by tracking backwards through all possible paths.",
        "This produces three different paths for the mul/add-subgraph from Figure 7.",
        "Arrows pointing downward propagate a-values while arrows pointing upward propagate ß-values.",
        "and where the calculations for the rules encompass all information needed to reestimate them using expectation maximization.",
        "The contextual probability of a rule – its outside probability – holds all information needed to calculate expectations, which can be exploited by promoting the rules to first-class citizens of the parse forest.",
        "We have also seen how this reification of the rules helped solve a real translation problem – induction of stochastic preterminal-ized linear inversion transduction grammars using expectation maximization."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was funded by the Defense Advanced Research Projects Agency (darpa) under gale Contract Nos.",
        "HR0011-06-C-0023 and HR0011-06-C-0023, and the Hong Kong Research Grants Council (rgc) under research grants GRF621008, GRF612806, DAG03/04.EG09, RGC6256/00E, and RGC6083/99E.",
        "Any opinions, findings and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the Defense Advanced Research Projects Agency.",
        "We would also like to thank the three anonymous reviewers, whose feedback made this a better paper."
      ]
    }
  ]
}
