{
  "info": {
    "authors": [
      "Philip Resnik"
    ],
    "book": "Workshop on Tagging Text With Lexical Semantics: Why, What, and How?",
    "id": "acl-W97-0217",
    "title": "Evaluating Automatic Semantic Taggers",
    "url": "https://aclweb.org/anthology/W97-0217",
    "year": 1997
  },
  "references": [
    "acl-H93-1051",
    "acl-W96-0208",
    "acl-W97-0213"
  ],
  "sections": [
    {
      "text": [
        "Unlike the problems of part-of-speech tagging and parsing, where commonly utilized training and test sets such as the Brown Corpus and Penn Treebank have existed for a number of years, evaluation of word sense disambiguation sytems is not yet standardized.",
        "In fact, most previous work in sense disambiguation has tended to use different sets of polysemous words, different sense inventories, different evaluation metrics and different test corpora.",
        "This working session will address these problems and seek solutions to them.",
        "Examples of issues for discussion include:",
        "• How should part-of-speech-level distinctions be treated when evaluating WSD systems?",
        "• How should sense inventories be defined so as not to be biased in favor of certain disambiguation methods, such as those based on selectional restriction, topic codes, hierarchical ontologies, or aligned multilingual corpora?",
        "Or are such biases ok?",
        "• What evaluation metrics are appropriate for the WSD task?",
        "• What characteristics should common test suites exhibit?",
        "How and by whom should they be developed?",
        "• Would a MUC-style competitive evaluation program be beneficial or detrimental to progress in the WSD field?",
        "• What special problems exist when evaluating WSD performance on verbs?",
        "• What special problems exist when evaluating WSD performance in a multilingual setting?",
        "• What additional issues arise in evaluating more complex semantic tagging, going beyond sense disambiguation as traditionally defined?",
        "• How should regular polysemy and metaphor be treated in WSD evaluation?",
        "• Can a common evaluation framework satisfy the needs and limitations of both supervised and unsupervised sense disambiguation methods?"
      ]
    }
  ]
}
