{
  "info": {
    "authors": [
      "Carlos Gómez-Rodríguez",
      "David Weir",
      "John Carroll"
    ],
    "book": "EACL",
    "id": "acl-E09-1034",
    "title": "Parsing Mildly Non-Projective Dependency Structures",
    "url": "https://aclweb.org/anthology/E09-1034",
    "year": 2009
  },
  "references": [
    "acl-C96-1058",
    "acl-H05-1066",
    "acl-P05-1013",
    "acl-P06-2066",
    "acl-P07-1021",
    "acl-P07-1077",
    "acl-P08-1110",
    "acl-P87-1015",
    "acl-P92-1012",
    "acl-P99-1059",
    "acl-W07-2216"
  ],
  "sections": [
    {
      "text": [
        "Parsing Mildly Non-projective Dependency Structures*",
        "Carlos Gomez-Rodriguez David Weir and John Carroll",
        "Departamento de Computation Department oflnformatics",
        "Universidade da Corutia, Spain University of Sussex, United Kingdom",
        "We present parsing algorithms for various mildly non-projective dependency formalisms.",
        "In particular, algorithms are presented for: all well-nested structures of gap degree at most 1, with the same complexity as the best existing parsers for constituency formalisms of equivalent generative power; all well-nested structures with gap degree bounded by any constant k; and a new class of structures with gap degree up to k that includes some ill-nested structures.",
        "The third case includes all the gap degree k structures in a number of dependency treebanks."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Dependency parsers analyse a sentence in terms of a set of directed links (dependencies) expressing the head-modifier and head-complement relationships which form the basis of predicate argument structure.",
        "We take dependency structures to be directed trees, where each node corresponds to a word and the root of the tree marks the syntactic head of the sentence.",
        "For reasons of efficiency, many practical implementations of dependency parsing are restricted to projective structures, in which the subtree rooted at each word covers a contiguous substring of the sentence.",
        "However, while free word order languages such as Czech do not satisfy this constraint, parsing without the projectivity constraint is computationally complex.",
        "Although it is possible to parse non-projective structures in quadratic time under a model in which each dependency decision is independent of all the others (McDonald et al., 2005),",
        "♦Partially supported by MEC and FEDER (HUM2007-66607-C04) and Xunta de Galicia (PGIDIT07SIN005206PR, INCITE08E1R104022ES, INCITE08ENA305025ES, IN-CITE08PXIB302179PR, Rede Galega de Proc.",
        "da Linguaxe e RI, Bolsas para Estadias INCITE - FSE cofinanced).",
        "the problem is intractable in the absence of this assumption (McDonald and Satta, 2007).",
        "Nivre and Nilsson (2005) observe that most non-projective dependency structures appearing in practice are \"close\" to being projective, since they contain only a small proportion of non-projective arcs.",
        "This has led to the study of classes of dependency structures that lie between projective and unrestricted non-projective structures (Kuhlmann and Nivre, 2006; Havelka, 2007).",
        "Kuhlmann (2007) investigates several such classes, based on well-nestedness and gap degree constraints (Bodirsky et al., 2005), relating them to lexicalised constituency grammar formalisms.",
        "Specifically, he shows that: linear context-free rewriting systems (LCFRS) with fanout k (Vijay-Shanker et al., 1987; Satta, 1992) induce the set of dependency structures with gap degree at most l ; coupled context-free grammars in which the maximal rank of a nonterminal is k (Hotz and Pitsch, 1996) induce the set of well-nested dependency structures with gap degree at most k – 1; and LTAGs (Joshi and Schabes, 1997) induce the set of well-nested dependency structures with gap degree at most 1.",
        "These results establish that there must be polynomial-time dependency parsing algorithms for well-nested structures with bounded gap degree, since such parsers exist for their corresponding lexicalised constituency-based formalisms.",
        "However, since most of the non-projective structures in treebanks are well-nested and have a small gap degree (Kuhlmann and Nivre, 2006), developing efficient dependency parsing strategies for these sets of structures has considerable practical interest, since we would be able to parse directly with dependencies in a data-driven manner, rather than indirectly by constructing intermediate constituency grammars and extracting dependencies from constituency parses.",
        "We address this problem with the following contributions: (1) we define a parsing algorithm for well-nested dependency structures of gap degree 1, and prove its correctness.",
        "The parser runs in time O(n), the same complexity as the best existing algorithms for LTAG (Eisner and Satta, 2000), and can be optimised to O(n) in the non-lexicalised case; (2) we generalise the previous algorithm to any well-nested dependency structure with gap degree at most k in time O(n5+2fc); (3) we generalise the previous parsers to be able to analyse not only well-nested structures, but also ill-nested structures with gap degree at most k satisfying certain constraints, in time O(n4+3fc); and (4) we characterise the set ofstructures covered by this parser, which we call mildly ill-nested structures, and show that it includes all the trees present in a number of dependency treebanks."
      ]
    },
    {
      "heading": "2. Preliminaries",
      "text": [
        "A dependency graph for a string u>\\... wn is a graph G = (V, E), where V = {wi,...,wra} and E C V x V. We write the edge ) as Wj – Wj, meaning that the word Wj is a syntactic dependent (or a child) of Wj or, conversely, that Wj is the governor (parent) of Wj.",
        "We write Wj – * Wj to denote that there exists a (possibly empty) path from Wj to Wj.",
        "The projection of a node Wj, denoted [WjJ, is the set of reflexive-transitive dependents of Wj, that is: [WjJ = {Wj €",
        "V | Wj – * An interval (with endpoints i and j) is a set of the form [i, j] = {Wk | i < k < j}.",
        "A dependency graph is said to be a tree if it is:",
        "(1) acyclic: Wj € [WjJ implies Wj – Wj € E; and (2) each node has exactly one parent, except for one node which we call the root or head.",
        "A graph verifying these conditions and having a vertex set",
        "V C {wi, ..., Wn} is a partial dependency tree.",
        "Given a dependency tree T = (V, E) and a node u € V, the subtree induced by the node u is the graph Tu = (|_uJ, EM) where EM = {Wj – Wj €",
        "E Wj € M}.",
        "We now define the concepts of gap degree and well-nestedness (Kuhlmann and Nivre, 2006).",
        "Let T be a (possibly partial) dependency tree for w1 ... Wn: We say that T is projective if [WjJ is an interval for every word Wj.",
        "Thus every node in the dependency structure must dominate a contiguous substring in the sentence.",
        "The gap degree of a particular node Wk in T is the minimum g € N such that [Wk J can be written as the union of g + 1 intervals; that is, the number of discontinuities in [■Wfc J.",
        "The gap degree of the dependency tree T is the maximum among the gap degrees of its nodes.",
        "Note that T has gap degree 0 if and only if T is projective.",
        "The subtrees induced by nodes Wp and Wq are interleaved if |_WpJ n |_WqJ = 0 and there are nodes Wj,Wj € |_WpJ and Wk, € [w9J such that i < k < j < l. A dependency tree T is well-nested if it does not contain two interleaved subtrees.",
        "A tree that is not well-nested is said to be ill-nested.",
        "Note that projective trees are always well-nested, but well-nested trees are not always projective.",
        "The framework of parsing schemata (Sikkel, 1997) provides a uniform way to describe, analyse and compare parsing algorithms.",
        "Parsing schemata were initially defined for constituency-based grammatical formalisms, but Gomez-Rodriguez et al.",
        "(2008a) define a variant of the framework for dependency-based parsers.",
        "We use these dependency parsing schemata to define parsers and prove their correctness.",
        "Due to space constraints, we only provide brief outlines of the main concepts behind dependency parsing schemata.",
        "The parsing schema approach considers parsing as deduction, generating intermediate results called items.",
        "An initial set of items is obtained from the input sentence, and the parsing process involves deduction steps which produce new items from existing ones.",
        "Each item contains information about the sentence's structure, and a successful parsing process produces at least one final item providing a full dependency analysis for the sentence or guaranteeing its existence.",
        "In a dependency parsing schema, items are defined as sets of partial dependency trees.",
        "To define a parser by means of a schema, we must define an item set and provide a set of deduction steps that operate on it.",
        "Given an item set I, the set of final items for strings of length n is the set of items in I that contain a full dependency tree for some arbitrary string of length n. A final item containing a dependency tree for a particular string w1 ... Wn is said to be a correct final item for that string.",
        "These concepts can be used to prove the correctness of a parser: for each input string, a parsing schema's deduction steps allow us to infer a set of items, called valid items for that string.",
        "A schema is said to be sound if all valid final items it produces for any arbitrary string are correct for that string.",
        "A schema is said to be complete if all correct final items are valid.",
        "A correct parsing schema is one which is both sound and complete.",
        "In constituency-based parsing schemata, deduction steps usually have grammar rules as side conditions.",
        "In the case of dependency parsers it is also possible to use grammars (Eisner and Satta, 1999), but many algorithms use a data-driven approach instead, making individual decisions about which dependencies to create by using probabilistic models (Eisner, 1996) or classifiers (Yamada and Matsumoto, 2003).",
        "To represent these algorithms as deduction systems, we use the notion of D-rules (Covington, 1990).",
        "D-rules take the form a – b, which says that word b can have a as a dependent.",
        "Deduction steps in non-grammar-based parsers can be tied to the D-rules associated with the links they create.",
        "In this way, we obtain a representation of the underlying logic of the parser while abstracting away from control structures (the particular model used to create the decisions associated with D-rules).",
        "Furthermore, the choice points in the parsing process and the information we can use to make decisions are made explicit in the steps linked to D-rules."
      ]
    },
    {
      "heading": "3. The WG 1 parser",
      "text": [
        "We define WG1, a parser for well-nested dependency structures of gap degree < 1, as follows: The item set is = I1 UI2, with where each item of the form [i, j, h, o, o] represents the set of all well-nested partial dependency trees with gap degree at most 1, rooted at Wh, and such that |_«vl = {Wh} U [i, j], and where each item ofthe form [i, j, h, l, r] represents the set of all well-nested partial dependency trees rooted at Wh such that |_WhJ = {Wh} U ([i, j] \\ [ l, r]) , and all the nodes (except possibly h) have gap degree at most 1.",
        "We call items of this form gapped items, and the interval [l, r] the gap of the item.",
        "Note that the constraints h = j, h = i + 1, h = l – 1, h = r are added to items to avoid redundancy in the item set.",
        "Since the result of the expression {Wh} U ([i, j ] \\ [l, r]) for a given head can be the same for different sets ofvalues of i, j, l, r, we restrict these values so that we cannot get two different items representing the same dependency structures.",
        "Items 1 violating these constraints always have an alternative representation that does not violate them, that we can express with a normalising function nm(1) as follows:",
        "or [i, j, r, o, o] (if 1 = r).",
        "nm([i, j, h, 1, r]) = [i, j, h, 1, r] for all other items.",
        "When defining the deduction steps for this and other parsers, we assume that they always produce normalised items.",
        "For clarity, we do not explicitly write this in the deduction steps, writing 1 instead of nm (1) as antecedents and consequents of steps.",
        "The set of initial items is defined as the set where each item [h, h, h, o, o] represents the set containing the trivial partial dependency tree consisting of a single node Wh and no links.",
        "This same set of hypotheses can be used for all the parsers, so we do not make it explicit for subsequent schemata.",
        "Note that initial items are separate from the item set and not subject to its constraints, so they do not require normalisation.",
        "The set of final items for strings of length n in WG1 is defined as the set which is the set of items in containing dependency trees for the complete input string (from position 1 to n), with their head at any word Wh.",
        "The deduction steps of the parser can be seen in Figure 1A.",
        "The WG1 parser proceeds bottom-up, by building dependency subtrees and joining them to form larger subtrees, until it finds a complete dependency tree for the input sentence.",
        "The logic of",
        "A. WGl parser:",
        "Combine Ungapped:",
        "Combine Opening Gap: such that j < k - l, Combine Keeping Gap Right:",
        "Combine Closing Gap:",
        "Combine Opening Gap:",
        "Combine Shrinking Gap Right:",
        "Combine Shrinking Gap Left:",
        "Combine Keeping Gaps:",
        "C. Additional steps to turn WGi into MGi:",
        "Combine Shrinking Gap Centre:",
        "Combine Interleaving:",
        "Combine Interleaving GapL: such that u > j, Combine Interleaving Gap C: such that m < r + 1, Combine Interleaving Gap R: such that k > 1.",
        "D. General form of the MGk Combine step:",
        ",iap+l - 1, h, [(ial + l,ia2 - 1),.. + l - l,h, ,ib2 - 1),...",
        "for each string of length n with a's located at positions a1 •.. ap(1 < a1 < ... < ap < n), b's at positions b1 • • • 6q (1 < 61 < • • • < 6q < n), and g's at positions g1 ... gr (2 < g1 < ... < gr < n – 1), such that 1 < p < k, 1 < q < k, 0 < r < k – 1, p + q + r = n, and the string does not contain more than one consecutive appearance of the same symbol.",
        "Figure 1: Deduction steps for the parsers defined in the paper.",
        "the parser can be understood by considering how it infers the item corresponding to the subtree induced by a particular node, given the items for the subtrees induced by the direct dependents of that node.",
        "Suppose that, in a complete dependency analysis for a sentence w1 ... Wn, the word Whhas Wdl ... Wdp as direct dependents (i.e. we have dependency links – Wh,..., t% – Wh).",
        "Then, the item corresponding to the subtree induced by Wh is obtained from the ones corresponding to the subtrees induced by Wdl ... Wdp by: (1) applying the Link Ungapped or Link Gapped step to each of the items corresponding to the subtrees induced by the direct dependents, and to the hypothesis [h, h, h, o, o].",
        "This allows us to infer p items representing the result of linking each of the dependent subtrees to the new head Wh; (2) applying the various Combine steps to join all of the",
        "[i2,j2,hl, [(ll,n),..., (lg ,rg )]] suchthat Wh2 G [i2,j 2] \\|J p=l[lP,rp] Awhl G [i2,j2] \\UP=l[lp,rp].",
        "such that g < k, such that g < k",
        "items obtained in the previous step into a single item.",
        "The Combine steps perform a union operation between subtrees.",
        "Therefore, the result is a dependency tree containing all the dependent subtrees, and with all of them linked to h: this is the subtree induced by Wh.",
        "This process is applied repeatedly to build larger subtrees, until, if the parsing process is successful, a final item is found containing a dependency tree for the complete sentence.",
        "The parsing schemata formalism can be used to prove the correctness of a parsing schema.",
        "To prove that WG1 is correct, we need to prove its soundness and completeness.",
        "Soundness is proven by checking that valid items always contain well-nested trees.",
        "Completeness is proven by induction, taking initial items as the base case and showing that an item containing a correct subtree for a string can always be obtained from items corresponding to smaller subtrees.",
        "In order to prove this induction step, we use the concept of order annotations (Kuhlmann, 2007; Kuhlmann and Mohl, 2007), which are strings that lexicalise the precedence relation between the nodes of a dependency tree.",
        "Given a correct subtree, we divide the proof into cases according to the order annotation of its head and we find that, for every possible form of this order annotation, we can find a sequence of Combine steps to infer the relevant item from smaller correct items.",
        "The time complexity of WG1 is O(n), as the step Combine Shrinking Gap Centre works with 7 free string positions.",
        "This complexity with respect to the length of the input is as expected for this set of structures, since Kuhlmann (2007) shows that they are equivalent to LTAG, and the best existing parsers for this formalism also perform in O(n) (Eisner and Satta, 2000).",
        "Note that the Combine step which is the bottleneck only uses the 7 indexes, and not any other entities like D-rules, so its O(n) complexity does not have any additional factors due to grammar size or other variables.",
        "The space complexity of WG1 is O(n) for recognition, due to the 5 indexes in items, and O(n) for full parsing.",
        "It is possible to build a variant of this parser with time complexity O(n), as with parsers for unlexicalised TAG, if we work with unlexicalised D-rules specifying the possibility ofdependencies between pairs of categories instead of pairs of words.",
        "In order to do this, we expand the item set with unlexicalised items of the form [i, j, C, l, r], where C is a category, apart from the existing items [i, j, h, l, r].",
        "Steps in the parser are duplicated, to work both with lexicalised and unlex-icalised items, except for the Link steps, which always work with a lexicalised item and an un-lexicalised hypothesis to produce an unlexicalised item, and the Combine ShrinkingGapsteps, which can work only with unlexicalised items.",
        "Steps are added to obtain lexicalised items from their unlex-icalised equivalents by binding the head to particular string positions.",
        "Finally, we need certain variants of the Combine Shrinking Gap steps that take 2 unlexicalised antecedents and produce a lexi-calised consequent; an example is the following:",
        "such that cat (w;)=C",
        "Although this version of the algorithm reduces time complexity with respect to the length of the input to O(n), it also adds a factor related to the number of categories, as well as constant factors due to using more kinds of items and steps than the original WG1 algorithm.",
        "This, together with the advantages of lexicalised dependency parsing, may mean that the original WG1 algorithm is more practical than this version."
      ]
    },
    {
      "heading": "4. The WG k parser",
      "text": [
        "The WG1 parsing schema can be generalised to obtain a parser for all well-nested dependency structures with gap degree bounded by a constant k(k > 1), which we call WGk parser.",
        "In order to do this, we extend the item set so that it can contain items with up to k gaps, and modify the deduction steps to work with these multi-gapped items.",
        "2008b).",
        "h = i – 1; and for each p € {1,2,...,g}: lp, rp € N, i < lp < rp < j, rp < lp+i – 1, h = lp – 1, h = rp.",
        "trees rooted at Wh such that |_WhJ = {Wh}U([i, j]\\ Up=1[lp, rp]), where each interval [lp, rp] is called a gap.",
        "The constraints h = j, h = i + 1, h = lp – 1, h = rp are added to avoid redundancy, and normalisation is defined as in WG1.",
        "The set of final items is defined as the set F = {[1, n, h, []] | h € N, 1 < h < n}.",
        "Note that this set is the same as in WG1 , as these are the items that we denoted [1, n, h, o, o] in the previous parser.",
        "The deduction steps can be seen in Figure 1B.",
        "As expected, the WG1 parser corresponds to WGkwhen we make k = 1.",
        "WGk works in the same way as WG1 , except for the fact that Combine steps can create items with more than one gap.",
        "The correctness proof is also analogous to that of WG1 , but we must take into account that the set of possible order annotations is larger when k > 1, so more cases arise in the completeness proof.",
        "The WGk parser runs in time O(n+2k): as in the case of WG1, the deduction step with most free variables is Combine Shrinking Gap Centre, and in this case it has 5 + 2k free indexes.",
        "Again, this complexity result is in line with what could be expected from previous research in constituency parsing: Kuhlmann (2007) shows that the set of well-nested dependency structures with gap degree at most k is closely related to coupled context-free grammars in which the maximal rank of a nonterminal is k + 1 ; and the constituency parser defined by Hotz and Pitsch (1996) for these grammars also adds an n factor for each unit increment of k. Note that a small value of k should be enough to cover the vast majority of the non-projective sentences found in natural language treebanks.",
        "For example, the Prague Dependency Treebank contains no structures with gap degree greater than 4.",
        "Therefore, a WG4 parser would be able to analyse all the well-nested structures in this treebank, which represent 99.89% of the total.",
        "Increasing k beyond 4 would not produce further improvements in coverage."
      ]
    },
    {
      "heading": "5. Parsing ill-nested structures",
      "text": [
        "The WGk parser analyses dependency structures with bounded gap degree as long as they are well-nested.",
        "This covers the vast majority of the structures that occur in natural-language treebanks (Kuhlmann and Nivre, 2006), but there is still a significant minority of sentences that contain ill-nested structures.",
        "Unfortunately, the general problem of parsing ill-nested structures is NP-complete, even when the gap degree is bounded: this set of structures is closely related to LCFRS with bounded fanout and unbounded production length, and parsing in this formalism has been proven to be NP-complete (Satta, 1992).",
        "The reason for this high complexity is the problem of unrestricted crossing configurations, appearing when dependency subtrees are allowed to interleave in every possible way.",
        "However, just as it has been noted that most non-projective structures appearing in practice are only \"slightly\" non-projective (Nivre and Nilsson, 2005), we characterise a sense in which the structures appearing in treebanks can be viewed as being only \"slightly\" ill-nested.",
        "In this section, we generalise the algorithms WG\\ and WGk to parse a proper superset of the set of well-nested structures in polynomial time; and give a characterisation of this new set of structures, which includes all the structures in several dependency treebanks.",
        "The WGk parser presented previously is based on a bottom-up process, where Link steps are used to link completed subtrees to a head, and Combine steps are used to join subtrees governed by a common head to obtain a larger structure.",
        "As WGk is a parser for well-nested structures of gap degree up to k, its Combine steps correspond to all the ways in which we can join two sets of sibling subtrees meeting these constraints, and having a common head, into another.",
        "Thus, this parser does not use Combine steps that produce interleaved subtrees, since these would generate items corresponding to ill-nested structures.",
        "We obtain a polynomial parser for a wider set of structures of gap degree at most k, including some ill-nested ones, by having Combine steps representing every way in which two sets ofsibling subtrees of gap degree at most k with a common head can be joined into another, including those producing interleaved subtrees, like the steps for gap degree 1 shown in Figure 1C.",
        "Note that this does not mean that we can build every possible ill-nested structure: some structures with complex crossed configurations have gap degree k, but cannot be built by combining two structures of that gap degree.",
        "More specifically, our algorithm will be able to parse a dependency structure (well-nested or not) if there exists a binarisation of that structure that has gap degree at most k. The parser implicitly works by finding such a binarisation, since Combine steps are always applied to two items and no intermediate item generated by them can exceed gap degree k (not counting the position of the head in the projection).",
        "More formally, let T be a dependency structure for the string w1 ... Wn.",
        "A binarisation of T is a dependency tree T' over a set of nodes, each of which may be unlabelled or labelled with a word in {w1 ... Wn}, such that the following conditions hold: (1) each node has at most two children, and (2) Wj – Wj in T if and only if Wj – * Wj in T'.",
        "A dependency structure is mildly ill-nested for gap degree k if it has at least one binarisation of gap degree < k. Otherwise, we say that it is strongly ill-nested for gap degree k. It is easy to prove that the set of mildly ill-nested structures for gap degree k includes all well-nested structures with gap degree up to k.",
        "We define MG1, a parser for mildly ill-nested structures for gap degree 1, as follows: (1) the item set is the same as that of WG1 , except that items can now contain any mildly ill-nested structures for gap degree 1 , instead of being restricted to well-nested structures; and (2) deduction steps are the same as in WG1, plus the additional steps shown in Figure 1C.",
        "These extra Combine steps allow the parser to combine interleaved subtrees with simple crossing configurations.",
        "The MG1parser still runs in O(n), as these new steps do not use more than 7 string positions.",
        "The proof of correctness for this parser is similar to that of WG1 .",
        "Again, we use the concept of order annotations.",
        "The set of mildly ill-nested structures for gap degree k can be defined as those that only contain annotations meeting certain constraints.",
        "The soundness proof involves showing that Combine steps always generate items containing trees with such annotations.",
        "Completeness is proven by induction, by showing that if a subtree is mildly ill-nested for gap degree k, an item for it can be obtained from items for smaller subtrees by applying Combine and Link steps.",
        "In the cases where Combine steps have to be applied, the order in which they may be used to produce a subtree can be obtained from its head's order annotation.",
        "To generalise this algorithm to mildly ill-nested structures for gap degree k, we need to add a Combine step for every possible way of joining two structures of gap degree at most k into another.",
        "This can be done systematically by considering a set of strings over an alphabet of three symbols: a and b to represent intervals of words in the projection of each of the structures, and g to represent intervals that are not in the projection of either structure, and will correspond to gaps in the joined structure.",
        "The legal combinations of structures for gap degree k will correspond to strings where symbols a and b each appear at most k + 1 times, g appears at most k times and is not the first or last symbol, and there is no more than one consecutive appearance of any symbol.",
        "Given a string of this form, the corresponding Combine step is given by the expression in Figure 1D.",
        "As a particular example, the Combine Interleaving Gap C step in Figure 1C is obtained from the string abgab.",
        "Thus, we define the parsing schema for MGk, a parser for mildly ill-nested structures for gap degree k, as the schema where (1) the item set is like that of WGk, except that items can now contain any mildly ill-nested structures for gap degree k, instead of being restricted to well-nested structures; and (2) the set of deduction steps consists of a Link step as the one in WGk, plus a set of Combine steps obtained as expressed in Figure 1D.",
        "As the string used to generate a Combine step can have length at most 3k + 2, and the resulting step contains an index for each symbol of the string plus two extra indexes, the MGk parser has complexity O(n3k+).",
        "Note that the item and deduction step sets of an MGk parser are always supersets of those of WGk.",
        "In particular, the steps for WGk are those obtained from strings that do not contain abab or baba as a scattered substring.",
        "The MGk algorithm defined in the previous section can parse any mildly ill-nested structure for a given gap degree k in polynomial time.",
        "We have characterised the set of mildly ill-nested structures for gap degree k as those having a binarisation of gap degree < k. Since a binarisation of a dependency structure cannot have lower gap degree than the original structure, this set only contains structures with gap degree at most k. Furthermore, by the relation between MGk and WGk, we know that it contains all the well-nested structures with gap degree up to k.",
        "Figure 2 shows an example of a structure that has gap degree 1 , but is strongly ill-nested for gap degree 1.",
        "This is one of the smallest possible such structures: by generating all the possible trees up to 10 nodes (without counting a dummy root node",
        "Table 1: Counts of dependency trees classified by gap degree, and mild and strong ill-nestedness (for their gap degree); appearing in treebanks for Arabic (Hajic et al., 2OO4), Czech (Hajic et al., 2OO6), Danish (Kromann, 2OO3), Dutch (van der Beek et al., 2OO2), Latin (Bamman and Crane, 2OO6), Portuguese (Afonso et al., 2OO2), Slovene (Dzeroski et al., 2OO6), Swedish (Nilsson et al., 2OO5) and Turkish (Oflazer et al., 2OO3; Atalay et al., 2OO3).",
        "Additionally, we have defined a set of structures for any gap degree k which we call mildly ill-nested.",
        "This set includes ill-nested structures verifying certain conditions, and can be parsed in O(n3k+) with a variant of the parser for well-nested structures.",
        "The practical interest of mildly ill-nested structures can be seen in the data obtained from several dependency treebanks, showing that all of the ill-nested structures in them are mildly ill-nested for their corresponding gap degree.",
        "Therefore, our O(n3k+) parser can analyse all the gap degree k structures in these treebanks.",
        "The set of mildly ill-nested structures for gap degree k is defined as the set of structures that have a binarisation of gap degree at most k. This definition is directly related to the way the MGk parser works, since it implicitly finds such a binarisation.",
        "An interesting line of future work would be to find an equivalent characterisation of mildly ill-nested structures which is more grammar-oriented and would provide a more linguistic insight into these structures.",
        "Another research direction, which we are currently working on, is exploring how variants of the MGk parser's strategy can be applied to the problem of binarising LCFRS (Gomez-Rodriguez et al., 2OO9).",
        "Figure 2: One of the smallest strongly ill-nested structures.",
        "This dependency structure has gap degree 1, but is only mildly ill-nested for gap degree > 2.",
        "located at position 0), it can be shown that all the structures of any gap degree k with length smaller than 10 are well-nested or only mildly ill-nested for that gap degree k.",
        "Even if a structure T is strongly ill-nested for a given gap degree, there is always some m € N such that T is mildly ill-nested for m (since every dependency structure can be binarised, and binari-sations have finite gap degree).",
        "For example, the structure in Figure 2 is mildly ill-nested for gap degree 2.",
        "Therefore, MGk parsers have the property of being able to parse any possible dependency structure as long as we make k large enough.",
        "In practice, structures like the one in Figure 2 do not seem to appear in dependency treebanks.",
        "We have analysed treebanks for nine different languages, obtaining the data presented in Table 1.",
        "None of these treebanks contain structures that are strongly ill-nested for their gap degree.",
        "Therefore, in any of these treebanks, the MGk parser can parse every sentence with gap degree at most k."
      ]
    },
    {
      "heading": "6. Conclusions and future work",
      "text": [
        "We have defined a parsing algorithm for well-nested dependency structures with bounded gap degree.",
        "In terms of computational complexity, this algorithm is comparable to the best parsers for related constituency-based formalisms: when the gap degree is at most 1, it runs in O(n), like the fastest known parsers for LTAG, and can be made O(n) if we use unlexicalised dependencies.",
        "When the gap degree is greater than 1, the time complexity goes up by a factor of n for each extra unit of gap degree, as in parsers for coupled context-free grammars.",
        "Most of the non-projective sentences appearing in treebanks are well-nested and have a small gap degree, so this algorithm directly parses the vast majority of the non-projective constructions present in natural languages, without requiring the construction of a constituency grammar as an intermediate step.",
        "Structures",
        "Language",
        "Nonprojective",
        "Total",
        "By gap degree",
        "By nestedness",
        "Total",
        "Gap",
        "Gap",
        "Gap",
        "Gap",
        "Well-",
        "Mildly",
        "Strongly",
        "degree 1",
        "degree 2",
        "degree 3",
        "deg.",
        "> 3",
        "Nested",
        "Ill-Nested",
        "Ill-Nested",
        "Arabic",
        "2995",
        "2O5",
        "189",
        "13",
        "2",
        "1",
        "2O4",
        "1",
        "O",
        "Czech",
        "87889",
        "2O353",
        "19989",
        "359",
        "4",
        "1",
        "2O257",
        "96",
        "O",
        "Danish",
        "543O",
        "864",
        "854",
        "1O",
        "O",
        "O",
        "856",
        "8",
        "O",
        "Dutch",
        "13349",
        "4865",
        "4425",
        "427",
        "13",
        "O",
        "485O",
        "15",
        "O",
        "Latin",
        "3473",
        "1743",
        "1543",
        "188",
        "1O",
        "2",
        "1552",
        "191",
        "O",
        "Portuguese",
        "9O71",
        "1718",
        "13O2",
        "351",
        "51",
        "14",
        "1711",
        "7",
        "O",
        "Slovene",
        "1998",
        "555",
        "443",
        "81",
        "21",
        "1O",
        "55O",
        "5",
        "O",
        "Swedish",
        "11O42",
        "1O79",
        "1O48",
        "19",
        "7",
        "5",
        "1OO8",
        "71",
        "O",
        "Turkish",
        "5583",
        "685",
        "656",
        "29",
        "O",
        "O",
        "665",
        "2O",
        "O"
      ]
    }
  ]
}
