{
  "info": {
    "authors": [
      "Hitoshi Iida",
      "Takayuki Yamaoka",
      "Hidekazu Arita"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C90-3076",
    "title": "Three Typed Pragmatics for Dialogue Structure Analysis",
    "url": "https://aclweb.org/anthology/C90-3076",
    "year": 1990
  },
  "references": [
    "acl-J84-2002",
    "acl-J89-2001",
    "acl-P83-1025"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "An experimental system for dialogue structure analysis based on a new type plan recognition model for spoken dialogues has been implemented.",
        "This model is realized by using four typed plans which are categorized into three kinds of universal pragmatics and a kind of task-dependent knowledge related to common action hierarchies.",
        "The experimental system is characterized by higher modularity and computational efficiency through defining a hierarchical usage order between these knowledges.",
        "The system can grasp a dialogue structure making it possible to solve problems related to spoken dialogue interpretation."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "An efficient and smooth communication between humans is generally realized in spoken dialogues.",
        "This fact is mainly supported by various ellipsis expressions.",
        "concerning old information, the dialogue participants, zero-pronouns - especially in Japanese, substitutional verbs and so on.",
        "As' a result, each utterance is fragmental.",
        "A sequence of these utterances generally construct a whole dialogue step by step.",
        "Fragmental utterance comprehension by a hearer can be achieved using knowledge of the dialogue situation, context information, domain dependent knowledge, especially the domain dependent action hierarchy[Litman871, universal pragmatics concerning how to advance a dialogue, maintain dialogue cooperation between dialogue participants, etc., and language specific pragmatics [Levinson831.",
        "Such ellipsis resolution is one of the main problems in discourse understanding.",
        "Several approaches were proposed and implemented in Ltlendrix781, [Shimazu79j, ICarbone11831, etc.",
        "These researchers used various heuristic rules and did not make a clear distinction between domain specific knowledge and pragmatics.",
        "As a consequence, the user interface became inflexible because the system basically handled expected utterance patterns.",
        "*(I ) :A discourse goal is characterized by a discourse expectation which dialogue participants mutually believe as an expectation.",
        "Therefore, a discourse goal is very vague because a expectation depends on various attentions or empathies and the participant's knowledge.",
        "*(2) :Allowing embedded turn-takings.",
        "*(3) :A communicative act is basically defined as an abstract action, one that effects the hearer's thinking or decision-making and which can be described by a plan :;chema (cf. Cohen84).",
        "Recently, a plan-based dialogue understanding approach was developed using a kind of pragmatics metaplan: a 'discourse plan' incorporated with domain knowledge, 'domain plan' [Litman87J.",
        "This approach was based on Allen & Perrault's plan recognition strategies [Allen80j, [Perrault80J, [Allen871.",
        "By way of contrast, a pragmatic-based approach was proposed in order to understand intersentential elliptical fragments [Carberry89I.",
        "She claimed Litman's strategies could not recognize a surprise or a doubt conveyed by an elliptical fragment, for example \"$10,000 ?\", which is not a complete sentence including postulated speech acts 'request' or 'inform'.",
        "In addition, she also claimed that metaplans representing communicative goals should be dealt with adequately.",
        "She newly introduced 'discourse expectation' rules for grasping interaction between an information-seeker and an information-provider and 'discourse goal' rules for identifying an information-seeker's conversational or communicative goal*(1).",
        "These rules are heuristics for interpreting an elliptical fragment which explicitly indicates no linguistic clues to interpreting speech acts.",
        "On the other hand, in order to make the general understanding mechanism clear, a surprise or a doubt fragment such as mentioned above, must be understood from recognizing an irregular meaning from the view of gaps between common sense (a certain prerequisite condition) and the declaration.",
        "Furthermore, studying how to express a query, an answer, a confirmation, a surprise or a doubt in a context and a dialogue situation is necessary.",
        "In consideration of making a dialogue understanding model including such an understanding process, a method to handle pragmatics and utterance or dialogue must be studied.",
        "This paper shows three typed pragmatics used for cooperative dialogue development, as well as a dialogue structure analysis and understanding model using a plan recognition approach.",
        "The pragmatics are described by a 'dialogue plan', 'communication plan' and 'interaction plan'."
      ]
    },
    {
      "heading": "2. THREE TYPED PRAGMATICS",
      "text": [
        "Three types of universal pragmatics (cf. Levinson83) can be classified and described by the following plans: Interaction-Plan - a plan basically characterized by a dialogue turn-taking*(2) which describes a sequence of communicative acts*(3) , Communication-Plan a plan which determines how to execute or",
        "achieve an utterance goal or dialogue goals, and Dialogue-Plan a plan for establishing a dialogue construction, e.g. a cooperative dialogue* (4) .",
        "Eor example, in order to achieve the goal of registering for the conference the following sequence must usually be performed (Domain-Plan): obtain a registration form, fill out the form and return it to the secretariat.",
        "In such a telephone dialogue, if something is needed to execute the goal action, a request to send it can be made, or it will be offered to you (Communication-Plan).",
        "To complete the cooperative information-seeking, the hearer will respond to the speaker's request*(5) (Interaction-Plan).",
        "Before building a whole dialogue structure, the speaker should utter the opening section of the dialogue, especially on the telephone.",
        "Furthermore when the dialogue is finished, the speaker should wide up the dialogue (Dialogue-Plan).",
        "Each plan is described in terms of a schema formulation (plan-schema).",
        "A plan-schema has various slots to describe both an action's inner properties, e.g. HEADER and PREDICATE&CASES, and relationships between the action and prerequisite states/actions, effects, etc., e.g.",
        "PREREQUISITE, DECOMPOSITIONS, CONSTRAINTS, EFFECTS.",
        "A definite hierarchical order among these plans is available as follows;"
      ]
    },
    {
      "heading": "3. DIALOGUE ANALYSIS",
      "text": [
        "There are several linguistic phenomena which are hard to interpret, such as ellipses, referring pronouns and substitutional expressions.",
        "Both information from the established context and expectations from the current dialogue situation are required to resolve such problems.",
        "In order to get these information a dialogue structure which indicates the goal hierarchy of utterances in a dialogue must be constructed.",
        "A dialogue analysis is required and it is necessary to determine ;",
        "(1) how to infer each goal of an utterance within a dialogue, (2) how to make clear the relationships between goals within the dialogue.",
        "For the first problem, a plan recognition inference method is adequate for identifying an utterance intention because the intention can be inferred by recognizing the speaker's plan by chaining communicative acts regarded as speech acts in a specific domain [Allen80], [Perrault80], [Litman 87].",
        "For the second problem, the *(4) :A dialogue global construction usually has an opening section and closing section.",
        "Here, such a linguistic",
        "domain-specific knowledge is related to the action and objects, especially the action hierarchy which is used to grasp the utterance hgoal, and three kinds of pragmatics between umans involved in a spoken dialogue are used to grasp the dialogue development."
      ]
    },
    {
      "heading": "3.1 Communicative Acts",
      "text": [
        "First, in order to recognize the speaker's plan, it is necessary to recognize the turn-taking patterns.",
        "Communicative acts [Cohen84] are introduced .",
        "In Fig.1, an example of communicative acts in a cooperative task-oriented dialogue, e.g. 'queries and explanations regarding registration for an international conference' is shown.",
        "A communicative act in the demand class and a corresponding act in the response class make a turn-taking pair.",
        "This is recognized by the interaction plan.",
        "A communicative act is a decomposition element of an interaction plan."
      ]
    },
    {
      "heading": "3.2 Inference Mechanism",
      "text": [
        "An utterance meaning is represented by illocutionary speech act types and propositional contents obtained from a Head-Driven unification-based active chart parser*(6) for Japanese dialogues.",
        "The parsing result is described by a feature structure and the system input is modified into a communicative act with propositional contents.",
        "These consist of a certain predicate, an 'utterance type', and some variables, in particular, 'speaker', 'hearer', and `topic'.",
        "'Topic' is, on a surface level, an NP marked with the Japanese special particle, 'Iva', or the compound particle `nituite'.",
        "The plan recognizer (1) assumes a goal.",
        "(2) If a particular goal cannot be found, then stop else goto next (3).",
        "(3) Infer a chaining path from an input to the goal.",
        "If success, stop.",
        "Else return to the first process (1) in order to try to find the next candidate.",
        "The chaining process between plans generally finds a candidate plan from the current state (HEADER) to an action list represented in DECOMPOSITION.",
        "However if this fails, the chaining will be continued in accordance with PREREQUISITE, and EFFECT.",
        "In order to manage the current understanding state, the system uses two stacks.",
        "UNDERSTANDING-LIST stores completed plans as the current understanding state, and GOAL-LIST maintains incomplete plans regarded as possibilities and expectations for - 2 - 371 future goals .",
        "An overview of a dialogue structure construction process is shown in Fig.2."
      ]
    },
    {
      "heading": "4. AN EXPERIMENTAL SYSTEM",
      "text": [
        "This analysis model is realized by using four typed plans which are categorized into three types of universal pragmatics and a type of task-dependent knowledge related to common action hierarchies.",
        "The system has been implemented in Symbolics Common Lisp.",
        "A dialogue structure is represented by both completed plans and incomplete plans stored in the two stacks.",
        "Therefore, the system can understand dialogue meanings and can offer a dialogue structure using the contents of both stacks.",
        "Four model dialogues regarding an international conference registration taken from slightly modified inter-keyboard dialogues in Japanese have been applied.",
        "For example, the system can understand a Japanese substitutional expression, e.g. \"0isog-i kudasai\" (literal translation : 'Hurry please') which shows no agent, no object and no verb, because the current topic which is focused on an action in the domain plan is known in the system and the omitted verb (e.g. 'Return-Form') can be identified under the scope dominated by the topic."
      ]
    },
    {
      "heading": "5. CONCLUSION",
      "text": [
        "Litman & Allen introduced a set of discourse plans, each one corresponding to a particular way that an utterance can relate to a discourse topic.",
        "They distinguish discourse plans from a set of domain plans.",
        "The dialogue structure analysis model basically follows the above idea and uses new three typed pragmatics: interaction plan, communication plan and dialogue plan.",
        "By introducing these plans, the mechanism for constructing a dialogue structure becomes clear because of the way a surface utterance is connected with both pragmatics and the domain-specific knowledge, and by reducing the search space using a hierarchical order of applying knowledge, computational efficiency is improved."
      ]
    },
    {
      "heading": "Acknowledgement",
      "text": [
        "The authors would like to thank The President Dr. Akira Kurematsu and our other colleagues at ATR Interpreting Telephony Research Laboratories for their encouragement and thought-provoking discussions."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    },
    {
      "heading": "HEADER: REQUEST-ACTION-UNIT DECOMPOSITION: REQUEST•ACTION ACCEPT I",
      "text": []
    }
  ]
}
