{
  "info": {
    "authors": [
      "Byron Wallace"
    ],
    "book": "NAACL",
    "id": "acl-N12-1001",
    "title": "Multiple Narrative Disentanglement: Unraveling Infinite Jest",
    "url": "https://aclweb.org/anthology/N12-1001",
    "year": 2012
  },
  "references": [
    "acl-J10-3004",
    "acl-P08-1090",
    "acl-P09-1068",
    "acl-P10-1015",
    "acl-P11-1118",
    "acl-W03-0430"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Many works (of both fiction and non-fiction) span multiple, intersecting narratives, each of which constitutes a story in its own right.",
        "In this work I introduce the task of multiple narrative disentanglement (MND), in which the aim is to tease these narratives apart by assigning passages from a text to the sub-narratives to which they belong.",
        "The motivating example I use is David Foster Wallace's fictional text Infinite Jest.",
        "I selected this book because it contains multiple, interweaving narratives within its sprawling 1,000-plus pages.",
        "I propose and evaluate a novel unsupervised approach to MND that is motivated by the theory of narratology.",
        "This method achieves strong empirical results, successfully disentangling the threads in Infinite Jest and significantly outperforming baseline strategies in doing so."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Both fictional and non-fictional texts often comprise multiple, intersecting and interrelated narrative arcs.",
        "This work considers the task of identifying the (sub-)narratives latent within a narrative text and the set of passages that comprise them.",
        "As a mo",
        "without the broader context of the overarching narrative).",
        "I refer to the task of identifying these independent threads and untangling them from one another as multiple narrative disentanglement (MND).",
        "The task is of theoretical interest because disentanglement is a necessary prerequisite to making sense of narrative texts, an interesting direction in NLP that has received an increasing amount of attention (Elson et al., 2010; Elson and McKeown, 2010; Celikyilmaz et al., 2010; Chambers and Jurafsky, 2008; Chambers and Jurafsky, 2009).",
        "Recognizing the (main) narrative threads comprising a work provides a context for interpreting the text.",
        "Disentanglement may thus be viewed as the first step in a literary processing ?pipeline?.",
        "Identifying threads and assigning them to passages may help in automatic plot summarization, social network construction and other literary analysis tasks.",
        "Computational approaches to literature look to make narrative sense of unstructured text, i.e., construct models that relate characters and events chronologically: disentanglement is at the heart of this re-construction.",
        "But MND is also potentially of more pragmatic import: disentanglement may be useful for identifying and extracting disparate threads in, e.g., a news-magazine article that covers multiple (related) stories.2 Consider an article covering a political race.",
        "It would likely contain multiple sub-narratives (the story of one candidate's rise and fall, a scandal in a political party, etc.)",
        "that may be of interest independently of the particular race at hand.",
        "Narrative dis-2While narrative colloquially tends to refer to fictional texts, the narrative voice is also frequently used in non-fictional contexts (Bal, 1997).",
        "entanglement thus has applications outside of computational methods for fiction.",
        "In this work, I treat MND as an unsupervised learning task.",
        "Given a block of narrative text, the aim is to identify the top k sub-narratives therein, and then to extract the passages comprising them.",
        "The proposed task is similar in spirit to the problem of chat disentanglement (Elsner and Charniak, 2010), in which the aim is to assign each utterance in a chat transcription to an associated conversational thread.",
        "Indeed, the main objective is the same: disentangle fragments of a monolithic text into chronologically ordered, independently coherent ?threads?.",
        "Despite their similarities, however, narrative disentanglement is a qualitatively different task than chat disentanglement, as I highlight in Section 3.",
        "I take inspiration from the literary community, which has studied the theoretical underpinnings of the narrative form at length (Prince, 1982; Prince, 2003; Abbott, 2008).",
        "I rely especially on the seminal work of Bal (1997), Narratology, which provides a comprehensive theoretical framework for treating narratives.",
        "This narratological theory motivates my strategy of narrative modeling, in which I first extract the entities in each passage of a text.",
        "I then uncover the latent narrative compositions of these passages by performing latent Dirichlet alocation (LDA) (Blei et al., 2003) over the extracted entities.",
        "The main contributions of this work are as follows.",
        "First, I introduce the task of multiple narrative disentanglement (MND).",
        "Second, motivated by the theory of narratology (Section 2) I propose a novel, unsupervised method for this task (Section 5) and demonstrate its superiority over baseline strategies empirically (Section 6).",
        "Finally, I make available a corpus for this task: the text of Infinite Jest manually annotated with narrative tags (Section 4)."
      ]
    },
    {
      "heading": "2 Narratology",
      "text": [
        "I now introduce some useful definitions and concepts (Table 1) central to the theory of narratology (Bal, 1997).",
        "These constructs motivate my approach to the task of disentanglement.",
        "These definitions imply that the observed narrative text has been generated with respect to some number of latent fabulas.",
        "A story is a particular telling of an underlying fabula, i.e., a sequence of Actor an agent that performs actions.",
        "Actors are not necessarily persons.",
        "Fabula a series of logically and chronologically related events that are caused or experienced by actors.",
        "Story an instantiation of a fabula, told in a particular style (a story tells a fabula).",
        "Stories are not necessarily told in chronological order.",
        "Focalizer a special actor from whose point of view the story is told.",
        "events involving actors.",
        "Figure 1 schematizes the relationships between the above constructs.",
        "The dotted line between author and fabula implies that authors sometimes generate the fabula, sometimes not.",
        "In particular, an author may retell a widely known fabula (e.g., Hamlet); perhaps from a different perspective.",
        "Consider, for example, the play Rosencrantz and Guildenstern are Dead (Stoppard, 1967), a narrative that retells the fabula of Hamlet from the perspective of the titular characters (both of whom play a minor part in Hamlet itself).",
        "From a narratological view, this story is an instantiation of the Hamlet fabula imbued with novel aspects (e.g., the focalizers in this telling are Rosencrantz and Guildenstern, rather than Hamlet).",
        "In non-fictional works the fabula corresponds to the actual event sequence as it happened, and thus is not invented by the author (save for cases of outright fabrication).",
        "Fabulas are essentially actor-driven.",
        "Further, actors tend to occupy particular places, and indeed Bal (1997) highlights locations as one of the defining elements of fabulas.",
        "Given these observations, it thus seems fruitful to attempt to identify the agents and locations (or entities) in each passage of a text as a first step toward disentanglement.",
        "I will return to this intuition when I present the narrative modeling method in Section 5.",
        "First, I place the present work in context by relating it to existing work on mining literature and chat disentanglement."
      ]
    },
    {
      "heading": "3 Relationship to Existing Work",
      "text": [
        "Most similar to MND is the task of chat disentanglement (Shen et al., 2006; Elsner and Charniak, 2010; Elsner and Charniak, 2011), wherein utterances (perhaps overheard at a cocktail party) are to",
        "dotted line between author and fabula implies that when generating a narrative text, an author may invent a fabula, or may draw upon an existing one.",
        "Together, the author and fabula jointly give rise to the story, which is communicated via the text.",
        "be assigned to conversational threads.",
        "There are, however, important differences between these two tasks.",
        "Notably, utterances in a chat belong to a single discussion thread, motivating ?hard?",
        "assignments of utterances to threads, e.g., using graph-partitioning (Elsner and Charniak, 2010) or k-means like approaches (Shen et al., 2006).",
        "Narratives, however, often intersect: a single passage may belong to multiple narrative threads.",
        "This motivates soft, probabilistic assignments of passages to threads.",
        "Moreover, narratives are inherently hierarchical.",
        "The latter two observations suggest that probabilistic generative models are appropriate for MND.",
        "There has also been recent interesting related work in the unsupervised induction of narrative schemas (Chambers and Jurafsky, 2008; Chambers and Jurafsky, 2009).",
        "In this work, the authors proposed the task of (automatically) discovering the events comprising a narrative chain.",
        "Here narrative event chains were defined by Chambers and Jurafsky (2008) as partially ordered sets of events involving the same protagonist.",
        "While similar in that these works attempt to make sense of narrative texts, the task at hand is quite different.",
        "In particular, narrative schema induction presupposes a single narrative thread.",
        "Indeed, the authors explicitly make the assumption that a single protagonist participates in all of the events forming a narrative chain.",
        "Thus the discovered chains describe actions experienced by the protagonist localized within a particular narrative structure.",
        "By contrast, in this work I treat narrative texts as instantiations of fabulas, in line with Bal (1997).",
        "Fabulas can be viewed as distributions over characters, events and other entities; this conceptualization of what constitutes a narrative is broader than Chambers and Jurafsky (2008).",
        "inducing narrative schemas (Chambers and Jurafsky, 2009) may be viewed as a possible next step in a narrative induction pipeline, subsequent to disentangling the text comprising individual narrative threads.",
        "Indeed, the latter task might be viewed as attempting to automatically reconstruct the fabula latent in a specific narrative thread.",
        "Elsewhere, Elson et al. (2010) proposed a method for extracting social networks from literary texts.",
        "Their method relies on dialogue detection.",
        "This is used to construct a graph representing social interactions, in which an edge connecting two characters implies that they have interacted at least once; the weight of the edge encodes the frequency of their interactions.",
        "Their method is a pipelined process comprising three steps: character identification, speech attribution and, finally, graph construction.",
        "Their results from the application of this method to a large collection of novels called into question a long-held literary hypothesis: namely that there is an inverse correlation between the number of characters in a novel and the amount of dialogue it contains (Moretti, 2005) (it seems there is not).",
        "By answering a literary question empirically, their work demonstrates the power of computational methods for literature analysis."
      ]
    },
    {
      "heading": "4 Corpus (Infinite Jest)",
      "text": [
        "I introduce a new corpus for the task of multiple narrative disentanglement (MND): David Foster Wallace's novel Infinite Jest (Wallace, 1996) that I have manually annotated with narrative tags.3 Infinite Jest is an instructive example for experimenting with MND, as the story moves frequently between a few mostly independent ?",
        "though ultimately connected and occasionally intersecting ?",
        "narrative threads.",
        "Annotation, i.e., manually assigning text to one or more narratives, is tricky due primarily to having to make decisions about new thread designation and label granularity.4 Start with the first.",
        "There is an inherent subjectivity in deciding what constitutes a narrative thread.",
        "In this work, I was liberal in making this designation, in total assigning 49 unique narrative labels.",
        "Most of these tell the story of particular (minor) characters, who are themselves actors in a ?higher-level?",
        "narrative ?",
        "as previously mentioned, narrative structures are inherently hierarchical.",
        "This motivates my liberal introduction of narratives: lesser threads are subsumed by their parent narratives, and can thus simply be ignored during analysis if one is uninterested in them.",
        "Indeed, this work focuses only on the three main narratives in the text (see below).",
        "Granularity poses another challenge.",
        "At what level ought the text be annotated?",
        "Should each sentence be tagged with associated threads?",
        "Each paragraph?",
        "I let context guide this decision: in some cases tags span a single sentence; more often they span paragraphs.",
        "As an example, consider the following example of annotated text, wherein the AFR briefly narrative intersects the story of the ETA (see Table 2).",
        "<AFR>Marathe was charged with this operation's details ... <ETA>A direct assault upon the Academy of Tennis itself was impossible.",
        "A.F.R.s fear nothing in this hemisphere except tall and steep hillsides.",
        "... </ETA></AFR> Here the ellipses spans several paragraphs.",
        "Precision probably matters less than context in MND: identifying only sentences that involve a particular sub-narrative, sans context, would probably not be useful.",
        "Because the appropriate level of granularity depends on the corpus at hand, the task of segmenting the text into useful chunks is a subtask of MND.",
        "I refer to the segmented pieces of text as passages and say that a passage belongs to all of the narrative threads that appear anywhere within it.",
        "Hence in the above example, the passage containing this excerpt would be designated as belonging to both the ETA and AFR threads.",
        "4These complexities seem to be inherent to disentanglement tasks in general: Elsner and Charniak (2010) describe analogues issues in the case of chat.",
        "AFR This is the tale of the wheelchair assassins, a Que`be`cois terrorist group, and their attempts to seize an original copy of a dangerous film.",
        "Focalizer: Marathe.",
        "EHDRH The Ennet House Drug Recovery House (sic).",
        "This narrative concerns the going-ons at a drug recovery house.",
        "Focalizer: Don Gately.",
        "ETA This narrative follows the students and faculty at the Enfield Tennis Academy.",
        "Focalizer: Hal.",
        "Infinite Jest is naturally segmented by breaks, i.e., blank lines in the text which typically indicate some sort of context-shift (functionally, these are like mini-chapters).",
        "There are 182 such breaks in the book, demarcating 183 passages.",
        "Each of these comprises about 16,000 words and contains an average of 4.6 (out of 49) narratives, according to my annotations.",
        "There are three main narrative threads in Infinite Jest, summarized briefly in Table 2.5 I am not alone in designating these as the central plot-lines in the book.6 Nearly all of the other threads in the text are subsumed by these (together the three cover 72% of the passages in the book).",
        "These three main threads are ideal for evaluating an MND system, for a few reasons.",
        "First, they are largely independent of one another, i.e., overlap only occasionally (though they do overlap).",
        "Second, they are relatively unambiguous: it is mostly clear when a passage tells a piece of one of these story-lines, and when it does not.",
        "These narratives are thus well-defined, providing a minimal-noise dataset for the task of MND.",
        "That I am the single annotator of the corpus (and hence inter-annotator agreement cannot be assessed) is unfortunate; the difficulty of finding someone both qualified and willing to annotate the 1000+ page book precluded this possibility.",
        "I hope to address",
        "in the passage at that location in the text; these are scaled relative to the passage length.",
        "this shortcoming in future work.",
        "Figure 2 depicts the location and duration of these sub-narratives within the text.",
        "Passages run along the bottom axis.",
        "A colored box indicates that the corresponding narrative is present in the passage found at that location in the book.",
        "Passages are normalized by their length: a wide box implies a long passage.",
        "The aim of MND, then, is to automatically infer this structure from the narrative text."
      ]
    },
    {
      "heading": "5 Narrative Modeling for Multiple",
      "text": []
    },
    {
      "heading": "Narrative Disentanglement",
      "text": [
        "The proposed method is motivated by the theory of narratology (Bal, 1997), reviewed in Section 2.",
        "Specifically I assume that passages are mixtures of different narratives with associated underlying fabulas.",
        "Fabulas, in turn, are viewed as distributions over entities.",
        "Entities are typically actors, but may also be locations, etc.",
        "; they are what fabulas are about.",
        "The idea is to infer from the observed passages the probable latent fabulas.",
        "This is a generative view of narrative texts, which lends itself naturally to a topic-modeling approach (Steyvers and Griffiths, 2007).",
        "Further, this generative vantage allows one to exploit the machinery of latent Dirichelet alocation (LDA) (Blei et al., 2003).",
        "LDA is a generative model for texts (and discrete data, in general) in which it is assumed that each document in a corpus reflects a mixture of (latent) topics.",
        "The words in the text are thus assumed to be generated by these topics: topics are multinomials over words.",
        "Graphically, this model is depicted by",
        "The outer plate represents documents, while the inner plate represents the repeated choice of topics and words within a document.",
        "where p(zn |\") is simply \"i for the unique i such that zin = 1.",
        "Integrating over \" and summing over z, we obtain the marginal distribution of a document:",
        "Finally, taking the product of the marginal probabilities of single documents, we obtain the probability of a corpus:",
        "The LDA model is represented as a probabilistic graphical model in Figure 1.",
        "As the figure makes clear, there are three levels to the LDA representation.",
        "The parameters !",
        "and # are corpus-level parameters, assumed to be sampled once in the process of generating a corpus.",
        "The variables \"d are document-level variables, sampled once per document.",
        "Finally, the variables zdn and wdn are word-level variables and are sampled once for each word in each document.",
        "It is important to distinguish LDA from a simple Dirichlet-multinomial clustering model.",
        "A classical clustering model would involve a two-level model in which a Dirichlet is sampled once for a corpus, a multinomial clustering variable is selected once for each document in the corpus, and a set of words are selected for the document conditional on the cluster variable.",
        "As with many clustering models, such a model restricts a document to being associated with a single topic.",
        "LDA, on the other hand, involves three levels, and notably the topic node is sampled repeatedly within the document.",
        "Under this model, documents can be associated with multiple topics.",
        "Structures similar to that shown in Figure 1 are often studied in Bayesian statistical modeling, where they are referred to as hierarchical models (Gelman et al., 1995), or more precisely as conditionally independent hierarchical models (Kass and Steffey, 1989).",
        "Such models are also often referred to as parametric empirical Bayes models, a term that refers not only to a particular model structure, but also to the methods used for estimating parameters in the model (Morris, 1983).",
        "Indeed, as we discuss in Section 5, we adopt the empirical Bayes approach to estimating parameters such as !",
        "and # in simple implementations of LDA, but we also consider fuller Bayesian approaches as well.",
        "eterizes the multinomial governing topics, i.e., zs.",
        "The observed words w are then assumed to be drawn from a multinomial conditioned on z.",
        "Here the plates denote that there are N (observed) words and M topics.",
        "um nts, standard i ference pr cedures can be used for parameter estimation (Jordan et al., 1999).",
        "I propose the following approach for MND, which I will refer to as narrative modeling.",
        "(This pipeline",
        "is also described by Figure 4).",
        "1.",
        "Segment the raw text into passages.",
        "It is at the",
        "level of this unit that narratives will be assigned: if a given narrative tag is anywhere in a passage, that passage is deemed as eing a part of said narrative.7 In many cases (including the present one) this step will be relativ ly trivial; e.g., segm nting th text into chapters or paragraphs.",
        "2.",
        "(Automatically) extract from each of these segments named entities.",
        "The idea is that these include the primary players in the respective narratives, i.e., important actors and locations.",
        "eling is performed over the entities, rather than the text, I shall refer to it as narrative modeling.",
        "As mentioned above, Step (1) will be task-specific: what constitutes a passage is inherently subjective.",
        "In many cases, however, the text will lend itself to a ?natural?",
        "segmenting, e.g., at the chapter-level.",
        "Standard statistical techniques for named entity recognition (NER) can be used for Step (2) (McCallum and Li, 2003).",
        "Algorithm 1 The story of LDA over extracted entities for multiple narrative disentanglement.",
        "Draw a mixture of narrative threads ?",
        "?",
        "Dir(?)",
        "for each entity in the passage ei do Draw a narrative thread ti ?Multinomial(?)",
        "pipeline.",
        "For the narrative modeling Step (3), I use LDA (Blei et al., 2003); the generative story for narrative modeling is told by Algorithm 1.8 This squares with the narratological view: entities are observed in the text with probability proportional to their likelihood of being drawn from the corresponding latent fabulas (which we are attempting to recover).",
        "Focusing on these entities, rather than the raw text, is crucial if one is to be compatible with the narratological view.",
        "The text is merely a particular telling of the underlying fabula, made noisy by story specific aspects; extracting entities from the passages effectively removes this noise, allowing the model to operate over a space more closely tied to the fabulas.",
        "In the following section, I demonstrate that this shift to the entity-space substantially boosts MND performance.",
        "8Liu and Liu (2008) have also proposed topic models over NEs, though in a very different context.",
        "The aim is to uncover the top k most salient narrative threads in a text, where k is a user-provided parameter.",
        "Indeed one must specify the number of threads he or she is interested in identifying (and disentangling), because because, due to the hierarchical nature of narratives, there is no single ?right number?",
        "of them.",
        "Consider that the input block of text constitutes a perfectly legitimate (meta-)narrative on its own, for example.",
        "A related issue that must be addressed is that of deciding when to assign a passage to multiple threads.",
        "That is, given the (estimated) narrative mixtures for each passage as an input, to which (if any) narrative threads ought this passage be assigned?",
        "My approach to this is two-fold.",
        "First, I set a threshold probability ?",
        "such that a passage pi cannot be assigned to a narrative thread t if the estimated mixture component is?",
        "?.",
        "I use ?",
        "= 1/k, as this value implies that the passage is dominated by other threads (in the case that all k threads contribute equally to a passage, the corresponding mixture elements would all be 1/k).",
        "Second, I enforce a constraint that in order to be assigned to the narrative t, a passage must contain at least one of the top l entities involved in t (according to the narrative model).",
        "This constraint encodes the intuition that the main actors (and locations) that constitute a given fabula are (extremely) likely to be present in any given passage in which it is latent.",
        "I set l = 100, reflecting intuition.",
        "These were the first values I used for both of these parameters; I did not tune them to the corpus at hand.",
        "I did, however, experiment with other values after the primary analysis to assess sensitivity.",
        "The proposed algorithm is not terribly sensitive to either parameter, though both exert influence in the expected directions: increasing ?",
        "decreases recall, as passages are less likely to be assigned to narratives.",
        "Decreasing l has a similar effect, but does not substantially impact performance unless extreme values are used.9"
      ]
    },
    {
      "heading": "5.1 Focalizer Detection",
      "text": [
        "Recall that the focalizer of a narrative is the agent responsible for perception: it is from their point of view that the story is told (Bal, 1997).",
        "One can easily exploit the narrative modeling method above to",
        "automatically identify the (main) focalizer of the uncovered narratives.10 To this end, I simply identify the highest ranking entity from each narrative that has also been labeled as a ?person?",
        "(as opposed, e.g., to an ?organization?",
        ")."
      ]
    },
    {
      "heading": "6 Empirical Results",
      "text": [
        "I now present experimental results over the Infinite Jest corpus, described in Section 4.",
        "The task here is to uncover the three main narratives in the text, depicted in Figure 2.",
        "To implement the proposed narrative modeling method (Section 5), I first chunked the text into passages, delineated in Jest by breaks in the text.",
        "I performed entity extraction over these passages using the NLTK toolkit (Bird et al., 2009).",
        "I then performed LDA via Mallet (McCallum, 2002) to estimate the narrative mixture components of each passage.",
        "I compare the narrative modeling approach presented in the preceding section to three baselines.",
        "The simplest of these, round-robin and all-same are similar to the baselines used for chat disentanglement (Elsner and Charniak, 2010).",
        "Respectively, these strategies designate each passage as: belonging to the next narrative in a given sequence (?narrative 1?, ?narrative 2?, ?narrative 3?",
        "), and, belonging to the majority narrative.",
        "In both cases I show the best result attainable using the method: thus in the case of the former, I report the best scoring results from all 3!",
        "possible thread sequences (with respect to macro-averaged F-score) and in the latter case I use the true majority narrative.",
        "I also evaluate a simple topic-modeling baseline, which is the same as narrative modeling, except that: 1) LDA is performed over the full-text (rather than the extracted entities) and, 2) there is no constraint enforcing that passages reference an entity associated with the assigned narrative.",
        "I evaluate results with respect to per-narrative recall, precision and F-score (Equations 1-3) (where TP=true positive, 10Technically, there may be multiple focalizers in a narrative, but more often there is only one.",
        "FN=false negative, etc.).",
        "I also consider micro-and macro-averages of these.",
        "To calculate the micro-average, one considers each passage at a time by counting up the TPs, FPs, TNs and FNs therein for each narrative under consideration (w.r.t.",
        "the model being evaluated).",
        "The micro-average is then calculated using these tallied counts.",
        "Note that in this case certain narratives may contribute more to the overall result than others, e.g. those that are common.",
        "By contrast, to calculate the macro-average, one considers each narrative in turn and calculates the average of the metrics of interest (recall, precision) w.r.t.",
        "this narrative over all passages.",
        "An average is then taken over these mean performances.",
        "This captures the average performance of a model over all of the narratives, irrespective of their prevalence; in this case, each thread contributes equally to the overall result.",
        "Finally, note that none of the methods explicitly labels the narratives they uncover: this assignment can be made by simply matching the returned narratives to the thread labels (e.g., ETA) that maximize performance.",
        "This labeling is strictly aesthetic; the aim is to recover the latent narrative threads in text, not to label them.",
        "Table 4 presents the main empirical results.",
        "Neither of the simple baseline methods (round-robin and all-same) performed very well.",
        "Both cases, for example, completely failed to identify the EHDRH thread (though this is hardly surprisingly in the all-same case, which identifies only one thread by definition).",
        "The macro-averaged precisions and F-measures are thus undefined in these cases (these give rise to a denominator of 0).",
        "With respect to micro-averaged performance, all-same achieves a substantially higher F-score than round-robin here, though in general this will be contingent on how dominated the text is by the majority thread.",
        "Next consider the two more sophisticated strategies, including the proposed narrative modeling method.",
        "Start with the performance of full-text TM, i.e., performing standard topic-modeling over the full-text.",
        "This method improves considerably on the baselines, achieving a macro-averaged F-score of .545.11 But the narrative modeling method (Section 5) performs substantially better, boosting the 11In the full-text case, I evaluated the performance of every possible assignment of topics to threads, and report the best scoring result.",
        "macro-averaged F-score by over 15 points (a percent gain of nearly 30%).",
        "Figures 5 and 6 depict the unsupervised reconstruction of the narrative threads using narrative modeling and the full-text topic modeling approach, respectively.",
        "Recall that the aim is to reconstruct the narratives depicted in Figure 2.",
        "In these plots, an empty box represents a false negative (i.e., implies that this passage contained the corresponding narrative but this was not inferred by the model), and a hatched box denotes a false positive (the model assigned the passage to the corresponding narrative, but the passage did not belong to it).",
        "One can see that the narrative modeling method (Figure 5) reconstructs the hidden threads much better than does the full-text topic modeling approach (Figure 6).",
        "Once can see that the latter method has particular trouble with the EHDRH thread.",
        "I also experimented with the focalizer detection method proposed in Section 5.1.",
        "This simple strategy achieved 100% accuracy on the three main narratives, correctly identifying by name each of the corresponding focalizers (see Table 2)."
      ]
    },
    {
      "heading": "6.1 A More Entangled Thread",
      "text": [
        "The preceding results are positive, insofar as the proposed method substantially improves on baselines and is able to disentangle threads with relatively high fidelity.",
        "These results considered the three main narratives that comprise the novel (Figure 2).",
        "This is the sort of structure I believe will be most common in narrative disentanglement, as it is likely that one will mostly be interested in extracting coherent threads that are largely independent of one another.",
        "That said, I will next consider a more entangled thread to see if the method handles these well.",
        "More specifically, I introduce the narrative INC, which relates the story of the Incandenza family.",
        "This family is (arguably) the focus of the novel.",
        "The story of the Incandenza's overlaps extremely frequently with the three main, mostly independent narratives considered thus far (see Figure 6).",
        "This thread is thus difficult from an MND perspective.",
        "I apply the same methods as above to this task, requesting four (rather than three) sub-narratives, i.e., k = 4.",
        "Results are summarized in Table 5.12 We ob-12I omit the two baseline strategies due to space constraints;",
        "round-robin all-same full-text TM narrative modeling narrative recall prec.",
        "F recall prec.",
        "F recall prec.",
        "F recall prec.",
        "F",
        "more frequently intersects with the other narratives.",
        "full-text TM narrative modeling narrative recall prec.",
        "F recall prec.",
        "F",
        "gled narrative (INC) is added.",
        "serve that the narrative modeling strategy again bests the baseline strategies, achieving a macro-averaged F-score of about 10 points greater than that achieved using the full-text TM method (a ?20% gain).",
        "Focalizer identification is tricky in this case because there are multiple focalizers.",
        "However I note that using the proposed strategy, four members of the Incandenza clan rank in the top five entities associated with this narrative, an encouraging result.13 both performed worse than the displayed methods.",
        "13The fifth top-ranking entity is Joelle, a girl who plays an important part in the family saga."
      ]
    },
    {
      "heading": "7 Conclusions",
      "text": [
        "I have introduced the task of multiple narrative disentanglement (MND), and provided a new annotated corpus for this task.",
        "I proposed a novel method (narrative modeling) for MND that is motivated by the theory of narratology.",
        "I demonstrated that this method is able to disentangle the narrative threads comprising Infinite Jest and that it substantially outperforms baselines in terms of doing so.",
        "I also extended the method to automatically identify narrative focalizers, and showed that it is possible to do so with near-perfect accuracy.",
        "Interesting future directions include exploring supervised narrative disentanglement, combining MND with narrative induction (Chambers and Jurafsky, 2009) and applying MND to non-fictional texts."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Thanks to Kevin Small and Carla Brodley for suggesting improvements to this work, and to all of the members of the Inman Square Existentialist Book Club for insightful discussions about Jest."
      ]
    }
  ]
}
