{
  "info": {
    "authors": [
      "Guohong Fu",
      "Jonathan J. Webster"
    ],
    "book": "Proceedings of the Sixth SIGHAN Workshop on Chinese Language Processing",
    "id": "acl-I08-4021",
    "title": "A Morpheme-based Part-of-Speech Tagger for Chinese",
    "url": "https://aclweb.org/anthology/I08-4021",
    "year": 2008
  },
  "references": [
    "acl-C00-1070",
    "acl-I05-3005",
    "acl-W02-1811",
    "acl-W04-3236"
  ],
  "sections": [
    {
      "text": [
        "Guohong Fu Jonathan J. Webster",
        "Harbin 150080, P.R.",
        "China 83 Tat Chee Avenue, Hong Kong, P.R.",
        "China",
        "ghfu@hotmail.com ctj jw@cityu.edu.hk",
        "This paper presents a morpheme-based part-of-speech tagger for Chinese.",
        "It consists of two main components, namely a morpheme segmenter to segment each word in a sentence into a sequence of morphemes, based on forward maximum matching, and a lexical tagger to label each morpheme with a proper tag indicating its position pattern in forming a word of a specific class, based on lexicalized hidden Markov models.",
        "This system have participated four closed tracks for POS tagging at the Fourth International Chinese Language Processing Bakeoff sponsored by the ACL-SIGHAN."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Part-of-speech (POS) tagging aims to assign each word in a sentence with a proper tag indicating its POS category.",
        "While a number of successful POS tagging systems have been available for English and many other languages, it is still a challenge to develop a practical POS tagger for Chinese due to its language-specific issues.",
        "Firstly, Chinese words do not have a strict one-to-one correspondence between their POS categories and functions in a sentence.",
        "Secondly, an ambiguous Chinese word can act as different POS categories in different contexts without changing its form.",
        "Thirdly, there are many out-of-vocabulary (OOV) words in real Chinese text whose POS categories are not defined in the dictionary used.",
        "All these factors make it much more difficult to achieve a high-performance POS tagger for Chinese.",
        "Recent studies in Chinese POS tagging focus on statistical or machine learning approaches with either characters or words as basic units for tagging (Ng and Low, 2004; Fu and Luke, 2006).",
        "Very little research has been devoted to resolving Chinese POS tagging problems based on morphemes.",
        "In our system, we prefer morphemes to characters or words as tagging units for three reasons.",
        "First, words are made of morphemes instead of characters (Wu and Tseng, 1995; Packard, 2000).",
        "Second, most morphemes are productive in word formation (Baayen, 1989; Sproat and Shih, 2002; Nishimoto, 2003), particularly in the formation of morphologically-derived words (MDWs) and proper nouns, which are the major source of OOV words in Chinese texts.",
        "Third, Packard (2000) indicates that Chinese do have morphology.",
        "Moreover, morphology proves to be a very informative cue for predicting POS categories of Chinese OOV words (Tseng et al., 2005).",
        "Therefore, we believe that a morpheme-based framework would be more effective than the character-or word-based ones in capturing both word-internal morphological features and word-external contextual information for Chinese POS disambiguation and unknown word guessing (UWG) as well.",
        "Thus we present a morpheme-based POS tagger for Chinese in this paper.",
        "It consists of two main components, namely a morpheme segmentation component for segmenting each word in a sentence into a sequence of morphemes, based on the forward maximum matching (FMM) technique, and a lexical tagging component for labeling each segmented morpheme with a proper tag indicating its position pattern in forming a word of a specific type, based on lexicalized hidden Markov models (HMMs).",
        "Lack of a large morphological knowledge base is a major obstacle to Chinese morphological analysis (Tseng and Chen, 2002).",
        "To overcome this problem and to facilitate morpheme-based POS tagging as well, we have also developed a statistically-based technique for automatically extracting morphemes from POS-tagged corpora.",
        "We participated in four closed tracks for POS tagging at the Fourth International Chinese Language Processing Bakeoff sponsored by the ACL-SIGHAN and tested our system on different testing corpora.",
        "In this paper, we also made a summary of this work and give some brief analysis on the results.",
        "The rest of this paper is organized as follows: Section 2 is a brief description of our system.",
        "Section 3 details the settings of our system for different testing tracks and presents the scored results of our system at this bakeoff.",
        "Finally, we give our conclusions in Section 4."
      ]
    },
    {
      "heading": "2. System Description",
      "text": [
        "In brief, Chinese morphemes can be classified into free morphemes and bound morphemes.",
        "A free morpheme can stand by itself as a word (viz. a basic word), whereas a bound morpheme can show up if and only if being attached to other morphemes to form a word.",
        "Free morphemes can be subdivided into true free morphemes and pseudo free morphemes.",
        "A pseudo free morpheme such as j&j ran2-er2 'however' can only stand alone, while a true free morpheme like SHENG-CHAN 'produce' can stand alone by itself as a word or occur as parts of other words.",
        "Chinese affixes include prefixes (e.g. # feil 'non-', $ wei3 'pseudo'), infixes (e.g. feil-zhil) or ism'), in terms of their positions within a word.",
        "To perform morpheme-based Chinese POS tagging, we represent a POS-tagged word in a Chinese sentence as a sequence of lexical chunks with the aid of an extended IOB2 tag set (Fu and Luke 2005).",
        "A lexical chunk consists of a sequence of constituent morphemes associated with their corresponding lexical chunk tags.",
        "A lexical chunk tag follows the format Tl-T2, indicating the POS category T2 of a word and the position pattern T1 of a constituent morpheme within the word.",
        "As shown in Table l, four position patterns are involved in our system, namely O for a single morpheme as a word by itself, I for a morpheme inside a word, B for a morpheme at the beginning of a word and E for a morpheme at the end of a word.",
        "Due to the increasing involvement of affixation in Chinese word formation, affixes play a more and more important role in Chinese POS tagging.",
        "In morpheme extraction, affixes are very useful in determining whether a given word is derived by affixation.",
        "To extract affixes from corpora, we consider three statistics, i.e. morpheme-position frequency Count (m, T1) , morpheme-position probability MPP(m, Tl) = Count(m, Tl)/Count(m) and morphological productivity.",
        "Following the proposal in (Baayen, l989), the morphological productivity of a morpheme m with a position pattern Tl, denoted as MP(m, Tl), can be defined as",
        "Count (m, T l) where nl(m,Tl) is the number of word types that occur only once in the training corpus and at the same time, are formed by the morpheme m with the position pattern Tl .",
        "To estimate the above statistics for affix extraction, we only take into account the three position patterns B, I and E, for prefixes, infixes and suffixes, respectively.",
        "Thus we can extract affixes from training data with the following three conditions: Count(m, Tl) > THMPF , MPP(m, Tl) > THMPPand MP(m, Tl) > THMP , where THmpf, THmpp and THMP are three empirically-determined thresholds.",
        "Tag",
        "Definition",
        "Corresponding morpheme types",
        "O",
        "A morpheme as a word by itself",
        "Free morphemes",
        "I",
        "A morpheme inside a word",
        "Free morphemes and infixes",
        "B",
        "A word-initial morpheme",
        "Free morphemes and prefixes",
        "E",
        "A word-final morpheme",
        "Free morphemes and suffixes",
        "Table 1.",
        "Extended I",
        "OB2 tag set",
        "The goal of morpheme extraction is to identify MDWs and proper nouns in training corpora and prevent them from getting into the morpheme dictionary for POS tagging.",
        "In the present system, the following criteria are applied to determine whether a word in training data should enter the morpheme dictionary.",
        "Completeness.",
        "With a view to the completeness of the morpheme dictionary, all characters in training data will be collected as morphemes.",
        "Word length.",
        "In general, shorter morphemes are more productive than longer ones in word formation.",
        "As such, the length of a morpheme should not exceed four characters.",
        "Word frequency.",
        "By this criterion, a word is selected as a morpheme if its frequency of occurrences in training data is higher than a given threshold.",
        "MDWs.",
        "By this criterion, words formed by morphological patterns such as affixation, compounding, reduplication and abbreviation will be excluded from the morpheme dictionary.",
        "Proper nouns.",
        "In some training corpora like the PKU corpus, some special tags are specified for proper nouns.",
        "In this case, they will be used to filter proper nouns during morpheme extraction.",
        "As shown in Figure l, our system works in three main steps as follows.",
        "_segmented sentence",
        "Morpheme Segmentation U-i",
        "Tag Candidate Generation",
        "Morph dictionary",
        "Scoring & Decoding",
        "Lexicalized HMMs",
        "POS-tagged sentence Figure l. Overall architecture of our system",
        "Morpheme segmentation.",
        "In this step, the FMM technique is employed to segment each word in a sentence to a sequence of morphemes associated with their position tags within the word.",
        "Tag candidate generation.",
        "In this step, all possible POS candidates are generated for each word in the sentence by consulting the morpheme dictionary with its constitute morphemes and their related position patterns.",
        "All these candidates are stored in a lattice.",
        "Scoring and Decoding.",
        "In this step, the lexical-ized HMMs are first employed to score each candidate in the lattice and the Viterbi decoding algorithm is further used to search an optimal sequence of POS tags for the sentence.",
        "The details of lexicalized HMMs can be seen in (Lee et al., 200) and (Fu and Luke, 2005)."
      ]
    },
    {
      "heading": "3. Evaluation Results",
      "text": [
        "The POS tagging task at the fourth ACL-SIGHAN bakeoff consists of five closed tracks.",
        "We participated four of them, namely CKIP, CTB, NCC and PKU.",
        "Therefore our system is trained only using the relevant training corpora provided for the bakeoff.",
        "Furthermore, the morpheme dictionaries for these tracks are also extracted automatically from the relevant training data with the method presented in Sections 2.3 and 2.4.",
        "Table 2 illustrated the number of morphemes extracted from different training data.",
        "Table 3 presents the scores of our system for different tracks.",
        "It should be noted that four measures are employed in the 4th ACL-SIGHAN bakeoff to score the performance of a POS tagging system, namely the overall accuracy (Total-A) and the recall with respect to in-vocabulary words (IV-R), OOV words (OOV-R) or multi-POS words (MTR).",
        "Source",
        "Training data (tokens/word types)",
        "Number of morphemes",
        "CKIP",
        "721551 /48045",
        "30757",
        "CTB",
        "642246 / 42133",
        "26330",
        "NCC",
        "535023 / 45108",
        "28432",
        "PKU",
        "1116754 / 55178",
        "30085",
        "Track",
        "Total-A",
        "IV-R",
        "OOV-R",
        "MT-R",
        "CKIP-O",
        "0.9l24",
        "0.9549",
        "0.4756",
        "0.8953",
        "CTB-O",
        "0.9234",
        "0.9507",
        "0.52",
        "0.905l",
        "NCC-O",
        "0.9395",
        "0.969",
        "0.4086",
        "0.9059",
        "PKU-C",
        "0.9266",
        "0.9574",
        "0.4386",
        "0.9079",
        "Although our system has achieved a promising performance, there is still much to be done to improve it.",
        "First, the quality of the morpheme dictionary is of particular importance to morpheme-based POS tagger.",
        "Although the present study proposed a statistical technique to extract morphemes from tagged corpora, further exploration is still needed on the optimization of this technique to acquire a more desirable morpheme dictionary for Chinese POS tagging.",
        "Second, morphological patterns prove to be informative cues for Chinese POS disambiguation and OOV word prediction.",
        "However, such a knowledge base is not publicly available for Chinese.",
        "As such, in the present study we only made use of certain surface morphological features, namely the position patterns of morphemes in word formation.",
        "Future research might usefully extend the present method to explore systematically more precise morphological features, including morpheme POS categories and morpho-syntactic rules for Chinese POS tagging."
      ]
    },
    {
      "heading": "4. Conclusion",
      "text": [
        "In this paper we have presented a morpheme-based POS tagger for Chinese.",
        "We participated in four closed tracks at the fourth SIGHAN bakeoff.",
        "The scored results show that our system can achieve an overall accuracy of 0.9l24-0.9395 for different corpora.",
        "However, the present system is still under development, especially in morphological knowledge acquisition.",
        "For future work, we hope to improve our system with a higher quality morpheme dictionary and more deep morphological knowledge such as morpheme POS categories and mor-pho-syntactic rules."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This study was supported in part by CityU Strategic Research Grant for fundable CERG (No.",
        "700l879 & 7002037)."
      ]
    }
  ]
}
