{
  "info": {
    "authors": [
      "Janusz Stanislaw Bien"
    ],
    "book": "ACL Microfiche Series 1-83, Including Computational Linguistics",
    "id": "acl-J79-1054",
    "title": "Multiple Environments Approach to Natural Language",
    "url": "https://aclweb.org/anthology/J79-1054",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "heading": "MULTIPLE ENVIRONMENTS l'PROACH TO NATURAL LANGUAGE JANUSZ JTANISLAW bIEN",
      "text": []
    },
    {
      "heading": "Summary",
      "text": [
        "The paper describes a preliminary staltre of authorIP aimed at integrating the 4possible wo\"lr approa,Th with the idea of treating utterances as programs.",
        "It is clnimed that providing sonhisticated facilities for manipulating possible world'' descrintions should be one of the main concerns in designing a natural language understanding system.",
        "The logical notion of possible world\" has a close counterpart in the computer science notion of the environment of expression evaluation.",
        "The idea of treating utterances as programs is generalized by allowing envi-sonmeht ovitr'hing during the evaluation of an utterance.",
        "A model of natural language, based an multiple environments in the sense just mentioned, is outlined in terms of computer science.",
        "A rough classification of environment types is given.",
        "One structure of environments iR de, voted to keeping track of the direct and indirect speech recursive quotations.",
        "Another structure is assigned to every person involved in a discourse or mentioned in it; it is used to handle belief-sentences, lies and promises.",
        "A third type of environment is used to represent the structure of topics in a discourse.",
        "Advantages of the advocated approach, called the multinle environment model of natural language\" are demonstrated in the discussion of well-known problems of vre,f-rence aria, presuppositions.",
        "They have been derived by the author independently (Bien 1975) while explortnP the Davies and IsPrd(1972) approach of treating utterances as programs.",
        "The subject examined in the paper is itself broad and encompasses many controversies;however, it is not the author s intent to make a case for the ideas prsented.",
        "Firstly, the limits of the paper do not permit a proper discussion of the pros and cons for each solution pronosed; and furthemore most of these problems have a triadition dating as far back as the Middle Ages, in some cases.",
        "And seconaiy, the author has not yet developed all of his own concepts fully enough to warrent a detailed presentation.",
        "Insteaa,the paner seeks to present the simplicity and generality of the proposed approach The paner is an enlarged and modified version of a talk delivered at the Fourth International Joint Conference on Artificial Intelligence in Tbilisi.",
        "The modifications envolve mainly the terminology and the form of presentation; the only essential change of some importance is the different treatment of the first and second person pronouns.",
        "Most of the examples in the paper are direct quotations from"
      ]
    },
    {
      "heading": "5",
      "text": [
        "the referenced literature; herein, some are employed somewhat differently than was their original intent."
      ]
    },
    {
      "heading": "2. Discourses as TroKrams, 2 1. Utterances as_Rroveramse",
      "text": [
        "It is now obvious that the human ability to use language is related Closely to intelligence itself.Neverthelesslthe complexitN of hatural language is still rather underestimated by linguists, which results usually in using relatively primitive tools for a formal description of language.",
        "Although such formalisms like e. 6. transformational grammar may be theoretically adequate, from a practical point of view they are too cumbersome; (in my opinion writing a transformational grammar may be only compared with programming a sophisticated system exclusively in an assembly language).",
        "The main merit of Artificial Intelligence for the development of computational linguistics lies in suggesting a quite new way of thinking about language.",
        "It consists in shifting the attention af research from linguistic competence to linguistic perfomance and creating the latter as an operation of a real or imagined language processor, which in turn can be discussed in terms of computer science.Winorad (19722) claims even that the best test of a complex model of natural language is to implement it as language understanding system.",
        "Although he is basically correct, in the present state of",
        "art, the objection posed by Charniak is often valikt.",
        "harniak (1y(2:2) noticed that most programs in Artificial Intelligence handle only a few kinds of selected test examples.",
        "Deciding that a program can be extended in some easily imaginable way to handle more examples or more sophisticated cases reguires practically the same procedure as verifying a non-programmed theory.",
        "Therefore, I treat Winograd's postulate as a long-term aim, and at this moment I advocate a less ambitious strategy: to use as mtUch possible of the computer science intuitions in natural language description.",
        "This is in fact also the approach of Longuet-Higgins (1972) who states that natural language utterances are just programs to be run in our brains.",
        "Some interesting analogies between lahguage understanding and running a POP-2 program have been shown e. g. in (Davies, Isard 1972).",
        "I pursue this approach in another direction, charqcterised by an intensive use of the notion of environment.",
        "In the earlier stage of the inquiry, represented by (Bien 1975), I thought that all the environment manipulations which were necessary for the feasibility of my approach could be realiLed by means of the Bobrow and Ciegbreit multipa environments primitives (1972); therefore, I have introduced the term multiple environments model of natural language .",
        "Now i am not sure of it, because I see reasons to use e. g. cross-world bindings , whose relation to the Bobrow-Wegbreit primitives is not yet clear to me.",
        "Anyway, I still use the term multiple an",
        "vironments model of natural languages because it characterises"
      ]
    },
    {
      "heading": "well my approach even if it is to be understood only metaphor",
      "text": [
        "ically.",
        "It should be noted that considering all utterances as a kind of imperative is not a new idea for linguists; it can be found s. 4. in (Wierzbicka 1969), but to my knowledge such AGeas had no practical impact on linguistic research.",
        "2,2.",
        "The notion o/ alscourse."
      ]
    },
    {
      "heading": "The notion of discourse (called also coherent text) ig a",
      "text": [
        "rather vague one.",
        "I will try to clarify my use of the term by discussing several aspêcts of coherency.",
        "First, there is a type of coherency which I shall Gall textual.",
        "It is realised by these inter-sentence and inter-phrase links which are visible in the text surface as some lexical items or syntactical featu'res.",
        "Surface realisations of these links I shall call pointers.",
        "A simple but very important class of pointers consists of pronouns understood in u broad sense, including pro-adverbs etc.",
        "There are also pointers peculiar to given languages; e. g. after McCawley (197) and Isard (1974) it is reasonable for English to treat the Past tense as a pointer, because (isard 1974) it acts as a form of definite referenne to a past situation on which the attention of the conversants has recently been focussed The presupposttions",
        "often function similarly to pointers, but I think that presuppositions are essentially different from pointers and I prefer to account for them in another way.",
        "A second type of coherency I shall call situational.",
        "The situation of a conversation can influence the coherence of the message in two ways.",
        "First, it can supply values for these pointers which are not assigned by the text itself.",
        "It is the case of e. g. (Isard 1974a)",
        "(1) Be careful, he might bite you.",
        "said while the adressee is near a dangerous animal.",
        "Such an utterance can be easily transformed into a textually coherent one by introducing a narrator.",
        "The second type of situational coherency is more subtlelit consists of applying the addressees knowledge to fill up some relations omitted in the sender s message.",
        "This is needed e* g* in the text (Bellert 1972:79)",
        "(2) Ann's eldest son has left Warsaw for a scholarship study in the Sorbonne.",
        "(3) France is an interesting country to study in.",
        "where the knowledge that the Sorbonne is a French university has to supply the missing link.",
        "In general, a text is situationally coherent only relative to a given domain of knowledge.",
        "In practice we often communicate our ideas by means of non-coherent texts; the communication succeeds only because the addressee modifies his beliefs for the purpose of making the text coherent relative to this updated domain of his",
        "oeliefs.",
        "Because he does it only if he decides more or less arbitrarily, that the message has a meaning, such texts I shall call volitionarilv coherent.",
        "A typical example is a text with a sentence which carries brand new information by means of presuppositions.",
        "The existence of such sentences has been pointed out by Wieraicka (1969), Bellert (1972:79), recently by Karttunen (1974:191) who gave the following examples:",
        "(4) I wou16 like to introduce you to my wife.",
        "(5) We regret that children cannot accompany their parents to commenclment exercises,",
        "where (4) presupposes the existence of the wife and (5) that its complement is true but both sentences are used in situations which do not satisfy these presuppositions.",
        "Tor the sake of completeness it is necessary to mention the situations, Where the text contain pointers without values, but they are considered by the addressee as not relevant to the matter at hand.",
        "This situation seems to happen only in literary texts."
      ]
    },
    {
      "heading": "2.3. Discourse processing0",
      "text": [
        "will discuss below the main levels of discourse analysis.",
        "ignofe discourse generation for two reasons.",
        "First is a",
        "the evaluation of the reanalysis of a generated text.",
        "Second reason is a practical one: at the present state of art we have much better insight into the analysis processes than into the synthesis problems.",
        "According to the present views I take for granted that the analysis consists of a set of cooperating processes performing different task, in particular the syntactic, semantic and pragmatic analysis.",
        "By a level mentioned above I mean a seL, vi such processes which manipulate the notions of similar type, in the intuitive sense of the same degree of abstractness relative to the physical message.",
        "I distinguish four levels.",
        "The level responsible for extracting relevant information from acoustic signal or a visual image I call the sorbtion.",
        "I mention it here only for the sake of completeness as I have nothing to say on this subject.",
        "The second L.vel, uhch lc the only 'joint uf interest of the present paper, I call the interpretation.",
        "I mean lay it the process taking as data the results of sorbtion (of course, it does not mean that the sorbtion is to be executed before the interpretation; the sorbtion should supply partial results on the request of the interpretation) and yielding some value in the formalism used in the system under consideration for the representation of knowledge.",
        "For simplicity I assume here that the knowledge is represented in labelled graphs stored in a",
        "classical way in a PLANNER-like associative data base (Hewit 1971), e.g. the value of the sentence (Charniak 1972:83)",
        "(6) Bill got the ball before he went to the park.",
        "may be something like (7) (Ni BEFORE N2 N3)",
        "It is often assumed that text processing by a language understanding system consists only of those two levels or their equivalence.",
        "I insist on the necessity of two additional levels.",
        "First of them I call judgement.Thi3 io the lc,vol 1c),)Q1-,1:c1e 2o: keeping the beliefs of the system consistent.",
        "As long as trivial worlds are considered, this level can be integrated into some systematically performed uata base bookkeeping When we start to model more complicated worlds, we will face the problem of theoretical ur practical undecidability of bookkeeping problems and therefor this level is to be thoroughly controlled by the system supervisor.",
        "Such a solution agrees with thc tl intuition of Marciszewski (1972:180) that most beliefs are spontaneous and that it is the entertaining of a belief with the awareness of non-accepting that requires a special act of giving up; the suspension of judgement is therefore an act more sophisticated than spontaneous pelief4 The fourth lavel, which I call the integration, should be de12 signed to memorize the facts marked by the judgement level as important enough to be stored.",
        "As far as I know, the inVesti-gation of the problets related to this level has been neglected, the only exceptions being the works of Chafe, in particular (Chafe 1973).",
        "Ambiguities, All the recent works on speech understanding as well as on discourse analysis show that the result of interpretation is as a rule ambiguous.",
        "For particular domains of discourse we often find some particular rules to disambiguate sentences, but the final solution consists, in my opinion, in formalizing and implementing general pragmatic rules, Which I Shall sketch.",
        "below.",
        "The highest priority rule should be the rule of coherency.",
        "It says that this interpretation of a discourse is better which yields as the value the more dense graph.The density of a graph can be computed as e.g. the ratio of graph arrows to the number of nodes; if our grapns are frame structures in the sense of Winograd (1974), we can compute the ratio of the important elements filled up to the important element slots left unassigned.",
        "I feel it is just the rule which chooses properly the referent of the last sentence 'Ishe' in the examples (Charniak",
        "(B) Penny wanted to go to Bill's party.",
        "mother had to tell her that she had not been invited.",
        "(9) When Penny heard about the custume ball she started thinking about What Mother could wear.",
        "Mother had to tell her that she htid not been invited.",
        "In general, the net effect of the coherence Tule will be that ILetimes the reCerents of different noun l'ira‘ce,-.",
        "(nra in gen-Pral, the linguistic 14eans which I call designators) aro collapsed to form one object for the sake of the higher density of the result.",
        "Therefore the rule will also help us to handle p:oesuppositions properly.",
        "We may treat every preupposItion as carrying brand new information and leave for the coherency rule the task of collapsing eventually the presupposed facts with the facts already known by the system.",
        "Second rum I call the consistency rule.",
        "I mean by it the simple but important rule:if one interpretation of hn utterance is incorisistent, look for another Interpretation.",
        "It explains why for the utterance (Russel 1905): (1O) I thought your yacht was larger than it is one should not react by saying (11) No, my yacht is not larger than it is; or why we treat the sentence (McCawley 1J67): (12) Boris said that he didn't kiss the girl who he kissed.",
        "as the information that Boris lied and not that he uttered a non-consisted utterance, The third and most subtle rule which has the lowest priority I call the efficiency rule.",
        "A similar regulation attributed to Quine, can be found in Ajdukiewicz (56:126).",
        "This rule states that if we have to choose between two interpretations of a sentence, and one interpretalion is also the value of a simple sentence, we choose the other interpretation.",
        "Our choice is based on the assumption that the sender was aware of all relevant possibilities and consciously used the more complicated sentence to transmit the message expressible only by this sentence.",
        "For example, althrough I agree with Ajdukiewicz that the sentence (13) Caesar knew that the capital ... lies on the Tiber.",
        "may be interpreted as equivalent to (14) Caesar knew that Rome lies on the Tiber.",
        "on the basis of the efficiency rule I prefer their interpretation of (13) which is equivalent to (15) Caesar knew that Rome lies on the Tiber and that Rome is the capital of the Popes.",
        "Incidentally, in some situations the efficiency rilemay suggest for the sentences siailai to (13) an interpretation analogical to (14).",
        "Let us assume for example that Stanley is solving crosword puzzle and 'las to fill in a pattern specifl.ed 1 clue the river on which lies the capital of the rope3 \" – r knows that Rome is the capital of 4-:-1 ropi:;sbut'he O'oes not",
        "know that Rome lies on the aber.",
        "He may ask John about the name of the riVer and receive the proper answer.",
        "'low, when Sanley is asked by somebody",
        "(16) Have you properly filled in this pattern7 there is a quite natural answer (17) Yes, John said that the capital of the Popes lies",
        "on the Tiber To summarizej think the only solution to the ambiguity problem is the breadth first search in the sense of Charniak (1972:75) with the above-mentioned rules used to evaluate the inter-pretdtions.",
        "It does not mean that I neglect the need fo,12 the rules peculiar for particular discourse domains.",
        "They are necessary for efficiency of the interpretation process and they should drive the searchlbut they may not be allowed to override any interpretation, as is the case in the Wilks preference grammar.",
        "For the sentence (Wilks 1974:32) (18) The hunter licxed his gun all over, and the stock tasted especially good, the real world knowledge would probably cause the interpretation with the \"soup'' sense of stock to be found first,but the coherency rule would properly choose the interpretation where stock is understood as a part of the gun.",
        "tac-toe of Isard (1974), Joshi and Weischedel (1973).",
        "In the linguistic literature one can easily find the ideas of possible worlds used to handle the modal concepts,but more subtle possible worlds classifications was disoussed, to the best of my knowledge, only by Lakoff (1968) and Morgan (1969).",
        "My claim is that we need a very sophisticated classification scheme for the possible worlds features.",
        "A set of facts to which I assign the same ontological status I will call environment.",
        "The term is borrowed from computer science, where it means all variables accessible from a givell program point together with their values.",
        "My use of the term is justified by the fact that the access to the system memory is ussually performed by matching a pattern against an associative data base, resulting in binding the free variables of the pattern to some values found in the memory; access to different environments in the sense defined above may result in different binding of the variables, which is also the case with the",
        "For the purpose of the present paper environments can be thouLfat of aJ :,1Absets of a DIJNITER-like data base wi.th contens specified by some filters in goal statelents.",
        "In relit 7 such an implementation would probably be inefficient and therefore it it5 necessary to look for another solutLon, stathng with the notion of context in Conniver (Sussman, McDermot 1972) and QA4 (Rulifson et al. 1972).",
        "The crucial point of the presented approach conJists in allowing quite complicated access environment structures, to stress this fact use the te2m environmentb% Person environments.",
        "A sophisticated language understanding system has to take into account the fact that some other beings also have the ability to use natural language, to remember events, to make inferences etc.",
        "For the sake of simplicity any real or fictious being capable of using a natural language will be called a person.",
        "Practically, persons will be either humans, engaged in a discourse with the system or humans mentioned in such a discourse, but we can mean by persons also another language understanding systems and robots, persofinications of an'imals from children tales, etc.",
        "In the lack of arguments to the contrary, the system will assume that the language using abilities of other",
        "to Frank; the interpretation ot (21.2) is done by the recursive call to the language processing routine in the environment of Frank.",
        "The mention of John yields the environment of John,which is embedded in the environment of Frank; therefore from the point of view of the system, it is the environment of John as described by Frank.",
        "This person environment has the pronoun",
        "I'' preset as usual to the respective person and the pronoun you' is set to his current interlocutor, i,.",
        ".",
        "Frank.",
        "The sentence (21.3) and other sentences reported by Frank as said by John are interpreted in this environment.",
        "P!Illtiple person environments allow the system to keep track of lifferenceu in person's knowledge, which has importance for nany reasons.",
        "For example, it is difficult to account for the use of the indefinite noun phrase in (22.5) in the text (Charniak 1372:185):",
        "(22.1) Jack and Bill were outside flying a kite.",
        "(22.2) A strong wind came by and the string broke.",
        "(22.j) Janet and Alice were4out:73ide,iie house.",
        "(22.4) Janet looked up and said: (22.5) Look Alice, there is a kite flint;",
        "without arating the knowledge of the narrator and the addressee from the knowledge of Janet.",
        "By keeping track of the knowledge and beliefs for every person in the discourse, we are able Lo give an obvious explanation for the difference between factual and non-tactual sentences, e. g. (Kiparsky 19711345):",
        "(23) John regrets that it is raining.",
        "(24) John thinks that it is raining.",
        "In th first case it is the environment of the addressee vitich is affected oy an evaluation of the phrase is rainine.",
        "According to our treatment of presupposition, the value of that",
        "20 phrase is added to the environment of thc addressee, 'here eventually may bE collapsed with another mention of the rain An analogical process is independently performed in the onvi ronment of John.",
        "in the second case it is exclwively the environment of John which is affected by the evaluation of the phrase A it is raining , while the addre::ees environment remains unchanged.",
        "As has been pointed out by Morgan (19o9) it is not true that non-factual sentences have no presuppositions.",
        "It can be easily seen in the following text: (25.1) John thought the door is open.",
        "(25.2) He thought he should open it",
        "which is inconsistent in the same way as the text (2b.1) The door was open.",
        "(26.2) John went to open it.",
        "The difference between (25) and (26) consists in the environment to which the presupposition refers: the real world or the mind of John.",
        "It should be noted thdt the class of non-factual sentences and phrase is much larger than is usually assumed.",
        "For example, in the text (Charniak 1972:191)",
        "(27.1) Jack and Bill were outside flying a kite.",
        "(27.2) A strong wind came by and the string broke.",
        "(27.3) Janet and Alice were outside the house.",
        "(27.4) When Janet looked up she saw a kite.",
        "a kite of (27.1) and (27.4) in reality refers to the same object, but in (27.4) it is referred again by means of the indefinite noun phrase to mark Janet's ignorance about Lt. TO may easily account for it by evaluating this noun phrase only in the environment oi Janet.",
        "Some cases involving non-factual interpretations of phmses and sentences have been discussed by logLciags nnd philoo-phers under the name of intentional (spelled with *t1 ) or Intensional (spelled with ''s\") verbs, e. g. (Montague 1W3):",
        "(28) John look e for a unicorn.",
        "intensional sentences, e. g. (Ajdukiewicz 1959): (29) Caesar knew that the capital of the Republic lies on the Tiber.",
        "or belief-sentences, 3. g. (Parte - ): (33) 73m beli7;vs that you an I are sisters.",
        "All these cases can be easily handled by means of multiple tnvironments."
      ]
    },
    {
      "heading": "10 Impression environments,",
      "text": [
        "rn the above discussion of persons we have assumed that exactly one environment is assigned to every person.",
        "There are several arguments for splitting this environment into at least three mvironments, which I call the environments of behaviour, 'pretense and knowledge, Distinguishing the pretense environment from the knowledge one is necessary to handle the cases of lying, e. g.",
        "(31) Fred is lying when he says he likes Stanley's book.",
        "we interprete as meaning (32) Fred likes Stanley's book.",
        "in the Fred's pretense and as 03) Fred does not like Stanley's book.",
        "in the Pred4s belief.",
        "This distinction allows us also to handle the performatives along the lines of lsard (1974a), i. e. the sentence (34) I bet you 2.5 p that it will rain tomorrow.",
        "is taken to be true, because uttering it changes the respectiv pretense (which is equivalent to nctIon of point of reference used by Isard) and the judgement durin,; the comparison of the value of (34) with the content of respective person environment founds them compatible.",
        "The distinction between behaviour and pretense is more dis-cutable, as it yields subtlety not needed in most applications.",
        "It is useful to handle e. b. slips of tongue and to distinguish different a.pects of what is said (Ziff 1972).",
        "To account for such linguistic facts like e. g. the accept",
        "ability of (35) John wants to catch a fish and he intends to eat it.",
        "and the non acceptability of (36) John intends to catch a fish and he wants to eat it.",
        "it is necessary,following Lakoff (68:7) to introduce additional",
        "environments,namely the environment of desires and the environment of intentions.",
        "The word \"knowledge' in the term knowledge environment\" is not to be understood literally.",
        "In fact it describes the knowledge attributed to somebody on the evidence of its behaviour, statements etc.",
        "This justifieu using the term impression environments to cover all the environments assigned to a person.",
        "'.4.",
        "Choosing an environment.",
        "From the preceeding paragrapn it follows that during discourse analysis we have usually several environment 6 at hand.",
        "Every phrase is to be interpreted in at least one environment.",
        "This poses the problem of choosing the proper environments for the interpretation of a given phrase.",
        "7le will see that there exist several strategies to handle the problem, which differ in the amount of computational resources (time and memory) used this fact may be considered to be the analogue of the human ability to change the amount of attention devoted to discourse undre standing.",
        "Let us imagine a highly sophisticdted computer-aided instruction system.",
        "During a teaching session with a student the system models its interlocutor by means of a person environment, composed of the behaviour environment (used e.. to the student response time), the pretense and the knowledge",
        "environments.",
        "The knowledge environment is preset to some general knowledge and it is systematically updated by .,e analysis of student utterances.",
        "Ef We do not exclude the po sibility that the student lies, we should interprete them directly in his knowledge environment.",
        "In any cFIL-e,the Fretense is useful to store the results of such performatives as student's definitions of symbols etc.",
        "If the student quotes a manual or a lecturer, it is necessary to create a new person environment and to evaluate the whole quoted passage in it '.Then the system is going to say somethilig to the student, it ,faould verify wh,ther the utte-2a::,- - atudent.",
        "The verification is made by running its utterance in the student's environment, which allows it to compare the real intention (4, its utterance with the intention probably assigned to it by student.",
        "To be more strict, in the student's environment the environment of the system as imagined by the student should be created, and the utterance run in the pretense of it; the results should be compared with the results of running the utterances in the proper pretense of the system.",
        "Opviously,this is a complicated and resource consuming process, difficult to carry on with reasonable efficiency.",
        "Newertheless, I think that processes performed in the mind of a talented teacher working at full capabilities must be similar.",
        "Let us now take an example from the other extreme, when the system works according to the reliability rule • It may be the 25 system from our first example during a session of knowledge acquisition when discussing a subject with a teacher.",
        "Now it is quite possible to introduce all the information directly to the knowledge environment of thu cyr,tem, '1119.1.3 credouply accepting everything what is said, It is evidently quite easy both for humans and computers, in practice humanJ apply this strategy mainly when they are forced to devote most of their computational power to other tasks of a higher priority.",
        "Between these two extremes there exist many mixed strategies, where the system for every person of the discourse makes an independent decision, whether or not to create a new environment, based both on the reliability of the person and the availability of resources."
      ]
    },
    {
      "heading": "3.5. Topic environments.",
      "text": [
        "The usual way of handling the reference problem is to compute for every noun phrase or pronoun a separate list of possible referents and to use some heuristics to choose one element from the list.",
        "Another approach, advocated here, consists in storing all possible referents permanently available into a special topic environments.",
        "The items stored in the topic environments may be the symbols of physical object as well as some relations and other semantic data structures, put there during the aval.",
        "26 uatian of respective, linguistic constructs.",
        "In particular, the indefinite descriptions of the type (Bellert 197?.",
        ":32)",
        "(37) It is a foreigner who is delivering aspeec.a now.",
        "(38) One young boy has flunked his matriculation exam.",
        "are inteppreted as declarations, used to create appropriate data structures to be put into the topic; therefore we do not need the Ref operator of Bellert (1972:3 ) introduced to handle such examples.",
        "In every topic environment the items are rdered in some way; the access routine yield: en request the subsequent elements of the topic in the very order; if the environment is exhausted and some new candidate for a referent is needed tae aces routine switches to the respective super-environment.",
        "Every succesful access to the topic cauEes its permutation,which results in making the accesued item the first element of the environment.",
        "The essential difference between tl!e traditional approach and that presented here lies in the possibility o' stricturing a topic environment.",
        "For example (Isard 1974a), in the text: ()9.1) What did John say about Dick?",
        "(39.2) He said that (39.3) he looked like a arunken gLraffe on ite skates.",
        "there is no doubt that 1\\14' of (39.3) refers to Dick.We account for it in the following way: every first use of a vero of the",
        "t(verbum dicendi type causes a new topic environment to be created; the environment is initialised, in our case to Dick and then itself becomes an item of the current topic, Tne next mention of that act of communication cawes the seerch in the current topic for the environment previously stored; when it is found, the reported clause is interpreted within it.",
        "Tn our case the first word of the reported clause is the pronoun which calls the access routine for a possible referent.",
        "/W he first and only possible referent of the current topic is Dick( the pronoun is properly bound.",
        "In the case of the text",
        "(40.1) What did John say about niclr?",
        "(40.2) He said that (40.3) iae doubted whether .Dick would like it.",
        "tae pronoun will be also at first bound to Dick from the topic But when tne proper name 'Dick° will be evaluated, an attempt will be made to shift Dick to the first position in the topic where it already is located.",
        "This is a violcItion of the eifi-ciency rule, and this interpretation will •e rejected.",
        "Next possible refrent will then be obtain from the super-environment yielding the correct result.",
        "There are some exceptions to the efficiency rule; in particular redundancy is desirable immediately after topic switching: (41.1) What did John say about Dick?",
        "(41,e) He said that (0.3) Dick looked like 8 drunken girdife on e",
        "Another aro.unent for topic Lt ucturinc;l tile existence cf conversation, Loticed e. g. by Chtarniak (107 :106): (42) JRnet, Bill and Bill' ister melon were outside.",
        "Janet ElaidT cant keep this kitten.",
        "Would you like to hive itt Helen?",
        "• Yes , said Helen.",
        "Bill said I don't 4low.",
        "Remember how 1;:other objected to that robin.",
        "_-)ae would not let us keep it , .",
        "hut T1,other :,aid it is not good to keep a robin indoors,' said helen.",
        "It is not \\ fair to the robin Look, said Janet, D., you want it or not?.",
        "At this stage the topic problem is the least elaborated part of my multiple environments approach;therefore I am not aole to go into deilAils here.",
        "Some additional argument in favour of the topic environment ideas will be found in the paragraph 4.2.",
        "40 Running an utterance, AJ.ILittsilaltawas.",
        "By designators I understand the linguistic means used to refer to particular objects.",
        "Designators may be classified roughly into three classes; proper names; common names and description.",
        "All three kinds of designators have been discussed for centuries by philosophers and logicians; our pragmatic approach to the designators is based mainly on the works of Kripke (1972) and",
        "Donnellan (1971).",
        "The characteristic feature of proper names is that their use must be preceded by the act of fixing thoreference.",
        "Contrary to popular opinion, in practice proper names ate much more ambiguous than common names 1 because propeTnames refer to individuals and common names to classes of individuals.",
        "For example, there are many men called John and if we are to understand e. g. (43) John has come.",
        "we need to have the referent of John already fixed.",
        "Different types of object have proper names of different stability.",
        "Countries, towns, mountains etc.",
        "have often unique names which are rarely changed.Most human full names are also rather stable from the practical point of view.Forenames are so ambiguous that their referents have to be reset again and again in every discourse, e.g. by quoting the full hame of the person in question.",
        "Such proper names as first and second person pronouns may alternate their meaning even during one discourse.",
        "To sumarize, proper names in fact name some recognition routine supplied in the act of fixing the reference.",
        "Common names do not refer directly to individuals, but they are names of characteristic functions of the respective sets of individuals;their meaning is so stable that they can be assumed to belong to the knowledge of the world; and therefore, fixing the reference, except in some peculiar cases, need not be",
        "Descriptions are compound names constructed ad hoc by special linguistic means, like qualifying n common noun by an adjective etc.",
        "They name also respective compound chnraoteristic functions.",
        "All the designators are usually used in the referential way.",
        "That means that the respctive procedure is evaluntLd in a proper environment to yield the intended referent.",
        "Such treatment agrees in particular with Donnellan's intuition that a definite description does not in itself refer to anything but only its use points to a referent.",
        "Therefore, we may explain easily why the sentence (Donnellan 1971:110): (44) Her husband is kind to her.",
        "can be sometimes properly understood even if the man refered to is not the husband of the woman, such a sentence is just to be evaluated in the environment of false belie 3 of the sender.",
        "Quite often the sender uses underspcified descriptions, i. e. the descriptions which refer to a much larger set of individuals than it is intended, e. g. in Charniak (1972:72):",
        "(45.1) Mother made some cookies and left one an a plate.",
        "(45.2) She put the plate on the kitchen table and went into living room.",
        "\"the platel of (45.2) by itself refers to every plate of the world.",
        "The addressee has in such situations to restrict the respective",
        "characteristic function to the object on his current topic; if it does not suffice, he need to eliminate the remaining ambiguities in the usual way, i. e. by means of the coherency, consistency and efficiency rules.",
        "All designators except pronouns can also be use in an attributive way.",
        "In this case they mean just their characteristic functions.",
        "For example",
        "(46) Mount Everst is Chomolungma.",
        "means that in the sender's beliefs the characteristic function of Mount Everest has as well all relevant matures of Chomolungma.",
        "In some other usage the respective characteristic function is to be adapted by the addreeo to tile nt of tile + ••• J 9 • • (47) He is a little Napoleon.",
        "More common is attributive use of common names and descriptions, g. (48) The Smith's murdered is insane.",
        "in the sense of (49) Whoever has murdered Smith, he is insane."
      ]
    },
    {
      "heading": "Attributive use of indefinite descriptions is also 'mown as",
      "text": [
        "nonspecific setting , e. g. (Charniak 1972:178) a kitten in (50.",
        ")- .",
        "(50.1) Jack wanted a kitten.",
        "(50.2) Bill had a kitten and Jack offered to trade his ball",
        "for the kitten.",
        "(50.3) Bill wanted to keep his kitten, so Jack went to look for George who also had a kitten.",
        "(50.4) George was willing to trade so Jack got his kitten.",
        "It is interesting that the SHRDLU program (Winograd 197) treat indefinite descriptions,which are used only attributively, e. g. (51) pick up a big block (52) find a block which is taller than the one you are holding ana put it into the box just along the lines given above, i. e. as programs with a free variable (Winograd 1972:130), although Winograd himself de-stribes it, probably influenced by the logical tradition, by means of the variable bound by the existential nuantifier (1972:i26).",
        "The characteristic feature of proper and comon nouns Is that they are always to be run in a single environment.",
        "It is not the case with descriptions which may require suitable splitting between several environments.",
        "It has been noted by Winograd (1972:147) with respct to the time reference, e. g.: (53) Many rich men made their fortunes during the depression.",
        "(54) Many rich men lost their fortunes during the depression.",
        "(55) Many rich men worked in restaurants during the depression.",
        "In these sentences the °rich men'' phrase is to be evaluated in the present time environment for (53), in the past time envi",
        "brother and the friend of Kowalski's brother and Smith knows that the friend of Kowalski's brother is a writer, Obviously, the interpretations (57) and (58) differ in the way the phrase rtthe friend of Kowalski's brother is split between the environments of the knowledge of the sender and the knowledge of Smith.",
        "ince we allow designators to switch environments, we have no problem with so called nouns with empty denotdtion ; they are to be evaluated in the respective fictitious worlds, e.g. (59) I met him in tine park by the sculpture of a faun.",
        "4;2.",
        "Pointers.",
        "In this paragraph we shall discuss the reference problem for the third person pronouns,the most important class of pointers.",
        "_54 We shall formulate a rule intended to substitute the tcommand rule af the transformational grammar.",
        "The arguments in savour of our rule are simplicity, better adequacy and use of tho demon facility whicn should be present in the system for other reasons (Charniak 1972).",
        "First, we shall remind that every accesn to the topic permuted it by advancing the accessed element to the very beginnjng of the topic; succesful evaluation of a designator introducing 4 new object puts the repreentation of the object also at the very beginning of the topic.",
        "Our rule states that the main clause pronouns immediately execute access to the while the evaluation of subordinate clause pronouns may be suspnded if tliere no suitable value for them In the topic; all the pronouns should be resolved be on the cnc the main clause processing.",
        "Let us see how the rule works for examples from (McCawiey 1L,A(t:226).",
        "(60) kfter John left his apartment, he went to the pool hall.",
        "The proper name I\\John\" advances the Jonn's representation at the beginni4g of the topic.",
        "The pronoun \"his is evaluated because there is at least one suitable value in the topic, i.e. John ; if bounding of \"his\" to John is rejected by some pragmatic rule, another possible referent is found, t'ne'' is set to it and the referent is advanced at the beginning of the topic, getting ahead of John • When ''he't is evaluated,",
        "it is usually bound to the same referent as his\", which may be John or some other person.",
        "(61) After he left his apartment, John went to the pool hall.",
        "'‘After\\k introduces a subordinate clause, which may be sus-1k, .l .",
        "pended if there is no rluitable value for 'the\" or rs In the topic; if the clause is suspended, it can be resumed when evaluation of Joh.1 puts its value to the topic.",
        "(62) John went to the pool room after he left is apartment.",
        "There is no problem with the sentence; Johnlk sets the topic supplying a possible value for \"he\" and (63) He went to the pool hall after John left his apartment.",
        "The \\'he\" is evaluated immediately; therefore the evaluation of Johnl■ cannot influence its value.",
        "The strong feeling that the value of 4 he' should be different from John is explained as the violation of the efficiency rule: if you can refer to an object by a pointer and there is no possibility of misunderstanding, do not refer to it by a designator.",
        "(64) A boy who saw her kissed a girl who knew him.",
        "I am anxious to see a sentence of this type in an authentic English text, not as an example of areference problem, because I do not see any circumstances under which such a sentence can be uttered.",
        "None the less, we can handle the example easily.",
        "First, 'La boy\" is is evaluated,yielding a person environment which is put into the topic.",
        "Next,ft who saw her\" is evaluated except 36 for the her because of the lack of a suitable value for It in the topic; therefore , the clnuse ir uspended.",
        "Then the rest of the main clause is evaluated and the person environmant for R girl is created, resulting in an updating of the topic.",
        "Now the suspended clause can be resumed and evaluated in parallel with the clause who knew hie; all the pronouns will be properly bound.",
        "Although it should be obvious, it i.s better to state explicity that the value of his in (60)-(63) is finally fixed by the coherency rule.",
        "Analogically as with subordinate clauses, we can treat paren-thethical clauses and phrases, e. g.: (65) In John's apartment, he smokes pot.",
        "(66) In his apartment, John smokes pot.",
        "and obtain the desired results."
      ]
    },
    {
      "heading": "4.). Presuppositions.",
      "text": [
        "It is hoped that the above discussion together with works of Isard, Davies and Longuet-Higgins has shown the advantage of treating discourses and utterances as programs.",
        "Below we give an additional argument in favour \"of'this approach, based on an article by Karttunen (1974).",
        "He presented difficulties related to finding the presupposition fOr a compound sentence and suggested they b'e avoided by adopting the more dynamic approach",
        "of a recursive verification of the satisfaction of presupposi-tion\" condition.",
        "This idea can be easily integrated in our model, as it is test illustrated from 'th-e examples",
        "(67) If Dean told the truth, Nixon is guilty too.",
        "(68) If Haldeman is guilty, Nixon is guilty too.",
        "(69) If Miss Woods destroyed the missing tapes, Nixon is guilty too.",
        "The consequent clause in all of these presupposes the guilt of someone else, but the presupposition of the 1ho1e sentences differ: (b8) definitely does not prc;:appo uuLlt onn Llue whilc (67) and (69) may presuppose it or not,depending upon the circumstances of their use.In our model the antecedent clauses are run before the consequent clause, therefore in (68) the presupposition of the consequent clause is satisfied by the antecedent and in (61) and (69) it can also be the case, depending upon the other knowledge available, in the environment of the evaluation.",
        "Conclusions, Even if some of the presented ideas may become obsolete throught further research,the usefulness of the sophi,,6J.uated environment structures for natural language descriptions seems evident.",
        "The notion of environment deserves a place as a crucial notion in a fully adequate theory of natural language.",
        "It is important that the environment structures postulated here involve quite complicated embedding of environments without any static restrictions on the depth of the embedding.",
        "At the present state of art, it is convenient to describe such structl:Ires in terms of computer science, because e. G. tormal icc i o _c, only mucll 1pL3i-1.a!.oLK71 bctween different po:Icible worlds.",
        "This fact, together with some other advantages shown in the pap, makes a strong argument in favour of treating discourses and utterances as programs."
      ]
    },
    {
      "heading": "MICROCOPY RESOLUTION TEST CHART NATIONAL BUREAU OF STANDARDS-1,63-A",
      "text": []
    }
  ]
}
