{
  "info": {
    "authors": [
      "Tsutomu Fujinami"
    ],
    "book": "Workshop on Spoken Language Translation",
    "id": "acl-W97-0413",
    "title": "Combining Situated Reasoning With Semantic Transfer Minimally",
    "url": "https://aclweb.org/anthology/W97-0413",
    "year": 1997
  },
  "references": [],
  "sections": [
    {
      "heading": "1 Overview",
      "text": [
        "With extralinguistic information, the quality of translation will be improved and the problem of translation mismatches can be solved.",
        "The difficulty lies, however, in that the sources of such information are unlimited and not always available.",
        "Our solution is to define translation rules as modular as possible and control application of rules with background conditions so that the best rule in the context should be chosen."
      ]
    },
    {
      "heading": "2 Viewpoint and honorifics",
      "text": [
        "We consider as an example how the translation of sentences containing 'give' is defined in our approach.",
        "For the English verb, 'give', there are at least four possible translations in Japanese: `lcureru', gcudasaru', `ageru', and `sashiageru'.",
        "`kureru' is used when the event is described from receiver's point of view (pov) while `ageru' is used when the event is described from giver's point of view.",
        "`lcu-dasaru' is a honorific form of `kureru', where the giver stands in higher position than the receiver.",
        "Both `lcureru' and `lcudasaru' can only be used when the giver is not the first person, typically the speaker in our domain.",
        "`sashiageru' is a honorific form of `ageru', where the giver stands in lower position than the receiver.",
        "Both `ageru ' and `sashiageru' can only be used when the receiver is not the first person, say, the speaker.",
        "Figure 1 depicts the translation relation between 'give' and { `kureru', qvudasaru', `ageru', `sashiageru'}.",
        "The rule at the top node, `ageru' .4#.",
        "'give', is the default translation rule translating `ageru' to 'give' and vice versa independent of any background condition.",
        "From here downwards, the items of information considered in background increase.",
        "Moving down leftwards, for example, if the viewpoint is at the receiver and the giver is not the first person, then the rule, `kureru ' 4.).",
        "'give', is applicable."
      ]
    },
    {
      "heading": "3 Semantic transfer",
      "text": [
        "Translation rules are applied to part of representations.",
        "To make `ageru' and 'give' interchangeable, a rule such as ageru(E) give(E) is suffice, where E is an event.",
        "For better translation, however, more elaborated rules are required.",
        "The below four rules define the cases where 'give' is to be translated to either The work was funded by the German Federal Ministry of Education, Science, Research and Technology (BMBF) in the framework of the Vebmobil project.",
        "`kureru', `kudasaru', `ageru', or `sashiageru'.",
        "The terms inside {} specify background conditions for the rule to be applicable.",
        "The negation, works as negation-by-failure.",
        "give(E), {giver(E,G), (1) kureru(E) <#.",
        "receiver(E,R), pov(R), – ispeaker(G)} give(E), {giver(E,G), receiver(E,R), pov(R), --ispea.ker(G), G>R} give(E), {giver(E,G), ageru(E) .4* receiver(E,R), pov(G), --speaker(R)} give(E), {giver(E,G), receiver(E,R), (4) sashiageru(E) <=> pov(G), ---,speaker(R), G Observe that the background condition of (2) subsumes that of (1).",
        "Since our translation strategy chooses the best match rule in the context, if the condition of (2) is satisfied, the rule (2) is chosen although the condition of (1) is satisfied, too.",
        "The honorific expression is thus adopted prior to the normal one when translation is performed from English to Japanese.",
        "The same goes for the rules, (3) and (4).",
        "If no rule satisfies the background condition, the simplest rule, ageru(E) <#.",
        "give(E), is chosen as default."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "Rules are defeasible in that a rule can be overridden by another more appropriate in the context even if the rule is still applicable.",
        "This property, on the one hand, allows us to import our knowledge in machine translation into speech-to-speech translation as default and, on the other hand, enables us to improve incrementally the quality of translation by adding to the rule-base the rules applicable only in particular contexts as more sources of information are made available to the system."
      ]
    }
  ]
}
