{
  "info": {
    "authors": [
      "Ha Trinh",
      "Annalu Waller",
      "Keith Vertanen",
      "Per Ola Kristensson",
      "Vicki L. Hanson"
    ],
    "book": "Proceedings of the Third Workshop on Speech and Language Processing for Assistive Technologies",
    "id": "acl-W12-2904",
    "title": "Applying Prediction Techniques to Phoneme-based AAC Systems",
    "url": "https://aclweb.org/anthology/W12-2904",
    "year": 2012
  },
  "references": [
    "acl-D11-1065",
    "acl-P10-2041"
  ],
  "sections": [
    {
      "text": [
        "It is well documented that people with severe speech and physical impairments (SSPI) often experience literacy difficulties, which hinder them from effectively using orthographic-based AAC systems for communication.",
        "To address this problem, phoneme-based AAC systems have been proposed, which enable users to access a set of spoken phonemes and combine phonemes into speech output.",
        "In this paper we investigate how prediction techniques can be applied to improve user performance of such systems.",
        "We have developed a phoneme-based prediction system, which supports single phoneme prediction and pho-neme-based word prediction using statistical language models generated using a crowdsourced AAC-like corpus.",
        "We incorporated our prediction system into a hypothetical 12-key reduced phoneme keyboard.",
        "A computational experiment showed that our prediction system led to 56.3% average keystroke sav-ings.",
        "1 Introduction Over the last forty years there has been an increasing number of high-tech AAC systems developed to provide communication support for individuals with severe speech and physical impairments (SSPI).",
        "Most of existing AAC systems can be classified into two categories, namely graphic-based and orthographic-based systems.",
        "Graphic-based systems utilize symbols to encode a limited set of frequently used words and utterances, thereby supporting fast access to pre-stored items.",
        "However, there is a high cognitive overhead associated with learning the encoding methods of these systems, which can be problematic for many AAC users, especially those with intellectual disabilities.",
        "In addition, users of these systems are limited to preprogrammed items rather than being able to create novel words and messages spontaneously.",
        "In con-trast, orthographic-based AAC systems allow users to spell out their own messages.",
        "Prediction tech-niques, such as character or word prediction, are often applied to improve the usability and accessibility of these systems.",
        "However, these systems require users to master literacy skills, a well-documented problem for many children and adults with SSPI (Koppenhaver and Yoder, 1992).",
        "The question arises as to how AAC systems can be designed to enable preliterate users with SSPI to generate novel words and messages in spontaneous conversations.",
        "A potential solution for this question is to adopt a phoneme-to-speech generation approach.",
        "This approach allows users to access a limited set of spoken phonemes and blend phonemes into speech output, thereby enabling them to create spontaneous messages without knowledge of orthographic spelling.",
        "This approach has been applied in several phoneme-based AAC systems to support communication (Glennen and DeCoste, 1997) and literacy learning (Black et al., 2008).",
        "It has also been utilized as an alternative typing method for people with spelling difficulties (Schroeder, 2005).",
        "Despite such potential, phoneme-based AAC systems have been an under-researched topic.",
        "In particular, little work has been done on the application of Natural Language Processing (NLP) techniques to these systems.",
        "Thus, in this paper we investigate how prediction methods can be incorporated into phoneme-based AAC systems to facil",
        "itate phoneme entry.",
        "We develop a basic phoneme-based prediction system, which provides predictions at both phoneme and word levels based on statistical language modeling techniques.",
        "We use a 6-gram phoneme mixture model and a 3-gram word mixture model trained on a large set of AAC-like data assembled from multiple sources, such as Twitter, Blog, and Usenet data.",
        "We take into consideration issues such as pronunciation variants and user accents in the design of our system.",
        "We performed a theoretical evaluation of our system on three different test sets using a simulated interface and report results of hit rate and potential keystroke savings.",
        "Finally, we propose a number of further studies to extend the current work.",
        "2 Background 2.1 Phoneme-based AAC Systems The idea of using phonemes in AAC systems was first commercially introduced by Phonic Ear in 1978 in the HandiVoice 110 (Creech, 2004; Glennen and DeCoste, 1997; Williams, 1995).",
        "The device provided users with direct access to a mixed vocabulary consisting of preprogrammed words, short phrases, letters, morphemes, and 45 pho-nemes.",
        "Users could generate synthetic speech from phoneme sequences using the Votrax speech syn-thesizer.",
        "Similar to the HandiVoice is the Finger Foniks, a handheld communicator developed by Words+ (Glennen and DeCoste, 1997).",
        "The device enables users to access prerecorded messages and a set of 36 phonemes from which they could generate unlimited speech output.",
        "Neither of these devices offered any prediction features.",
        "The PhonicStick?, a talking joystick (Black et al., 2008), is a phoneme-based AAC device developed by researchers at the University of Dundee.",
        "Unlike the HandiVoice and the Finger Foniks, the primary use of the PhonicStick?",
        "is to facilitate language play and phonics teaching for children with SSPI.",
        "The device allows users to access the 42 phonemes used in the Jolly Phonics literacy program (Lloyd, 1998) by moving the joystick along predefined paths.",
        "A prototype of the Phon-icStick?, using a subset of 6 Jolly Phonics?",
        "pho-nemes, has been evaluated with seven children without and with SSPI.",
        "Results of the evaluations demonstrated that the participants could create short words using the phonemes.",
        "However, some participants with poor hand function experienced significant difficulties in using the joystick to select target phonemes (Black et al., 2008).",
        "This suggests that the PhonicStick?",
        "could benefit from prediction mechanisms to reduce the number of difficult joystick movements required for each phoneme entry.",
        "The phoneme-to-speech approach is not only applied in dedicated AAC systems but also in alternative typing interfaces for individuals with spelling difficulties.",
        "An example of such applications is the REACH Sound-It-Out Phonetic Keyboard?",
        "(Schroeder, 2005).",
        "This on-screen keyboard comprises 40 phonemes and 4 phoneme combinations.",
        "It offers two types of prediction features, including phoneme prediction and word prediction.",
        "The phoneme prediction feature uses a pronunciation dictionary to determine which phonemes cannot follow the currently selected phonemes.",
        "These phonemes are then removed from the keyboard, thereby facilitating users in visually scanning and identifying the next phoneme in the intended word.",
        "The word prediction feature also uses a dictionary to search for the most frequently used words that phonetically match the currently selected phoneme sequence.",
        "To our knowledge, this is the only currently available system that provides phoneme-based predictions.",
        "However, these predictions use a simple dictionary-based prediction algorithm, which does not take into account contextual information (e.g. prior text).",
        "There has been little or no published research into how more advanced NLP techniques can be employed to improve the performance of phoneme-based predictions.",
        "2.2 Prediction in AAC Systems Prediction techniques have been extensively utilized in many AAC systems to achieve keystroke savings and potential communication rate enhancement (Garay-Victoria and Abascal, 2005).",
        "There are various prediction strategies that have been developed in these systems, of which the most commonly used are character prediction and word prediction.",
        "Character prediction anticipates next probable characters given the preceding char-acters.",
        "It is typically applied in reduced keyboards and scanning-based AAC systems to augment the scanning process (Lesher et al., 1998).",
        "Word prediction anticipates the word being entered on the basis of the previously selected characters and",
        "words, thereby saving the user the effort of entering every character of a word.",
        "Most existing prediction systems employ statistical language modelling techniques to perform prediction tasks.",
        "Prediction accuracy generally increases with higher-order n-gram language mod-els.",
        "However, most systems are limited to 6-gram models for character prediction and 3-gram models for word prediction, as the gain from higher-order models is often small at the cost of considerably increased computational and storage resources.",
        "To further improve the prediction performance, a number of advanced language modelling techniques have been investigated, which take into account additional information such as word recency (Swiffin et al., 1987), syntactic information (Hunnicutt and Caarlberger, 2001; Swiffin et al., 1987), semantic information (Li and Hirst, 2005), and topic modelling (Trnka et al., 2006).",
        "These techniques have the potential of improved keystroke savings at the cost of increased computational complexity.",
        "A fundamental issue of the statistical-based prediction approach is that its performance is heavily dependent on the size of the training corpus and the degree to which the corpus represents the domain of use.",
        "Therefore, in the development of sta-tistical-based prediction for conversational AAC systems, it may be ideal to construct language models from a large corpus of transcribed conversations of real AAC users.",
        "However, such a corpus has been unavailable to date.",
        "To address this prob-lem, previous research has utilized corpora of telephone transcripts, such as the Switchboard corpus, and performed cleanup processing to make them a more appropriate approximate of AAC communication (Lesher and Rinkus, 2002; Trnka et al., 2006).",
        "Vertanen and Kristensson (2011) have recently proposed a novel solution to this problem by creating a large corpus of fictional AAC messages.",
        "Using Amazon Mechanical Market, the researchers crowdsourced a small dataset of AAC-like mes-sages, which was then used to select a much larger set of AAC-like data from Twitter, Blog, and Usenet datasets.",
        "The language models trained on this AAC-like corpus were proved to outperform other models trained on telephone transcripts (Vertanen and Kristensson, 2011).",
        "3 Phoneme-based Prediction System Although statistical-based predictions have been a well-studied topic, little or no research has been published on how well these predictions can be adapted to phoneme-based AAC systems.",
        "In this section, we describe our phoneme-based prediction system, which employs statistical language model-ing techniques to perform phoneme prediction and phoneme-based word prediction.",
        "Phoneme prediction predicts probable next phonemes based on the previously entered phonemes.",
        "Word prediction predicts the word currently being entered based on the current phoneme prefix and prior words.",
        "3.1 Phoneme Set Unlike traditional orthographic-based AAC systems that operate on a standard character set, different phoneme-based systems tend to use slightly different phoneme sets.",
        "For our prediction system, we use the phoneme set from the Jolly Phonics, a systematic synthetic phonics program widely used in the UK for literacy teaching (Lloyd, 1998).",
        "The phoneme set, to be called the PHONICS set, consists of 42 phonemes, with 17 vowels and 25 con-sonants.",
        "By using a literacy-linked phoneme set, our prediction system can readily be integrated into both literacy learning tools (such as the Phon-icStick?",
        "joystick (Black et al., 2008)) and communication aids.",
        "Other systems that use different phoneme sets can also be easily adapted to utilize our prediction system by providing a phoneme mapping scheme between their phoneme sets and the PHONICS set.",
        "3.2 Pronunciation Dictionary 3.2.1 The PHONICS Dictionary The development of phoneme-based predictions requires a pronunciation dictionary, which should be accent-specific as pronunciations may vary across different accents.",
        "There has been no dictionary to date that contains word pronunciations using the PHONICS set.",
        "To address this problem, we built our PHONICS pronunciation dictionary based on the Unisyn1 lexicon, as it provides facilities for generating dictionaries in different accents.",
        "The Unisyn uses the concept of key-symbols (i.e. meta-phonemes) to encode the characteristics of 1 http://www.cstr.ed.ac.uk/projects/unisyn/ 2 http://aac.unl.edu/vocabulary.html, accessed 4 September",
        "multiple accents into a single base lexicon.",
        "Accent-specific rules can then be applied to the base lexicon to produce pronunciations in a given accent.",
        "To create the PHONICS dictionary, we first derived a lexicon in the Edinburgh accent from the base lexicon using a set of Perl scripts supplied with Unisyn.",
        "We also performed additional clean-up processing to remove unwanted information, such as stress and boundary markers.",
        "We then created a mapping function from the set of 61 phonemes and allophones used in the Edinburgh lexicon to the PHONICS set.",
        "As the PHONICS set only contains 42 phonemes, several allophones in the Edinburgh set were mapped to the same phonemes in the PHONICS set.",
        "This mapping function was then used to convert the Edinburgh lexicon to the PHONICS pronunciation dictionary.",
        "The resulting dictionary consists of 121,004 pronunciation entries for 117,625 unique words.",
        "3.2.2 The Schwa Phoneme An issue of the phoneme mapping is that the Edinburgh set contains the schwa phoneme (denoted by the symbol ?@?",
        "), which cannot be mapped to any phonemes in the PHONICS set.",
        "The schwa, a reduced form of full vowels in unstressed syllables, occurs in 41,539 entries in the PHONICS diction-ary.",
        "An example of a word containing the schwa phoneme is ?today?",
        "(/t @ d ai/).",
        "While the schwa is the most commonly used vowel sound in spoken English (Gimson and Cruttenden, 2001), it is not included in the Jolly Phonics teaching as it is a difficult concept to understand for literacy learners at early stages.",
        "The simplest solution for this issue would be to explicitly add the schwa phoneme into the PHONICS set in our prediction system.",
        "However, learning to use the schwa correctly can be challenging for users with SSPI and literacy difficul-ties.",
        "Thus, we decided to support two modes in our system, namely the SCHWA_ON and the SCHWA_OFF modes.",
        "In the SCHWA_ON mode, the schwa phoneme is explicitly added to the PHONICS set, increasing the set to 43 phonemes.",
        "In the SCHWA_OFF mode, the schwa is not added into the PHONICS set and therefore is not offered to the users for selection.",
        "To deal with the absence of the schwa, we employed a basic auto-correction method.",
        "To search for a word given a phoneme sequence, we apply a limited set of schwa insertion and replacement rules (e.g. replacing vowels with schwas) to generate a set of alternative sequences.",
        "These sequences and the original sequence are then used to look up a list of matching words in the PHONICS dictionary.",
        "Once the user has selected a word from this list, the correct pronunciation of the selected word (which might include the schwas) would be used to replace the original phoneme sequence in the currently selected phoneme string.",
        "This corrected phoneme string would then be input to the phoneme language model (described in Section 3.3.1) to predict probable next phonemes.",
        "3.3 Phoneme Prediction We trained a 6-gram phoneme language model starting with training data from: ?",
        "Twitter messages collected via the free streaming API between December 2010 and July 2011.",
        "36M sentences, 251M words.",
        "?",
        "Blog posts from the ICWSM corpus (Burton et al., 2009).",
        "25M sentences, 387M words.",
        "?",
        "Usenet messages (Shaoul and Westbury, 2009).",
        "123M sentences, 1847M words.",
        "We used the crowdsourced data from Vertanen and Kristensson (2011) to select AAC-like sentences using cross-entropy difference selection (Moore and Lewis, 2010).",
        "The selection process retained 6.9M, 1.6M, and 2.3M words of data from the Twitter, Blog and Usenet data sets respectively.",
        "We converted the words in the selected sentences to pronunciation strings using the PHONICS dic-tionary.",
        "Whenever we encountered a word with multiple pronunciations, we chose a pronunciation at random.",
        "If a sentence had a word not in the PHONICS dictionary, we dropped the entire training sentence.",
        "We trained a 6-gram phoneme language model for each of the Twitter, Blog, and Usenet data sets.",
        "Estimation of unigrams used Witten-Bell discounting while all higher order n-grams used modified Kneser-Ney discounting with interpolation.",
        "We then created a mixture model via linear interpolation with mixture weights optimized on the crowdsourced development set from Vertanen and Kristensson (2011).",
        "The optimized mixture weights were: Twitter 0.54, Blog 0.25, and Usenet 0.21.",
        "Our final mixture model has 2.0M parameters and a compressed disk size of 14 MB."
      ]
    }
  ]
}
