{
  "info": {
    "authors": [
      "Michael Zock",
      "Gerard Sabah",
      "Christophe Alviset"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1133",
    "title": "From Structure to Process Computer-Assisted Teaching of Various Strategies for Generating Pronoun Constructions in French",
    "url": "https://aclweb.org/anthology/C86-1133",
    "year": 1986
  },
  "references": [
    "acl-C82-1024"
  ],
  "sections": [
    {
      "text": [
        "FROM STRUCTURE TO PROCESS Computer-assisted teaching of various strategies for generating pronoun constructions in French (1): Michael Zeck Gerard Sabah LIMST - Landes Naturelles B.P.",
        "30 - Orsay Cedex / France ABSTRACT Ibis paper describes an implemented tutoring system (2), designed to help students to generate clitic-constructions in French.",
        "While showing various ways of converting a given meaning structure into its corresponding surface expression, the system helps not only to discover what data to process but also how this information processing should take_place.",
        "In-other words, we are concerned with efficiency in verbal planning (performance).",
        "Recognizing that the same result can be obtained by various methods, the student should find out which one is best suited to the circumstances (what is known, task demands etc.).",
        "Informational states, hence the processor's needs, may vary to a great extent, as may his strategies or cognitive styles.",
        "In consequence, in order to become an efficient processor, the student has to acquire not only STRUCILRAL or RULE-KNOWLEDGE but also FROCEDWAL-KNALEDGE (skill).",
        "With this in mind we have designed three modules in order to foster a reflective, experimental attitude in the learner, helping him to discover insightfully the most efficient strategy."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "It is well known that the same output can be achieved by several methods.",
        "For example, a given set of sentences or texts can be generated by a variety of equivalent but different grammars.",
        "Any of these grammars can be used in numerous ways.",
        "Grammars are generally neutral with respect to processing (3).",
        "They pertain only to competence and performance factors such as memory load, focus of attention, etc.",
        "lie out of their scope.",
        "Though different grammars may be equivalent in terms of their product they all produce the same result, i.e. the same set of sentences they certainly differ in terms of the processing, that is to say in terms of their relative efficiency (speed, memory load, etc.)",
        "Whereas most scholars working in the domain of generation do not deal with strategies (4) they consider but one way to reach the solution we will be concerned by the procedural implications of using a given grammar in a variety of ways.",
        "Instead of having competing grammars, we will take one of them (5) and relate its efficiency to the way it is used.",
        "This performance-oriented approach seems justified on theoretical as well as on practical grounds (economy and flexibility of processing).",
        "Let us take, for example, a student who would like to be-cone fluent in French.",
        "Obviously, he would have to learn not only what to process, but also how to process in order to efficiently convert a given meaning (conceptual graph) into its corresponding expression (sentence).",
        "In other words, our student has to learn not only a set of grammatical rules but also a set of strategies or operating principles (6) powerful and flexible enough to get from a given input (meaning) to the output (sentence) in the most economic way, i.e. with the fewest operations, with the least storage, and with the minimum amount of transformations.",
        "Christophe Alviset INSSEE - 3, ay.",
        "P.Larousse 94241 Malakoff - France 2.",
        "PROCESS, FUNCTION OF STRUCTURE:",
        "It is a well known fact that students learning French have difficulties in producing fluently sentences with 2 pronoun complements such as: Dis-le moi V-DO-I0 Tell me (tell me it) Ne le lui dis pas!",
        "neg-DO-IO-V-neg Don't tell him (that)!",
        "to le donnera S-IO-DO-V He'll give it to you II le lui donnera S-DO-IO-V He'll give it to him Je to presente a elle S-DO-V-prep-I0 I'll presente you to her It is interesting to find out why these constructions are so difficult to learn and to process.",
        "We believe that there are three basic reasons for this:",
        "1) the structural idiosyncracies of the French system: morphology and syntax are interdependant; 2) the procedural implications of this structure: many morphemes have an embedded structure (see below); 3) the resource limitations of the human processor:",
        "being a serial processor, the learner can focus his attention on but one thing at a time."
      ]
    },
    {
      "heading": "2.1 STRUCTLRAL PARTICULARITIES:",
      "text": [
        "French pronoun constructions are complicated because syntax and morphology are interrelated, form as well as position depending upon each other.",
        "Their generation implies that one is capable of determining at least three things: - the form of a given referent: for example, the concepts SPEAKER or 3d PERSON can be realized in any of the following forms:",
        "SPEAKER: Jo, me, moi 3d PERSON: il, elle, ils, elles, on, se, soi, le, la, les, lui, leur, eux; - its position: In the affirmative mode there are three positions or sentence-frames: a) S-IO-DO-V it me le presente (he presents him to me) b) S-DO-IO-V it le lui presente (he presents him to her) c) S-DO-V-prep-ID it me■irjsente a elle(he presents me to her) - whether the preposition, inherent in the base, should be made explicit or not.",
        "As the examples (b) and (c) clearly show, the same verbconstruction may or may not require elision of the preposition.",
        "Either one affects form as well as position (7).",
        "It should be noted that while most verbs allow only for two patterns in the declarative mode ('a' and 'b'), those with an animate object such as 'presenter' (to present) allow also for 'c'."
      ]
    },
    {
      "heading": "2.2 PROCEDWAL IMLICATIONS:",
      "text": [
        "The linguistic constraints operate en all levels: phonological, morphological and syntactical.",
        "a) Phonological constraints: The determination of morphology generally requires three operations (person, case, number and somteimes gender), yet pronouns are monosyllabic.",
        "In consegeence, one cannot plan the next pronoun while uttering the current one as the pronoun uttered is too short and the time needed for planning the next one being too long.",
        "b) Morphological constraints: There are number of cases where the indirect object has an embedded structure, i.e. the morphology of the indirect object depends upon information coning from the direct object (8).",
        "This implies interruption of a routine.",
        "Suppose that the sentence: John presents Paul to Mary is to be pronaninalized.",
        "The problem is the determination of form and position of the pronouns, referring respectively to \"Pour and to \"Mary\".",
        "The indirect object (Mary) lexicalizes either as LOT or as flit, depending upon whether the direct object (Paul) represents the speaker/listener or a 3d person.",
        "In this latter case (e) the verb follows the indirect object, whereas in the Conner (d) precedes it.",
        "(d) it me presente a ELLE (he presents me to her) (e) it le LUI presence (he presents him to her) c) Syntactical constraints:",
        "The linear order of the constituents can generally not be established, until both objects are known.",
        "In consequence, at least one of the two elements has to be stored in working memory.",
        "(f) II le dui donne he gives it to him (S-0040-V) (g) if me le donne he gives it to me (S-IO-DO-V)",
        "Suppose that the direct object has been processed right after the subject.",
        "In that case one knows its form but not necessarily its position ('f' or 'g').",
        "This latter depends upon the value of the indirect object.",
        "If the indirect object is in the first or second person it precedes the direct object (g), otherwise it follows it (f).",
        "Should we start by processing the indirect object before the direct one, we might have to keep the fonwrr in working memory.",
        "This is precisely the case of \"f\" where the indirect object is in the third person and not reflexive.",
        "As one can see, in both situations one is faced with unwanted storage problems.",
        "Obviously these structural particularities of the French pronoun system have implicationsnot only for the process of learning but also for the process of generation, namely: they exclude any word-to-word processing, and they require a certain amount of preplanning or lookahead.",
        "What is needed then, in order to avoid false starts or corrections (backtracking), is global planning on the clause level rather than local planning on the word level.",
        "In the light of these facts one has to admit that the generation of pronoun constructions in French is not all that simple.",
        "Although the relevant features (rules) are simple in nature, their interaction is highly complex.",
        "It is thus not surprising that students take a long time to understand all the intricacies of the system, which would allow them eventually to integrate the rules into an efficient process-model.",
        "3.",
        "00ICTIVE:",
        "The system described here is an attempt to help the student to acquire the necessary structural and procedural knowledge.",
        "Its goal can be characterized as follows: While learning experimostally about structure (grower-rides) he should learn as well about the process of incrcnental sentence generation.",
        "In other words, by playing with the system, the student should gain necessary insights into the grammar, its procedural inplications etc.",
        "ib should also reflect upon his own strategies.",
        "All these insights should help him to develop a mere effiecct set of procedures.",
        "Since the discovery of such optimal processing strategics implies that one learns how to access the graimutical database under different eiranstances, the data and their use being separated we have varied the processing situation as well as the coding of the data.",
        "Variable task demands and multiple representation should enhance the flexibility, speed and aronany of processing."
      ]
    },
    {
      "heading": "4. DESCRIPTION OF 1FE SYSTEM:",
      "text": [
        "The heart of the system is a knowledge base which contains, in form of production rules, the structural information necessary to incrementally determine form as well as position.",
        "Furthermore the system contains an inference mechanism, i.e. a set of rules, whose function is to deduce new facts from any information given to the system.",
        "The base can be accessed in various ways, thus allowing for for varying usage of the knowledge according to the objective.",
        "We will.",
        "use it here in three ways, varying one of the following parameters: input, output, or processing, while keeping the other 000ctane.",
        "-Mc thrco ,,othod,- air-for in env of the following ways: - what is known at the input ?",
        "- what is expected at the output ?",
        "- which method or strategy is used to get from one to the other ?",
        "The three methods have a commas goal, namely, the building of larger blocks (schematas).",
        "the of the main objectives is to induce strategies where items belonging conceptually together are also processed together (grouping).",
        "This chunking method avoids not only unnecessary disruptions and memory load, Nit it hopefully favors the evolution from serial to simultaneous processing."
      ]
    },
    {
      "heading": "5. APPLICATIONS:",
      "text": []
    },
    {
      "heading": "5.1 *WE SOCRATIC METHOD:",
      "text": [
        "The system guides the student in the form of a dialogue, by showing him what and how to process in order to get from an input to the output.",
        "The user starts by providing the input (verb pattern composed of a verb, its complements and prepositions): donner (gn,qc,a gn) to give (so, sth, to so) The system takes over, asking for more information about these basic elements.",
        "By asking specific questions (person, gender, number etc.",
        "), the systems shows which information is relevant when determining form as well as position.",
        "While answering these questions the student incrementally determines the final.",
        "form of the sentence.",
        "The following example may illustrate the process:",
        "INPUT given dormer (quelqu'un, quelere chose, a quelqu'un) by the user: to give (somebody, something, to somebody) PROCESSING prompts from the system answers given by success.",
        "questions (attributes) the user (value) OUTPUTS If priority is given to morphology (lexically-driven generation), the form is determined before the relative order of the constituent elements.",
        "In this case two strategies are possible: either one processes the direct or the indirect object.",
        "The efficiency of these three strategies is of course not the sane.",
        "It is precisely the user's task to find out which of these strategies is the most efficient.",
        "The system invites him to conpare these methods by applying certain performance criteria:",
        "- number of steps necessary to generate the sentence, - what is known when ?",
        "(form/position), - congruence of input/output order (are pernutations necessary?",
        "LIFO/FIFO) - are there any conceptual disruptions ?",
        "(9)",
        "This experimental method should make the student aware of the le fact that several strategies can be used to arrive at the solution.",
        "He should compare them with respect to certain criteria and reach his conclusions.",
        "The qualities of this socratic dialogue lie in the visualization of the whole process.",
        "The system demonstrates which information should be processed and in what order.",
        "It also shows under what conditions movement of constituents are necessary.",
        "These permutations are shown on the screen, so that the user can learn which features control those movements.",
        "Furthermore, the results of the processed date are shown on-line, i.e. the form and position of the word determined are shown instantaneously.",
        "Finally the system tells whether the newly determined item can be articulated right away or not.",
        "The system is thus explicit with respect to rule knowledge and optimal in terms of processing.",
        "The result is obtained in the most economic way.",
        "The disadvantage of this system-driven processing reside in the fact that the solution, or more precisely, the method used to arrive at the solution, is shown but not discovered.",
        "Moreover, only one method is considered, hence the procedural knowledge remains implicit.",
        "The student will not even envisage other methods.",
        "He may thus know how to convert meaning into sentences, but this knowledge being implicit, he will not know how to transfer it to other situations."
      ]
    },
    {
      "heading": "5.2 GUIDED DISCOVERY",
      "text": [
        "The system still controls the nature of the operations but no longer controls their order.",
        "The latter is controlled, via strategies, by the user.",
        "He decides in what order to process the data.",
        "Having determined the subject, whose positions is invariable, one can choose from three strategies: - a syntactical one (syntactic-driven processing), - and two morphological ones (lexical-driven processing).",
        "If priority is given to syntax, no reordering of constituents is meant to take place, i.e. all information pertaining to word order is processed.",
        "The result is an ordered categorial structure or syntactical frame (h) which will be filled in by the morphological values determined later (i), for example: he gives it to her",
        "(h) sentence frame: SUBJECT - DIRECT OBJECT - IND.",
        "OBJECT - VERB (i) morphology: - le - lui - donne",
        "This method, like the previous one, is empirical.",
        "By playing with the system the student may gain certain insights about processing order.",
        "A matrix appears on the screen, whose blank spaces have to be filled in by the student.",
        "The horizontal line shows the syntactic information given with the input (verb, subject, object, preposition), more information is needed about those elements the vertical line shows the nature of the information necessary to arrive at the output.",
        "Thus the processing once again consists of the specification of the values of a list of attributes.",
        "However there is a fundamental differences between this approach and the former, namely, the system has an inference mechanism.",
        "Each item of information given to the system is considered for its meaning potential, i.e. the system tries to find out whether some new facts can be inferred from the old fact.",
        "It should be noted that the inference power varies with the nature of the data as well as with their order.",
        "There are cases where a single fact enables 3 other facts to be deduced (reflexives).",
        "A given inference may allow further deductions (inference-chain, knowledge propagation).",
        "This has of course an effect on the process, namely, the greater the inference power, the greater the economy of processing.",
        "This speaks for the following operating principle: the greater the inference power of a given piece of information, the earlier it should be processed.",
        "This method is interesting in that, by testing different items and different order it makes possible to watch on the screen which items allow what inferences.",
        "Since those inferences depend upon the nature of the input as well as on the Regent at which that information is given, we believe that this module is particularly useful in helping discover the best possible order of processing.",
        "Furthermore we think that this method has another virtue, namely that it can simulate literally any knowledge state, thus making it possible, by experimental means to discover the shortest path between a given information state (input) and the solution (output)."
      ]
    },
    {
      "heading": "6. CONCLUSIONS:",
      "text": [
        "We have stressed the need for teaching procedural knowledge (strategies) as well as structural knowledge (linguistic rules).",
        "furthermore, we argued that the procedures to be learned had to be flexible, because the input conditions (informational states) as well as the cognitive styles may vary both among individuals and within the same individual.",
        "In integrating the student into the learning-process we hopefully make him: - actively curious (testing of hypothesis learning by discovery); - conscious about the need for planning (how far should one plan ahead ?",
        "%hat are the planning units ?",
        "); - selective about the means he should use (which strategy is best under what circumstances ?).",
        "the whole Idea of having different strategies compete has been largely ignored by current work on language generation.",
        "While this aspect may be only of secondary interest for automatic generation in general, it certainly is not an unimportant issue in cognitive mcdelling, whether it be second language-learning or usage."
      ]
    },
    {
      "heading": "7 . NOTES:",
      "text": [
        "10 Our gramnar deals only with a small.",
        "subset of French, namely pronoun constructions (clitics).",
        "Starting with input propositions of the type: to give (sonnone,something,to somebody) the system helps the student to determine the output.",
        "The input above could lead to any of the following output: QUESTION: Est-ce que to le lui as donne?",
        "ASSERTION: 3e le lui donne.",
        "ORDER: Donne le lui !",
        "2° The modules described are written in Simla and Prolog.",
        "They were implemented by G.Sabah and C.Alviset.",
        "3° There are a few exceptions like Robinson's (1975), Carrol's (1980) or Kempen & Fbenkanp's (1982) approach.",
        "4° See for example: Davey (1978), McDonald (1983), Mc Keay!)",
        "(1982), Mann (1983), Sowa (1983), Danlos (1985).",
        "5° Our grammar is basically a lexical-functional grammar (see Kay, 1979) 6° Among those operating principles are the following: - avoid disruptions by grouping together what belongs conceptually together; - start with the most informative itean (feature hierarchy: PERSON, CASE, NEWER, GENDER); - avoid unnecessary storage - start with the lefimost item.",
        "7° The fact that prepositions have morphological reflexes has been readily recognized by linguists.",
        "%fiat has not been shown are the conditions under which a preposition has to be expli-cited or not, but that is the kind of knowledge a speaker must have.",
        "8° This is generally not made explicit in linguistic descriptions.",
        "9° Given the fact that the whole process is visualized in form of Pascal-like structures, the student can easily realize at what mament conceptual disruptions take place.",
        "Hierarchy is signalled through indentations.",
        "All features pertaining to the same referent arerepresented on the same level.",
        "It can happen that one cannot process all information for a given referent.",
        "For example if priority is given to syntax it often happens that one cannot complete a procedure because of an embedded structure.",
        "Having started with the direct object, one needs information from the indirect object before getting back to the original object.",
        "This jumping forth and back results in conceptual disruption, which is precisely what should be avoided.",
        "8.",
        "REFERENCES:"
      ]
    }
  ]
}
