{
  "info": {
    "authors": [
      "Ruihong Huang",
      "Ellen Riloff"
    ],
    "book": "NAACL",
    "id": "acl-N13-1005",
    "title": "Multi-faceted Event Recognition with Bootstrapped Dictionaries",
    "url": "https://aclweb.org/anthology/N13-1005",
    "year": 2013
  },
  "references": [
    "acl-C00-2136",
    "acl-D07-1075",
    "acl-D12-1091",
    "acl-N12-1034",
    "acl-N12-1083",
    "acl-P03-1029",
    "acl-P05-1047",
    "acl-P06-1061",
    "acl-P06-2094",
    "acl-P11-1040",
    "acl-P11-1114"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Identifying documents that describe a specific type of event is challenging due to the high complexity and variety of event descriptions.",
        "We propose a multifaceted event recognition approach, which identifies documents about an event using event phrases as well as defining characteristics of the event.",
        "Our research focuses on civil unrest events and learns civil unrest expressions as well as phrases corresponding to potential agents and reasons for civil unrest.",
        "We present a bootstrapping algorithm that automatically acquires event phrases, agent terms, and purpose (reason) phrases from unannotated texts.",
        "We use the bootstrapped dictionaries to identify civil unrest documents and show that multifaceted event recognition can yield high accuracy."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Many people are interested in following news reports about events.",
        "Government agencies are keenly interested in news about civil unrest, acts of terrorism, and disease outbreaks.",
        "Companies want to stay on top of news about corporate acquisitions, high-level management changes, and new joint ventures.",
        "The general public is interested in articles about crime, natural disasters, and plane crashes.",
        "We will refer to the task of identifying documents that describe a specific type of event as event recognition.",
        "It is tempting to assume that event keywords are sufficient to identify documents that discuss instances of an event.",
        "But event words are rarely reliable on their own.",
        "For example, consider the challenge of finding documents about civil unrest.",
        "The words ?strike?, ?rally?, and ?riot?",
        "refer to common types of civil unrest, but they frequently refer to other things as well.",
        "A strike can refer to a military event or a sporting event (e.g., ?air strike?, ?bowling strike?",
        "), a rally can be a race or a spirited exchange (e.g.,?car rally?, ?tennis rally?",
        "), and a riot can refer to something funny (e.g., ?she's a riot?).",
        "Event keywords also appear in general discussions that do not mention a specific event (e.g., ?37 states prohibit teacher strikes?",
        "or ?The fine for inciting a riot is $1,000?).",
        "Furthermore, many relevant documents are not easy to recognize because events can be described with complex expressions that do not include event keywords.",
        "For example, ?took to the streets?, ?walked off their jobs?",
        "and ?stormed parliament?",
        "often describe civil unrest.",
        "The goal of our research is to recognize event descriptions in text by identifying event expressions as well as defining characteristics of the event.",
        "We propose that agents and purpose are characteristics of an event that are essential to distinguish one type of event from another.",
        "The agent responsible for an action often determines how we categorize the action.",
        "For example, natural disasters, military operations, and terrorist attacks can all produce human casualties and physical destruction.",
        "But the agent of a natural disaster must be a natural force, the agent of a military incident must be military personnel, and the agent of a terrorist attack is never a natural force and rarely military personnel.",
        "There may be other important factors as well, but the agent is often an essential part of an event definition.",
        "The purpose of an event is also a crucial factor in distinguishing between event types.",
        "For exam",
        "ple, civil unrest events and sporting events both involve large groups of people amassing at a specific site.",
        "But the purpose of civil unrest gatherings is to protest against socio-political problems, while sporting events are intended as entertainment.",
        "As another example, terrorist events and military incidents can both cause casualties, but the purpose of terrorism is to cause widespread fear, while the purpose of military actions is to protect national security interests.",
        "Our research explores the idea of multifaceted event recognition: using event expressions as well as facets of the event (agents and purpose) to identify documents about a specific type of event.",
        "We present a bootstrapping framework to automatically create event phrase, agent, and purpose dictionaries.",
        "The learning process uses unannotated texts, a few event keywords, and seed terms for common agents and purpose phrases associated with the event type.",
        "Our bootstrapping algorithm exploits the observation that event expressions, agents, and purpose phrases often appear together in sentences that introduce an event.",
        "In the first step, we extract event expressions based on dependency relations with an agent and purpose phrase.",
        "The harvested event expressions are added to an event phrase dictionary.",
        "In the second step, new agent terms are extracted from sentences containing an event phrase and a purpose phrase, and new purpose phrases are harvested from sentences containing an event phrase and an agent.",
        "These harvested terms are added to agent and purpose dictionaries.",
        "The bootstrapping algorithm ricochets back and forth, alternately learning new event phrases and learning new agent/purpose phrases, in an iterative process.",
        "We explore several ways of using these bootstrapped dictionaries.",
        "We conclude that finding at least two different types of event information produces high accuracy (88% precision) with good recall (71%) on documents that contain an event keyword.",
        "We also present experiments with documents that do not contain event keywords, and obtain 74% accuracy when matching all three types of event information."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Event recognition has been studied in several different contexts.",
        "There has been a lot of research on event extraction, where the goal is to extract facts about events from text (e.g., (ACE Evaluations, 2006; Appelt et al., 1993; Riloff, 1996; Yangar-ber et al., 2000; Chieu and Ng, 2002; Califf and Mooney, 2003; Sudo et al., 2003; Stevenson and Greenwood, 2005; Sekine, 2006)).",
        "Although our research does not involve extracting facts, event extraction systems can also be used to identify stories about a specific type of event.",
        "For example, the MUC-4 evaluation (MUC-4 Proceedings, 1992) included ?text filtering?",
        "results that measured the performance of event extraction systems at identifying event-relevant documents.",
        "The best text filtering results were high (about 90% F score), but relied on hand-built event extraction systems.",
        "More recently, some research has incorporated event region detectors into event extraction systems to improve extraction performance (Gu and Cercone, 2006; Patwardhan and Riloff, 2007; Huang and Riloff, 2011).",
        "There has been recent work on event detection from social media sources (Becker et al., 2011; Popescu et al., 2011).",
        "Some research identifies specific types of events in tweets, such as earthquakes (Sakaki et al., 2010) and entertainment events (Benson et al., 2011).",
        "There has also been work on event trend detection (Lampos et al., 2010; Mathioudakis and Koudas, 2010) and event prediction through social media, such as predicting elections (Tumasjan et al., 2010; Conover et al., 2011) or stock market indicators (Zhang et al., 2010).",
        "(Ritter et al., 2012) generated a calendar of events mentioned on twitter.",
        "(Metzler et al., 2012) proposed structured retrieval of historical event information over mi-croblog archives by distilling high quality event representations using a novel temporal query expansion technique.",
        "Some text classification research has focused on event categories.",
        "(Riloff and Lehnert, 1994) used an information extraction system to generate relevancy signatures that were indicative of different event types.",
        "This work originally relied on manually labeled patterns and a hand-crafted semantic dictionary.",
        "Later work (Riloff and Lorenzen, 1999) eliminated the need for the dictionary and labeled patterns, but still assumed the availability of relevant/irrelevant training texts.",
        "Event recognition is also related to Topic Detection and Tracking (TDT) (Allan et al., 1998; Allan,",
        "2002) which addresses event-based organization of a stream of news stories.",
        "Event recognition is similar to New Event Detection, also called First Story Detection, which is considered the most difficult TDT task (Allan et al., 2000a).",
        "Typical approaches reduce documents to a set of features, either as a word vector (Allan et al., 2000b) or a probability distribution (Jin et al., 1999), and compare the incoming stories to stories that appeared in the past by computing similarities between their feature representations.",
        "Recently, event paraphrases (Petrovic et al., 2012) have been explored to deal with the diversity of event descriptions.",
        "However, the New Event Detection task differs from our event recognition task because we want to find all stories describing a certain type of event, not just new events."
      ]
    },
    {
      "heading": "3 Bootstrapped Learning of Event Dictionaries",
      "text": [
        "Our bootstrapping approach consists of two stages of learning as shown in Figure 1.",
        "The process begins with a few agent seeds, purpose phrase patterns, and unannotated articles selected from a broad-coverage corpus using event keywords.",
        "In the first stage, event expressions are harvested from the sentences that have both an agent and a purpose phrase in specific syntactic positions.",
        "In the second stage, new purpose phrases are harvested from sentences that contain both an event phrase and an agent, while new agent terms are harvested from sentences that contain both an event phrase and a purpose phrase.",
        "The new terms are added to growing event dictionaries, and the bootstrapping process repeats.",
        "Our work focuses on civil unrest events."
      ]
    },
    {
      "heading": "3.1 Stage 1: Event Phrase Learning",
      "text": [
        "We first extract potential civil unrest stories from the English Gigaword corpus (Parker et al., 2011) using six civil unrest keywords.",
        "As explained in Section 1, event keywords are not sufficient to obtain relevant documents with high precision, so the extracted stories are a mix of relevant and irrelevant articles.",
        "Our algorithm first selects sentences to use for learning, and then harvests event expressions from them.",
        "The input in stage 1 consists of a few agent terms and purpose patterns for seeding.",
        "The agent seeds are single nouns, while the purpose patterns are verbs in infinitive or present participle forms.",
        "Table 1 shows the agent terms and purpose phrases used in our experiments.",
        "The agent terms were manually selected by inspecting the most frequent nouns in the documents with civil unrest keywords.",
        "The purpose patterns are the most common verbs that describe the reason for a civil unrest event.",
        "We identify probable event sentences by extracting all sentences that contain at least one agent term and one purpose phrase.",
        "Agents protesters, activists, demonstrators, students, groups, crowd, workers, palestinians, supporters, women Purpose demanding, to demand, Phrases protesting, to protest",
        "To constrain the learning process, we require event expressions and purpose phrases to match certain syntactic structures.",
        "We apply the Stanford dependency parser (Marneffe et al., 2006) to the probable event sentences to identify verb phrase candidates and to enforce syntactic constraints between the different types of event information.",
        "that we learn.",
        "One type consists of a verb paired with the head noun of its direct object.",
        "For example, event phrases can be ?stopped work?",
        "or ?occupied offices?, and purpose phrases can be ?show support?",
        "or ?condemn war?.",
        "The second type consists of a verb and an attached prepositional phrase, retaining only the head noun of the embedded noun phrase.",
        "For example, ?took to street?",
        "and ?scuffled with police?",
        "can be event phrases, while ?call for resignation?",
        "and ?press for wages?",
        "can be purpose phrases.",
        "In both types of verb phrases, a particle can optionally follow the verb.",
        "Event expressions, agents, and purpose phrases must appear in specific dependency relations, as illustrated in Figure 3.",
        "An agent must be the syntactic subject of the event phrase.",
        "A purpose phrase must be a complement of the event phrase, specifically, we require a particular dependency relation, ?xcomp?1, between the two verb phrases.",
        "For example, in the sentence ?Leftist activists took to the streets in the Nepali capital Wednesday protesting higher fuel prices.",
        "?, the dependency relation 1In the dependency parser, ?xcomp?",
        "denotes a general relation between a VP or an ADJP and its open clausal complement.",
        "For example, in the sentence ?He says that you like to swim.",
        "?, the ?xcomp?",
        "relation will link ?like?",
        "(head) and ?swim?",
        "(dependent).",
        "With our constraints on the verb phrase forms, the dependent verb phrase in this construction tends to describe the purpose of the verb phrase.",
        "?xcomp?",
        "links ?took to the streets?",
        "with ?protesting higher fuel prices?.",
        "Given the syntactic construction shown in Figure 3, with a known agent and purpose phrase, we extract the head verb phrase of the ?xcomp?",
        "dependency relation as an event phrase candidate.",
        "The event phrases that co-occur with at least two unique agent terms and two unique purposes phrases are saved in our event phrase dictionary."
      ]
    },
    {
      "heading": "3.2 Stage 2: Learning Agent and Purpose Phrases",
      "text": [
        "In the second stage of bootstrapping, we learn new agent terms and purpose phrases.",
        "Our rationale is that if a sentence contains an event phrase and one other important facet of the event (agent or purpose), then the sentence probably describes a relevant event.",
        "We can then look for additional facets of the event in the same sentence.",
        "We learn both agent and purpose phrases simultaneously in parallel learning processes.",
        "As before, we first identify probable event sentences and then harvest agent and purpose phrases from these sentences.",
        "We identify probable event sentences by extracting sentences that contain at least one event phrase (based on the dictionary produced in the first stage of bootstrapping) and an agent term or a purpose phrase.",
        "As before, the event information must occur in the sentential dependency structures shown in",
        "The sentences that contain an event phrase and an agent are used to harvest more purpose phrases, while the sentences that contain an event phrase and a purpose phrase are used to harvest more agent terms.",
        "Purpose phrases are extracted from the phrasal structures shown in Figure 2.",
        "In the learning process for agents, if a sentence has an event",
        "phrase as the head of the ?xcomp?",
        "dependency relation and a purpose phrase as the dependent clause of the ?xcomp?",
        "dependency relation, then the head noun of the syntactic subject of the event phrase is harvested as a candidate agent term.",
        "We also record the modifiers appearing in all of the noun phrases headed by an agent term.",
        "Agent candidates that co-occur with at least two unique event phrases and at least two different modifiers of known agent terms are selected as new agent terms.",
        "The learning process for purpose phrases is analogous.",
        "If the syntactic subject of an event phrase is an agent and the event phrase is the head of the ?xcomp?",
        "dependency relation, then the dependent clause of the ?xcomp?",
        "dependency relation is harvested as a candidate purpose phrase.",
        "Purpose phrase candidates that co-occur with at least two different event phrases are selected as purpose phrases.",
        "The bootstrapping process then repeats, ricocheting back and forth between learning event phrases and learning agent and purpose phrases."
      ]
    },
    {
      "heading": "3.3 Domain Relevance Criteria",
      "text": [
        "To avoid domain drift during bootstrapping, we use two additional criteria to discard phrases that are not necessarily associated with the domain.",
        "For each event phrase and purpose phrase, we estimate its domain-specificity as the ratio of its prevalence in domain-specific texts compared to broad-coverage texts.",
        "The goal is to discard phrases that are common across many types of documents, and therefore not specific to the domain.",
        "We define the domain-specificity of phrase p as: domain-specificity(p) = frequency of p in domain-specific corpusfrequency of p in broad-coverage corpus We randomly sampled 10% of the Gigaword texts that contain a civil unrest event keyword to create the ?domain-specific?",
        "corpus, and randomly sampled 10% of the remaining Gigaword texts to create the ?broad-coverage?",
        "corpus.2 Keyword-based sampling is an approximation to domain-relevance, but gives us a general idea about the prevalance of a phrase in different types of texts.",
        "For agent terms, our goal is to identify people who participate as agents of civil unrest events.",
        "Other types of people may be commonly mentioned in civil unrest stories too, as peripheral characters.",
        "For 2The random sampling was simply for efficiency reasons.",
        "example, police may provide security and reporters may provide media coverage of an event, but they are not the agents of the event.",
        "We estimate the event-specificity of each agent term as the ratio of the phrase's prevalence in event sentences compared to all the sentences in the domain-specific corpus.",
        "We define an event sentence as one that contains both a learned event phrase and a purpose phrase, based on the dictionaries at that point in time.",
        "Therefore, the number of event sentences increases as the bootstrapped dictionaries grow.",
        "We define the event-specificity of phrase p as: event-specificity(p) = frequency of p in event sentencesfrequency of p in all sentences In our experiments we required event and purpose phrases to have domain-specificity ?",
        ".33 and agent terms to have event-specificity ?",
        ".01.3"
      ]
    },
    {
      "heading": "4 Evaluation",
      "text": []
    },
    {
      "heading": "4.1 Data",
      "text": [
        "We conducted experiments to evaluate the performance of our bootstrapped event dictionaries for recognizing civil unrest events.",
        "Civil unrest is a broad term typically used by the media or law enforcement to describe a form of public disturbance that involves a group of people, usually to protest or promote a cause.",
        "Civil unrest events include strikes, protests, occupations, rallies, and similar forms of obstructions or riots.",
        "We chose six event keywords to identify potential civil unrest documents: ?protest?, ?strike?, ?march?, ?rally?, ?riot?",
        "and ?occupy?.",
        "We extracted documents from the English Gigaword corpus (Parker et al., 2011) that contain at least one of these event keywords, or a morphological variant of a keyword.4 This process extracted nearly one million documents, which we will refer to as our event-keyword corpus.",
        "We randomly sampled 400 documents5 from the event-keyword corpus and asked two annotators to determine whether each document mentioned a civil",
        "unrest event.",
        "We defined annotation guidelines and conducted an inter-annotator agreement study on 100 of these documents.",
        "The annotators achieved a ?",
        "score of .82.",
        "We used these 100 documents as our tuning set.",
        "Then each annotator annotated 150 more documents to create our test set of 300 documents."
      ]
    },
    {
      "heading": "4.2 Baselines",
      "text": [
        "The first row of Table 2 shows event recognition accuracy when only the event keywords are used.",
        "All of our documents were obtained by searching for a keyword, but only 101 of the 300 documents in our test set were labeled as relevant by the annotators (i.e., 101 describe a civil unrest event).",
        "This means that using only the event keywords to identify civil unrest documents yields about 34% precision.",
        "In a second experiment, KeywordTitle, we required the event keyword to be in the title (headline) of the document.",
        "The KeywordTitle approach produced better precision (66%), but only 33% of the relevant documents had a keyword in the title.",
        "The second section of Table 2 shows the results of two supervised classifiers based on 10-fold cross validation with our test set.",
        "Both classifiers were trained using support vector machines (SVMs) (Joachims, 1999) with a linear kernel (Keerthi and DeCoste, 2005).",
        "The first classifier used unigrams as features, while the second classifier used both unigrams and bigrams.",
        "All the features are binary.",
        "The evaluation results show that the unigram classifier has an F-score of .64.",
        "Using both unigram and bi-gram features increased precision to 71% but recall fell by 7%, yielding a slightly lower F-score of .62."
      ]
    },
    {
      "heading": "4.3 Event Recognition with Bootstrapped Dictionaries",
      "text": [
        "Next, we used our bootstrapped dictionaries for event recognition.",
        "The bootstrapping process ran for 8 iterations and then stopped because no more phrases could be learned.",
        "The quality of bootstrapped data often degrades as bootstrapping progresses, so we used the tuning set to evaluate the dictionaries after each iteration.",
        "The best performance6 on the tuning set resulted from the dictionaries produced after four iterations, so we used these dictionaries for our experiments.",
        "Table 3 shows the",
        "number of event phrases, agents and purpose phrases learned after each iteration.",
        "All three lexicons were significantly enriched after each iteration.",
        "The final bootstrapped dictionaries contain 623 event phrases, 569 purpose phrases and 139 agent terms.",
        "Table 4 shows samples from each event dictionary.",
        "Event Phrases: went on strike, took to street, chanted slogans, gathered in capital, formed chain, clashed with police, staged rally, held protest, walked off job, burned flags, set fire, hit streets, marched in city, blocked roads, carried placards Agent Terms: employees, miners, muslims, unions, protestors, journalists, refugees, prisoners, immigrants, inmates, pilots, farmers, followers, teachers, drivers Purpose Phrases: accusing government, voice anger, press for wages, oppose plans, urging end, defying ban, show solidarity, mark anniversary, calling for right, condemning act, pressure government, mark death, push for hike, call attention, celebrating withdrawal",
        "The third section of Table 2 shows the results when using the bootstrapped dictionaries for event recognition.",
        "We used a simple dictionary lookup approach that searched for dictionary entries in each document.",
        "Our phrases were generated based on",
        "syntactic analysis and only head words were retained for generality.",
        "But we wanted to match dictionary entries without requiring syntactic analysis of new documents.",
        "So we used an approximate matching scheme that required each word to appear within 5 words of the previous word.",
        "For example, ?held protest?",
        "would match ?held a large protest?",
        "and ?held a very large political protest?.",
        "In this way, we avoid the need for syntactic analysis when using the dictionaries for event recognition.",
        "First, we labeled a document as relevant if it contained any Event Phrase (EV) in our dictionary.",
        "The event phrases achieved better performance than all of the baselines, yielding an F-score of 69%.",
        "The best baseline was the unigram classifier, which was trained with supervised learning.",
        "The bootstrapped event phrase dictionary produced much higher precision (79% vs. 66%) with only slightly lower recall (60% vs. 62%), and did not require annotated texts for training.",
        "Statistical significance testing shows that the Event Phrase lookup approach works significantly better than the unigram classifier (p < 0.05, paired bootstrap (Berg-Kirkpatrick et al., 2012)).",
        "For the sake of completeness, we also evaluated the performance of dictionary lookup using our bootstrapped Agent (AG) and Purpose (PU) dictionaries, individually.",
        "The agents terms produced 42% precision with 98% recall, demonstrating that the learned agent list has extremely high coverage but (unsurprisingly) does not achieve high precision on its own.",
        "The purpose phrases achieved a better balance of recall and precision, producing an F-score of 63%, which is nearly the same as the supervised unigram classifier.",
        "Our original hypothesis was that a single type of event information is not sufficient to accurately identify event descriptions.",
        "Our goal was high-accuracy event recognition by requiring that a document contain multiple clues pertaining to different facets of an event (multi-faceted event recognition).",
        "The last row of Table 2 (All Pairs) shows the results when requiring matches from at least two different bootstrapped dictionaries.",
        "Specifically, we labeled a document as relevant if it contained at least one phrase from each of two different dictionaries and these phrases occurred in the same sentence.",
        "Table 2 shows that multifaceted event recognition achieves 88% precision with reasonably good recall of 71%, yielding an F-score of 79%.",
        "This multifaceted approach with simple dictionary lookup outperformed all of the baselines, and each dictionary used by itself.",
        "Statistical significance testing shows that the All Pairs approach works significantly better than the unigram classifier (p < 0.001, paired bootstrap).",
        "The All Pairs approach is significantly better than the Event",
        "dictionaries performed.",
        "The first row shows that requiring a document to have an event phrase and a purpose phrase produces the best precision (100%) but with low recall (14%).",
        "The second row reveals that requiring a document to have an event phrase and an agent term yields better recall (47%) and high precision (94%).",
        "The third row shows that requiring a document to have a purpose phrase and an agent term produces the best recall (50%) but with slightly lower precision (85%).",
        "Finally, the last row of Table 5 shows that taking the union of these results (i.e., any combination of dictionary pairs is sufficient) yields the best recall (71%) with high precision (88%), demonstrating that we get the best coverage by recognizing multiple combinations of event information.",
        "the Lexicons Learned after each Iteration, on the Test Set Table 6 shows the performance of the lexicon lookup approach using the All Pairs criteria during the bootstrapping process.",
        "The first row shows the results using only 10 agent seeds and 4 purpose seeds as shown in Table 1.",
        "The following four rows in the table show the performance of All Pairs using",
        "the lexicons learned after each bootstrapping iteration.",
        "We can see that the recall increases steadily and that precision is maintained at a high level throughout the bootstrapping process.",
        "Event recognition can be formulated as an information retrieval (IR) problem.",
        "As another point of comparison, we ran an existing IR system, Terrier (Ounis et al., 2007), on our test set.",
        "We used Terrier to rank these 300 documents given our set of event keywords as the query 7, and then generated a recall/precision curve (Figure 4) by computing the precisions at different levels of recall, ranging from",
        "parameter PL2 which refers to an advanced Divergence From Randomness weighting model (Amati and Van Rijsbergen, 2002).",
        "In addition, Terrier used automatic query expansion.",
        "We can see that Terrier identified the first 60 documents (20% recall) with 100% precision.",
        "But precision dropped sharply after that.",
        "The circle in Figure 4 shows the performance of our bootstrapped dictionaries using the All Pairs approach.",
        "At comparable level of precision (88%), Terrier achieved about 45% recall versus 71% recall produced with the bootstrapped dictionaries."
      ]
    },
    {
      "heading": "4.4 Supervised Classifiers with Bootstrapped Dictionaries",
      "text": [
        "We also explored the idea of using the bootstrapped dictionaries as features for a classifier to see if a supervised learner could make better use of the dic",
        "TermLex encodes a binary feature for every phrase in any of our dictionaries.",
        "PairLex encodes a binary feature for each pair of phrases from two different dictionaries and requires them to occur in the same sentence.",
        "The TermLex classifier achieves good performance (74% F-score), but is not as effective as our All Pairs dictionary lookup approach (79% F-score).",
        "The PairLex classifier yield higher precision but very low recall, undoubtedly due to sparsity issues in matching specific pairs of phrases.",
        "One of the strengths of our bootstrapping method is that it creates dictionaries from large volumes of unannotated documents.",
        "A limitation of supervised learning with lexical features is that the classifier can not benefit from terms in the bootstrapped dictionaries that do not appear in its training documents.",
        "To address this issue, we also tried encoding the dictionaries as set-based features.",
        "The TermSets classifier encodes three binary features, one for each dictionary.",
        "A feature gets a value of 1 if a document contains any word in the corresponding dictionary.",
        "The PairSets classifier also encodes three binary features, but each feature represents a different pair of dictionaries (EV+AG, EV+PU, or AG+PU).",
        "A feature gets a value of 1 if a document contains at least one term from each of the two dictionaries in the same sentence.",
        "The AllSets classifier encodes 7 set-based features: the previous six features and one additional feature that requires a sentence to contain at least one entry from all three dictionaries.",
        "The All Sets classifier yields the best performance with an F-score of 76%.",
        "However, our straightforward dictionary lookup approach still performs better (79% F-score), and does not require annotated documents for training."
      ]
    },
    {
      "heading": "4.5 Finding Articles with no Event Keyword",
      "text": [
        "The learned event dictionaries have the potential to recognize event-relevant documents that do not contain any human-selected event keywords.",
        "This can happen in two ways.",
        "First, 378 of the 623 learned event phrases do not contain any of the original event keywords.",
        "Second, we expect that some event descriptions will contain a known agent and purpose phrase, even if the event phrase is unfamiliar.",
        "We performed an additional set of experiments with documents in the Gigaword corpus that contain no human-selected civil unrest keyword.",
        "Following our multifaceted approach to event recognition, we collected all documents that contain a sentence that matches phrases in at least two of our bootstrapped event dictionaries.",
        "This process retrieved 178,197 documents.",
        "The first column of Table 8 shows the number of documents that had phrases found in two different dictionaries (EV+AG, EV+PU, AG+PU) or in all three dictionaries (EV+AG+PU).",
        "We randomly sampled 50 documents from each category and had them annotated.",
        "The accuracies are shown in the third column.",
        "Finding all three types of phrases produced the best accuracy, 74%.",
        "Furthermore, we found over 6,800 documents that had all three types of event information using our learned dictionaries.",
        "This result demonstrates that the bootstrapped dictionaries can recognize many event descriptions that would have been missed by searching only with manually selected keywords.",
        "This experiment also confirms that multi-facted event recognition using all three learned dictionaries achieves good accuracy even for documents that do not contain the civil unrest keywords."
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "We proposed a multifaceted approach to event recognition and presented a bootstrapping technique to learn event phrases as well as agent terms and purpose phrases associated with civil unrest events.",
        "Our results showed that multifaceted event recognition using the learned dictionaries achieved high accuracy and performed better than several other methods.",
        "The bootstrapping approach can be easily trained for new domains since it requires only a large collection of unannotated texts and a few event keywords, agent terms, and purpose phrases for the events of interest.",
        "Furthermore, although the training phase requires syntactic parsing to learn the event dictionaries, the dictionaries can then be used for event recognition without needing to parse the documents.",
        "An open question for future work is to investigate whether the same multifaceted approach to event recognition will work well for other types of events.",
        "Our belief is that many different types of events have characteristic agent terms, but additional types of facets will need to be defined to cover a broad array of event types.",
        "The syntactic constructions used to harvest dictionary items may also vary depending on the types of event information that must be learned.",
        "In future research, we plan to explore these issues in more depth to design a more general multifaceted event recognition system, and we plan to investigate new ways to use these event dictionaries for event extraction as well."
      ]
    },
    {
      "heading": "6 Acknowledgments",
      "text": [
        "This research was supported by the Intelligence Advanced Research Projects Activity (IARPA) via Department of Interior National Business Center (DoI / NBC) contract number D12PC00285 and by the National Science Foundation under grant IIS-1018314.",
        "The U.S. Government is authorized to reproduce and distribute reprints for Governmental purposes notwithstanding any copyright annotation thereon.",
        "The views and conclusions contained herein are those of the authors and should not be interpreted as necessarily representing the official policies or endorsements, either expressed or implied, of IARPA, DoI/NBE, NSF, or the U.S. Government."
      ]
    }
  ]
}
