{
  "info": {
    "authors": [
      "Stephan Peitz",
      "David Vilar",
      "Hermann Ney"
    ],
    "book": "EACL",
    "id": "acl-E14-4034",
    "title": "Simple and Effective Approach for Consistent Training of Hierarchical Phrase-based Translation Models",
    "url": "https://aclweb.org/anthology/E14-4034",
    "year": 2014
  },
  "references": [
    "acl-J03-1002",
    "acl-N03-1017",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P05-1033",
    "acl-P10-1049",
    "acl-P11-2031",
    "acl-P96-1041",
    "acl-W10-1738"
  ],
  "sections": [
    {
      "text": [
        "Abstract",
        "In this paper, we present a simple approach for consistent training of hierarchical phrase-based translation models.",
        "In order to consistently train a translation model, we perform hierarchical phrase-based decoding on training data to find derivations between the source and target sentences.",
        "This is done by synchronous parsing the given sentence pairs.",
        "After extracting k-best derivations, we reestimate the translation model probabilities based on collected rule counts.",
        "We show the effectiveness of our procedure on the IWSLT German?English and English?French translation tasks.",
        "Our results show improvements of up to 1.6 points BLEU."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In state of the art statistical machine translation systems, the translation model is estimated by following heuristic: Given bilingual training data, a word alignment is trained with tools such as GIZA ++ (Och and Ney, 2003) or fast align (Dyer et al., 2013).",
        "Then, all valid translation pairs are extracted and the translation probabilities are computed as relative frequencies (Koehn et al., 2003).",
        "However, this extraction method causes several problems.",
        "First, this approach does not consider, whether a translation pair is extracted from a likely alignment or not.",
        "Further, during the extraction process, models employed in decoding are not considered.",
        "For phrase-based translation, a successful approach addressing these issues is presented in (Wuebker et al., 2010).",
        "By applying a phrase-based decoder on the source sentences of the training data and constraining the translations to the corresponding target sentences, k-best segmentations are produced.",
        "Then, the phrases used for these segmentations are extracted and counted.",
        "Based on the counts, the translation model probabilities are recomputed.",
        "To avoid over-fitting, leave-one-out is applied.",
        "However, for hierarchical phrase-based translation an equivalent approach is still missing.",
        "In this paper, we present a simple and effective approach for consistent reestimation of the translation model probabilities in a hierarchical phrase-based translation setup.",
        "Using a heuristically extracted translation model as starting point, the training data are parsed bilingually.",
        "From the resulting hypergraphs, we extract k-best derivations and the rules applied in each derivation.",
        "This is done with a top-down k-best parsing algorithm.",
        "Finally, the translation model probabilities are recomputed based on the counts of the extracted rules.",
        "In our procedure, we employ leave-one-out to avoid over-fitting.",
        "Further, we consider all models which are used in translation to ensure a consistent training.",
        "Experimental results are presented on the German?English and English?French IWSLT shared machine translation task (Cettolo et al., 2013).",
        "We are able to gain improvements of up to 1.6% BLEU absolute and 1.4% TER over a competitive baseline.",
        "On all tasks and test sets, the improvements are statistically significant with at least 99% confidence.",
        "The paper is structured as follow.",
        "First, we revise the state of the art hierarchical phrase-based extraction and translation process.",
        "In Section 3, we propose our training procedure.",
        "Finally, experimental results are given in Section 4 and we conclude with Section 5.",
        "2 Hierarchical Phrase-based Translation In hierarchical phrase-based translation (Chiang, 2005), discontinuous phrases with ?gaps?",
        "are allowed.",
        "The translation model is formalized as a synchronous context-free grammar (SCFG) 174 and consists of bilingual rules, which are based on bilingual standard phrases and discontinuous phrases.",
        "Each bilingual rule rewrites a generic non-terminal X into a pair of strings ?",
        "f and e?",
        "with both terminals and non-terminals in both languages X ?",
        "?",
        "?",
        "f, e??.",
        "(1) In a standard hierarchical phrase-based translation setup, obtaining these rules is based on a heuristic extraction from automatically word-aligned bilingual training data.",
        "Just like in the phrase-based approach, all bilingual rules of a sentence pair are extracted given an alignment.",
        "The standard phrases are stored as lexical rules in the rule set.",
        "In addition, whenever a phrase contains a sub-phrase, this sub-phrase is replaced by a generic non-terminal X .",
        "With these hierarchical phrases we can define the hierarchical rules in the SCFG.",
        "The rule probabilities which are in general defined as relative frequencies are computed based on the joint counts C(X ?",
        "?",
        "?",
        "f, e??)",
        "of a bilingual rule X ?",
        "?",
        "?",
        "f, e??",
        "p H ( ?",
        "f |e?)",
        "= C(X ?",
        "?",
        "?",
        "f, e??)",
        "?",
        "?",
        "f ?",
        "C(X ?",
        "?",
        "?",
        "f ?",
        ", e??)",
        ".",
        "(2) The translation probabilities are computed in source-to-target as well as in target-to-source direction.",
        "In the translation processes, these probabilities are integrated in the log-linear combination among other models such as a language model, word lexicon models, word and phrase penalty and binary features marking hierarchical phrases, glue rule and rules with non-terminals at the boundaries.",
        "The translation process of hierarchical phrase-based approach can be considered as parsing problem.",
        "Given an input sentence in the source lan-guage, this sentence is parsed using the source language part of the SCFG.",
        "In this work, we perform this step with a modified version of the CYK+ algorithm (Chappelier and Rajman, 1998).",
        "The output of this algorithm is a hypergraph, which represents all possible derivations of the input sentence.",
        "A derivation represents an application of rules from the grammar to generate the given input sentence.",
        "Using the the associated target part of the applied rule, for each derivation a translation can be constructed.",
        "In a second step, the language model score is incorporated.",
        "Given the hy-pergraph, this is done with the cube pruning algorithm presented in (Chiang, 2007).",
        "3 Translation Model Training We propose following pipeline for consistent hierarchical phrase-based training: First we train a word alignment, from which the baseline translation model is extracted as described in the previous section.",
        "The log-linear parameter weights are tuned with MERT (Och, 2003) on a development set to produce the baseline system.",
        "Next, we perform decoding on the training data.",
        "As the translations are constrained to the given target sen-tences, we name this step forced decoding in the following.",
        "Details are given in the next subsection.",
        "Given the counts C FD (X ?",
        "?",
        "?",
        "f, e??)",
        "of the rules, which have been applied in the forced decoding step, the translation probabilities p FD ( ?",
        "f |e?)",
        "for the translation model are recomputed: p FD ( ?",
        "f |e?)",
        "= C FD (X ?",
        "?",
        "?",
        "f, e??)",
        "?",
        "?",
        "f ?",
        "C FD (X ?",
        "?",
        "?",
        "f ?",
        ", e??)",
        ".",
        "(3) Finally, using the translation model with the reestimated probabilities, we retune the log-linear parameter weights and obtain our final system.",
        "3.1 Forced Decoding In this section, we describe the forced decoding for hierarchical phrase-based translation in detail.",
        "Given a sentence pair of the training data, we constrain the translation of the source sentence to produce the corresponding target sentence.",
        "For this constrained decoding process, the language model score is constant as the translation is fixed.",
        "Hence, the incorporation of the a language model is not needed.",
        "This results in a simplification of the decoding process as we do not have to employ the cube pruning algorithm as described in the previous section.",
        "Consequently, forced decoding for hierarchical phrase-based translation is equivalent to synchronous parsing of the training data.",
        "Dyer (2010) has described an approach to reduce the average-case run-time of synchronous parsing by splitting one bilingual parse into two successive monolingual parses.",
        "We adopt this method and first parse the source sentence and then the target sentence with CYK+.",
        "If the given sentence pair has been parsed suc-cessfully, we employ a top-down k-best parsing algorithm (Chiang and Huang, 2005) on the resulting hypergraph to find the k-best derivations between the given source and target sentence.",
        "In this step, all models of the translation process are 175 included (except for the language model).",
        "Further, leave-one-out is applied to counteract overfitting.",
        "Note, that the model weights of the baseline system are used to perform forced decoding.",
        "Finally, we extract and count the rules which have been applied in the derivations.",
        "These counts are used to recompute the translation probabilities.",
        "3.2 Recombination In standard hierarchical phrase-based decoding, partial derivations that are indistinguishable from each other are recombined.",
        "In (Huck et al., 2013) two schemes are presented.",
        "Either derivations that produce identical translations or derivations with identical language model context are recombined.",
        "As in forced decoding the translation is fixed and a language model is missing, both schemes are not suitable.",
        "However, a recombination scheme is necessary to avoid derivations with the same application of rules.",
        "Further, recombining such derivations increases simultaneously the amounts of considered derivations during k-best parsing.",
        "Given two derivations with the same set of applied rules, the order of application of the rules may be different.",
        "Thus, we propose following scheme for recombining derivations in forced decoding: Derivations that produce identical sets of applied rules are recombined.",
        "Figure 1 shows an example for k = 3.",
        "Employing the proposed scheme, derivations d 1 and d 2 are recombined since both share the same set of applied rules ({r 1 , r 3 , r 2 }).",
        "d 1 : {r 1 , r 3 , r 2 } d 2 : {r 3 , r 2 , r 1 } d 3 : {r 4 , r 5 , r 1 , r 2 } (a) d 1 : {r 1 , r 3 , r 2 } d 3 : {r 4 , r 5 , r 1 , r 2 } d 4 : {r 6 , r 5 , r 2 , r 3 } (b) Figure 1: Example search space before (a) and after (b) applying recombination.",
        "4 Experiments 4.1 Setup The experiments were carried out on the IWSLT 2013 German?English shared translation task.",
        "1 1 http://www.iwslt2013.org German English English French Sentences 4.32M 5.23M Run.",
        "Words 108M 109M 133M 147M Vocabulary 836K 792K 845K 888K Table 1: Statistics for the bilingual training data of the IWSLT 2013 German?English and English?French task.",
        "It is focusing the translation of TED talks.",
        "Bilingual data statistics are given in Table 1.",
        "The baseline system was trained on all available bilingual data and used a 4-gram LM with modified Kneser-Ney smoothing (Kneser and Ney, 1995; Chen and Goodman, 1998), trained with the SRILM toolkit (Stolcke, 2002).",
        "As additional data sources for the LM we selected parts of the Shuffled News and LDC English Gigaword corpora based on cross-entropy difference (Moore and Lewis, 2010).",
        "In all experiments, the hierarchical search was performed as described in Section 2.",
        "To confirm the efficacy of our approach, additional experiments were run on the IWSLT 2013 English?French task.",
        "Statistics are given in Table 1.",
        "The training pipeline was set up as described in the previous section.",
        "Tuning of the log-linear parameter weights was done with MERT on a provided development set.",
        "As optimization criterion we used BLEU (Papineni et al., 2001).",
        "Forced decoding was performed on the TED talks portion of the training data (?140K sen-tences).",
        "In both tasks, around 5% of the sentences could not be parsed.",
        "In this work, we just skipped those sentences.",
        "We report results in BLEU [%] and TER [%] (Snover et al., 2006).",
        "All reported results are averages over three independent MERT runs, and we evaluated statistical significance with MultE-val (Clark et al., 2011).",
        "4.2 Results Figure 2 shows the performance of setups using translation models with reestimated translation probabilities.",
        "The setups vary in the k-best derivation size extracted in the forced decoding (fd) step.",
        "Based on the performance on the development set, we selected two setups with k = 500 using leave-one-out (+l1o) and k = 750 without leave-one-out (-l1o).",
        "Table 2 shows the final results for the German?English task.",
        "Performing consistent translation model training improves the translation 176 dev * eval11 test BLEU [%] TER [%] BLEU [%] TER [%] BLEU [%] TER [%] baseline 33.1 46.8 35.7 44.1 30.5 49.7 forced decoding -l1o 33.2 46.3 36.3 43.4 31.2 48.8 forced decoding +l1o 33.6 46.2 36.6 43.0 31.8 48.3 Table 2: Results for the IWSLT 2013 German?English task.",
        "The development set used for MERT is marked with an asterisk (*).",
        "Statistically significant improvements with at least 99% confidence over the baseline are printed in boldface.",
        "dev * eval11 test BLEU [%] TER [%] BLEU [%] TER [%] BLEU [%] TER [%] baseline 28.1 55.7 37.5 42.7 31.7 49.5 forced decoding +l1o 28.8 55.0 39.1 41.6 32.4 49.0 Table 3: Results for the IWSLT 2013 English?French task.",
        "The development set used for MERT is marked with an asterisk (*).",
        "Statistically significant improvements with at least 99% confidence over the baseline are printed in boldface.",
        "31.5 32 32.5 33 33.5 34 1 10 100 1000 10000 B L E U [ % ] k dev fd +l1odev fd -l1odev baseline Figure 2: BLEU scores on the IWSLT German?English task of setups using translation models trained with different k-best derivation sizes.",
        "Results are reported on dev with (+l1o) and without leave-one-out (-l1o).",
        "quality on all test sets significantly.",
        "We gain an improvement of up to 0.7 points in BLEU and 0.9 points in TER.",
        "Applying leave-one-out results in an additional improvement by up to 0.4 % BLEU and 0.5 % TER.",
        "The results for English?French are given in Table 3.",
        "We observe a similar improvement by up to 1.6 % BLEU and 1.1 % TER.",
        "The improvements could be the effect of domain adaptation since we performed forced decoding on the TED talks portion of the training data.",
        "Thus, rules which were applied to decode the in-domain data might get higher translation probabilities.",
        "Furthermore, employing leave-one-out seems to avoid overfitting as the average source rule length in training is reduced from 5.0 to 3.5 (k = 500).",
        "5 Conclusion We have presented a simple and effective approach for consistent training of hierarchical phrase-based translation models.",
        "By reducing hierarchical decoding on parallel training data to synchronous parsing, we were able to reestimate the translation probabilities including all models applied during the translation process.",
        "On the IWSLT German?English and English?French tasks, the final results show statistically significant improvements of up to 1.6 points in BLEU and 1.4 points in TER.",
        "Our implementation was released as part of Jane (Vilar et al., 2010; Vilar et al., 2012; Huck et al., 2012; Freitag et al., 2014), the RWTH Aachen University open source statistical machine translation toolkit.",
        "2 Acknowledgments The research leading to these results has received funding from the European Union Seventh Framework Programme (FP7/2007-2013) under grant agreements no 287658 and no 287755.",
        "2 http://www.hltpr.rwth-aachen.de/jane/ 177 References"
      ]
    }
  ]
}
