{
  "info": {
    "authors": [
      "Patrick Simianer",
      "Stefan Riezler"
    ],
    "book": "Workshop on Statistical Machine Translation",
    "id": "acl-W13-2236",
    "title": "Multi-Task Learning for Improved Discriminative Training in SMT",
    "url": "https://aclweb.org/anthology/W13-2236",
    "year": 2013
  },
  "references": [
    "acl-D07-1104",
    "acl-D11-1139",
    "acl-E03-1076",
    "acl-E12-1083",
    "acl-J07-2003",
    "acl-N09-1068",
    "acl-N10-1069",
    "acl-P02-1040",
    "acl-P07-1033",
    "acl-P09-1019",
    "acl-P09-1054",
    "acl-P10-4002",
    "acl-P11-2031",
    "acl-P12-1002",
    "acl-W10-1757",
    "acl-W11-2123"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Multi-task learning has been shown to be effective in various applications, including discriminative SMT.",
        "We present an experimental evaluation of the question whether multi-task learning depends on a ?natural?",
        "division of data into tasks that balance shared and individual knowledge, or whether its inherent regularization makes multi-task learning a broadly applicable remedy against overfitting.",
        "To investigate this question, we compare ?natural?",
        "tasks defined as sections of the International Patent Classification versus ?random?",
        "tasks defined as random shards in the context of patent SMT.",
        "We find that both versions of multi-task learning improve equally well over independent and pooled baselines, and gain nearly 2 BLEU points over standard MERT tuning."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Multi-task learning is motivated by situations where a number of statistical models need to be estimated from data belonging to different tasks.",
        "It is assumed that the data are not completely independent of one another as they share some commonalities, yet they differ enough to counter a simple pooling of data.",
        "The goal of multi-task learning is to take advantage of commonalities among tasks by learning a shared model without neglecting individual knowledge.",
        "For example, Obozinski et al.",
        "(2010) present an optical character recognition scenario where data consist of samples of handwritten characters from several writers.",
        "While the styles of different writers vary, it is expected that there are also commonalities on a pixel-or stroke-level that are shared across writers.",
        "Chapelle et al. (2011) present a scenario where data from search engine query logs are available for different countries.",
        "While the rankings for some queries will have to be country-specific (they cite ?football?",
        "as a query requiring different rankings in the US and the UK), a large fraction of queries will be country-insensitive.",
        "Wa?schle and Riezler (2012b) present multi-task learning for statistical machine translation (SMT) of patents from different classes (so-called sections) according to the International Patent Classification (IPC)1.",
        "While the vocabulary may differ between the different IPC sections, specific legal jargon and a typical textual structure will be shared across IPC sections.",
        "As shown in the cited works, treating data from different writers, countries, or IPC classes as data from different tasks, and applying generic multi-task learning to the specific scenario, improves learning results over learning independent or pooled models.",
        "The research question we ask in this paper is as follows: Is multi-task learning dependent on a ?natural?",
        "task structure in the data, where shared and individual knowledge is properly balanced?",
        "Or can multi-task learning be seen as a general regularization technique that prevents overfitting irrespective of the task structure in the data?",
        "We investigate this research question on the example of discriminative training for patent translation, using the algorithm for multi-task learning with `1/`2 regularization presented by Simianer et al. (2012).",
        "We compare multi-task learning on ?natural?",
        "tasks given by IPC sections to multi-task learning on ?random?",
        "tasks given by random shards and to baseline models trained on independent tasks and pooled tasks.",
        "We find that both versions of multi-task learning improve over independent or pooled training.",
        "However, differences between multi-task learning on IPC tasks and random tasks are small.",
        "This points to a more general regularization effect of multi-task learning and indicates a broad applicability of multi-task learning techniques.",
        "Another advantage of the `1/`2 reg",
        "ularization technique of Simianer et al. (2012) is a considerable efficiency gain due to parallelization and iterative feature selection that makes the algorithm suitable for big data applications and for large-scale training with millions of sparse features.",
        "Last but not least, our best result for multi-task learning improves by nearly 2 BLEU points over the standard MERT baseline."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Multi-task learning is an active area in machine learning, dating back at least to Caruana (1997).",
        "A regularization perspective was introduced by Ev-geniou and Pontil (2004), who formalize the central idea of trading off optimality of parameter vectors for each task-specific model and closeness of these model parameters to the average parameter vector across models in an SVM framework.",
        "Equivalent formalizations replace parameter regularization by Bayesian prior distributions on the parameters (Finkel and Manning, 2009) or by augmentation of the feature space with domain independent features (Daume?, 2007).",
        "Besides SVMs, several learning algorithms have been extended to the multi-task scenario in a parameter regularization setting, e.g., perceptron-type algorithms (Dredze et al., 2010) or boosting (Chapelle et al., 2011).",
        "Further variants include different formalizations of norms for parameter regularization, e.g., `1/`2 regularization (Obozinski et al., 2010) or `1/`?",
        "regularization (Quattoni et al., 2009), where only the features that are most important across all tasks are kept in the model.",
        "Early research on multi-task learning for SMT has investigated pooling of IPC sections, with larger pools improving results (Utiyama and Isa-hara, 2007; Tinsley et al., 2010; Ceaus?u et al., 2011).",
        "Wa?schle and Riezler (2012b) apply multi-task learning to tasks defined as IPC sections and compare patent translation on independent tasks, pooled tasks, and multi-task learning, using same-sized training data.",
        "They show small but statistically significant improvements for multi-task learning over independent and pooled training.",
        "Duh et al. (2010) introduce random tasks as n-best lists of translations and showed significant improvements by applying various multi-task learning techniques to discriminative reranking.",
        "Song et al. (2011) define tasks as bootstrap samples from the development set and show significant improvements for a bagging-based system combination over individual MERT training.",
        "In this paper we apply the multi-task learning technique of Simianer et al. (2012) to tasks defined as IPC sections and to random tasks.",
        "Their algorithm can be seen as a weight-based backward feature elimination variant of Obozinski et al.",
        "(2010)'s gradient-based forward feature selection algorithm for `1/`2 regularization.",
        "The latter approach is related to the general methodology of using block norms to select entire groups of features jointly.",
        "For example, such groups can be defined as non-overlapping subsets of features (Yuan and Lin, 2006), or as hierarchical groups of features (Zhao et al., 2009), or they can be grouped by the general structure of the prediction problem (Martins et al., 2011).",
        "However, these approaches are concerned with grouping features within a single prediction problem whereas multi-task learning adds an orthogonal layer of multiple task-specific prediction problems.",
        "By virtue of averaging selected weights after each epoch, the algorithm of Simianer et al. (2012) is related to McDonald et al. (2010)'s iterative mixing procedure.",
        "This algorithm is itself related to the bagging procedure of Breiman (1996), if random shards are considered from the perspective of random samples.",
        "In both cases averaging helps to reduce the variance of the per-sample classifiers."
      ]
    },
    {
      "heading": "3 Multi-task Learning for Discriminative",
      "text": [
        "Training in SMT In multi-task learning, we have data points {(xiz, yiz), i = 1, .",
        ".",
        ".",
        ", Nz, z = 1, .",
        ".",
        ".",
        ", Z}, sampled from a distribution Pz on X ?",
        "Y .",
        "The subscript z indexes tasks and the superscript i indexes i.i.d.",
        "data for each task.",
        "For the application of discriminative ranking in SMT, the spaceX can be thought of as feature representations of n-best translations, and the space Y denotes corresponding sentence-level BLEU scores.2 We assume that Pz is different for each task but that the Pz's are related as, for example, considered in Evgeniou and Pontil (2004).",
        "The standard approach is to fit an independent model involving a D-dimensional parameter vector wz for each task z.",
        "In multi-task learning, we consider a Z-by-D matrix W = (wdz)z,d of stacked D-dimensional row vectors wz , and Z-dimensional column vectors wd of weights associated with feature d across tasks.",
        "The central al",
        "gorithms in most multi-task learning techniques can be characterized as a form of regularization that enforces closeness of task-specific parameter vectors to shared parameter vectors, or promotes sparse models that only contain features that are shared across tasks.",
        "In this paper, we will follow the approach of Simianer et al. (2012), who formalize multi-task learning as a distributed feature selection algorithm using `1/`2 regularization.",
        "`1/`2 regularization can be described as penalizing weights W by the weighted `1/`2 norm, which is defined following Obozinski et al. (2010), as",
        "Each `2 norm of a weight column wd represents the relevance of the corresponding feature across tasks.",
        "The `1 sum of the `2 norms enforces a selection of features by encouraging several feature columns wd to be 0 and others to have high weights across all tasks.",
        "This results in shrinking the matrix to the features that are useful across all tasks.",
        "Simianer et al. (2012) achieve this behavior by the following weight-based iterative feature elimination algorithm that is wrapped around a stochastic gradient descent (SGD) algorithm for pairwise ranking (Shen and Joshi, 2005): Algorithm 1 Multi-task SGD Get data for Z tasks, each including S sentences; distribute to machines.",
        "Initialize v?",
        "0. for epochs t?",
        "0 .",
        ".",
        ".",
        "T ?",
        "1: do for all tasks z ?",
        "{1 .",
        ".",
        ".",
        "Z}: parallel do wz,t,0,0 ?",
        "vfor all sentences i ?",
        "{0 .",
        ".",
        ".",
        "S ?",
        "1}: do Decode ith input with wz,t,i,0.for all pairs j ?",
        "{0 .",
        ".",
        ".",
        "P ?",
        "1}: do",
        "return v The innermost loop of the algorithm computes an SGD update based on the subgradient ?lj of a pairwise loss function.",
        "`1/`2-based feature selection is done after each epoch of SGD training for each task in parallel.",
        "The `2 norm of the weights is computed for each feature column across tasks; features are sorted by this value; K top features are kept in the model; reduced weight vectors are mixed and the result is resent to each task-specific model to start another epoch of parallel training for each task.",
        "We compare two different loss functions for pairwise ranking, one corresponding to the original perceptron algorithm (Rosenblatt, 1958), and an improved version called the margin perceptron (Collobert and Bengio, 2004).",
        "To create training data for a pairwise ranking setup, we generate preference pairs by ordering translations according to smoothed sentence-wise BLEU score (Nakov et al., 2012).",
        "Let each translation candidate in the n-best list be represented by a feature vector x ?",
        "IRD: For notational convenience, we denote by xj a preference pair xj = (x(1)j ,x(2)j ) where x(1)j is ordered above x(2)j w.r.t.",
        "BLEU.",
        "Furthermore, we use the shorthand x?j = x(1)j ?",
        "x(2)j to denote aD-dimensional difference vector representing an input pattern.",
        "For completeness, a label y = +1 can be assigned to patterns x?j where x(1)j is ordered above x(2)j (y = ?1 otherwise), however, since the ordering relation is antisymmetric, we can consider an ordering in one direction and omit the label entirely.",
        "The original perceptron algorithm is based on the following hinge loss-type objective function:",
        "where (a)+ = max(0, a) , w ?",
        "IRD is a weight vector, and ?",
        "?, ??",
        "denotes the standard vector dot product.",
        "Instantiating SGD to the stochastic sub",
        "leads to the perceptron algorithm for pairwise ranking (Shen and Joshi, 2005).",
        "Collobert and Bengio (2004) presented a version of perceptron learning that includes a margin term in order to control the capacity and thus the generalization performance.",
        "Their margin perceptron algorithm follows from applying SGD to the loss function lj(w) = (1?",
        "?w, x?j ?",
        ")+",
        "with the following stochastic subgradient",
        "Collobert and Bengio (2004) argue that the use of a margin term justifies not using an explicit regularization, thus making the margin perceptron an efficient and effective learning machine."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": []
    },
    {
      "heading": "4.1 Data & System Setup",
      "text": [
        "For training, development and testing, we use data extracted from the PatTR3 corpus for the experiments in Wa?schle and Riezler (2012b).",
        "Training data consists of about 1.2 million German-English parallel sentences.",
        "We translate from German into English.",
        "German compound words were split using the technique of Koehn and Knight (2003).",
        "We use the SCFG decoder cdec (Dyer et al., 2010)4 and build grammars using its implementation of the suffix array extraction method described in Lopez (2007).",
        "Word alignments are built from all parallel data using mgiza5 and the Moses scripts6.",
        "SCFG models use the same settings as described in Chiang (2007).",
        "We built a modified Kneser-Ney smoothed 5-gram language model using the English side of the training data and performed querying with KenLM (Heafield, 2011)7.",
        "The International Patent Classification (IPC) categorizes patents hierarchically into 8 sections, 120 classes, 600 subclasses, down to 70,000 subgroups at the leaf level.",
        "The eight top classes (called sections) are listed in Table 1.",
        "Typically, a patent belongs to more than one section, with one section chosen as main classification.",
        "Our development and test sets for each of the classes, A to H, comprise 2,000 sentences each, originating from a patent with the respective class.",
        "These sets were built so that there is no overlap of development sets and test sets, and no overlap between sets of different classes.",
        "These eight test sets are referred to as independent test sets.",
        "Furthermore, we test on a combined set,",
        "called pooled-cat, that is constructed by concatenating the independent sets.",
        "Additionally we use two pooled sets for development and testing, each containing 2,000 sentences with all classes evenly represented.",
        "Our tuning baseline is an implementation of hy-pergraph MERT (Kumar et al., 2009), directly optimizing IBM BLEU4 (Papineni et al., 2002).",
        "Furthermore, we present a regularization baseline by applying `1 regularization with clipping (Carpenter, 2008; Tsuruoka et al., 2009) to the standard pairwise ranking perceptron.",
        "All pairwise ranking methods use a smoothed sentence-wise BLEU+1 score (Nakov et al., 2012) to create gold standard rankings.",
        "Our multi-task learning experiments are based on pairwise ranking perceptrons that differ in their objective, corresponding either to the original perceptron or to the margin-perceptron.",
        "Both versions of the perceptron are used for single-task tuning and multi-task tuning.",
        "In the multi-task setting, we compare three different methods for defining a task: ?natural?",
        "tasks given by IPC sections where each independent data set is considered as task; ?random?",
        "tasks, defined by sharding where data is shuffled and split once, tasks are kept fixed throughout, and by resharding where after an epoch data is shuffled and new random tasks are constructed.",
        "In all cases a task/shard is defined to contain 2,000 sentences8, resulting in eight shards for each setting.",
        "The number of features selected after each epoch was set to K = 100, 000.",
        "For all perceptron runs, the following meta parameters were fixed: A cube pruning pop limit of 200 and non-terminal span limit of 15; 100-best lists with unique entries; constant learning rate; multipartite pair selection.",
        "Single-task perceptron runs on independent and pooled tasks were done",
        "features for three different tuning sets: independent (separate tuning sets for each IPC class), pooled and pooled-cat (concatenated independent sets).",
        "Significant superior performance over other systems in the same row is denoted by prefixed numbers.",
        "The first row shows, e.g., that the result of pooled 1 is significantly better than independent 0, and pooled-cat 2. for 15 epochs; multi-task perceptron runs used 10 epochs.",
        "Single-task tuning on pooled-cat data increases computation time by a factor of eight which makes this setup infeasible in practice.",
        "For the sake of comparison we performed 10 epochs in this setup.",
        "MERT (with default parameters) is used to optimize the weights of 12 dense default features; eight translation model features, a word penalty, the passthrough weight, the language model (LM) score, and an LM out-of-vocabulary penalty.",
        "Per-ceptron training allows to add millions of sparse features which are directly derived from grammar rules: rule shape, rule identifier, bigrams in rule source and target.",
        "For a further explanation of these features see Simianer et al. (2012).",
        "For testing we measured IBM BLEU4 on tokenized and lowercased data.",
        "Significance results were obtained by approximate randomization tests using the approach of Clark et al. (2011)9 to account for optimizer instability.",
        "Tuning methods with a random component (MERT, randomized experiments) were repeated three times, scores reported in the tables are averaged over optimizer runs."
      ]
    },
    {
      "heading": "4.2 Experimental Results",
      "text": [
        "In single-task tuning mode, systems are tuned on the eight independent data sets separately, the pooled data set, and the independent data sets con",
        "ularization baseline using sparse rule features, tuned on independent, pooled and pooled-cat sets.",
        "Prefixed superscripts denote a significant improvement over the result in the same row indicated by the superscript.",
        "catenated (pooled-cat).",
        "Testing is done on each of the eight IPC sections separately, and on a pooled test set of 2,000 sentences where all sections are equally represented.",
        "Furthermore, we report average test results over runs for all independent data sets.",
        "Results for the MERT baseline are shown in",
        "pendent sets leads to significant performance improvements on all sets with averaged scores being nearly identical.",
        "Evaluation results obtained with the standard perceptron algorithm (Table 4) show improvements over MERT in single-task tuning mode.",
        "The gain on pooled-cat data shows that in contrast to MERT training on 12 dense features, discriminative training using large feature sets is able to benefit from large data sets.",
        "However, since the pooled-cat scenario increases computation time by a factor of 8, it is quite infeasible when used with large sets of sparse features.",
        "Single-task tuning on a small set of pooled data seems to show overfitting behavior.",
        "Table 3 shows evaluation results for a regularization baseline that applies `1 regularization with clipping to the the single-task tuned standard perceptron in Table 4.",
        "We see gains in BLEU on independent and pooled-cat tuning data, but not on the small pooled data set.",
        "Multi-task tuning for the standard perceptron is shown in the right half of Table 4.",
        "Because of parallelization, this scenario is as efficient as",
        "single-task tuning multi-task tuning indep.",
        "0 pooled 1 pooled-cat 2 IPC 3 sharding 4 resharding 5",
        "pooled, and pooled-cat sets, and in multi-task mode on eight tasks taken from IPC sections or by random (re)sharding.",
        "Prefixed superscripts denote a significant improvement over the result in the same row indicated by the superscript.",
        "single-task tuning multi-task tuning indep.",
        "0 pooled 1 pooled-cat 2 IPC 3 sharding 4 resharding 5",
        "tasks, and in multi-task mode on eight tasks taken from IPC sections or by random (re)sharding.",
        "Prefixed superscripts denote a significant improvement over the result in the same row indicated by the superscript.",
        "single-task tuning on small data.",
        "We see improvements in BLEU over single-task tuning on small and large tuning data sets.",
        "Concerning our initial research questions, we see that the performance difference between ?natural?",
        "tasks (IPC) and ?random?",
        "tasks is not conclusive.",
        "However, multi-task learning using `1/`2 regularization consistently outperforms the standard perceptron under `1 regularization as shown in Table 3 and MERT tuning as shown in Table 2.",
        "Table 5 shows the evaluation results of the margin-perceptron algorithm.",
        "Evaluation results on single-task tuning show that this algorithm improves over the standard perceptron (Table 4), even in its `1-regularized version (Table 3), on all tuning sets.",
        "Results for multi-task tuning show improvements over the same scenario for the standard perceptron (Table 4).",
        "This means that the improvements due to the orthogonal regularization techniques in example space and feature space, namely large-margin learning and multi-task learning, add up.",
        "A comparison between single-task and multi-task tuning modes of the margin-perceptron shows a gain for the latter scenarios.",
        "Differences between multi-task learning on IPC classes versus random sharding or resharding are again small, with the best overall result obtained by multi-task learning of the margin-perceptron on IPC classes.",
        "Overall, our best multi-task learing result is nearly 2 BLEU points better than MERT training.",
        "The algorithm to achieve this result is efficient due",
        "to parallelization and due to iterative feature selection.",
        "As shown in the last rows of Tables 3-5 , the average size is around 400K features for independently tuned models and around 1.6M features for models tuned on pooled-cat data.",
        "In multi-task learning, models can be iteratively cut to 100K shared features whose weights are tuned in parallel."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "We presented an experimental investigation of the question whether the power of multi-task learning depends on data structured along tasks that exhibit a proper balance of shared and individual knowledge, or whether its inherent feature selection and regularization makes multi-task learning a widely applicable remedy against overfitting.",
        "We compared multi-task patent SMT for ?natural?",
        "tasks of IPC sections and ?random?",
        "tasks of shards in distributed learning.",
        "Both versions of multi-task learning yield significant improvements over independent and pooled training, however, the difference between ?natural?",
        "and ?random?",
        "tasks is marginal.",
        "This is an indication for the usefulness of multi-task learning as a generic regularization tool.",
        "Considering also the efficiency gained by iterative feature selection, the `1/`2 regularization algorithm presented in Simianer et al. (2012) presents itself as an efficient and effective learning algorithm for general big data and sparse feature applications.",
        "Furthermore, the improvements by multi-task feature selection add up with improvements by large-margin learning, delivering overall improvements of nearly 2 BLEU points over the standard MERT baseline.",
        "Our research question regarding the superiority of ?natural?",
        "or ?random?",
        "tasks was shown to be undetermined for the application of patent translation.",
        "The obvious question for future work is if and how a task division can be found that improves multi-task learning over our current results.",
        "Such an investigation will have to explore various similarity metrics and clustering techniques for IPC subclasses (Wa?schle and Riezler, 2012a), e.g., for the goal of optimizing clustering with respect to the ratio of between-cluster to within-cluster similarity for a given metric.",
        "However, the final criterion for the usefulness of a clustering is necessarily application specific (von Luxburg et al., 2012), in our case specific to patent translation performance.",
        "Nevertheless, we hope that the presented and future work will prove useful and generalizable for related multi-task learning scenarios."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The research presented in this paper was supported in part by DFG grant ?Cross-language Learning-to-Rank for Patent Retrieval?."
      ]
    }
  ]
}
