{
  "info": {
    "authors": [
      "Norihiro Abe",
      "Saburo Tsuji"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-1001",
    "title": "A Learning of Object Structures by Verbalism",
    "url": "https://aclweb.org/anthology/C82-1001",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Toyonaka Osaka JAPAN In this paper ai attempt of learning by verbalism is shown in order to create the models for an,identification of unknown objects.",
        "When we expect a computer to recognize objects, the models of them must be given to it, however there are cases where some objects may not be,matched to the models or there is no model with which object is compared.",
        "At that time, this system can augment or create new descriptions by being explicitly taught using verbal instructions."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "We have reported the story understanding system which uses both linguistic and pictorial information in order to,resolve the meaning of givenisentences and images.",
        "In this research, we have believe that a correct meaning of the given sentences is obtained if the relations among noun phrases, which correspond to objects in the images, consistent with the relations observed among objects in the images.",
        "The :fact that this identification of objects and the interpretation (of the given sentences supplements each other simplifies both the detection of objects and disamibiguation of word sense or prepositional groups.",
        "In spite of these effects, this formalism has a defect that it requires additional knowledge, sources, the model of objects that will appear in the images.",
        "All of models of objects or actors that are supposed to appear in,the picture must be given to our system in order to achieve its purposes.",
        "But it is not easy for us to store all of such models in a computer.",
        "If a person who does not know well about the details of this system wants to interacttwith it, he will give up to use the system, as he knows nothing of the representation.",
        "of models in the computer.",
        "To make matters worse, there are quite many variations in real objects which we will encounter in the real world.",
        "For example,we can see various type of houses.",
        "(In the traditional AI system, a generic model is utilized) to identify such class of objects.",
        "But it is not easy for such a system to discriminate idiosyncrasy of varous objects.",
        "IFig.1 shows a part, of sample story used to experiment its story understanding capability.",
        "Even if the system is supposed to be given a generic model (for example, BOGLE) that represents both OBAQ and OJIRO, the system will not be able to discriminate them.",
        "The system needs some proper model for OBAQ and OJIRO.",
        "But if a new character which ha's some similar points to OBAQ and OJIRO apperes in the story, some modifications, to the BOGLE model are required.!",
        "Thus generalization process could not be acomplised in advance, but should be achieved through experience.",
        "When, we are asked to do some task, we are usually given informations concerning to the objects of that task and :their processing method.",
        "In case where we encounter some unkown objects in the course of the task we can construct a, more generic !model including them (together with aicreation of instance models for those individuals by demanding an explanation to a person who knows well",
        "about those objects.",
        "In this,real situation, it cannot be expected that a learning process proceeds successfully like the experiment studied by Winston, as the assumption fails of success that the",
        "samples can be arranged conveniently for the learning.",
        "We usually augment our knowledge by explicitly being taught about missing or insufficient parts of the known models.",
        "In order to realize this type of learning, there are two important problems to be solved.",
        "First is an explanation capability.",
        "Unless a",
        "capability to convey one's obscure points tJ his partner is given to the system, it is difficult for the system to obtain good instructions from its partneri Second is a point that fromtwhat kind of levels of knowledge state the system should start its learning process.",
        "Should an initial state ofknowledge be given in forms of an inner representation or be explained in natural language?",
        "We select the former approach by just the following reason.",
        "We think it quite difficult to give a clear view to unknown object without referring to models.",
        "So we restrict a. class of objects learned by our system to the group of objects of which the system can obtain clear views concerning to their conditions through the comparison with their similar example.",
        "But the assumption is not required that.",
        "examples should be different in only one or two points at most from the unknown object.",
        "Many discrepancies between the object and its models are permitted to exist because such differences can be explained explicity in the language,by a teacher.",
        "And through a cognition of analogical or discrepant points of objects belonging to the same conceptual class, a generalization process is invoked that creates a common concept to them.",
        "2.",
        "Description for Object",
        "The .model description used in this paper is,the same one shown in the paper[1] except for the usage of the frame representation to describe' relations among subparts of the model.",
        "Let explan using an example.",
        "Fig.2 shows the OBAQ, who is an actor of the sample story shown in Fig.li To describe location of subparts of this model, its main part is enclosed by a rectangle as shown in Fig.2.",
        "Then, this rectangle is devided into 9 subregions and the location of its subparts.",
        "is described in terms of these subregions.",
        "When some of these subparts 'has also subparts, they.are hierarchically described in the similar way.",
        "And the relations between these subparts is represented using the frame, structures.",
        "The frame structures corresponding to.the OBAQ model is given in Fig.3 (this figure shows a hypothetical model of OJIRO obtained from the copy of OBAQ frames)",
        "3.",
        "Frame Representation",
        "The slot AKO means a well-known relation A-KIND-OF, anti the CLASS indicates whether the frame is gneric or instance frame..",
        "If the frame is generic, then it has two slot, GENE recording its lower class of generic frames and INST recording its instance frames.",
        "The FIG slot represents a pictorial reration.to its parent frame.",
        "This slot means that the part corresponding to this frame is a subpart of the .frame stored in the PART and that it can be found by looking for the region designated in pos.",
        "And the facet DIR describes a relation which this part has to its parents There are three relations concerning to the DIR as shown in Fig.2 and concering to the POs, many combinations of subregions are permitted which can be expressed with the symbols, L,C,R•and U,C,D.",
        "Especially the symbols ®, se are used to \"designate the locations shown in Fig.4.",
        "The slot sHAp represent whether the part corresponding to this frame is a region( G) or a branch(EDIA).",
        "The SUPslot records its subparts and their locations of or relations to this part are described in three facets as shown above.",
        "Especially SUB slot instead of when the SHAP condition is BRA, this frame has a",
        "A LEARNING OF OBJECT STRUCTURES BY VERBALISM 3 SUBP.",
        "slot and a branch structure is recorded here.",
        "An example :of a branch is shown in Fig.5.",
        "The COL slot records a color of this part and a slot CONCEPT means that this frame is prepared for the conceptual consistency' of frames and not for pictorial relation.",
        "In additionito these slots, there are several slots, WAKE, SEX.",
        "NUM and so on.",
        "These are prepaired Ito generate a sentence.for stating a reason why this' frame .is required or an explanation about why discrepancies between an object and its model can be found out in its matching:process.",
        "4.",
        "Basic:Strategy of Learning The system tries to generate a model.for the unknown object by referring to an analogical model and using a teacher's instruction, and simultaneously it augments the concept treesiof objects.",
        "At that time, the first key for a detection of analogy is assumed to be in locations of subparts of objects.",
        "When we are told that an unknown object is similar to a certain object among various points of view, we usually expect that many substructures having similar features will be found in the same location as the refered object.",
        "Of course, there are many examples that resemblance in a locationi is not useful but prevents; the program from achieving a correct detection of analogy.",
        "At that case,.",
        "the teacher should explicilty.tell the program to ignore",
        "this standard and to use other methods suet' as similarity in relations or shapes or colors of objects.",
        "lAs we usually employ these variety way to detect analogy and record these experinces into our memory, we can easily decide what method should be used to compare things.",
        "We can not say that the program has learned something until] these mechanisms recording a standards to compar things into memory are realized in the program.'"
      ]
    },
    {
      "heading": "5. Scenario",
      "text": [
        "T: WHAT ARE YOU DOING?",
        "C: I have found a black region in the center of the middle part of his body as a candidate of his right-eye.",
        "But it is different from his model.",
        "(10) T: EXPLAIN OJIRO'S RIGHT-EYE.",
        "C: Which do you mean the model or object?",
        "T: MODEL.",
        "C: It is a white region which is above his mouth in the model.",
        "Do you want another explanation?",
        "T: NO.",
        "T: DOES IT HAVE SUBPARTS?",
        "C: Yes, his right-eye has a pupil in the model.",
        "T: OJIRO'S RIGHT-EYE IS A BLACK REGION.",
        "C: I have found his right-eye.",
        "I have found his left-eye.",
        "Finally, I have found ojiro.",
        "T: EXPLAIN OJIRO.",
        "C: He is a kind of bogie.",
        "T: EXPLAIN OJIRO'S STRUCTURE.",
        "C: Ojiro is a yellow region and his body has a hair, a mouth, eyes and hands."
      ]
    },
    {
      "heading": "6. Example",
      "text": [
        "We would like to explain how the dialog shown in 5. has been obtained.",
        "By (1) the program generate OIJR0 model from OBAQ model shown in Fig.3; and constructs a frame tree consisting from a BOGLE frame and the OBAQ frame, is stored as an instance of the BOGLE frame.",
        "But it records: in its STM thatithere is just one hair as the teacher said so.",
        "Next, Cilooks for a candidate region of OJIRO using the copied model.",
        "In.the second frame, OBAQ, TABLE, APPLE, CLOCK and OJIRO are drawn, but as the first four objects have been appeared in the first frame, in this case C can find OJIRO by looking for new objects.",
        "But regrettably a color of the region (yellow) which seems to be OJ-IRO'S. body(J-BODY) being different from that of the model(white), this cause a complaint shown in (2) and by accepting a T's agreement C can believe its correctness and T can also think C in a right state.",
        "Consequently, C changes value of.",
        "COL in J-BODY into YELLOW.",
        "Next; C tries a verificationiof J-HAIR which is the 'first member of SCOUT; where ScouT={J-HAIR,J-HAND} As C can be aware of the fact that J-HAIR is a hair by its AKO slot and that there is a note on the hair in STM, it can know that OJIRO'S ,hair cannot be recognized only by referring, to the copied model.",
        "Since the just one alteration in the number of hairs is recorded there,.",
        "C thinks their location to be same as model specification, and can find a line in the ((C)U) part of J-BODY.",
        "It ends the verification of J-HAIR by storing (Hi NIL).",
        "into SUM) slo' in place of-(L1 NIL L2 NIL L3 NIL).",
        "In a similar way to this, C begins to A LEARNING OF OBJECT STRUCTURES BY VERBALISM 5 identify J-HAND, however C can be aware of that it should look for J-R-HAND and J-L-HAND, as there is a CONCEPT slot in J-HAND.",
        "So C succeeds in the identificationlof them,because of a perfect match in their locations, colors and substructures.",
        "The result of this steps is reported in (3).",
        "Next, the identification process proceeds to SIN and C starts a verification of J-MOUTH,where SiN=(J-MOUTH, J-EYE).",
        "As the locational constraint for this part is (••0C), which means that it occupies (.",
        "(L)C), ((C),C) and ((R),C) of J-BODY, the check is attempted whether just one candidate can be found for each of these 3 subregions.",
        "In this case, nothing is found for ((L)C)land ((R)C) but several parts are found in ((C)C) of J-BODY.",
        "So this process is suspended and identification of other parts (J-R-EYE and J-L-EYE) is attempted, but the same ambiguity as the above occurs and this causes the identification steps to be suspended.",
        "Consequently, for each one of these 3 parts,itheir results are just same 'each other; there are 3iparts in the ((C)C) of J-BODY and theylare candiades for J-MOUTH, J-R-EYE and J-L-EYE.",
        "Then C avails of the relational constraint on,locations of them in order to clarify their correspondences as far as possible.",
        "It infers!",
        "that J-MOUTH .probably locates in a lower position than J-EYE, because the locationiof J-MOUTH is (••0C) and that of J-R-EYE and J-L-EYE is ((L)U) and ((R)U) respectively (in this example note that the location of J-EYE, (•10U) can be also available).",
        "And it is also decidable if which black region corresponds to J-L(R)-EYE using.",
        "the relation between ((L)U) and ((R)U).",
        "By this assumption on availabilty of the relational constraints, C can discover one possible correspondence between the model and object.",
        "Then other properties are tested.",
        "But regrettably, discrepancies are found for both his mouth and eyes.",
        "The candidate for his mouth is a line segment, whereas the model says that it is a region and that it has a substructure.",
        "Similary the candidate for his left(right) eye is a black region,but its model description is that it is a white region with .a substructure.. At the present state of program, any estimation on which is more plausible is not realized regarding to the accordance of these properties, C simply complains about their disagreements in the order of their discovery.",
        "Therefore it at first complains of his mouth as shown in (4).",
        "Given teacher's instruction on a. shape of mouth, .0 is convinced of his decision and add a new slot SUBS in place of SUBP and records (H2 NIL) into it becase it has found that his mouth is not a region but a line segment.",
        "Here instead of the instruction1(9), T can say that C should be believe the given image correct.",
        "In that case, .0 suppose its decision to be right and does the same thing as the above.",
        "The difference between these two cases is that the latter has a high risk in the correctness of its conclusion.",
        "Next, C complains about the discrepancies of his eyes.",
        "Note here that nothing is stated about his left-eye once an instruction on his right-eye is given to it, because they have the same properties concerning to both their models and object parts.",
        "In case where one of them is not same, a question is asked about the difference by C. 7.",
        "Use of Generic Frames As mentioned in 4., OBAQ frame causes BOGLE frame to be generated as a generic one, and OJIRO frame is obtained through learning process.",
        "At present our program just makes frame trees in which OJIRO and OBAQ frame are child of BOGLE.",
        "A reason for thislis partly due to a lack of condsideration how simple pictorial descriptions can be compiled from various types of deviations in slot values.",
        "An another reason is that there is a danger of partial rearrangements of frames treest In the example, we at first believe OBAQ frame to be an instance frame but it may turn out thatiit is not an instance when other examples not matched to this frame appears in image, because there are many varietions in his shape as he can wink or move his eyes or open his mouth.",
        "After program have",
        "experinced these example, it should i.4ke a general concept of OBAQ and arrange frame trees by erasing unnec_.ssary instances about him.",
        "As a more important problem, s'rategies to discover cues for finding analogy between subparts mtm belstored in some slots of their model; that is, the locational cons aint is a useful cue for human, animals and so on, but is not adeqr , for doors and windors of houses.",
        "Though there are some inco/- fete points in the construction of frame trees, program can use a po,_ion of them to identify subparts of the object to be learned.",
        "For eiample, suppose that we, would like to teach a character Q-KO by referrin'A to OJIRO.",
        "Let suppose that Q-KO resembles to him very much except for her eyes but that they are rather similar to OBAQ's. In the course of identification of her, if OBAQ frame is not stored, program will complain about her eyes as well as in the learning of OJIRO from OBAQ.",
        "However it can use OBAQ'S eyes in the irecognition of her eyes by tracing its AKO link and finding OBAQ frame, after a failure in the matching of her eyes to OJIRO's. Of cause, it does not do that without teacher's permission, but will ask for his approval."
      ]
    },
    {
      "heading": "8. Explanation Capability",
      "text": [
        "It is necessary for teacher to be given sufficient explanations about the level of knowledge the computer has attained.",
        "Unless the computer, can tell him what it is,looking for, what it has already found, what sort of descrepancies it suffers from, he cannot give proper instructions leading the 'computer to a satisfastory state.",
        "There are many sentence generating and explanation systems, however an explanation system like this research has not been investigated in the point that our system tries to give its partner an explanation or pictorial features of objects to be modeled by translating sentences not from the case frame of sentences but from frames corresponding to the pictorial models.",
        "Naturally such an explanation is on locations, shapes, colors and relations that models or objects have, and must be given in the forms that the partner can easily understand what the system knows.",
        "For this purpose, the explanation on locations is first attempted using the referred things in the dialog, and is finally given in an absolude coordinate based on the 9 subregions if there is no reference or the reference stack becomes empty.",
        "(4),(5),(6) in the Scenario shows .this mechanism.",
        "The next important thing is that a partner may expect a detail explanation for something, but expect just a simple one for others.",
        "Regrettably the present sate of our program cannot detect hiS demand like this or resolve ambiguous points of his question then it must ask him about his require as shown in (7).",
        "In this case, there,are also many things to be explained, however the points ere only stated by the program and the detail explanation is left to the partner as in (8).",
        "We believe this method proper because of easiness of explanations.",
        "The comparison between things are listed in above of (9) in order to clarify theindifferencies.",
        "If more detail on the lip is needed, the partner can ask the system about iti.",
        "On account of limited space, though we cannot state a sufficient discussion, there are many problems to be improved on how the system should grasp partner's intention or requirments.",
        "They must be solved for giving simple explanation to the partner."
      ]
    },
    {
      "heading": "Reference",
      "text": []
    }
  ]
}
