{
  "info": {
    "authors": [
      "Jin Yang",
      "Jean Senellart",
      "Remi Zajac"
    ],
    "book": "SIGHAN Workshop on Chinese Language Processing",
    "id": "acl-W03-1729",
    "title": "SYSTRAN's Chinese Word Segmentation",
    "url": "https://aclweb.org/anthology/W03-1729",
    "year": 2003
  },
  "references": [
    "acl-W03-1719"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "SYSTRAN’s Chinese word segmentation is one important component of its Chinese-English machine translation system.",
        "The Chinese word segmentation module uses a rule-based approach, based on a large dictionary and fine-grained linguistic rules.",
        "It works on general-purpose texts from different Chinese-speaking regions, with comparable performance.",
        "SYSTRAN participated in the four open tracks in the First International Chinese Word Segmentation Bakeoff.",
        "This paper gives a general description of the segmentation module, as well as the results and analysis of its performance in the Bakeoff."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Chinese word segmentation is one of the preprocessing steps of the SYSTRAN Chinese-English Machine Translation (MT) system.",
        "The development of the Chinese-English MT system began in August 1994, and this is where the Chinese word segmentation issue was first addressed.",
        "The algorithm of the early version of the segmentation module was borrowed from SYSTRAN’s Japanese segmentation module.",
        "The program ran on a large word list, which contained 600,000 entries at the time1.",
        "The basic strategy was to list all possible matches for an entire linguistic unit, then solve the overlapping matches via linguistic rules.",
        "The development was focused on technical domains, and high accuracy was achieved after only three months of development.",
        "Since then, development has shifted to other areas of Chinese-English MT, including the enrichment of the bilingual word lists with part-of-speech, syntactic and semantic features.",
        "In 2001, the development of a prototype Chinese-Japanese MT system began.",
        "Although the project only lasted for three months, some important changes were made in the segmentation convention, regarding the distinction between words and phrases 2 .",
        "Along with new developments of the SYSTRAN MT engine, the segmentation engine has recently been reimplemented.",
        "The dictionary and the general approach remain unchanged, but dictionary lookup and rule matching were reimplemented using finite-state technology, and linguistic rules for the segmentation module are now expressed using a context-free-based formalism, improving maintainability.",
        "The reimplementation generates multiple segmentation results with associated probabilities.",
        "This will allow for disambiguation at a later stage of the MT process, and will widen the possibility of word segmentation for other applications."
      ]
    },
    {
      "heading": "2 System Description",
      "text": []
    },
    {
      "heading": "2.1 Segmentation Standard",
      "text": [
        "Our definition of words and our segmentation conventions are based on available standards, modified for MT purposes.",
        "The PRC standard (Liu et al., 1993) was initially used.",
        "Sample differences are listed as follows:"
      ]
    },
    {
      "heading": "2.2 Methodology",
      "text": [
        "The SYSTRAN Chinese word segmentation module uses a rule-based approach and a large dictionary.",
        "The dictionary is derived from the Chinese-English MT dictionary.",
        "It currently includes about 400,000 words.",
        "The basic segmentation strategy is to list all possible matches for a translation unit (typically, a sentence), then to solve overlapping matches via linguistic rules.",
        "The same segmentation module and the same dictionary are used to segment different types of text with comparable performance.",
        "All dictionary lookup and rule matching are performed using a low level Finite State Automaton library.",
        "The segmentation speed is 3,500 characters per second using a Pentium 4 2.4GHZ processor."
      ]
    },
    {
      "heading": "Dictionary",
      "text": [
        "The Chinese-English MT dictionary currently contains 400,000 words (e.g., 中 华), and 200,000 multi-word expressions (e.g., 中 华 人 民 共 和 国).",
        "Only words are used for the segmentation.",
        "Specialized linguistic rules are associated with the dictionary.",
        "The dictionary is general purpose, with good coverage on several domains.",
        "Domain-specific dictionaries are also available, but were not used in the Bakeoff.",
        "The dictionary contains words from different Chinese-speaking regions, but the representation is mostly in simplified Chinese.",
        "The traditional characters are considered as “variants”, and they are not physically stored in the dictionary.",
        "For example, 意 大 利 and 义 大 利 are stored in the dictionary, and 義大利 can also be found via the character matching 義→ 义.",
        "The dictionary is encoded in Unicode (UTF8), and all internal operations manipulate UTF8 strings.",
        "Major encoding conversions are supported, including GB2312-80, GB 13000, BIG-5, BIG5-HKSCS, etc.",
        "Training The segmentation module has been tested and fine-tuned on general texts, and on texts in the technical and military domains (because of specific customer requirements for the MT system).",
        "Due to the wide availability of news texts, the news domain has also recently been used for training and testing.",
        "The training process is merely reduced to the customization of a SYSTRAN MT system.",
        "In the current version of the MT system, customization is achieved by building a User Dictionary (UD).",
        "A UD supplements the main dictionary: any word that is not found in the main MT system dictionary is added in a User Dictionary."
      ]
    },
    {
      "heading": "Name-Entity Recognition and Unknown Words",
      "text": [
        "Name entity recognition is still under development.",
        "Recognition of Chinese persons’ names is done via linguistic rules.",
        "Foreign name recognition is not yet implemented due to the difficulty of obtaining translations.",
        "Due to the unavailability of translations, even when an unknown word has been successfully recognized, we consider the unknown word recognition as part of the terminology extraction process.",
        "This feature was not integrated for the Bakeoff."
      ]
    },
    {
      "heading": "2.3 Evaluation",
      "text": [
        "Our internal evaluation has been focused on the accuracy of segmentation using our own segmentation standard.",
        "Our evaluation process includes large-scale bilingual regression testing for the Chinese-English system, as well as regression testing of the segmenter itself using a test database of over 5MB of test items.",
        "Two criteria are used:",
        "1.",
        "Overlapping Ambiguity Strings (OAS): the reference segmentation and the segmenter segmentation overlap for some string, e.g., AB-C and ABC.",
        "As shown below, this typically indicates an error from our segmenter.",
        "2.",
        "Covering Ambiguity Strings (CAS): the test strings that cover the reference strings (CAS-T: ABC and AB-C), and the reference strings that cover the test strings (CAS-R: AB-C and ABC).",
        "These cases arise mostly from a difference between equally valid segmentation standards.",
        "No evaluation with other standards had been done before the Bakeoff."
      ]
    },
    {
      "heading": "3 Discussion of the Bakeoff 3.1 Results",
      "text": [
        "SYSTRAN participated in the four open tracks in the First International Chinese Word Segmentation Bakeoff http://www.sighan.org/bakeoff2003/.",
        "Each track corresponds to one corpus with its own word segementation standard.",
        "Each corpus had its own segmentation standard that was significantly different from the others.",
        "The training process included building a User Dictionary that contains words found in the training corpora, but not in the SYSTRAN dictionary.",
        "Although each of these corpora was segmented according to its own standard, we made a single UD containing all the words gathered in all corpora.",
        "Although the ranking of the SYSTRAN segmenter is different in the four open tracks, SYSTRAN’s segmentation performance is quite comparable across the four corpora.",
        "This is to be compared to the scores obtained by other participants, where good performance was typically obtained on one corpus only.",
        "SYSTRAN scores for the 4 tracks are shown in Table 3 (Sproat and Emerson, 2003).",
        "Track R P F Roov Riv ASo 0.915 0.894 0.904 0.426 0.926 CTBo 0.891 0.877 0.884 0.733 0.925 HKo 0.898 0.860 0.879 0.616 0.920 PKo 0.905 0.869 0.886 0.503 0.934"
      ]
    },
    {
      "heading": "3.2 Discussions",
      "text": [
        "The segmentation differences between the reference corpora and SYSTRAN’s results are further analyzed.",
        "Table 4 shows the partition of divergences between OAS, CAS-T, and CAS-R strings:3",
        "The majority of OAS divergences show incorrect segmentation from SYSTRAN.",
        "However, differences in CAS do not necessarily indicate incorrect segmentation results.",
        "The reasons can be categorized as follows: a) different segmentation standards, b) unknown word problem, c) name entity recognition problem, and d) miscellaneous4.",
        "The distributions of the differences are further analyzed in Table 5 and 6 for the ASo and PKo corpora, respectively.",
        "This analysis shows that the segmentation results are greatly impacted by the difference in the segmentation standards.",
        "Other problems include for example the encoding of numbers using single bytes instead of the standard double-byte encoding in the PKo corpus, which account for about 12% of differences in the PKo track scores."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "For an open track segmentation competition like the Bakeoff, we need to achieve a balance between the following aspects:",
        "• Segmentation standards: differences between one’s own standard and the reference standard.",
        "• Adaptation to the other standards: whether one should adapt to other standards.",
        "• Dictionary coverage: the coverage of one’s own dictionary and the dictionary obtained by training.",
        "• Algorithm: combination of segmentation, unknown word identification, and name entity recognition.",
        "• Speed: the time needed to segment the corpora.",
        "• Training: time and manpower used for training",
        "each corpus and track Few systems participated in all open tracks: only SYSTRAN and one university participated in all four.",
        "We devoted about 2 person/week for this evaluation.",
        "We rank in the top three of three open tracks, and only the PKo track scores are lower, probably because of encoding problems for numbers for this corpus (we did not adjust our segmenter to cope with this corpus-specific problem).",
        "Our results are very consistent for all open tracks, indicating a very robust approach to Chinese segmentation.",
        "Analysis of results shows that SYSTRAN’s Chinese word segmentation excels in the area of dictionary coverage, robustness, and speed.",
        "The vast majority of divergences with the test corpora originate from differences in segmentation standards (over 55% for CAS-R and about 98% for CAS-T).",
        "True errors range between 0% and 2% only, the rest being assigned to either the lack of unknown word processing or the lack of a name entity recognizer.",
        "Although not integrated, the unknown word identification and name entity recognition are under development as part of a terminology extraction tool.",
        "For future Chinese word segmentation evaluations, some of the issues that arose in this Bakeoff would need to be addressed to obtain even more significant results, including word segmentation standards and encoding problems for example.",
        "We would also welcome the introduction of a surprise track, similar to the surprise track of the DARPA MT evaluations that would require participants to submit results within 24 hours on an unknown corpus."
      ]
    }
  ]
}
