{
  "info": {
    "authors": [
      "Dietmar F. Roesner"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2093",
    "title": "Why Implementors of Practical NLP Systems Can Not Wait for Linguistic Theories Remarks and Theses",
    "url": "https://aclweb.org/anthology/C88-2093",
    "year": 1988
  },
  "references": [],
  "sections": [
    {
      "text": [
        "A) There is no doubt: the idea of taking an accepted linguistic theory (it) as the basis of the implementation of a practical natural language processing (nip) system is very attractive.",
        "But: In reality there are no linguistic theories available that may be simply \"taken from the shelf and applied in such a way.",
        "Some reasons for this:",
        "- There is often a mismatch between the problems dealt with extensively in a given linguistic theory and their frequency of occnrence in real data.",
        "- On the other hand the chosen linguistic theory or grammar may tell you only little or nothing about phenomena that are predominant in your application (e.g. large nominal groups in technical texts).",
        "- Practical systems need a substantial if not complete coverage of the syntax of the n1 they are built, for.",
        "TT!",
        "general the language fragments covered by linguistic theories are not aufficient.",
        "- Evon if you are able to start with structures in accordance with a linguistic",
        "theory when building a practical nip system you will have to augment the formalism: e.g. on soon as you have to process real data and.",
        "not only text book cases a lot of conventional material has to be taken into account as well: format of dates, measurements, etc.",
        "- Linguistic theories very often have been extensively applied to problems taken from a specific natural.",
        "language (in most cases: English).",
        "To transfer those theories to other languages with different problems may be hard (if not impossible).",
        "B) Another difference between theoretical and engineering problems lies in the fact that building a practical nip system always forces you to take a lot of 'additional constraints into account that are negligeable from a theorist's viewpoint:",
        "- For the implementation, usage and Maintenance of practical nip systems dedicated software tools are needed e.g, for editing, debugging and update of grammars and lexica.",
        "• Practical alp systems are often evaluated by users (and.",
        "referees) that are non-linguists.",
        "According.",
        "to our experience those people tend to take \"superficial\" aspects that have little or no relevance for linguists as a basis for their judgements; e.g. if or if not a system for German is able to handle umlauts correctly or how you may type in to e system for Japanese.",
        "- Practical.",
        "alp systems inevitably need a substantial lexicon and - due to the generativeness of al with respect to vocabulary - additional techniques for handling unknown lexical items.",
        "C) Some of the above holds especially for work in 111 generation: - Linguistic theories are primarily concerned with aspects of (syntactic) analysis.",
        "- Some of the hard problems for analysis (e.g. PP attachment) are not equally problematic in generation.",
        "- In general nl generation in an interdisciplinary task involving a lot of nonlinguistic decisions.",
        "D) Theorists tend to restrict their approaches to the very techniques available within their theories.",
        "In practical nip systems it may be fruitful to freely combine elements from distinct \"linguistic schools\".",
        "The morpho-syntactic front end generator FREGE [Emele 87] is a case in point: fREGE takes functional grammatical structures - comparable to those from LF'G [Kaplan, Bresnan 82] - as input and working structures but provides means to specify constituent ordering as linear precedence relations similar to GPSG [Gazdar et al.",
        "82].",
        "E) What about the following analogy: The relation between theoretical linguistics and \"language engineering\" should parallel that between mathematics and (civil) engineering.",
        "F) Linguistic theory might profit from problems attacked in practical systems as well because (as with mathematics and problems in engineering) these problems may give motivation for future research.",
        "Practical work in multilingual generation - o. attempts to generate different languages from the same semantic structures - may for example give a new perspective for work in contrastive linguistics.",
        "To sum up: One should not wait ter theoretical solutions since theory might not attack some problems until they are of practical relevance."
      ]
    }
  ]
}
