{
  "info": {
    "authors": [
      "Marisa Ferrara Boston",
      "John Hale",
      "Reinhold Kliegl",
      "Shravan Vasishth"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P08-2002",
    "title": "Surprising Parser Actions and Reading Difficulty",
    "url": "https://aclweb.org/anthology/P08-2002",
    "year": 2008
  },
  "references": [
    "acl-A97-1014",
    "acl-C00-1017",
    "acl-N01-1021",
    "acl-P06-1007",
    "acl-W04-0308"
  ],
  "sections": [
    {
      "text": [
        "Surprising parser actions and reading dificulty",
        "Marisa Ferrara Boston, John Hale",
        "Michigan State University USA",
        "Reinhold Kliegl, Shravan Vasishth",
        "Potsdam University Germany",
        "{kliegl,vasishth}@uni-potsdam.de",
        "An incremental dependency parser's probability model is entered as a predictor in a linear mixed-effects model of German readers' eye-fixation durations.",
        "This dependency-based predictor improves a baseline that takes into account word length, ra-gram probability, and Cloze predictability that are typically applied in models of human reading.",
        "This improvement obtains even when the dependency parser explores a tiny fraction of its search space, as suggested by narrow-beam accounts of human sentence processing such as Garden Path theory."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "A growing body of work in cognitive science characterizes human readers as some kind of probabilistic parser (Jurafsky, 1996; Crocker and Brants, 2000; Chater and Manning, 2006).",
        "This view gains support when specific aspects of these programs match up well with measurable properties of humans engaged in sentence comprehension.",
        "One way to connect theory to data in this manner uses a parser's probability model to work out the surprisal or log-probability of the next word.",
        "Hale (2001) suggests this quantity as an index of psycholinguistic difficulty.",
        "When the transition from previous word to current word is low-probability, from the parser's perspective, the sur-prisal is high and the psycholinguistic claim is that behavioral measures should register increased cognitive difficulty.",
        "In other words, rare parser actions are cognitively costly.",
        "This basic notion has proved remarkably applicable across sentence types and languages (Park and Brew, 2006; Demberg and Keller, 2007; Levy, 2008).",
        "The present work uses the time spent looking at a word during reading as an empirical measure of sentence processing difficulty.",
        "From the theoretical side, we calculate word-by-word surprisal predictions from a family of incremental dependency parsers for German based on Nivre (2004); these parsers differ only in the size k of the beam used in the search for analyses of longer and longer sentence-initial substrings.",
        "We find that predictions derived even from very narrow-beamed parsers improve a baseline eye-fixation duration model.",
        "The fact that any member of this parser family derives a useful predictor shows that at least some syntactic properties are reflected in readers' eye fixation durations.",
        "From a cognitive perspective, the utility of small k parsers for modeling comprehension difficulty lends credence to the view that the human processor is a single-path analyzer (Frazier and Fodor, 1978)."
      ]
    },
    {
      "heading": "2. Parsing costs and theories of reading difficulty",
      "text": [
        "The length of time that a reader's eyes spend fixated on a particular word in a sentence is known to be affected by a variety of word-level factors such as length in characters, n-gram frequency and empirical predictability (Ehrlich and Rayner, 1981; Kliegl et al., 2004).",
        "This last factor is the one measured when human readers are asked to guess the next word given a left-context string.",
        "Any role for parser-derived syntactic factors would have to go beyond these word-level influences.",
        "Our methodology imposes this requirement by fitting a kind of regression known as a linear mixed-effects model to the total reading times associated with each sentence-medial word in the Potsdam Sentence Corpus (PSC) (Kliegl et al., 2006).",
        "The PSC records the eye-movements of 272 native speakers as they read 144 German sentences."
      ]
    },
    {
      "heading": "3. The Parsing Model",
      "text": [
        "The parser's outputs define a relation on word pairs (Tesniere, 1959; Hays, 1964).",
        "The structural description in Figure 1 is an example output that depicts this dependency relation using arcs.",
        "The word near the arrowhead is the dependent, the other word its head (or governor).",
        "These outputs are built up by monotonically adding to an initially-empty set of dependency relations as analysis proceeds from left to right.",
        "To arrive at Figure 1 the Nivre parser passes through a number of intermediate states that aggregate four data structures, detailed below in Table 1.",
        "a A stack of already-parsed unreduced words.",
        "t An ordered input list of words.",
        "h A function from dependent words to heads.",
        "d A function from dependent words to arc types.",
        "The stack a holds words that could eventually be connected by new arcs, while t lists unparsed words.",
        "h and d are where the current set of dependency arcs reside.",
        "There are only four possible transitions from configuration to configuration.",
        "Left-Arc and Right-Arc transitions create dependency re-",
        "Error type Amount",
        "Noun attachment 4.2% Prepositional Phrase attachment 3.0%",
        "Conjunction 1.9%",
        "Adverb ambiguity 1.8% lations between the top elements in a and t , while Shift and Reduce transitions manipulate a.",
        "When more than one transition is applicable, the parser decides between them by consulting a probability model derived from the Negra and Tiger newspaper corpora (Skut et al., 1997; Konig and Lezius, 2003).",
        "This model is called Stack3 because it considers only the parts-of-speech of the top three elements of a along with the top element of t .",
        "On the PSC this model achieves 87.9% precision and 79.5% recall for unlabeled dependencies.",
        "Most of the attachments it gets wrong (Table 2) represent alternative readings that would require semantic guidance to rule out.",
        "To compare \"serial\" human sentence processing models against \"parallel\" models, our implementation does beam search in the space of Nivre-configurations.",
        "The number of configurations maintained at any point is a changeable parameter k.",
        "In Figure 1 the thermometer beneath the German preposition \"in\" graphically indicates a high surprisal prediction derived from the dependency parser.",
        "Greater cognitive effort, reflected in reading time, should be observed on \"in\" as compared to \"alte.\"",
        "The difficulty prediction at \"in\" ultimately follows from the frequency of verbs taking prepositional complements that follow nominal complements in the training data.",
        "Equation 1 expresses the general theory: the surprisal of a word, on a language model, is the logarithm of the prefix probability eliminated in the transition from one word to the next.",
        "surprisal(n) = log2",
        "The prefix-probability an of an initial substring is the total probability of all grammatical analyses that derive w = w\\...wn as a left-prefix (Equation 2).",
        "In a complete parser, every member of D is in correspondence with a state transition sequence.",
        "In the beam-search approximation, only the top k configurations are retained from preix to preix, which amounts to choosing a subset of D."
      ]
    },
    {
      "heading": "4. Study",
      "text": [
        "The study addresses whether surprisal is a significant predictor of reading dificulty and, if it is, whether the beam-size parameter k affects the usefulness of the calculated surprisal values in accounting for reading dificulty.",
        "Using total reading time as a dependent measure, we it a baseline linear mixed-effects model (Equation 3) that takes into account word-level predictors log frequency (If), log bigram frequency (bi), word length (len), and human predictability given the left context (pr).",
        "All of the word-level predictors were statistically signiicant at the a level 0.05.",
        "Beyond this baseline, we fitted ten other linear mixed-effects models.",
        "To the inventory of wordlevel predictors, each of the ten regressions uniquely added the surprisal predictions calculated from a parser that retains at most k=1...9,100 analyses at each prefix.",
        "We evaluated the change in relative quality of fit due to surprisal with the Deviance Information Criterion (DIC) discussed in Spiegelhalter et al.",
        "(2002).",
        "Whereas the more commonly applied Akaike Information Criterion (1973) requires the number of estimated parameters to be determined exactly, the DIC facilitates the evaluation of mixed-effects models by relaxing this requirement.",
        "When comparing two models, if one of the models has a lower DIC value, this means that the model it has improved.",
        "Table 3 shows that the linear mixed-effects model of German reading difficulty improves when surprisal values from the dependency parser are used as predictors in addition to the word-level predictors.",
        "The coeficients on the baseline predictors remained unchanged (Equation 3) when any of the parser-based predictors was added.",
        "Table 3 also suggests the returns to be had in accounting for reading time are greatest when the beam is limited to a handful of parses.",
        "Indeed, a parser that handles a few analyses at a time (k=1,2,3) is just as valuable as one that spends far greater memory resources (k=100).",
        "This observation is consistent with Brants and Crocker's (2000) observation that accuracy can be maintained even when restricted to 1% of the memory required for exhaustive parsing.",
        "The role of small k dependency parsers in determining the quality of statistical it challenges the assumption that cognitive functions are global optima.",
        "Perhaps human parsing is boundedly rational in the sense of the bound imposed by Stack3 (Simon, 1955)."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "This study demonstrates that surprisal calculated with a dependency parser is a signiicant predictor of reading times, an empirical measure ofcognitive dif-iculty.",
        "Surprisal is a signiicant predictor even when examined alongside the more commonly used predictors, word length, predictability, and n-gram frequency.",
        "The viability of parsers that consider just a small number of analyses at each increment is consistent with conceptions of the human comprehender that incorporate that restriction.",
        "Table 3: Coefficients and standard errors from the multiple regressions using different versions of surprisal (baseline predictors' coefficients are not shown for space reasons).",
        "t values > 2 are statistically significant at a = 0.05.",
        "The table also shows DIC values for the baseline model (Equation 3) and the models with baseline predictors plus surprisal.",
        "Model",
        "Coeficient",
        "Std.",
        "Error",
        "t value",
        "DIC",
        "Baseline",
        "-",
        "-",
        "-",
        "144511.1",
        "k=1",
        "0.033691",
        "0.002285",
        "15",
        "143964.9",
        "k=2",
        "0.038573",
        "0.002510",
        "15",
        "143946.2",
        "k=3",
        "0.037320",
        "0.002693",
        "14",
        "143990.4",
        "k=4",
        "0.041035",
        "0.002853",
        "14",
        "143975.7",
        "k=5",
        "0.048692",
        "0.002953",
        "16",
        "143910.9",
        "k=6",
        "0.046580",
        "0.003063",
        "15",
        "143951.6",
        "k=7",
        "0.045008",
        "0.003118",
        "14",
        "143974.4",
        "k=8",
        "0.042039",
        "0.003165",
        "13",
        "144006.4",
        "k=9",
        "0.040657",
        "0.003225",
        "13",
        "144023.9",
        "k=100",
        "0.029467",
        "0.003878",
        "8",
        "144125.4"
      ]
    }
  ]
}
