{
  "info": {
    "authors": [
      "Igor A. Mel'cuk",
      "A. V. Gladky"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C69-0101",
    "title": "Tree Grammars (Grammars)",
    "url": "https://aclweb.org/anthology/C69-0101",
    "year": 1969
  },
  "references": [],
  "sections": [
    {
      "heading": "TREE GRAMMARS ( = A,- GRAMMARS)",
      "text": [
        "- Gladky A. V. (Novosibirsk) & Meluk l.A. (Moscow) - 1.This paper suggests a new kind of formal grammar (hereafter called A,- grammarit) which in some respects is closely related to Chornsky's grammars but differs from these in that it is meant to process trees (in the sense of graph theory) and not to process strings as Chomsky's grammars do.",
        "More precisely, we aim at a type of grammar with rewriting rules of the \"X -.Y\" where X and Y are trees (N. B. : with no linear order imposed on their nodes !**).",
        "Linguistically, the trees under consideration are dependency (not phrase structure) trees representing natural sentences at different levels of \"depth\" : roughly speaking, \"surface\" syntax, \"deep\" syntax, semantics.",
        "A grammars are designed to be used not for generating sentences but rather for transforming given trees into other trees; this covers transitions from one abstract representation of a natural sentence to another (deeper or more superficial) representation of the same sentence as well as transitions from an abstract representation of one sentence to a representation on the same level of another sentence, synonymous to the given one.",
        "The conversion of a \"ready\" surface tree into an actual sentence - a conversion consisting of a) inflexion and b) determination of word order - must be carried out by some autonomous device not included in the conception of A grammar.",
        "S. A from the Greek cliv'ciroV(tree).",
        "31*.",
        "The limitations of place and time prevent us from comparing tree grammars with those of Chomsky as well as from referring to other works dealing with more or less analogous matters, such as studies by M. Arapow and V. Bor-schtschow; G. Veillon, J. Veyrunes and B. Vauquois; Ch.",
        "Hockett; and others.",
        "The authors are glad to acknowledge here the friendly help and useful suggestions by O.S.",
        "Kulagina and A. Y. Dikovsky.",
        "All shortcomings in the paper are, of course, ours.",
        "The a-grammar embodies an attempt to formalize the linguistic \"Meaning ....Text Model\" described, e.g., in [11.",
        "In this model, the starting point for producing a sentence is a detailed semantic description of its meaning conceived as a rather involved graph (not merely a tree) consisting of \"semantic atoms\" and \"semantic links\" connecting them.",
        "The semantic description is generated outside of the linguistic model and constitutes the input of that model; it is then subsequently \"lingualized\" (anglicized, russianized etc.)",
        "by means of formally specified transformations: 0 extracting from the given semantic description (of a family of synonymous sentences conveying the meaning repret sented by that description) the deepest admissible treelike structures; 2) proceeding in a multi-step fashion from the deeper trees to the more superficial ones; 3) linearizing the most superficial syntactic trees (with simultaneous inflexion where needed) to produce actual sentences.",
        "The A-grammars deal with the second phase of this_ process only.",
        "2.We shall consider trees with labelled branches; nodes are not labelled.",
        "The labels can be interpreted as names of the types of syntactic link at the corresponding level.",
        "For brevity % sake such trees will here be referred to just as \"trees\".",
        "A tree is called minimal if all its nodes, except the root, are terminal (i.e., with no branches growing out of them).",
        "A tree with but one node is called an empty tree and is denoted as e. The composition of trees is defined as follows: let to, ty, t2.",
        "....t5 be trees, and let in to some nodes a (Yr, (not necessa.rily pairwise different) be marked.",
        "Then the result of the composition of the tree to with the trees ty, t2, ..., to will be any tree isomorphic to the tree which can be obtained from to by identifying the roots of the trees ty, t2, tn with the nodes a, a2,op,v respectively in to.",
        "The composition of to in which the nodes ay, err ..., an are marked with t tby is denoted 1,2, ,",
        "where ao is a terminal node of To, and al, a2,an a repetitionless enumeration of all nodes of t.",
        "Now, an elementary transformation (ET) of trees is an ordered triple t2, f >, where t, and t2 are trees and f is a mapping of the set of all nodes of t, into the set of all nodes of t2 , Instead of <t1, 12,f >, we shall write",
        "where Gioia a terminal node of To , and al, 0,2,an a repetionless enumeration of all nodes of t, .",
        "Informally, an application of certain ET to a tree T consists of the substituting of 12 for an occurence of t, in T ; if a (a node of t, ) is mapped on B( a node of t2 ), i.e., B= f(d), then all \"untouched\" nodes of T \"pending\" from a are transferred to B with the same labels on corresponding branches.",
        "Example: Let ti4t2 F 'Gand let f be specified",
        "we can obtain the tree",
        "T contains three occurences of t ; the replaced one is the subtree of T with the nodes M, N, 0, Q.",
        "3.A syntactic A grammar is an ordered pair r = <v,n > where visa finite set of symbols (branch labels) and a finite set of ET' s,called rules of grammar r .",
        "A derivation in a syntactic A-grammar is a finite sequence of trees where each subsequent tree is obtainable from the preceding one by application of an ET off) .",
        "A tree t' is derivable from T inr if there exists a derivation in r beginning with T and ending with T .",
        "For linguistic applications, it may prove to be of interest to define some specific types of syntactic A -grammars.",
        "A syntactic A grammar will be called expanding if each rule it contains has in its left side no more nodes than in its right.",
        "An expanding syntactic A grammar will be called minimal if in each of its rules of the form \"t1 t2 I f\" the trees ti and t2 can be represented in the form",
        "where t) p. is a minimal tree, 2) al, 02, ..., CV, is a repetitionless enumeration of all nodes of p., 3) ci is the root of p, ,4) gat ), f(a2), f(an) are pairwise different, 5) f(a2), f(a3), gun)are terminal nodes of V, 6) for every i = 2, 3, ..., n the label on the branch of p. ending in coincides with the label on the branch of V ending in f(a, ) , 7) for all nodes of t differing from at , ty2 ,an, the mapping is identical.",
        "A minimal expanding syntactic A grammar will be called context-free if in the expressions (5) and (6) the trees ire, 9 ,.....r are unity trees.",
        "4.Linguistic considerations dealt with in \"Meaning4-0Text Model\" (see, e. p.., [ 1 ]) imply the introduction of a subset of ET is, Lpecial elementary transformations (SET Is).",
        "A SET is an ET of oneof the following three types: 1) Splitting of one node - a transformation of the forma C where either f(A) B or f(A) = C. Notation: A a a(S, C) I f(A) = B and A a a(B, C1 j a(A) = C .",
        "Let ti a t2 I f be an ET and let M be a set of ET's.",
        "Then the statement \"The ET t a t2 I f can be simulated by ET I s of M\" means that there exists some finite sequencemi , m2 ,m, of ET s in M such that for any trees T and T1 where T1 can be obtained from T by application of the",
        "Theorem 1.",
        "Any elementary transformation can be simulated by special elementary transformations.",
        "5.For the representation of natural sequences it is reasonable to assume not arbitrary syntactic trees but rather a subset of those - namely, those with limited branching.",
        "The precise meaning of limited branching is as follows: for each branch label a there is fixed an integer ni such that each node can be a starting ppint at most for ni branches labelled ai .",
        "The trees meeting this restriction are called (n1 , n2 ,nk ).-regular (k being the number of different branch labels); for brevity we shall call these trees simply regular trees.",
        "Now, a slight modification of the notion of the application of an ET suggests itself: if we suppose that the trees T and T in (3) - (4) are regular, we need consider only ET I e with regular left and right sides; such ET I s will also be called regular.",
        "A regular syntactic P grammar is an ordered triple < v, S,rt >, where V =f a1 , a2 .....ais a finite set of symbols (branch labels),is a mapping of V into the set of positive integers (for every a E v the integer C (a) being the maximum number of branches labelled a which can grow out of any single node) andil is a finite set of (r (al ), C (a2 ), C (at ))-regular ET's.",
        "The set of all regular syntactic A-grammars may be divided into hierarchical subsets which are fully analogous to the corresponding subsets of the syntactic A grammars as defined above.",
        "Special elementary transformations (SET s) can be defined here too.",
        "Theorem 1 I., Any (ni , n2 ,nk )-regular elementary transformation can be simulated by (nl , n2 ,nk , 1)-regular SET Theorem 2. a) If n1 +...+nk 3 or if ni +...+nk =1, then any (n1, n2, ..., nk)- regular ET can be simulated by (ni, n2, ..., nk )- regular SET'S.",
        "b) There exists (1, 1)-regular and (2)-regular's which cannot be simulated by (1, 1)-regular and (2)-regular SET' s respectively.",
        "6.If a regularity characteristics (ni , n2 ,nk ) is fixed on the basis of some empirical (linguistic) evidence, then a \"universal syntax\" can be constructed as an abstract calculus of all possible syntactic structures and all possible transformations of these.",
        "Choosing (1, 1, 1, t, 10, I) - regularity* as a first approximation to the deep syntactic description of natural languages, we obtain a universal (1, 1, 1, 1, 10, 1)-regular A-grammar, where[a2,aej is the set of types of deep syntactic connections and where",
        "consists of the following 80 rules: 1) 12 \"splitting\" rules of the form An a,(B, C) f(A)and An a, (B, C) I f(A) = C (i = 1, ..., 6) 2) 62 \"transfer\" rules of the form a., (A, B) .",
        "a, (B, C) n a, (D, E) .",
        "a (D, F) and a, (A, B) .",
        "ai (A, C)a, (D, E) .",
        "ai (E, F) ; i)The description of deep syntax suggested in [ 1] is meant here.",
        "6 types of syntactic connections are differentiated and interpreted as follows: connections 1 through 4 link a predicate with its arguments (only predicates with no more than 4 places are considered), connection 5 formalizes the general attributive relation, and connection 6 expresses coordination; a node can be a starting point for only one branch of each of types 1, 2,3, 4, 6 and for several branches of type 5 (we have set the number of the latter at 10 as a sufficient upper limit).",
        "The set of all regular syntactic A-grammars may be divided into hierarchical subsets which are fully analogous to the corresponding subsets of the syntactic A grammars as defined above.",
        "Special elementary transformations (SET s) can be defined here too.",
        "Theorem t Any (n1 , n2 ,nk )-regular elementary transformation can be simulated by (ni , n2 ,nk , 0-regular SET Is.. Theorem 2. a) If ni +...+nk 3 or if n1 +...+nk =1, then any (ni, n2,nk)-regular ET can be simulated by (n1, n2,nk)-regular SET I s. b) There exists (1, 1)-regular and (2)-regular ET s which cannot be simulated by (1, 1)-regular and (2)-regular SET I s respectively.",
        "6.If a regularity characteristics (n, , n2 ,) is fixed on the basis of some empirical (linguistic) evidence, then a \"universal syntax\" can be constructed as an abstract calculus of all possible syntactic structures and all possible transformations of these.",
        "Choosing (1, t, t, t, 10, 1)regularity* as a first approximation to the deep syntactic description of natural languages, we obtain a universal (1, 1, 1, 1, 10, 1)-regular A-grammar, <v, ,where vu= [at, a2 .",
        "a61 is the set of types of deep syntactic connections and where",
        "consists of the following 80 rules: 1) 12 \"splitting\" rules of the form An a,(B, C) I f(A) E and A n a, (B, C) I f(A) = C (i = 1, ..., 6) 2) 62 \"transfer\" rules of the form a, (A, B) .",
        "a, (B, C)E) .",
        "a, D, F) and a, (A, B) .",
        "ai(A, C)a,(D, E) .",
        "a, (E, F) ; *)The description of deep syntax suggested in [1] is meant here.",
        "6 types of syntactic connections are differentiated and interpreted as follows; connections 1 through 4 link a predicate with its arguments (only predicates with no more than 4 places are considered), connection 5 formalizes the general attributive relation, and connection 6 expresses coordination; a node can be a starting point for only one branch of each of types 1, 2,3, 4, 6 and for several branches of type 5 (we have set the number of the latter at 10 as a sufficient upper limit).",
        "here i, j = 1, ..., 6 and either i f j or i j = 5.",
        "3) 6 \"lumping\" rules of the form ai (A.",
        "B) a C (i = 1, ..., 6).",
        "7.It may be useful, in view of possible linguistic applications, to consider also such regular trees where the branches as well as the nodes are labelled filled regular trees.",
        "The node labels may be interpreted as characterized lexemes, i.e., symbols denoting words, idioms and so-called lexical functions with morphological subscripts attached to them ([1], p. 186) The notion of regular ET and that of regular syntactic Agrammar can in an obvious manner be modified accordingly.",
        "As a result, we obtain regular lexico-syntactic grammars.",
        "For these grammars (see p.6-7) we can define SET'S of the types \"splitting\",\"transfer\" and \"lumping\" in a manner analogous to the one above; in addition another type of SET must be introduced: 4) \"renaming\" of a node - a transformation of the form where wi and w,are node labels.",
        "If SET'S are understood as transformations of the types 1-4, the theorems 11 and 2 will hold also for this case.",
        "r 1 ) MAANOBOgati A K, Mexbuyx H A0 cemanTamecacom ekniTeBB.-npodAeuu xBdepneTuna, Bun.",
        "19 1967, 177 is 2313."
      ]
    }
  ]
}
