{
  "info": {
    "authors": [
      "Thomas Russ"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C90-3099",
    "title": "A Syntactic and Morphological Analyzer for a Text-To-Speech System",
    "url": "https://aclweb.org/anthology/C90-3099",
    "year": 1990
  },
  "references": [
    "acl-C86-1063",
    "acl-C88-1028",
    "acl-E87-1037"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents a system which analyzes an input text syntactically and morphologically and converts the text from the graphemic to the phonetic representation (or vice versa).",
        "We describe the grammar formalism used and report a parsing experiment which compared eight parsing strategies within the framework of chart parsing.",
        "Although the morphological and syntactic analyzer has been developed for a text-to-speech system for German, it is language independent and general enough to be used for dialog systems, NL-interfaces or speech recognition systems."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "in order to convert text to speech one must first derive an underlying abstract linguistic representation for the text.",
        "There are at least two reasons why a direct approach (e.g., letter-to-sound rules) is inadequate.",
        "Firstly, rules for pronouncing words must take into consideration morpheme structure, e.g., <sch> is pronouced differently in the German words \"liiisch-hen\" (\"extinguish\") and \"HOs+chen\" (diminutive of \"trousers\"), and syntactic structure, e.g., to solve noun-verb ambiguities such as \"Sucht\" (\"addiction\") and \"sucht\" (\"to search\").",
        "Secondly, sentence duration pattern and fundamental frequency contour depend largely on the structure of the sentence.",
        "While most commercial, but also some laboratory text-to-speech (TTS) systems use letter-to-sound rules without taking into account the morphological structure of a word, recently developed systems [t,2,3] incorporate morphological analysis.",
        "Although the influence of syntax on prosody is widely acknowledged [2,3], most TTS systems lack syntax analysis [1,3] or use some kind of phrase-level parsing [2] to obtain information on the syntactic structure of a ,sentence.",
        "This is motivated more by current technological limitations than by linguistic insights.VVe are convinced that in order to achieve highly intelligible and natural-sounding speech, not only the phonological and morphological but also the syntactic, semantic and even discourse structure of a text must be taken into account - although this is not yet feasible.",
        "As a step toward such a model, we have developed a morphological and syntactic analyzer that is based on simple but powerful formalisms which are linguistically well-motivated and computationally effective."
      ]
    },
    {
      "heading": "2 Morphological and Syntactic Analysis",
      "text": [
        "In our TTS system, morphological analysis consists of three stages: segmentation, parsing and generation.",
        "The segmentation module finds possible ways to partition the input string into dictionary entries (morphs).",
        "Spelling changes, e.g., schwa-insertion or elision, are covered by morphographemic rules.",
        "The parsing module of the morphological analysis uses a word grammar to accept or reject combinations of dictionary entries and to percolate features from the lexicon to the syntactic analyzer.",
        "The generation module of the morphological analysis generates the phonetic transcription by concatenating the phonetic strings, which are stored as part of each morph entry, and by applying morphophonetic rules.",
        "The syntactic analysis is based on a sentence grammar and a parser that takes as input the result of the morphological analyzer.",
        "It assigns to each sentence its surface syntactic structure.",
        "The syntactic structure of the sentence and the phonetic transcription of each word are used at a later stage to determine prosodic features such as duration pattern and fundamental frequency contour."
      ]
    },
    {
      "heading": "3 UTN Formalism",
      "text": [
        "Morphographemic and morphophonetic rules are written in a Kimmo-style formalism [4].",
        "Unlike the original two-level model, a word grammar is used to parse the lexical strings and to determine the category of the overall word formed by several morphs.",
        "To express word and sentence grammars, we have developed a grammar formalism, called Unification-based Transition Networks (UTN).",
        "Its skeleton are nondeterministic recursive transition networks (RTNs), which are equivalent to context-free grammars.",
        "A transition network specifies the linear precedence and immediate dominance relation",
        "within a constituent.",
        "Each label of a transition denotes a preterminal, a constituent or an e-transition.",
        "As opposed to labels in RTNs, which are monadic, labels in UTNs are complex categories (features matrices).",
        "Each transition contains a set of attribute equations, which specify the constraints that must be satisfied between complex categories in a network.",
        "Our notation of attribute equations is very similar to that commonly used in unification-based rule formalisms such as PATR [5].",
        "The UTN formalism is fully declarative.",
        "It is based on concatenation and recursion, which is reflected in the topology of the networks, and unification, which is used for matching, equality testing and feature passing.",
        "Although the UTN formalism is somewhat similar to ATNs it is much more concise and elegant because of its simplicity and declarativeness.",
        "The implementation of several grammars for German syntax and morphosyntax revealed that transition networks are well-suited to designs and test grammars.",
        "We believe that this formalism meets the general criteria of linguistic naturalness and mathematical power.",
        "In addition, the parsing experiment reported below shows that efficient parsers can be implemented for the UTN formalism."
      ]
    },
    {
      "heading": "4 Parsmg",
      "text": [
        "The design of our rrs system requires efficient parsing algorithms and a flexible parser environment to compare several search and rule invocation strategies.",
        "Active chart parsing [8] is well-suited for that purpose.",
        "We have implemented a general chart parser that can be parameterized for several search and rule invocation strategies.",
        "The aim of the experiment reported below was to investigate to what extent a parser can be directed by using the FIRST, FOLLOW and REACHABILITY relations [9,8] and combinations thereof, thereby reducing the number of edges, the number of applications of the fundamental rule and parsing time."
      ]
    },
    {
      "heading": "4.1 Rule invocation Strategies",
      "text": [
        "We compared eight parsing strategies, i.e., four top-down (T1 to T4) and four bottom-up (B1 to B4) strategies.",
        "The top-down strategies are variants of Earley's algorithm, the bottom-up strategies variants of the left-corner algorithm [9].",
        "Tl, a pure top-down strategy, implements Earley's algorithm without lookahead.",
        "Strategy T2, a directed top-down 'To compare the UTN formalism with rule-based formalisms, we translated several grammars to transition networks.",
        "As an example, the grammar GM found in Tomita's book [7] with about 220 rules was translated to a strongly equivalent network grammar of 37 transition networks.",
        "We got the impression that it is easier to write and modify a network grammar of several dozen networks (that can be displayed and edited graphically) than one of several hundreds of rules.",
        "strategy, uses the FIRST relation to test whether the next input symbol is in the FIRST set of the active edge each time an empty active edge is created.",
        "Strategy T3, a top-down strategy with lookahead, uses the FOLLOW set to test whether the next input symbol belongs to the FOLLOW set of the inactive edge each time an inactive edge is created.",
        "Strategy T4 combines the selectivity of strategy T2 and lookahead of strategy T3.",
        "Strategy B1 implements a left-corner algorithm 191.",
        "Strategy B2 is a left-corner parser directed by a top-down filter based on the REACHABILITY relation [10].",
        "Strategy 133 implements a left-corner algorithm with lookahead similar to that of strategy T3, while strategy 134 adds a top-down filter and lookahead to the left-corner al-gorithrn."
      ]
    },
    {
      "heading": "4.2 Grammars and Test Sets",
      "text": [
        "For the experiment presented here, 'we used a grammar (GI) for German syntax' that, has been developed for our 'ITS system and a grammar (011) for English syntax3 (GII) to compare our results with those of other experiments ([7,11,10]).",
        "Our sentence sets consist of 35 German sentences (set SI, with an average sentence length of 9.8 words) and 39 English sentences (set SII, with an average sentence length of 15.3 words) from Tomita [7], pp.",
        "185-189."
      ]
    },
    {
      "heading": "4.3 Results",
      "text": [
        "Tables 1 and 2 show the results of parsing sets SI and SII with grammars GI and GII, respectively.",
        "We measured for all strategies (T1 to B4) the number of active (AE) and inactive (IE) edges, the total number of edges (TOT AE+IE) and parsing time4 (TIME).",
        "Since the UTN formalism is based on unification, a time and space-consuming operation, we also indicate the number of applications of the fundamental rule (FR) to show the relation between parsing strategy and FR applications.",
        "Our experiments confirm the results of Shann and Wiren [10,11] that parsing efficiency depends heavily on the grammar, the language, the grammar formalism and the sentence set.",
        "Nevertheless, by carefully tuning a parsing strategy, a significant increase in efficiency is gained.",
        "Undirected top-down parsing performs better than undirected bottom-up.",
        "This coincides with the results of Wirers.",
        "Directed strategies5 outperform undirected strategies with respect to parsing time and memory.",
        "This holds for top-down and bottom-up strategies.",
        "Previous experiments 111,10,7] did not investigate the influence of lookahead in top-down parsing.",
        "However, using lookahead (the FOLLOW relation) significantly reduces the number of edges, the num-bex of applications of the fundamental rule and parsing time.",
        "Directed top-down parsing with lookahead is as fast as left-corner parsing with top-down filtering and lookahead.",
        "The difference between the two strategies is statistically insignificant when considering all experiments conducted with all German grammars and several sentence sets.",
        "However, it is uncertain to what extent this statement can be generalized to other types of grammars and languages.",
        "Based on the results of our experiments, both strategies (T4 and B4) are suited as main strategies in our TTS systern."
      ]
    },
    {
      "heading": "5 Concluding Remarks",
      "text": [
        "We have presented a language-independent model for syntactic and morphological analysis.",
        "Special emphasis has been laid on the description of the 'YIN formalism and a parser experiment which compared different rule invocation strategies.",
        "The analyzer is fully implemented in Common Lisp and its application in a text-to-speech system has significantly improved the quality of the synthetic speech.",
        "Since the grapheme-to-phoneme conversion is bidirectional, our approach may also be promising for speech recognition."
      ]
    }
  ]
}
