{
  "info": {
    "authors": [
      "Spence Green",
      "Christopher D. Manning"
    ],
    "book": "COLING",
    "id": "acl-C10-1045",
    "title": "Better Arabic Parsing: Baselines, Evaluations, and Analysis",
    "url": "https://aclweb.org/anthology/C10-1045",
    "year": 2010
  },
  "references": [
    "acl-C08-1112",
    "acl-D07-1022",
    "acl-D07-1066",
    "acl-D09-1087",
    "acl-E06-1047",
    "acl-H05-1100",
    "acl-J03-4003",
    "acl-J04-4004",
    "acl-J93-2004",
    "acl-L08-1460",
    "acl-N03-1033",
    "acl-N06-2013",
    "acl-N07-2014",
    "acl-N09-1046",
    "acl-P03-1013",
    "acl-P03-1054",
    "acl-P03-1056",
    "acl-P05-1038",
    "acl-P05-1071",
    "acl-P06-1055",
    "acl-P06-1073",
    "acl-P06-3009",
    "acl-P08-1043",
    "acl-P08-2053",
    "acl-P09-2056",
    "acl-P99-1065",
    "acl-W04-1602",
    "acl-W05-1102"
  ],
  "sections": [
    {
      "text": [
        "In this paper, we offer broad insight into the underperformance of Arabic constituency parsing by analyzing the interplay of linguistic phenomena, annotation choices, and model design.",
        "First, we identify sources of syntactic ambiguity understudied in the existing parsing literature.",
        "Second, we show that although the Penn Arabic Treebank is similar to other treebanks in gross statistical terms, annotation consistency remains problematic.",
        "Third, we develop a human interpretable grammar that is competitive with a latent variable PCFG.",
        "Fourth, we show how to build better models for three different parsers.",
        "Finally, we show that in application settings, the absence of gold segmentation lowers parsing performance by 2-5% F1."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "It is well-known that constituency parsing models designed for English often do not generalize easily to other languages and treebanks.",
        "Explanations for this phenomenon have included the relative informativeness of lexicalization (Dubey and Keller, 2003; Arun and Keller, 2005), insensitivity to morphology (Cowan and Collins, 2005; Tsarfaty and Sima'an, 2008), and the effect of variable word order (Collins et al., 1999).",
        "Certainly these linguistic factors increase the difficulty of syntactic disambiguation.",
        "Less frequently studied is the interplay among language, annotation choices, and parsing model design (Levy and Manning, 2003; Kubler, 2005).",
        "To investigate the influence of these factors, we analyze Modern Standard Arabic (henceforth MSA, or simply \"Arabic\") because of the unusual opportunity it presents for comparison to English parsing results.",
        "The Penn Arabic Treebank (ATB) syntactic guidelines (Maamouri et al., 2004) were purposefully borrowed without major modification from English (Marcus et al., 1993).",
        "Further, Maamouri and Bies (2004) argued that the English guidelines generalize well to other languages.",
        "But Arabic contains a variety of linguistic phenomena unseen in English.",
        "Crucially, the conventional orthographic form of MSA text is unvocalized,a property that results in a deficient graphical representation.",
        "For humans, this characteristic can impede the acquisition of literacy.",
        "How do additional ambiguities caused by devocalization affect statistical learning?",
        "How should the absence of vowels and syntactic markers influence annotation choices and grammar development?",
        "Motivated by these questions, we significantly raise baselines for three existing parsing models through better grammar engineering.",
        "Our analysis begins with a description of syntactic ambiguity in unvocalized MSA text (§2).",
        "Next we show that the ATB is similar to other treebanks in gross statistical terms, but that annotation consistency remains low relative to English (§3).",
        "We then use linguistic and annotation insights to develop a manually annotated grammar for Arabic (§4).",
        "To facilitate comparison with previous work, we exhaustively evaluate this grammar and two other parsing models when gold segmentation is assumed (§5).",
        "Finally, we provide a realistic evaluation in which segmentation is performed both in a pipeline and jointly with parsing (§6).",
        "We quantify error categories in both evaluation settings.",
        "To our knowledge, ours is the first analysis of this kind for Arabic parsing."
      ]
    },
    {
      "heading": "2. Syntactic Ambiguity in Arabic",
      "text": [
        "Arabic is a morphologically rich language with a root-and-pattern system similar to other Semitic languages.",
        "The basic word order is VSO, but SVO, VOS, and VO configurations are also possible.",
        "Nouns and verbs are created by selecting a consonantal root (usually triliteral or quadrilit-eral), which bears the semantic core, and adding affixes and diacritics.",
        "Particles are uninflected.",
        "Diacritics can also be used to specify grammatical relations such as case and gender.",
        "But diacritics are not present in unvocalized text, which is the standard form of, e.g., news media documents.",
        "Let us consider an example of ambiguity caused by devocalization.",
        "Table 1 shows four words whose unvocalized surface forms jl an are indistinguishable.",
        "Whereas Arabic linguistic theory assigns (1) and (2) to the class of pseudo verbs jl L$3l^.».îj inna and her sisters since they can be inflected, the ATB conventions treat (2) as a complementizer, which means that it must be the head ofSBAR.",
        "Because these two words have identical complements, syntax rules are typically unhelpful for distinguishing between them.",
        "This is especially true in the case of quotations – which are common in the ATB – where (1) will follow a verb like (2) (Figure 1).",
        "Even with vocalization, there are linguistic categories that are difficult to identify without semantic clues.",
        "Two common cases are the attributive adjective and the process nominal jla^^Jl maSdar, which can have a verbal reading.",
        "Attributive adjectives are hard because they are orthographically identical to nominals; they are inflected for gender, number, case, and definiteness.",
        "Moreover, they are used as substantives much",
        "Table 1: Diacritized particles and pseudo-verbs that, after orthographic normalization, have the equivalent surface form jl an.",
        "The distinctions in the ATB are linguistically justified, but complicate parsing.",
        "Table 8a shows that the best model recovers SBAR at only 71.0% F1.",
        "Saddam (b) Stanford",
        "(a) Reference",
        "Figure 1: The Stanford parser (Klein and Manning, 2002) is unable to recover the verbal reading of the unvocalized surface form jl an (Table 1).",
        "more frequently than is done in English.",
        "Process nominals name the action of the transitive or ditransitive verb from which they derive.",
        "The verbal reading arises when the maSdar has an NP argument which, in vocalized text, is marked in the accusative case.",
        "When the maSdar lacks a determiner, the constituent as a whole resembles the ubiquitous annexation construct ààLùîtfl iDafa.",
        "Gabbard and Kulick (2008) show that there is significant attachment ambiguity associated with iDafa, which occurs in 84.3% of the trees in our development set.",
        "Figure 4 shows a constituent headed by a process nominal with an embedded adjective phrase.",
        "All three models evaluated in this paper incorrectly analyze the constituent as iDafa; none of the models attach the attributive adjectives properly.",
        "For parsing, the most challenging form of ambiguity occurs at the discourse level.",
        "A defining characteristic of MSA is the prevalence of discourse markers to connect and subordinate words and phrases (Ryding, 2005).",
        "Instead of offsetting new topics with punctuation, writers of MSA insert connectives such as j wa and ^ fa to link new elements to both preceding clauses and the text as a whole.",
        "As a result, Arabic sentences are usually long relative to English, especially after",
        "Word",
        "Head Of",
        "Complement",
        "POS",
        "1",
        "j| inna \"Indeed, truly\"",
        "VP",
        "Noun",
        "VBP",
        "2",
        "jî anna \"That\"",
        "SB AR",
        "Noun",
        "IN",
        "3",
        "j| in \"If\"",
        "SBAR",
        "Verb",
        "IN",
        "4",
        "jî an \"to\"",
        "SBAR",
        "Verb",
        "IN",
        "Length English (WSJ) Arabic (ATB)",
        "Table 2: Frequency distribution for sentence lengths in the WSJ (sections 2-23) and the ATB (p1-3).",
        "English parsing evaluations usually report results on sentences up to length 40.",
        "Arabic sentences of up to length 63 would need to be evaluated to account for the same fraction of the data.",
        "We propose a limit of70 words for Arabic parsing evaluations.",
        "Table 3: Dev set frequencies for the two most significant discourse markers in Arabic are skewed toward analysis as a conjunction.",
        "segmentation (Table 2).",
        "The ATB gives several different analyses to these words to indicate different types of coordination.",
        "But it conflates the coordinating and discourse separator functions of wa ( rttrttt jlj) into one analysis: conjunction (Table 3).",
        "A better approach would be to distinguish between these cases, possibly by drawing on the vast linguistic work on Arabic connectives (Al-Batal, 1990).",
        "We show that noun-noun vs. discourse-level coordination ambiguity in Arabic is a significant source of parsing errors (Table 8c)."
      ]
    },
    {
      "heading": "3. Treebank Comparison 3.1 Gross Statistics",
      "text": [
        "Linguistic intuitions like those in the previous section inform language-specific annotation choices.",
        "The resulting structural differences between treebanks can account for relative differences in parsing performance.",
        "We compared the ATB to treebanks for Chinese (CTB6), German (Negra), and",
        "English (WSJ) (Table 4).",
        "The ATB is disadvantaged by having fewer trees with longer average",
        "Table 4: Gross statistics for several different treebanks.",
        "Test set OOV rate is computed using the following splits: ATB gra (Dubey and Keller, 2003); English, sections 2-21 (train) and section 23 (test).",
        "yields.",
        "But to its great advantage, it has a high ratio of non-terminals/terminals (ß Constituents / ß Length).",
        "Evalb, the standard parsing metric, is biased toward such corpora (Sampson and Babar-czy, 2003).",
        "Also surprising is the low test set OOV rate given the possibility of morphological variation in Arabic.",
        "In general, several gross corpus statistics favor the ATB, so other factors must contribute to parsing underperformance.",
        "Annotation consistency is important in any supervised learning task.",
        "In the initial release of the ATB, inter-annotator agreement was inferior to other LDC treebanks (Maamouri et al., 2008).",
        "To improve agreement during the revision process, a dual-blind evaluation was performed in which 10% of the data was annotated by independent teams.",
        "Maamouri et al.",
        "(2008) reported agreement between the teams (measured with Evalb) at 93.8% F1, the level of the CTB.",
        "But Rehbein and van Genabith (2007) showed that Evalb should not be used as an indication of real difference – or similarity – between treebanks.",
        "Instead, we extend the variation n-gram method of Dickinson (2005) to compare annotation error rates in the WSJ and ATB.",
        "For a corpus C,let M be the set of tuples (n, l),where n is an n-gram with bracketing label l.Ifanyn appears",
        "ATB",
        "CTB6",
        "Negra",
        "WSJ",
        "Trees",
        "23449",
        "28278",
        "20602",
        "43948",
        "Word Typess",
        "40972",
        "45245",
        "51272",
        "46348",
        "Tokens",
        "738654",
        "782541",
        "355096",
        "1046829",
        "Tags",
        "32",
        "34",
        "499",
        "45",
        "Phrasal Cats",
        "22",
        "26",
        "325",
        "27",
        "Test OOV",
        "16.8%",
        "22.2%",
        "30.5%",
        "13.2%",
        "Per Sentence",
        "Depth (ß / ff)",
        "3.87/0.74",
        "5.01 /1.44",
        "3.58/0.89",
        "4.18/0.74",
        "Breadth (ß / ff)",
        "14.6 / 7.31",
        "10.2/4.44",
        "7.50/4.56",
        "12.1 /4.65",
        "Length (ß / ff)",
        "31.5 / 22.0",
        "27.7/18.9",
        "17.2/10.9",
        "23.8/11.2",
        "Constituents (ß)",
        "32.8",
        "32.5",
        "8.29",
        "19.6",
        "ß Const.",
        "/ ß Length",
        "1.04",
        "1.18",
        "0.482",
        "0.820",
        "< 20",
        "41.9%",
        "33.7%",
        "< 40",
        "92.4%",
        "73.2%",
        "< 63",
        "99.7%",
        "92.6%",
        "< 70",
        "99.9%",
        "94.9%",
        "Part of Speech",
        "Tag",
        "Freq.",
        "conjunction",
        "CC",
        "4256",
        "\"and\"",
        "preposition",
        "IN",
        "6",
        "abbreviation",
        "NN",
        "6",
        "conjunction",
        "CC",
        "160",
        "l2 fa \"so, then\"",
        "connective particle",
        "RP",
        "67",
        "abbreviation",
        "NN",
        "22",
        "response conditioning particle",
        "RP",
        "11",
        "subordinating conjunction",
        "IN",
        "3",
        "Table 5: Evaluation of 100 randomly sampled variation nuclei types.",
        "The samples from each corpus were independently evaluated.",
        "The ATB has a much higher fraction of nuclei per tree, and a higher type-level error rate.",
        "in a corpus position without a bracketing label, then we also add (n,NIL) to M. We call the set of unique n-grams with multiple labels in M the variation nuclei of C.",
        "Bracketing variation can result from either annotation errors or linguistic ambiguity.",
        "Human evaluation is one way to distinguish between the two cases.",
        "Following Dickinson (2005), we randomly sampled 100 variation nuclei from each corpus and evaluated each sample for the presence of an annotation error.",
        "The human evaluators were a non-native, fluent Arabic speaker (the first author) for the ATB and a native English speaker for the WSJ.",
        "Table 5 shows type-and token-level error rates for each corpus.",
        "The 95% confidence intervals for type-level errors are (5580, 9440) for the ATB and (1400, 4610) for the WSJ.",
        "The results clearly indicate increased variation in the ATB relative to the WSJ, but care should be taken in assessing the magnitude of the difference.",
        "On the one hand, the type-level error rate is not calibrated for the number of n-grams in the sample.",
        "At the same time, the n-gram error rate is sensitive to samples with extreme n-gram counts.",
        "For example, one of the ATB samples was the determiner .^~t\\ dhalik \"that.\"",
        "The sample occurred in 1507 corpus positions, and we found that the annotations were consistent.",
        "If we remove this sample from the evaluation, then the ATB type-level error rises to only 37.4% while the n-gram error rate increases to 6.24%.",
        "The number of ATB n-grams also falls below the WSJ sample size as the largest WSJ sample appeared in only 162 corpus positions.",
        "Figure 2: An ATB sample from the human evaluation.",
        "The ATB annotation guidelines specify that proper nouns should be specified with a flat NP (a).",
        "But the city name Sharm Al-Sheikh is also iDafa, hence the possibility for the incorrect annotation in (b)."
      ]
    },
    {
      "heading": "4. Grammar Development",
      "text": [
        "We can use the preceding linguistic and annotation insights to build a manually annotated Arabic grammar in the manner of Klein and Manning (2003).",
        "Manual annotation results in human interpretable grammars that can inform future treebank annotation decisions.",
        "A simple lexicalized PCFG with second order Markovization gives relatively poor performance: 75.95% F1 on the test set.",
        "But this figure is surprisingly competitive with a recent state-of-the-art baseline (Table 7).",
        "In our grammar, features are realized as annotations to basic category labels.",
        "We start with noun features since written Arabic contains a very high proportion of NPs.",
        "genitiveMark indicates recursive NPs with a indefinite nominal left daughter and an NP right daughter.",
        "This is the form of recursive levels in iDafa constructs.",
        "We also add an annotation for one-level iDafa (oneLevelIdafa) constructs since they make up more than 75% of the iDafa NPs in the ATB (Gabbard and Kulick, 2008).",
        "For all other recursive NPs, we add a common annotation to the POS tag of the head (recursiveNPHead).",
        "Base NPs are the other significant category of nominal phrases.",
        "markBaseNP indicates these non-recursive nominal phrases.",
        "This feature includes named entities, which the ATB marks with a flat NP node dominating an arbitrary number of NNP pre-terminal daughters (Figure 2).",
        "For verbs we add two features.",
        "First we mark any node that dominates (at any level) a verb",
        "Corpus",
        "Sample",
        "Error %",
        "Trees Nuclei",
        "n-grams",
        "Type n-gram",
        "WSJ 2-23",
        "43948 25041",
        "746",
        "12.0% 2.10%",
        "ATB",
        "23449 20292",
        "2100",
        "37.0% 1.76%",
        "Table 6: Incremental dev set results for the manually annotated grammar (sentences of length < 70).",
        "phrase (markContainsVerb).",
        "This feature has a linguistic justification.",
        "Historically, Arabic grammar has identified two sentences types: those that begin with a nominal (2u^u/tf!",
        "2JUäJI), and those that begin with a verb (a-UMI 2JUäJI).",
        "But foreign learners are often surprised by the verbless predications that are frequently used in Arabic.",
        "Although these are technically nominal, they have become known as \"equational\" sentences.",
        "mark-ContainsVerb is especially effective for distinguishing root S nodes ofequational sentences.",
        "We also mark all nodes that dominate an SVO configuration (containsSVO).",
        "In MSA, SVO usually appears in non-matrix clauses.",
        "Lexicalizing several POS tags improves performance.",
        "splitIN captures the verb/preposition idioms that are widespread in Arabic.",
        "Although this feature helps, we encounter one consequence of variable word order.",
        "Unlike the WSJ corpus which has a high frequency of rules like VP – VB PP, Arabic verb phrases usually have lexi-calized intervening nodes (e.g., NP subjects and direct objects).",
        "For example, we might have",
        "VP – VB NP PP, where the NP is the subject.",
        "This annotation choice weakens splitIN.",
        "The ATB gives all punctuation a single tag.",
        "For parsing, this is a mistake, especially in the case of interrogatives.",
        "splitPUNC restores the convention of the WSJ.",
        "We also mark all tags that dominate a word with the feminine ending 3 taa mar-buuTa (markFeminine).",
        "To differentiate between the coordinating and discourse separator functions of conjunctions (Table 3), we mark each CC with the label of its right sister (splitCC).",
        "The intuition here is that the role of a discourse marker can usually be determined by the category of the word that follows it.",
        "Because conjunctions are elevated in the parse trees when they separate recursive constituents, we choose the right sister instead of the category of the next word.",
        "We create equivalence classes for verb, noun, and adjective POS categories."
      ]
    },
    {
      "heading": "5. Standard Parsing Experiments",
      "text": [
        "We compare the manually annotated grammar, which we incorporate into the Stanford parser, to both the Berkeley (Petrov et al., 2006) and Bikel (Bikel, 2004) parsers.",
        "All experiments use ATB parts 1-3 divided according to the canonical split suggested by Chiang et al.",
        "(2006).",
        "Preprocessing the raw trees improves parsing performance considerably.",
        "We first discard all trees dominated by X, which indicates errors and non-linguistic text.",
        "At the phrasal level, we remove all function tags and traces.",
        "We also collapse unary chains with identical basic categories like NP – NP.",
        "The pre-terminal morphological analyses are mapped to the shortened \"Bies\" tags provided with the treebank.",
        "Finally, we add \"DT\" to the tags for definite nouns and adjectives (Kulick et al., 2006).",
        "The orthographic normalization strategy we use is simple.",
        "In addition to removing all diacritics, we strip instances of taTweel Jj^laj,col-lapse variants of alif I to bare alzf, and map Arabic punctuation characters to their Latin equivalents.",
        "We retain segmentation markers – which are consistent only in the vocalized section of the treebank – to differentiate between e.g. (s-fc \"they\" and \"their.\"",
        "Because we use the vocalized section, we must remove null pronoun markers.",
        "In Table 7 we give results for several evaluation metrics.",
        "Evalb is a Java reimplementation of the standard labeled precision/recall metric.",
        "Feature",
        "States",
        "Tags",
        "F1",
        "Indiv.",
        "AF1",
        " – ",
        "3208",
        "33",
        "76.86",
        " – ",
        "recursiveNPHead",
        "3287",
        "38",
        "77.46",
        "+0.60",
        "genitiveMark",
        "3471",
        "38",
        "77.88",
        "+0.42",
        "splitPUNC",
        "4221",
        "47",
        "77.98",
        "+0.10",
        "markContainsVerb",
        "5766",
        "47",
        "79.16",
        "+ 1.18",
        "markBaseNP",
        "6586",
        "47",
        "79.5",
        "+0.34",
        "markOneLevelldafa",
        "7202",
        "47",
        "79.83",
        "+0.33",
        "splitIN",
        "7595",
        "94",
        "80.48",
        "+0.65",
        "containsSVO",
        "9188",
        "94",
        "80.66",
        "+0.18",
        "splitCC",
        "9492",
        "124",
        "80.87",
        "+0.21",
        "markFem",
        "10049",
        "141",
        "80.95",
        "+0.08",
        "Table 7: Test set results.",
        "Maamouri et al.",
        "(2009b) evaluated the Bikel parser using the same ATB split, but only reported dev set results with gold POS tags for sentences of length < 40.",
        "The Bikel GoldPOS configuration only supplies the gold POS tags; it does not force the parser to use them.",
        "We are unaware of prior results for the Stanford parser.",
        "with the number of exactly matching guess trees.",
        "The Stanford parser includes both the manually annotated grammar (§4) and an Arabic unknown word model with the following lexical features:"
      ]
    },
    {
      "heading": "1.. Presence of the determiner JI Al",
      "text": []
    },
    {
      "heading": "2.. Contains digits",
      "text": []
    },
    {
      "heading": "3.. Ends with the feminine affix 3 p",
      "text": [
        "Other notable parameters are second order vertical Markovization and marking of unary rules.",
        "Modifying the Berkeley parser for Arabic is straightforward.",
        "After adding a ROOT node to all trees, we train a grammar using six split-and-merge cycles and no Markovization.",
        "We use the default inference parameters.",
        "Because the Bikel parser has been parameterized for Arabic by the LDC, we do not change the default model settings.",
        "However, when we pre-tag the input – as is recommended for English – we notice a 0.57% F1 improvement.",
        "We use the log-linear tagger of Toutanova et al.",
        "(2003), which gives 96.8% accuracy on the test set.",
        "The Berkeley parser gives state-of-the-art performance for all metrics.",
        "Our baseline for all sentence lengths is 5.23% F1 higher than the best previous result.",
        "The difference is due to more careful",
        "Berkeley",
        "I_training trees",
        "Figure 3: Dev set learning curves for sentence lengths < 70.",
        "All three curves remain steep at the maximum training set size of 18818 trees.",
        "The Leaf Ancestor metric measures the cost of transforming guess trees to the reference (Sampson and Babarczy, 2003).",
        "It was developed in response to the non-terminal/terminal bias ofEvalb, but Clegg and Shepherd (2005) showed that it is also a valuable diagnostic tool for trees with complex deep structures such as those found in the ATB.",
        "For each terminal, the Leaf Ancestor metric extracts the shortest path to the root.",
        "It then computes a normalized Levenshtein edit distance between the extracted chain and the reference.",
        "The range of the score is between 0 and 1 (higher is better).",
        "We report micro-averaged (whole corpus) and macro-averaged (per sentence) scores along",
        "add a constraint on the removal of punctuation, which has a single tag (PUNC) in the ATB.",
        "Tokens tagged as PUNC are not discarded unless they consist entirely ofpunctuation.",
        "Leaf Ancestor",
        "Evalb",
        "Tag",
        "Model",
        "System",
        "Length",
        "Corpus",
        "Sent",
        "Exact",
        "LP",
        "LR",
        "F1",
        "%",
        "Baseline",
        "70",
        "0.791",
        "0.825",
        "358",
        "80.37",
        "79.36",
        "79.86",
        "95.58",
        "Stanford (v1.6.3)",
        "all",
        "0.773",
        "0.818",
        "358",
        "78.92",
        "77.72",
        "78.32",
        "95.49",
        "GoldPOS",
        "70",
        "0.802",
        "0.836",
        "452",
        "81.07",
        "80.27",
        "80.67",
        "99.95",
        "Baseline (Self-tag)",
        "70",
        "0.770",
        "0.801",
        "278",
        "77.92",
        "76.00",
        "76.95",
        "94.64",
        "all",
        "0.752",
        "0.794",
        "278",
        "76.96",
        "75.01",
        "75.97",
        "94.63",
        "Bikel (v1.2)",
        "Baseline (Pre-tag)",
        "70",
        "0.771",
        "0.804",
        "295",
        "78.35",
        "76.72",
        "77.52",
        "95.68",
        "all",
        "0.752",
        "0.796",
        "295",
        "77.31",
        "75.64",
        "76.47",
        "95.68",
        "GoldPOS",
        "70",
        "0.775",
        "0.808",
        "309",
        "78.83",
        "77.18",
        "77.99",
        "96.60",
        "(Petrov, 2009)",
        "all",
        " – ",
        " – ",
        " – ",
        "76.40",
        "75.30",
        "75.85",
        " – ",
        "Berkeley (Sep. 09)",
        "Baseline",
        "70",
        "0.809",
        "0.839",
        "335",
        "82.32",
        "81.63",
        "81.97",
        "95.07",
        "all",
        "0.796",
        "0.834",
        "336",
        "81.43",
        "80.73",
        "81.08",
        "95.02",
        "GoldPOS",
        "70",
        "0.831",
        "0.859",
        "496",
        "84.37",
        "84.21",
        "84.29",
        "99.87",
        "(a) Reference (b) Stanford (c) Berkeley",
        "Figure 4: The constituent Restoring ofits constructive and effective role parsed by the three different models (gold segmentation).",
        "The ATB annotation distinguishes between verbal and nominal readings of maSdar process nominals.",
        "Like verbs, maSdar takes arguments and assigns case to its objects, whereas it also demonstrates nominal characteristics by, e.g., taking determiners and heading iDafa (Fassi Fehri, 1993).",
        "In the ATB, -jUïtal asta'adah is tagged 48 times as a noun and 9 times as verbal noun.",
        "Consequently, all three parsers prefer the nominal reading.",
        "Table 8b shows that verbal nouns are the hardest pre-terminal categories to identify.",
        "None of the models attach the attributive adjectives correctly.",
        "pre-processing.",
        "However, the learning curves in Figure 3 show that the Berkeley parser does not exceed our manual grammar by as wide a margin as has been shown for other languages (Petrov, 2009).",
        "Moreover, the Stanford parser achieves the most exact Leaf Ancestor matches and tagging accuracy that is only 0.1% below the Bikel model, which uses pre-tagged input.",
        "In Figure 4 we show an example of variation between the parsing models.",
        "We include a list of per-category results for selected phrasal labels, POS tags, and dependencies in Table 8.",
        "The errors shown are from the Berkeley parser output, but they are representative of the other two parsing models."
      ]
    },
    {
      "heading": "6. Joint Segmentation and Parsing",
      "text": [
        "Although the segmentation requirements for Arabic are not as extreme as those for Chinese, Arabic is written with certain cliticized prepositions, pronouns, and connectives connected to adjacent words.",
        "Since these are distinct syntactic units, they are typically segmented.",
        "The ATB segmentation scheme is one of many alternatives.",
        "Until now, all evaluations of Arabic parsing – including the experiments in the previous section – have assumed gold segmentation.",
        "But gold segmentation is not available in application settings, so a segmenter and parser are arranged in a pipeline.",
        "Segmentation errors cascade into the parsing phase, placing an artificial limit on parsing performance.",
        "Lattice parsing (Chappelier et al., 1999) is an alternative to a pipeline that prevents cascading errors by placing all segmentation options into the parse chart.",
        "Recently, lattices have been used successfully in the parsing of Hebrew (Tsarfaty, 2006; Cohen and Smith, 2007), a Semitic language with similar properties to Arabic.",
        "We extend the Stanford parser to accept pre-generated lattices, where each word is represented as a finite state automaton.",
        "To combat the proliferation of parsing edges, we prune the lattices according to a hand-constructed lexicon of 31 clitics listed in the ATB annotation guidelines (Maamouri et al., 2009a).",
        "Formally, for a lexicon L and segments I G L, O G L, each word automaton accepts the language I*(O +1Aside from adding a simple rule to correct alifdeletion caused by the preposition J, no other language-specific processing is performed.",
        "Our evaluation includes both weighted and unweighted lattices.",
        "We weight edges using a unigram language model estimated with Good-Turing smoothing.",
        "Despite their simplicity, unigram weights have been shown as an effective feature in segmentation models (Dyer, 2009).",
        "The joint parser/segmenter is compared to a pipeline that uses MADA (v3.0), a state-of-the-art Arabic segmenter, configured to replicate ATB segmentation (Habash and Rambow, 2005).",
        "MADA uses an ensemble of SVMs to first re-rank the output of a deterministic morphological analyzer.",
        "For each",
        "(a) Major phrasal (b) Major POS categories (c) Ten lowest scoring (Collins, categories 2003)-style dependencies occurring more than 700 times",
        "Table 8: Per category performance of the Berkeley parser on sentence lengths < 70 (dev set, gold segmentation).",
        "(a) Of the high frequency phrasal categories, ADJP and SBAR are the hardest to parse.",
        "We showed in §2 that lexical ambiguity explains the underperformance of these categories.",
        "(b) POS tagging accuracy is lowest for maSdar verbal nouns (VBG,VN) and adjectives (e.g., JJ).",
        "Richer tag sets have been suggested for modeling morphologically complex distinctions (Diab, 2007), but we find that linguistically rich tag sets do not help parsing.",
        "(c) Coordination ambiguity is shown in dependency scores by e.g., (SSSR) and (NP NP NP R).",
        "(NP NP PP R) and (NP NP ADJP R) are both iDafa attachment.",
        "input token, the segmentation is then performed deterministically given the 1-best analysis.",
        "Since guess and gold trees may now have different yields, the question of evaluation is complex.",
        "Cohen and Smith (2007) chose a metric like SParseval (Roark et al., 2006) that first aligns the trees and then penalizes segmentation errors with an edit-distance metric.",
        "But we follow the more direct adaptation of Evalb suggested by Tsarfaty (2006), who viewed exact segmentation as the ultimate goal.",
        "Therefore, we only score guess/gold pairs with identical character yields, a condition that allows us to measure parsing, tagging, and segmentation accuracy by ignoring whitespace.",
        "Table 9 shows that MADA produces a high quality segmentation, and that the effect of cascading segmentation errors on parsing is only 1.92% F1.",
        "However, MADA is language-specific and relies on manually constructed dictionaries.",
        "Conversely, the lattice parser requires no linguistic resources and produces segmentations of comparable quality.",
        "Nonetheless, parse quality is much lower in the joint model because a lattice is effectively a long sentence.",
        "A cell in the bottom row of the parse chart is required for each potential whitespace boundary.",
        "As we have said, parse quality decreases with sentence length.",
        "Finally, we note that simple weighting gives nearly a 2% F1 improvement, whereas Goldberg and Tsarfaty (2008) found that unweighted lattices were more effective for Hebrew.",
        "Table 9: Dev set results for sentences of length < 70.",
        "Coverage indicates the fraction of hypotheses in which the character yield exactly matched the reference.",
        "Each model was able to produce hypotheses for all input sentences.",
        "In these experiments, the input lacks segmentation markers, hence the slightly different dev set baseline than in Table 6."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "By establishing significantly higher parsing baselines, we have shown that Arabic parsing performance is not as poor as previously thought, but remains much lower than English.",
        "We have described grammar state splits that significantly improve parsing performance, catalogued parsing errors, and quantified the effect of segmentation errors.",
        "With a human evaluation we also showed that ATB inter-annotator agreement remains low relative to the WSJ corpus.",
        "Our results suggest that current parsing models would benefit from better annotation consistency and enriched annotation in certain syntactic configurations.",
        "Acknowledgments We thank Steven Bethard, Evan Rosen, and Karen Shiells for material contributions to this work.",
        "We are also grateful to Markus Dickinson, Ali Farghaly, Nizar Habash, Seth Kulick, David McCloskey, Claude Reichard, Ryan Roth, and Reut Tsarfaty for constructive discussions.",
        "The first author is supported by a National Defense Science and Engineering Graduate (NDSEG) fellowship.",
        "This paper is based on work supported in part by DARPA through IBM.",
        "The content does not necessarily reflect the views of the U.S. Government, and no official endorsement should be inferred.",
        "Tag",
        "#gold",
        "%",
        "Tag",
        "#gold",
        "%",
        "VBG",
        "182",
        "48.84",
        "JJR",
        "134",
        "92.83",
        "Parent",
        "Head",
        "Modifer",
        "Dir",
        "#gold",
        "F1",
        "Label",
        "#gold",
        "F1",
        "VN",
        "163",
        "60.37",
        "DTNNS",
        "1069",
        "94.29",
        "NP",
        "NP",
        "TAG",
        "R",
        "946",
        "0.54",
        "ADJP",
        "1216",
        "59.45",
        "VBN",
        "352",
        "72.42",
        "DTJJ",
        "3361",
        "95.07",
        "SS",
        "S",
        "R",
        "708",
        "0.57",
        "SBAR",
        "2918",
        "69.81",
        "DTNNP",
        "932",
        "83.48",
        "NNP",
        "4152",
        "95.09",
        "NP",
        "NP",
        "ADJP",
        "R",
        "803",
        "0.64",
        "FRAG",
        "254",
        "72.87",
        "JJ",
        "1516",
        "86.09",
        "NN",
        "10336",
        "95.23",
        "NP",
        "NP",
        "NP",
        "R",
        "2907",
        "0.66",
        "VP",
        "5507",
        "78.83",
        "ADJ_NUM",
        "277",
        "88.93",
        "DTNN",
        "6736",
        "95.78",
        "NP",
        "NP",
        "SBAR",
        "R",
        "1035",
        "0.67",
        "S",
        "6579",
        "78.91",
        "VBP",
        "2139",
        "89.94",
        "NOUNQUANT",
        "352",
        "98.16",
        "NP",
        "NP",
        "PP",
        "R",
        "2713",
        "0.67",
        "PP",
        "7516",
        "80.93",
        "RP",
        "818",
        "91.23",
        "PRP",
        "1366",
        "98.24",
        "VP",
        "TAG",
        "PP",
        "R",
        "3230",
        "0.80",
        "NP",
        "34025",
        "84.95",
        "NNS",
        "907",
        "91.75",
        "CC",
        "4076",
        "98.92",
        "NP",
        "NP",
        "TAG",
        "L",
        "805",
        "0.85",
        "ADVP",
        "1093",
        "90.64",
        "DTJJR",
        "78",
        "92.41",
        "IN",
        "8676",
        "99.07",
        "VP",
        "TAG",
        "SBAR",
        "R",
        "772",
        "0.86",
        "WHNP",
        "787",
        "96.00",
        "VBD",
        "2580",
        "92.42",
        "DT",
        "525",
        "99.81",
        "S",
        "VP",
        "NP",
        "L",
        "961",
        "0.87",
        "LP",
        "LR",
        "F1",
        "SegF1",
        "Tag F1",
        "Coverage",
        "Stanford (Gold)",
        "81.64",
        "80.55",
        "81.09",
        "100.0",
        "95.81",
        "100.0%",
        "MADA",
        " – ",
        " – ",
        " – ",
        "97.67",
        " – ",
        "96.42%",
        "MADA+Stanford",
        "79.44",
        "78.90",
        "79.17",
        "97.67",
        "94.27",
        "96.42%",
        "StanfordJoint",
        "76.13",
        "72.61",
        "74.33",
        "94.12",
        "90.13",
        "94.73%",
        "StanfordJoint+Uni",
        "77.09",
        "74.97",
        "76.01",
        "96.26",
        "92.23",
        "95.87%"
      ]
    }
  ]
}
