{
  "info": {
    "authors": [
      "Nianwen Xue",
      "Libin Shen"
    ],
    "book": "SIGHAN Workshop on Chinese Language Processing",
    "id": "acl-W03-1728",
    "title": "Chinese Word Segmentation as LMR Tagging",
    "url": "https://aclweb.org/anthology/W03-1728",
    "year": 2003
  },
  "references": [
    "acl-J95-4004",
    "acl-J96-3004",
    "acl-J96-4004",
    "acl-N01-1006",
    "acl-P03-1064",
    "acl-P98-1081",
    "acl-W96-0213"
  ],
  "sections": [
    {
      "heading": "Abstract 1 Segmentation as Tagging",
      "text": [
        "Unlike English text in which sentences are sequences of words delimited by white spaces, in Chinese text, sentences are represented as strings of Chinese characters or hanzi without similar natural delimiters.",
        "Therefore, the first step in a Chinese language processing task is to identify the sequence of words in a sentence and mark boundaries in appropriate places.",
        "This may sound simple enough but in reality identifying words in Chinese is a non-trivial problem that has drawn a large body of research in the Chinese language processing community (Fan and Tsai, 1988; Gan et al., 1996; Sproat et al., 1996; Wu, 2003; Xue, 2003).",
        "The key to accurate automatic word identification in Chinese lies in the successful resolution of ambiguities and aproper way to handle out-of-vocabulary words.",
        "The ambiguities in Chinese word segmentation is due to the fact that a hanzi can occur in different word-internal positions (Xue, 2003).",
        "Given the proper context, generally provided by the sentence in which it occurs, the position of a hanzi can be determined.",
        "In this paper, we model the Chinese word segmentation as a hanzi tagging problem and use a machine-learning algorithm to determine the appropriate position for a hanzi.",
        "There are several reasons why we may expect this approach to work.",
        "First, Chinese words generally have fewer than four characters.",
        "As a result, the number of positions is small.",
        "Second, although each hanzi can in principle occur in all possible positions, not all hanzi behave this way.",
        "A substantial number of hanzi are distributed in a constrained manner.",
        "For example, , the plural marker, almost always occurs in the word-final position.",
        "Finally, although Chinese words cannot be exhaustively listed and new words are bound to occur in naturally occurring text, the same is not true for hanzi.",
        "The number of hanzi stays fairly constant and we do not generally expect to see new hanzi.",
        "We represent the positions of a hanzi with four different tags (Table 1): LM for a hanzi that occurs on the left periphery of a word, followed by other hanzi, MM for a hanzi that occurs in the middle of a word, MR for a hanzi that occurs on the right periphery of word, preceded by other hanzi, and LR for hanzi that is a word by itself.",
        "We call this LMR tagging.",
        "With this approach, word segmentation is a process where each hanzi is assigned an LMR tag and sequences of hanzi are then converted into sequences of words based on the LMR tags.",
        "The use of four tags is linguistically intuitive in that LM tags morphemes that are prefixes or stems in the absence of prefixes, MR tags morphemes that are suffixes or stems in the absence of suffixes, MM tags stems with affixes and LR tags stems without affixes.",
        "Representing the distributions of hanzi with LMR tags also makes it easy to use machine learning algorithms which has been successfully applied to other tagging problems, such as POS-tagging and IOB tagging used in text chunking.",
        "In this paper we present Chinese word segmentation algorithms based on the so-called LMR tagging.",
        "Our LMR taggers are implemented with the Maximum Entropy Markov Model and we then use Transformation-Based Learning to combine the results of the two LMR taggers that scan the input in opposite directions.",
        "Our system achieves F-scores of and on the Academia Sinica corpus and the Hong Kong City University corpus respectively."
      ]
    },
    {
      "heading": "2 Tagging Algorithms",
      "text": [
        "Our algorithm consists of two parts.",
        "We first implement two Maximum Entropy taggers, one of which scans the input from left to right and the other scans the input from right to left.",
        "Then we implement a Transformation Based Algorithm to combine the results of the two taggers."
      ]
    },
    {
      "heading": "2.1 The Maximum Entropy Tagger",
      "text": [
        "The Maximum Entropy Markov Model (MEMM) has been successfully used in some tagging problems.",
        "MEMM models are capable of utilizing a large set of features that generative models cannot use.",
        "On the other hand, MEMM approaches scan the input incrementally as generative models do.",
        "The Maximum Entropy Markov Model used in POS-tagging is described in detail in (Ratnaparkhi, 1996) and the LMR tagger here uses the same probability model.",
        "The probability model is defined over , where is the set of possible contexts or ”histories” and is the set of possible tags.",
        "The model’s joint probability of a history and a tag is defined as where is a normalization constant, are the model parameters and are known as features, where .",
        "Each feature has a corresponding parameter , that effectively serves as a ”weight” of this feature.",
        "In the training process, given a sequence of characters and their LMR tags as training data, the purpose is to determine the parameters that maximize the likelihood of the training data using : The success of the model in tagging depends to a large extent on the selection of suitable features.",
        "Given , a feature must encode information that helps to predict .",
        "The features we used in our experiments are instantiations of the feature templates in (1).",
        "Feature templates (b) to (e) represent character features while (f) represents tag features.",
        "In the following list, are characters and are LMR tags.",
        "), the previous two characters ( ), and the next two characters ( ) (e) The previous and the next character ( ) (f) The tag of the previous character ( ), and the tag of the character two before the current character ( )"
      ]
    },
    {
      "heading": "2.2 Transformation-Based Learning",
      "text": [
        "One potential problem with the MEMM is that it can only scan the input in one direction, from left to right or from right to left.",
        "It is noted in (Lafferty et al., 2001) that non-generative finite-state models, MEMM models included, share a weakness which they call the Label Bias Problem (LBP): a transition leaving a given state compete only against all other transitions in the model.",
        "They proposed Conditional Random Fields (CRFs) as a solution to address this problem.",
        "A partial solution to the LBP is to compute the probability of transitions in both directions.",
        "This way we can use two MEMM taggers, one of which scans the input from left to right and the other scans the input from right to left.",
        "This strategy has been successfully used in (Shen and Joshi, 2003).",
        "In that paper, pairwise voting (van Halteren et al., 1998) has",
        "been used to combine the results of two supertaggers that scan the input in the opposite directions.",
        "The pairwise voting is not suitable in this application because we must make sure that the LMR tags assigned to consecutive words are compatible.",
        "For example, an LM tag cannot immediately follow an MM.",
        "Pairwise voting does not use any contextual information, so it cannot prevent incompatible tags from occurring.",
        "Therefore, in our experiments described here, we use the Transformation-Based Learning (Brill, 1995) to combine the results of two MEMM taggers.",
        "The feature set used in the TBL algorithm is similar to those used in the NP Chunking task in (Ngai and Florian, 2001)."
      ]
    },
    {
      "heading": "3 Experiments",
      "text": [
        "We conducted closed track experiments on three data sources: the Academia Sinica (AS) corpus, the Beijing University (PKU) corpus and the Hong Kong City University (CityU) corpus.",
        "We first split the training data from each of the three sources into two portions.",
        "of the official training data is used to train the MEMM taggers, and the other is held out as the development test data (the development set).",
        "The development set is used to estimate the optimal number of iterations in the MEMM training.",
        "Figure (1), (2) and (3) show the curves of F-scores on the development set with respect to the number of iterations in MEMM training.",
        "dataset of the Academia Sinica corpus.",
        "X-axis stands for the number of iteration in training.",
        "Y-axis stands for the -score.",
        "Experiments show that the MEMM models",
        "achieve the best results after 500 and 400 rounds (iterations) of training on the AS data and the PKU data respectively.",
        "However, the results on the CityU data is not very clear.",
        "From Round 100 through 200, the F-score on the development set almost stays unchanged.",
        "We think this is because the CityU data is from three different sources, which differ in the optimal number of iterations.",
        "We decided to train the MEMM taggers for 160 iterations the HK City University data.",
        "We implemented two MEMM taggers, one scans the input from left to right and one from right to left.",
        "We then used these two MEMM taggers to tag both the training and the development data.",
        "We use the LMR tagging output to train a Transformation-Based learner, using fast TBL (Ngai and Florian, 2001).",
        "The middle in Table 2 shows the F-score",
        "on the development set achieved by the MEMM tagger that scans the input from left to right and the last column is the results after the Transformation-Based Learner is applied.",
        "The results show that using Transformation-Based learning only give rise to slight improvements.",
        "It seems that the bidirectional approach does not help much for the LMR tagging.",
        "Therefore, we only submitted the results of our left-to-right MEMM tagger, retrained on the entire training sets, as our official results.",
        "The results on the official test data is similar to what we have got on our development set, except that the F-score on the Beijing Univ.",
        "corpus is over 2 lower in absolute accuracy than what we expected.",
        "The reason is that in the training data of Beijing University corpus, all the numbers are encoded in GBK, while in the test data many numbers are encoded in ASCII, which are unknown to our tagger.",
        "With this problem fixed, the results of the official test data are compatible with the results on our development set.",
        "However, we have withdrawn our segmentation results on the Beijing University corpus."
      ]
    },
    {
      "heading": "4 Conclusions and Future Work",
      "text": [
        "Our closed track experiments on the first Sighan Bakeoff data show that the LMR algorithm produces promising results.",
        "Our system ranks the second when tested on the Academia Sinica corpus and third on the Hong Kong City University corpus.",
        "In the future, we will try to incorporate a large word list into our tagger to test its performance on open track experiments.",
        "Its high accuracy on makes it a good candidate as a general purpose segmenter."
      ]
    }
  ]
}
