{
  "info": {
    "authors": [
      "Oliver Lemon",
      "Srinivasan Janarthanam",
      "Verena Rieser"
    ],
    "book": "Proceedings of the International Natural Language Generation Conference",
    "id": "acl-W10-4235",
    "title": "Generation Under Uncertainty",
    "url": "https://aclweb.org/anthology/W10-4235",
    "year": 2010
  },
  "references": [
    "acl-E09-1078",
    "acl-P04-1011",
    "acl-P08-2019",
    "acl-P10-1008",
    "acl-P10-1103",
    "acl-W08-0119",
    "acl-W09-0626",
    "acl-W09-3916"
  ],
  "sections": [
    {
      "text": [
        "Generation under Uncertainty",
        "Oliver Lemon Srini Janarthanam Verena Rieser",
        "Heriot-Watt University Edinburgh University Edinburgh University",
        "Edinburgh, United Kingdom Edinburgh, United Kingdom Edinburgh, United Kingdom",
        "We invite the research community to consider challenges for NLG which arise from uncertainty.",
        "NLG systems should be able to adapt to their audience and the generation environment in general, but often the important features for adaptation are not known precisely.",
        "We explore generation challenges which could employ simulated environments to study NLG which is adaptive under uncertainty, and suggest possible metrics for such tasks.",
        "It would be particularly interesting to explore how different planning approaches to NLG perform in challenges involving uncertainty in the generation environment."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "We would like to highlight the design of NLG systems for environments where there may be incomplete or faulty information, where actions may not always have the same results, and where there may be tradeoffs between the different possible outcomes of actions and plans.",
        "There are various sources of uncertainty in systems which employ NLG techniques, for example:",
        "• the current state of the user / audience (e.g. their knowledge, preferred vocabulary, goals, preferences....),",
        "• the likely user reaction to the generated output,",
        "• the behaviour of related components (e.g. a surface realiser, or TTS module),",
        "• noise in the environment (for spoken output),",
        "• ambiguity of the generated output.",
        "The problem here is to generate output that takes these types of uncertainty into account appropriately.",
        "For example, you may need to choose a referring expression for a user, even though you are not sure whether they are an expert or novice in the domain.",
        "In addition, the next time you speak to that user, you need to adapt to new information you have gained about them (Janarthanam and Lemon, 2010).",
        "The issue of uncertainty for referring expression generation has been discussed before by (Reiter, 1991; Horacek, 2005).",
        "Another example is in planning an Information Presentation for a user, when you cannot know with certainty how they will respond to it (Rieser and Lemon, 2009; Rieser et al., 2010).",
        "In the worst case, you may even be uncertain about the user's goals or information needs (as in \"POMDP\" approaches to dialogue management (Young et al., 2009; Henderson and Lemon, 2008a)), but you still need to generate output for them in an appropriate way.",
        "In particular, in interactive applications of NLG:",
        "• each NLG action changes the environment state or context,",
        "• the effect of each NLG action is uncertain.",
        "Several recent approaches describe NLG tasks as different kinds of planning, e.g. (Koller and Pet-rick, 2008; Rieser et al., 2010; Janarthanam and Lemon, 2010), or as contextual decision making according to a cost function (van Deemter, 2009).",
        "It would be very interesting to explore how different approaches perform in NLG problems where different types of uncertainty are present in the generation environment.",
        "In the following we discuss possible generation challenges arising from such considerations, which we hope will lead to work on an agreed shared challenge in this research community.",
        "In section 2 we briefly review recent work showing that simulated environments can be used to evaluate generation under uncertainty, and in section 3 we discuss some possible metrics for such tasks.",
        "Section 4 concludes by considering how a useful generation challenge could be constructed using similar methods."
      ]
    },
    {
      "heading": "2. Generation in Uncertain Simulated Environments",
      "text": [
        "Finding the best (or \"optimal\") way to generate under uncertainty requires exploring the possible outcomes of actions in stochastic environments.",
        "Therefore, related research on Dialogue Strategy learning has used data-driven simulated environments as a cheap and efficient way to explore uncertainty (Lemon and Pietquin, 2007).",
        "However, building good simulated environments is a challenge in its own right, as we illustrate in the following using the examples of Information Presentation and Referring Expression Generation.",
        "We also point out the additional challenges these simulations have to face when being used for NLG.",
        "User Simulations can provide a model of probable, but uncertain, user reactions to NLG actions, and we propose that they are a useful potential direction for exploring and evaluate different approaches to handling uncertainty in generation.",
        "User Simulations are commonly used to train strategies for Dialogue Management, see for example (Young et al., 2007).",
        "A user simulation for Information Presentation is very similar, in that it is a predictive model of the most likely next user act.",
        "However, this NLG predicted user act does not actually change the overall dialogue state (e.g. by filling slots) but it only changes the generator state.",
        "In other words, this NLG user simulation tells us what the user is most likely to do next, if we were to stop generating now.",
        "In addition to the challenges of building user simulations for learning Dialogue policies, e.g. modelling, evaluation, and available data sets (Lemon and Pietquin, 2007), a crucial decision for NLG is the level of detail needed to train sensible policies.",
        "While high-level dialogue act descriptions may be sufficient for dialogue policies, NLG decisions may require a much finer level of detail.",
        "The finer the required detail of user reactions, the more data is needed to build data-driven simulations.",
        "For content selection in Information Presentation tasks (choosing presentation strategy and number of attributes), for example, the level of description can still be fairly abstract.",
        "We were most interested in probability distributions over the following possible user reactions:",
        "1. select: the user chooses one of the presented items, e.g. \"Yes, I'll take that one.\".",
        "This reply type indicates that the information presentation was sufficient for the user to make a choice.",
        "2. addlnfo: The user provides more attributes, e.g. \"I want something cheap.\".",
        "This reply type indicates that the user has more specific requests, which s/he wants to specify after being presented with the current information.",
        "3. requestMorelnfo: The user asks for more information, e.g. \"Can you recommend me one?",
        "\", \"What is the price range of the last item?\".",
        "This reply type indicates that the system failed to present the information the user was looking for.",
        "4. askRepeat: The user asks the system to repeatthe same message again, e.g. \"Canyou repeat?\".",
        "This reply type indicates that the utterance was either too long or confusing for the user to remember, or the TTS quality was not good enough, or both.",
        "5. silence: The user does not say anything.",
        "In this case it is up to the system to take initiative.",
        "6. hangup: The user closes the interaction.",
        "We have built user simulations using n-gram models of system (s) and user (u) acts, as first introduced by (Eckert et al., 1997).",
        "In order to account for data sparsity, we apply different discounting (\"smoothing\") techniques including automatic back-off, using the CMU Statistical Language Modelling toolkit (Clarkson and Rosenfeld, 1997).",
        "For example we have constructed a bi-gram model for the users' reactions to the system's IP structure decisions (P(aU;t\\IPS;t)), and a tri-gram (i.e. IP structure + attribute choice) model for predicting user reactions to the system's combined IP structure and attribute selection decisions: P(au,t\\IPs,t,attributess>t).",
        "We have evaluated the performance of these models by measuring dialogue similarity to the original data, based on the Kullback-Leibler (KL) divergence, as also used by e.g. (Cuayahuitl et al., 2005; Jung et al., 2009; Janarthanam and Lemon, 2009).",
        "We compared the raw probabilities as observed in the data with the probabilities generated by our n-gram models using different discounting techniques for each context.",
        "All the models have a small divergence from the original data (especially the bi-gram model), suggesting that they are reasonable simulations for training and testing NLG policies (Rieser et al., 2010).",
        "In some systems, NLG decisions may also depend on related components, such as the database, subsequent generation steps, or the Text-to-Speech module for spoken generation.",
        "Building simulations for these components to capture their inherent uncertainty, again, is an interesting challenge.",
        "For example, one might want to adapt the generated output according to the predicted TTS quality.",
        "Therefore, one needs a model of the expected/ predicted TTS quality for a TTS engine (Boidin et al., 2009).",
        "Furthermore, NLG decisions might be inputs to a stochastic sentence realiser, such as SPaRKy (Stent et al., 2004).",
        "However, one might not have a fully trained stochastic sentence realiser for this domain (yet).",
        "In (Rieser et al., 2010) we therefore modelled the variance as observed in the top ranking SPaRKy examples.",
        "In this section, we present an example user simulation (US) model, that simulates the dialogue behaviour of users who react to referring expressions depending on their domain knowledge.",
        "These external simulation models are different from internal user models used by dialogue systems.",
        "In particular, such models must be sensitive to a system's choices of referring expressions.",
        "The simulation has a statistical distribution of inbuilt knowledge profiles that determines the dialogue behaviour of the user being simulated.",
        "Uncertainty arises because if the user does not know a referring expression, then he is more likely to request clarification.",
        "If the user is able to interpret the referring expressions and identify the references then he is more likely to follow the system's instruction.",
        "This behaviour is simulated by the action selection models described below.",
        "The user simulation (US) receives the system action As t and its referring expression choices RECS;t at each turn.",
        "The US responds with a user action Au t (u denoting user).",
        "This can either be a clarification request (cr) or an instruction response (ir).",
        "We used two kinds of action selection models: a corpus-driven statistical model and a hand-coded rule-based model.",
        "The user simulation (US) receives the system action As t and its referring expression choices RECS;t at each turn.",
        "The US responds with a user action Au t (u denoting user).",
        "This can either be a clarification request (cr) or an instruction response (ir).",
        "The US produces a clarification request cr based on the class of the referent C(Ri), type of the referring expression Ti, and the current domain knowledge of the user for the referring expression DKut(Ri,Ti).",
        "Domain entities whose jargon expressions raised clarification requests in the corpus were listed and those that had more than the mean number of clarification requests were classified as difficult and others as easy entities (for example, \"power adaptor\" is easy - all users understood this expression, \"broadband filter\" is difficult).",
        "Clarification requests are produced using the following model.",
        "where (Ri,T) e RECs,t",
        "One should note that the actual literal expression is not used in the transaction.",
        "Only the entity that it is referring to (Ri) and its type (Ti) are used.",
        "However, the above model simulates the process of interpreting and resolving the expression and identifying the domain entity of interest in the instruction.",
        "The user identification of the entity is signified when there is no clarification request produced (i.e.",
        "Au t = none).",
        "When no clarification request is produced, the environment action EAU)tis generated using the following model.",
        "Finally, the user action is an instruction response which is determined by the system action AS)t. Instruction responses can be either provide-info, acknowledgement or other based on the system's instruction.",
        "All the above models were trained on our corpus data using maximum likelihood estimation and smoothed using a variant of Witten-Bell discounting.",
        "According to the data, clarification requests are much more likely when jargon expressions are used to refer to the referents that belong to the difficult class and which the user doesn't know about.",
        "When the system uses expressions that the user knows, the user generally responds to the instruction given by the system.",
        "These user simulation models have been evaluated and found to produce behaviour that is very similar to the original corpus data, using the Kullback-Leibler divergence metric (Janarthanam and Lemon, 2010)."
      ]
    },
    {
      "heading": "3. Metrics",
      "text": [
        "Here we discuss some possible evaluation metrics that will allow different approaches to NLG under uncertainty to be compared.",
        "We envisage that other metrics should be explored, in particular those measuring adaptivity of various types.",
        "Given a suitable corpus, a data-driven evaluation function can be constructed, using a stepwise linear regression, following the PARADISE framework (Walker et al., 2000).",
        "For example, in (Rieser et al., 2010) we build a model which selects the features which significantly influenced the users' ratings for NLG strategies in a Wizard-of-Oz study.",
        "We also assign a value to the user's reactions (valueUserReaction), similar to optimising task success for DM (Young et al., 2007).",
        "This reflects the fact that good Information Presentation strategies should help the user to select an item (valueUserReaction = +100) or provide more constraints addlnfo (valueUserReaction = ±0), but the user should not do anything else (valueUserReaction = – 100).",
        "The regression in equation 1 (R = .26) indicates that users' ratings are influenced by higher level and lower level features: Users like to be focused on a small set of database hits (where #DBhits ranges over [1100]), which will enable them to choose an item (valueUserReaction), while keeping the IP utterances short (where #sentence was in the range [2-18]):",
        "Expressions",
        "We have also designed a metric for the goal of adapting referring expressions to each user's domain knowledge.",
        "We present the Adaptation Accuracy score AA that calculates how accurately the agent chose the expressions for each referent r, with respect to the user's knowledge.",
        "Appropriateness of an expression is based on the user's knowledge of the expression.",
        "So, when the user knows the jargon expression for r, the appropriate expression to use is jargon, and if s/he doesn't know the jargon, an descriptive expression is appropriate.",
        "Although the user's domain knowledge is dynamically changing due to learning, we base appropriateness on the initial state, because our objective is to adapt to the initial state of the user DKU)initiai.",
        "However, in reality, designers might want their system to account for user's changing knowledge as well.",
        "We calculate accuracy per referent RAr as the ratio of number of appropriate expressions to the total number of instances of the referent in the dialogue.",
        "We then calculate the overall mean accuracy over all referents as shown below.",
        "RA _ #(appropriate-£xpressions(r))",
        "r #(instances(r))",
        "AdaptationAccuracyAA = #(ry Sr RAr4 Conclusion",
        "We have invited the research community to consider challenges for NLG which arise from uncertainty.",
        "We argue that NLG systems, like dialogue managers, should be able to adapt to their audience and the generation environment.",
        "However, often the important features for adaptation are not precisely known.",
        "We then summarised 2 potential directions for such challenges - example generation tasks which employ simulated uncertain environments to study adaptive NLG, and discussed some possible metrics for such tasks.",
        "We hope that this will lead to discussions on a shared challenge allowing comparison of different approaches to NLG with respect to how well they handle uncertainty."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The research leading to these results has received funding from the European Community's Seventh Framework Programme (FP7/2007-2013) under grant agreement no.",
        "216594 (CLASSiC project www.classic-project.org) and from the EPSRC, project no.",
        "EP/G069840/1."
      ]
    }
  ]
}
