{
  "info": {
    "authors": [
      "Kow Kuroda",
      "Jun'ichi Kazama",
      "Kentaro Torisawa"
    ],
    "book": "Proceedings of the Second Workshop on NLP Challenges in the Information Explosion Era (NLPIX 2010)",
    "id": "acl-W10-3907",
    "title": "A Look inside the Distributionally Similar Terms",
    "url": "https://aclweb.org/anthology/W10-3907",
    "year": 2010
  },
  "references": [
    "acl-I08-1025",
    "acl-P08-1047",
    "acl-P98-2127",
    "acl-P99-1014"
  ],
  "sections": [
    {
      "text": [
        "Kow Kuroda Jun'ichi Kazama Kentaro Torisawa",
        "kuroda@nict.go.jp kazama@nict.go.jp torisawa@nict.go.jp",
        "National Institute of Information and Communications Technology (NICT)",
        "We analyzed the details of a Web-derived distributional data of Japanese nominal terms with two aims.",
        "One aim is to examine if distributionally similar terms can be in fact equated with \"semanti-cally similar\" terms, and if so to what extent.",
        "The other is to investigate into what kind of semantic relations constitute (strongly) distributionally similar terms.",
        "Our results show that over 85% of the pairs of the terms derived from the highly similar terms turned out to be semantically similar in some way.",
        "The ratio of \"classmate,\" synonymous, hypernym-hyponym, and meronymic relations are about 62%, 17%, 8% and 1% of the classified data, respectively."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The explosion of online text allows us to enjoy a broad variety of large-scale lexical resources constructed from the texts in the Web in an unsupervised fashion.",
        "This line of approach was pioneered by researchers such as Hindle (1990), Grefenstette (1993), Lee (1997) and Lin (1998).",
        "At the heart of the approach is a crucial working assumption called \"distributional hypothesis,\" as with Harris (1954).",
        "We now see an impressive number of applications in natural language processing (NLP) that benefit from lexical resources directly or indirectly derived from this assumption.",
        "It seems that most researchers are reasonably satisfied with the results obtained thus far.",
        "Does this mean, however, that the distributional hypothesis was proved to be valid?",
        "Not necessarily: while we have a great deal of confirmative results reported in a variety of research areas, but we would rather say that the hypothesis has never been fully \"validated\" for two reasons.",
        "First, it has yet to be tested under the precise definition of \"semantic similarity.\"",
        "Second, it has yet to be tested against results obtained at a truly large scale.",
        "One of serious problems is that we have seen no agreement on what \"similar terms\" mean and should mean.",
        "This paper intends to cast light on this unsolved problem through an investigation into the precise nature of lexical resources constructed under the distributional hypothesis.",
        "The crucial question to be asked is, Can distri-butionally similar terms really be equated with semantically similar terms or not?",
        "In our investigation, we sought to recognize what types of semantic relations can be found for pairs of terms with high distributional similarity, and see where the equation of distributional similarity with semantic similarity fails.",
        "With this concern, this paper tried to factor out as many components of semantic similarity as possible.",
        "The effort of factorization resulted in the 18 classes of semantic (un)relatedness to be explained in §2.3.1.",
        "Such factorization is a necessary step for a full validation of the hypothesis.",
        "To meet the criterion of testing the hypothesis at a very large scale, we analyzed 300,000 pairs of distributionally similar terms.",
        "Details of the data we used are given in §2.2.",
        "This paper is organized as follows.",
        "In §2, we present our method and data we used.",
        "In §3, we present the results and subsequent analysis.",
        "In § 4, we address a few remaining problems.",
        "In §5, we state tentative conclusions."
      ]
    },
    {
      "heading": "2. Method and Data",
      "text": [
        "The question we need to address is how many subtypes of semantic relation we can identify in the highly similar terms.",
        "We examined the question in the following procedure:",
        "(1) a.",
        "Select a set of \"base\" terms B.",
        "b.",
        "Use a similarity measure M to construct a list of n terms T = [ti;1, ti;2,..., ti,j, ..., ti,rî\\ where ti;j denotes the j-th most similarity term in T against bi G B. P(k) are pairs of bi and ti k, i.e., the k-th most similar term to bi.",
        "c. Human raters classify a portion Q of the pairs in P(k) with reference to a classification guideline prepared for the task.",
        "Note that the selection of base set B can be independent of the selection of T. Note also that T is indexed by terms in B.",
        "To encode this, we write: T[bi] = [ti,i, ti,2,..., ,..., ti,n\\.",
        "For T, we used Kazama's nominal term clustering (Kazama and Torisawa, 2008; Kazama et al., 2009).",
        "In this data, base set B for T is one million terms defined by the type counts of dependency relations, which is roughly equated with the \"frequencies\" of the terms.",
        "Each base term in B is associated with up to 500 of the most dis-tributionally similar terms.",
        "This defines T.",
        "For M, we used the Jensen-Shannon divergence (JS-divergence) base on the probability distributions derived by an EM-based soft clustering (Kazama and Torisawa, 2008).",
        "For convenience, some relevant details of the data construction are described in Appendix A, but in a nutshell, we used dependency relations as distributional information.",
        "This makes our method comparable to that used in Hindle (1990).",
        "The statistics of the distributional data used were as follows: roughly 920 million types of dependency relations1) were automatically acquired",
        "1)The 920 million types come in two kinds of context triples: 590 million types of (t,p, v) and 320 million types",
        "from a large-scale Japanese Web-corpus called the Tsubaki corpus (Shinzato et al., 2008) which consists of roughly 100 million Japanese pages with six billion sentences.",
        "After excluding hapax nouns, we had about 33 million types of nouns (in terms of string) and 27 million types of verbs.",
        "These nouns were ranked by type count of the two context triples, i.e., (t,p, v) and (n*,p*, t).",
        "B was determined by selecting the top one million terms with the most variations of context triples.",
        "For illustration, we present examples of the Web-derived distributional similar terms.",
        "(2) shows the 10 most distributionally similar terms",
        "X^ – \" (Tchaikovsky) is the 38555-th term in B.",
        "of (t,p*,n*), where t denotes the target nominal term, p a postposition, v a verb, and n* a nominal term that follows t and p*, i.e., \"t-no\" analogue to the English \"oft.\"",
        "For construction of P(k), we had the following settings: i) k = 1,2; and ii) for each k, we selected the 150,000 most frequent terms (out of one million terms) with some filtering specified below.",
        "Thus, Q was 300,000 pairs whose base terms are roughly the most frequent 150,000 terms in B with filtering and targets are terms k = 1 or k = 2.",
        "For filtering, we excluded the terms of B with one of the following properties: a) they are in an invalid form that could have resulted from parse errors; b) they have regular ending (e.g., -£ t , -l?",
        "[event], -B# [time or when], -fe© [thing or person], [thing], -# [person]).",
        "The reason for the second is two-fold.",
        "First, it was desirable to reduce the ratio of the class of \"classmates with common morpheme,\" which is explained in §2.3.2, whose dominance turned out to be evident in the preliminary analysis.",
        "Second, the semantic property of the terms in this class is relatively predictable from their morphology.",
        "That notwithstanding, this filtering might have had an undesirable impact on our results, at least in terms of representativeness.",
        "Despite of this, we decided to place priority on collecting more varieties of classes.",
        "The crucial question is, again, whether dis-tributionally similar terms can really be equated with semantically similar terms.",
        "Put differently, what kinds of terms can we find in the sets constructed using distributionally similarity?",
        "We can confirm the hypothesis if the most of the term pairs are proved to be semantically similar for most sets of terms constructed based on the distributional hypothesis.",
        "To do this, however, we need to clarify what constitutes semantic similarity.",
        "We will deal with this prerequisite.",
        "Building on lexicographic works like Fellbaum (1998) and Murphy (2003), we assume that the following are the four major classes of semantic relation that contribute to semantic similarity between two terms:",
        "(4) a.",
        "\"synonymic\" relation (one can substitute for another on an identity basis).",
        "Examples are (Microsoft, MS).",
        "b.",
        "\"hypernym-hyponym\" relation between two terms (one can substitute for another on un underspecifica-tion/abstraction basis).",
        "Examples are (guys, players)",
        "c. \"meronymic\" (part-whole) relation between two terms (one term can be a substitute for another on metonymic basis).",
        "Examples are (bodies, players) [cf. All the players have strong bodies]",
        "d. \"classmate\" relation between two terms, t1 and t2, if and only if (i) they are not synonymous and (ii) there is a concrete enough class such that both t1and t2 are instances (or subclasses).-For example, (China, South Korea) [cf. (Both) China and South Korea are countries in East Asia], (Ford, Toyota) [cf. (Both) Ford and Toyota are top-selling automotive companies] and (tuna, cod) [cf. (Both) tuna and cod are types offish that are eaten in the Europe] are classmates.",
        "For the substitution, the classmate class behaves somewhat differently.",
        "In this case, one term cannot substitute for another for a pair of terms.",
        "It is hard to find out the context in which pairs like (China, South Korea), (Ford, Toyota) and (tuna, cod) can substitute one another.",
        "On the other hand, substitution is more or less possible in the other three types.",
        "For example, a synonymic pair of (MS, Microsoft) can substitute for one another in contexts like Many people regularly complain",
        "2)The proper definition of classmates is extremely hard to form.",
        "The authors are aware of the incompleteness of their definition, but decided not to be overly meticulous.",
        "pair of meaningful terms y: undecidable",
        "about products { i. MS; ii.",
        "Microsoft }.",
        "A hypernym-hyponym pair of (guys, players) can substitute in contexts like We have dozens ofex-cellent { i. guys; ii.",
        "players } on our team.",
        "A meronymic pair of (bodies, players) can substitute for each other in contexts like They had a few ofexcellent { i. bodies; ii.",
        "players } last year.",
        "The classification guidelines were specified based on a preliminary analysis of 5,000 randomly selected examples.",
        "We asked four annotators to perform the task.",
        "The guidelines were finalized after several revisions.",
        "This revision process resulted in a hierarchy of binary semantic relations as illustrated in Figure 1, which subsumes 18 types as specified in (5).",
        "The essential division is made at the fourth level where we have s* (pairs of synonyms in the broadest sense) with two subtypes, p (pairs of terms in the \"part-whole\" relation), h (pairs of terms in the \"hypernym-hyponym\" relation), k** (pairs of terms in the \"classmate\" relation), and o (pairs of terms in any other relation).",
        "Note that this system includes the four major types described in (4).",
        "The following are some example pairs of Japanese terms with or without English translations:",
        "(5) s: synonymic pairs (subtype of s*) in which the pair designates the same entity, property, or relation.",
        "Examples are: (Mfc, Ste) [both mean root], (V~ hkm, Wtkm) [(supporting member, cooperating member)], (nftfttiL Te, fi7°n-feX) [(invoker of the process, parent process)], (^y^^ – Mi/^ X, ^y^-v – ) [(venture business, venture)], (*B#K#, fg#t?.y^ – ) [(opposing hurler, opposing pitcher)], (#f ffi, KfiM) [(medical history, anamneses)],",
        "n: alias pairs (subtype of s*) in which one term of the pair is the \"alias\" of the other term.",
        "Examples are (Steve Jobs, founder ofApple, Inc.), (Barak Obama, US President), (7^^rh, • 7 7^), (fê-g|3,",
        "pair of forms",
        "x: pair with a meaningless form",
        "a: acronymic pair (subtype of s*) in which one term of the pair is the acronym of of the other term.",
        "Examples are: (DEC, Digital Equipment), (IBM, International Business Machine) (Microsoft it, MS it), (Hü",
        "v: allographic pairs (subtype of s*) in which the pair is the pair of two forms of the same term.",
        "Examples are: (convention centre, convention center), (colour terms, color terms), (Zk ? – h, Zk? – ), fefrT D),",
        "h: hypernym-hyponym pair in which one term of the pair designates the \"class\" of the other term.",
        "Examples (order is irrelevant) are: (thesaurus, Ro-get's), fl^y – K «iV7 h) [(search tool, search software)], (^it^Ä, 1OT Sä) [(unemployment measures, employment measures)], (JRiÄ, IM It® ) [( business conditions, employment conditions)], (7xXf^A^, Hs^SI) [(festival, music festival)], (féltli, ££ isféÛBS) [(test agent, pregnancy test)], (SyMi^h, P^y) [(cymbidium, orchid)], (^Soh, ndV – 7) [(company logo, logo)], M*fO [(mystical experiences, near-death experiences)]",
        "p: meronymic pair in which one term of the pair designates the \"part\" of the other term.",
        "Examples (order is irrelevant) are: , [(earth, sea)], (fit$j, TP) [(affirmation, admission)], (KIM, W^fiScH) [(findings, research progress)], (V – :7 – If – ^y h, ^SîIÎHîS) [(solar circuit system, exterior thermal insulation method)], (^n^yx, S ft) [(Provence, South France)],",
        "k: classmates not obviously contrastive without common morpheme (subtype",
        "w: classmates not obviously contrastive with common morpheme (subtype of k*).",
        "Examples are: (#X^fI, ffêC^û) [(gas facilities, electric facilities)], (ffi ttSm, ^Sto) [(products of other company, aforementioned products)], Jm, ftKfJm) [(affiliate station, local station)], (frilfl, ft^t-üff) [(Niigata City, Wakayama City)], (7:^7^1!, vl^ – ¥ft) [(Sinai Peninsula, Malay Peninsula)],",
        "c: contrastive pairs without antonymity (subtype of c*).",
        "Examples are: (nvy ±lt, gM±lt) [(romanticism, naturalism)], (»fiM!S:i – +f – , ^y? – *yh +f – ) [(mobile user, internet user)], PS2 fig), [(bootleg edition, PS2 edition)]",
        "d: antonymic pairs = contrastive pairs with antonymity (subtype of c*).",
        "Examples are: (Küf, ^P) [(bonding, disintegration)], (WJM, ffiSfê) [(gravel road, pavement)], (HS, SS ) [(west walls, east walls)], JftT^MO [(daughter and son-in-law, son and daughter-in-law)], (^fü, faff ) [(tax-exclusive prices, tax-inclusive prices)], (U77l^ – ^, 7nyh7l^ – ^ ) [(front brake, rear brake)], (7y7V y^S ->y?^V7f) [(tag-team match, solo match)], (f£K^, 7j<K^) [(wiping with dry materials, wiping with wet materials)], (7 – XU – 7, Utt) [(sleeveless, long-sleeved)]",
        "t: pairs with inherent temporal order (subtype of c*).",
        "Examples are: (fif/U D, Mix.)",
        "[(harvesting of rice, planting of rice)], Cffi^H) [(day of departure, day of arrival)], (ffifê^ S, üS&iHR) [(career decision, career selection)], (JglgD, SHfrL) [(catnap, stay up)], (ffiW, ?8fi) [(poaching, con-",
        "e: erroneous pairs are pairs in which one term of the pair seems to suffer from character-level input errors, i.e.",
        "\"mistypes.\"",
        "Examples are: (ffiifMi, Ü",
        "f: quasi-erroneous pair is a pair of terms with status somewhat between v and e. Examples (order is irrelevant) are: (X #7 h, K) [(supoito, supoido)],",
        "m: misuse pairs in which one term of the pair seems to suffer from \"mistake\" or \"bad memory\" of a word (e is caused by mistypes but m is not).",
        "Examples (order is irrelevant) are: (/Mttf, /Kffttf ), (t*T5L, a*»5L), (Uff, US),",
        "o: pairs in other unidentified relation in which the pair is in some semantic relation other than s*, k**, p, h, and u.",
        "Examples are: (Tl>, JScSÄ) [(ulterior motives, possessive feeling)], (ffl gWfS, [(theoretical back-",
        "u: unrelated pairs in which the pair is in no promptly conceivable semantic relation.",
        "Examples are: (#SM, rS^Ptt ) [(noncontact, high resolution)], (iffi , ÎÉ^PfR) [(imitation, overinterpretation)],",
        "x: nonsensical pairs in which either ofthe pair is not a proper term of Japanese.",
        "(but it can be a proper name with very low familiarity).",
        "Examples are: (bofc limit.3) Examples are: (ifpjîll, fiStS?",
        "Note that some relation types are symmetric and others are asymmetric: a, n, h, p, and t (and e, f, and m, too) are asymmetric types.",
        "This means that the order of the pair is relevant, but it was not taken into account during classification.",
        "Annotators were asked to ignore the direction of pairs in the classification task.",
        "In the finalization, we need to reclassify these to get them in the right order.",
        "The overall implicational relation in the hierarchy in Figure 1 is the following:",
        "(6) a. s, k**, p, h, and o are supposed to be mutually exclusive, but the distinction is sometimes obscure.4) b. k** has two subtypes: k* and c*.",
        "c. k and w are two subtypes k*.",
        "d. c, d and t three subtypes of c*.",
        "To resolve the issue of ambiguity, priority was set among the labels so that e, f < v < a < n < p < h < s < t < d < c < w < k < m < o < u < x < y, where the left label is more preferred over the right.",
        "This guarantees preservation ofthe im-plicational relationship among labels.",
        "We would like to add a remark on the quality.",
        "After a quick overview, we reclassified o and w, because the first run of the final task ultimately produced a resource of unsatisfactory quality.",
        "Another note on inter-annotator agreement: originally, the classification task was designed and run as a part of a large-scale language resource development.",
        "Due to its overwhelming size, we tried to make our development as efficient as possible.",
        "In the final phase, we asked",
        "3) We did not ask annotators to check for unknown terms.",
        "4) To see this, consider pairs like (large bowel, bowel), (small bowel, bowel).",
        "Are they instances of p or h?",
        "The difficulty in the distinction between h and p becomes harder in Japanese due to the lack of plurality marking: cases like (Mars, heavenly body) (a case of h) and (Mars, heavenly bodies) (a p case) cannot be explicitly distinguished.",
        "In fact, the Japanese term ^cf£ can mean both \"heavenly body\" (singular) and \"heavenly bodies\" (plural).",
        "17 annotators to classify the data with no overlap.",
        "Ultimately we obtained results that deserve a detailed report.",
        "This history, however, brought us to an undesirable situation: no inter-annotator agreement is calculable because there was no overlap in the task.",
        "This is why no inter-rater agreement data is now available."
      ]
    },
    {
      "heading": "3. Results",
      "text": [
        "Table 1 summarizes the distribution of relation types with their respective ranks and proportions.",
        "The statistics suggests that classes of e, f, m, x, and y can be ignored without risk.",
        "We noticed the following.",
        "Firstly, the largest class is the class of classmates, narrowly defined or broadly defined.",
        "The narrow definition of the classmates is the conjunction of k and w, which makes 58.39%.",
        "The broader definition of classmates, k**, is the union of k, w, c, d and t, which makes 62.10%.",
        "This confirms the distributional hypothesis.",
        "The second largest class is the narrowly defined synonymous pairs s. This is 8.7% of the total, but the general class of synonymic pairs, s* as the union of s, a, n, v, e, f, and m, makes 16.91%.",
        "This comes next to h and w. Notice also that the union of k** and s* makes 79.01%.",
        "The third largest is the class of terms in hypernym-hyponym relations.",
        "This is 8.20% of the total.",
        "We are not sure if this is large or small.",
        "These results look reasonable and can be seen as validation of the distributional hypothesis.",
        "But there is something uncomfortable about the the fourth and fifth largest classes, pairs in \"other\" relation and \"unrelated\" pairs, which make 6.31% and 4.13% of the total, respectively.",
        "Admittedly, 6.31% are 4.13% are not very large numbers, but it does not guarantee that we can ignore them safely.",
        "We need a closer examination of these classes and return to this in §4.",
        "There are some additional notes: the rate of allographic pairs [v] (6.92%) is rather high.5) We suspect that this ratio is considerably higher than the similar results that are to be expected in other",
        "5) Admittedly, 6.92% is not a large number in an absolute value, but it is quite large for the rate of allographic pairs.",
        "rank",
        "count",
        "ratio (%)",
        "cum.",
        "(%)",
        "class",
        "label",
        "1",
        "108,149",
        "36.04",
        "36.04",
        "classmates without common morpheme",
        "k",
        "2",
        "67,089",
        "22.35",
        "58.39",
        "classmates with common morpheme",
        "w",
        "3",
        "26,113",
        "8.70",
        "67.09",
        "synonymic pairs",
        "s",
        "4",
        "24,599",
        "8.20",
        "75.29",
        "hypernym-hyponym pairs",
        "h",
        "5",
        "20,766",
        "6.92",
        "82.21",
        "allographic pairs",
        "v",
        "6",
        "18,950",
        "6.31",
        "88.52",
        "pairs in other \"unidentified\" relation",
        "o",
        "7",
        "12,383",
        "4.13",
        "92.65",
        "unrelated pairs",
        "u",
        "8",
        "8,092",
        "2.70",
        "95.34",
        "contrastive pairs without antonymity",
        "c",
        "9",
        "3,793",
        "1.26",
        "96.61",
        "pairs with inherent temporal order",
        "t",
        "10",
        "3,038",
        "1.01",
        "97.62",
        "antonymic pairs",
        "d",
        "11",
        "2,995",
        "1.00",
        "98.62",
        "meronymic pairs",
        "P",
        "12",
        "1,855",
        "0.62",
        "99.23",
        "acronymic pairs",
        "a",
        "13",
        "725",
        "0.24",
        "99.48",
        "alias pairs",
        "n",
        "14",
        "715",
        "0.24",
        "99.71",
        "erroneous pairs",
        "e",
        "15",
        "397",
        "0.13",
        "99.85",
        "misuse pairs",
        "m",
        "16",
        "250",
        "0.08",
        "99.93",
        "nonsensical pairs",
        "x",
        "17",
        "180",
        "0.06",
        "99.99",
        "quasi-erroneous pairs",
        "f",
        "18",
        "33",
        "0.01",
        "100.00",
        "unclassified",
        "y",
        "languages.",
        "In fact, the range of notational variations in Japanese texts is notoriously large.",
        "Many researchers in Japanese NLP became to be aware of this, by experience, and claim that this is one of the causes of Japanese NLP being less efficient than NLP in other (typically \"segmented\") languages.",
        "Our result revealed only the allogra-phy ratio in nominal terms.",
        "It is not clear to what extent this result is applied to the notional variations on predicates, but it is unlikely that predicates have a lesser degree of notational variation than nominals.",
        "At the least, informal analysis suggests that the ratio of allography is more frequent and has more severe impacts in predicates than in nominals.",
        "So, it is very unlikely that we had a unreasonably high rate of allography in our data.",
        "Overall, we can say that the distributional hypothesis was to a great extent positively confirmed to a large extent.",
        "Classes of classmates and synonymous pairs are dominant.",
        "If the side effects of filtering described in §2.2.2 are ignored, nearly 88% (all but o, u, m, x, and y) of the pairs in the data turned out to be \"se-mantically similar\" in the sense they are classified into one of the regular semantic relations defined in (5).",
        "While the status of the inclusion of hypernym-hyponym pairs in classes of semantically similar terms could be controversial, this result cannot be seen as negative.",
        "One aspect somewhat unclear in the results we obtained, however, is that highly similar terms in our data contain such a number of pairs in unidentifiable relation.",
        "We will discuss this in more detail in the following section."
      ]
    },
    {
      "heading": "4. Discussion",
      "text": [
        "Our results have certain limits.",
        "We specify those here.",
        "First, our results are based on the case of k = 1, 2 for P(k).",
        "This may be too small and it is rather likely that we did not acquire results with enough representativeness.",
        "For more complete results, we need to compare the present results under larger k, say k = 4, 8, 16,.... We did not do this, but we have a comparable result in one of the preliminary studies.",
        "In the preparation stage, we classified samples of pairs whose base term is at frequency ranks 13-172, 7981,422 and 12,673-15,172 where k = 1, 2, 3, ..., 9, 10.6) Table 2 shows the ratios of relation types for this sample (k = 1, 2, 4, 8, 10).",
        "From Table 2, we notice that: as similarity rank decreases, (i) the ratios of v, s, a, and d decrease monotonically, and the ratios of v and s decrease drastically; (ii) the ratios of o, u, and x increases monotonically, and the ratio of o and u increases considerably; and while (iii) the ratios of h, k, p, w, m, and f seem to be constant.",
        "But it is likely that the ratios of h, k, p, w, m, and f change at larger k, say 128, 256.",
        "Overall, however, this suggests that the difference in similarity rank has the greatest impact on s* (recall that s and v are subtypes of s*), o, and u, but not so much on others.",
        "Two tendencies can be stated: first, terms at lower similarity ranks become less synonymous.",
        "Second,",
        "6)The frequency/rank in B was measured in terms of the count of types of dependency relation.",
        "rank",
        "1",
        "2",
        "4",
        "8",
        "10",
        "v",
        "18.13",
        "10.48",
        "3.92",
        "2.51",
        "1.04",
        "o",
        "17.08",
        "21.24",
        "26.93",
        "28.24",
        "29.56",
        "w",
        "13.65",
        "13.33",
        "14.30",
        "12.19",
        "12.75",
        "s",
        "11.74",
        "9.14",
        "7.05",
        "4.64",
        "4.06",
        "u",
        "11.07",
        "16.48",
        "17.63",
        "20.79",
        "20.87",
        "h",
        "10.50",
        "10.29",
        "11.17",
        "12.96",
        "10.20",
        "k",
        "7.82",
        "8.38",
        "7.84",
        "7.74",
        "8.22",
        "d",
        "2.58",
        "2.00",
        "1.57",
        "1.16",
        "0.85",
        "p",
        "2.00",
        "1.14",
        "1.08",
        "1.35",
        "1.79",
        "c",
        "1.43",
        "1.05",
        "1.27",
        "1.35",
        "1.89",
        "a",
        "1.05",
        "1.33",
        "0.88",
        "0.39",
        "0.57",
        "x",
        "1.05",
        "1.14",
        "1.27",
        "1.64",
        "2.08",
        "t",
        "0.29",
        "0.19",
        "0.20",
        "0.39",
        "0.47",
        "f",
        "0.10",
        "0.10",
        "0.00",
        "0.10",
        "0.09",
        "m",
        "0.00",
        "0.10",
        "0.20",
        "0.00",
        "0.19",
        "#item",
        "1,048",
        "1,050",
        "1,021",
        "1,034",
        "1,059",
        "the relationships among terms at lower similarity ranks become more obscure.",
        "Both are quite understandable.",
        "There are, however, two caveats concerning the data in Table 2, however.",
        "First, the 15 labels used in this preliminary task are a subset of the 18 labels used in the final task.",
        "Second, the definitions of some labels are not completely the same even if the same labels are used (this is why we have this great of a ratio of o in Table 2.",
        "We must admit, therefore, that no direct comparison is possible between the data in Tables 1 and 2.",
        "Second, it is not clear if we made the best choices for clustering algorithm and distributional data.",
        "For the issue of algorithm, there are too many clustering algorithms and it is hard to reasonably select candidates for comparison.",
        "We do, however, plan to extend our evaluation method to other clustering algorithms.",
        "Currently, one of such options is Bayesian clustering.",
        "We are planning to perform some comparisons.",
        "For the issue of what kind of distributional information to use, many kinds of distributional data other than dependency relation are available.",
        "For example, simple co-occurrences within a \"window\" are a viable option.",
        "With a lack of comparison, however, we cannot tell at the present what will come about if another kind of distributional data was used in the same clustering algorithm.",
        "A closer look suggests that the ratio of hypernym-hyponym pairs was somewhat overestimated.",
        "This is due to the algorithm used in our data construction.",
        "It was often the case that head nouns were extracted as bare nouns from complex, much longer noun phrases, sometimes due to the extraction algorithms or parse errors.",
        "This resulted in accidental removal of modifiers being attached to head nouns in their original uses.",
        "We have not yet checked how often this was the case.",
        "We are aware that this could have resulted in the overestimation of the ratio of hypernymic relations in our data.",
        "As stated, the fourth largest class, roughly 6.31% of the total, is that of the pairs in the \"other\" unidentified relation [o].",
        "In our setting, \"other\" means that it is in none among the synonymous, classmate, part-whole or hypernym-hyponym relation.",
        "A closer look into some examples of o suggest that they are pairs of terms with extremely vague association or contrast.",
        "Admittedly, 6.31% is not a large number, but its ratio is comparable with that of the allographic pairs [ v], 6.92%.",
        "We have no explanation why we have this much of an unindenfiable kind of semantic relation distinguished from unrelated pairs [u].",
        "All we can say now is that we need further investigation into it.",
        "u is not as large as o, but it has a status similar to o.",
        "We need to know why this much amount of this kind of pairs.",
        "A possible answer would be that they are caused by parse errors, directly or indirectly."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "We analyzed the details of the Japanese nominal terms automatically constructed under the \"distributional hypothesis,\" as in Harris (1954).",
        "We had two aims.",
        "One aim was to examine to see if what we acquire under the hypothesis is exactly what we expect, i.e., if distributional similarity can be equated with semantic similarity.",
        "The other aim was to see what kind of semantic relations comprise a class of distributionally similar terms.",
        "For the first aim, we obtained a positive result: nearly 88% of the pairs in the data turned out to be semantically similar under the 18 criteria defined in (5), which include hypernym-hyponym, meronymic, contrastive, and synonymic relations.",
        "Though some term pairs we evaluated were among none of these relations, the ratio of o and u in sum is about 14% and within the acceptable range.",
        "For the second aim, our result revealed that the ratio of the classmates, synonymous, relation, hypernym-hyponym, and meronymic relations are respectively about 62%, 17%, 8% and 1% of the classified data.",
        "Overall, these results suggest that automatic acquisition of terms under the distributional hypothesis give us reasonable results.",
        "A Clustering of one million nominals",
        "This appendix provides some details on how the clustering of one million nominal terms was performed.",
        "To determine the similarity metric of a pair of nominal terms (t1, t2), Kazama et al.",
        "(2009) used the Jensen-Shannon divergence (JS-divergence) Djs(p\\\\q) = D(p||M) + \\D(q\\\\M), where p and q are probability distributions, and D = ^ip(i)logq4y (Kullback-Leibler divergence, or",
        "KL-divergence) of p and q, and M = 2 (p + q).",
        "We obtained p and q in the following way.",
        "Instead of using raw distribution, Kazama et al.",
        "(2009) applied smoothing using EM algorithm (Rooth et al., 1999; Torisawa, 2001).",
        "In Torisawa's model (2001), the probability of the occurrence of the dependency relation (v, r, n) is defined as:",
        "where a denotes a hidden class of (v, r) and term t. In this equation, the probabilities P((v, r)\\a), P(t\\ a), and P(a) cannot be calculated directly because class a is not observed in a given dependency data.",
        "The EM-based clustering method estimates these probabilities using a given corpus.",
        "In the E-step, the probability P(a\\(v,r)) is calculated.",
        "In the M-step, the probabilities P((v, r)\\ a), P(t\\ a), and P(a) are updated until the likelihood is improved using the results of the E-step.",
        "From the results of this EM-based clustering method, we can obtain the probabilities P((v, r)\\a), P(t\\a), and P(a) for each (v, r), t, and a.",
        "Then, P( a\\ t) is calculated by the following equation:",
        "The distributional similarity between t1 and t2 was calculated by the JS divergence between P(a t1) and P(a t2)."
      ]
    }
  ]
}
