{
  "info": {
    "authors": [
      "German Rigau",
      "Bernardo Magnini",
      "Eneko Agirre",
      "Piek Vossen",
      "John Carroll"
    ],
    "book": "Workshop on a Roadmap for Computational Linguistics",
    "id": "acl-W02-1304",
    "title": "MEANING: A Roadmap to Knowledge Technologies",
    "url": "https://aclweb.org/anthology/W02-1304",
    "year": 2002
  },
  "references": [
    "acl-J98-1001",
    "acl-J98-1006",
    "acl-P00-1064",
    "acl-P95-1026",
    "acl-P98-2247",
    "acl-W00-0706",
    "acl-W00-1322",
    "acl-W00-1325",
    "acl-W00-1326",
    "acl-W01-0703",
    "acl-W02-0801",
    "acl-W97-0201",
    "acl-W99-0603"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Knowledge Technologies need to extract knowledge from existing texts, which calls for advanced Human Language Technologies (HLT).",
        "Progress is being made in Natural Language Processing but there is still a long way towards Natural Language Understanding.",
        "An important step towards this goal is the development of technologies and resources that deal with concepts rather than words.",
        "The MEANING project argues that we need to solve two complementary and intermediate tasks to enable the next generation of intelligent open domain HLT application systems: Word Sense Disambiguation and large-scale enrichment of Lexical Knowledge Bases.",
        "Innovations in this area will lead to HLT with deeper understanding of texts, and immediate progress in real applications of Knowledge Technologies."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "The field of Information Society Technologies (IST) is one of the main thematic priorities of the European Commission for the 6th Framework programme.",
        "In this field, Knowledge Technologies (KT) aim to provide meaning to the petabytes of information content our societies will generate in the near future.",
        "Information and knowledge management systems need to evolve accordingly, to enable the next generation of intelligent open domain Human Language Technologies (HLT) that will deal with the growing potential of the knowledge-rich and multilingual society.",
        "In order to develop a trustable semantic web infrastructure and a multilingual ontology framework to support knowledge management a wide range of techniques are required to progressively automate the knowledge lifecycle.",
        "In particular, this involves extracting high-level meaning from the large collections of content data and its representation and management in a common knowledge base.",
        "Even now, building large and rich knowledge bases takes a great deal of expensive manual effort; this has severely hampered Knowledge-Technologies and HLT application development.",
        "For example, dozens of person-years have been invest into the development of wordnets1 for various languages, but the data in these resources is still not sufficiently rich to support advanced concept-based HLT applications directly.",
        "Furthermore, resources produced by introspection usually fail to register what really occurs in texts.",
        "Applications will not scale up to working in the open domain without more detailed and rich general-purpose, which should perhaps include domain-specific linguistic knowledge.",
        "The MEANING project identifies two complementary intermediate tasks which we think are crucial in order to enable the next generation of intelligent open domain HLT application systems: Word Sense Disambiguation (WSD) and large-scale enrichment of Lexical Knowledge Bases.",
        "1 A wordnet is a conceptually structured knowledge base of word senses.",
        "The English WordNet (Miller 90, Fellbaum 98) has been developed at Princeton University over the past 14 years.",
        "EuroWordNet (Vossen 1998) is a multilingual database with wordnets for several European languages (Dutch, Italian, Spanish, German, French, Czech and Estonian).",
        "Balkanet is building wordnets for the Balkan languages following the EuroWordNet design.",
        "The advance in these two areas will allow for large-scale extractions of shallow meaning from texts, in the form of relations among concepts.",
        "WSD provides the technology to convert relations between words into relations between concepts.",
        "Rich and large-scale Lexical Knowledge Bases will have be the repositories of extracted relations and other linguistic knowledge.",
        "However, progress is difficult due to the following interdependence:",
        "ƒ In order to achieve accurate WSD, we need far more linguistic and semantic knowledge than is available in current lexical knowledge bases (e.g. current wordnets).",
        "ƒ In order to enrich Lexical Knowledge Bases we need to acquire information from corpora, which have been accurately tagged with word senses.",
        "Providing innovative technology to solve this problem will be one of the main challenges to access KTs.",
        "Following this introduction section 1 presents the major research goals in HLT.",
        "Section 2 presents the MEANING roadmap.",
        "Finally, section 4 draws the conclusions."
      ]
    },
    {
      "heading": "1 Major research goals in HLT",
      "text": [
        "In order to extend the state-of-the-art in human language technologies (HLT) future research must devise: (1) innovative processes and tools for automatic acquisition of lexical knowledge from large-scale document collections; (2) novel techniques for accurately selecting the sense of open-class words in a large number of languages; (3) ways to enrich existing multilingual linguistic knowledge resources with new kinds of lexical information by automatically mapping information across languages.",
        "We present each one in turn."
      ]
    },
    {
      "heading": "1.1 Dealing with knowledge acquisition",
      "text": [
        "The acquisition of linguistic knowledge from corpora has been a very successful line of research.",
        "Research in the acquisition of subcategorization information, selectional preferences, in thematic role assignments and diathesis alternations (Agirre and Martínez 2001, 2002, McCarthy and Korhonen, 1998; Korhonen et al., 2000; McCarthy 2001), domain information (Magnini and Cavaglià 2000), topic signatures (Agirre et al.",
        "2001b), lexico-semantic relations between words (Agirre et al.",
        "2002) etc.",
        "has obtained encouraging results.",
        "The acquisition process usually involves large bodies of text, which have been previously processed with shallow language processors.",
        "Much of the use of the acquired knowledge has been hampered by the fact that the texts are not sense-disambiguated, and therefore, only knowledge for words can be acquired, that is, subcategorization for words, selectional preferences for words, etc.",
        "It is a well established fact that much of the linguistic behavior of words can be better explained if it is keyed to word senses.",
        "For instance, the subcategorization frames of verbs are highly dependent of the sense of the verb.",
        "Some senses of a given verb allow for a particular combination of complements, while others do not (McCarthy, 2001).",
        "The same is applicable to selectional preferences; traditional approaches that learn selectional preferences for a verb, tend to mix e.g. all subjects for differents senses, even if verbs can have different selectional preferences for each word sense (Agirre & Martinez, 2002).",
        "Having texts automatically sense-tagged with high accuracy will produce significantly better acquired knowledge at a sense level, including subcategorization frequencies, domain information, topic signatures, selectional preferences, specific lexico-semantic relations, thematic role assignments and diathesis alternations.",
        "It will also facilitate the investigation on automatic methods for dealing with new senses not present in current wordnets and clustering of word senses.",
        "Furthermore, linguistic information keyed to word senses that are linked to interlingual concepts (as proposed in the EuroWordNet model), can be easily integrated in a multilingual Lexical Knowledge Base (cf. section 2.3)"
      ]
    },
    {
      "heading": "2.2 Dealing with WSD",
      "text": [
        "Word Sense Disambiguation (WSD) is the task of assigning the appropriate meaning (sense) to a given word in a text or discourse.",
        "Ide and Veronis (1998) argue that word sense ambiguity is a central problem for many established HLT applications (for example Machine Translation, Information Extraction and Information Retrieval).",
        "This is also the case for associated subtasks (i.e. reference resolution and parsing).",
        "For this reason many international research groups are working on WSD, using a wide range of approaches.",
        "However, no large-scale broad-coverage accurate WSD system has been built up to date2.",
        "With current state-of-the-art accuracy in the range 60-70%, WSD is one of the most important open problems in Natural Language Processing.",
        "A promising current line of research uses semantically annotated corpora to train Machine Learning (ML) algorithms to decide which word sense to choose in which contexts.",
        "The words in these annotated corpora are tagged manually with semantic classes taken from a particular lexical semantic resource (most commonly WordNet).",
        "Many standard ML techniques have been tried, such as Bayesian learning, Exemplar based learning, Decision Lists, and recently margin-based classifiers like Boosting and Support Vector Machines (Escudero et al., 2000a, 2000b, 2000c, 2000d, 2001; Martínez and Agirre, 2000).",
        "These approaches are termed \"supervised\" because they learn from previously sense annotated data and therefore they require a large amount of human intervention to annotate the training data.",
        "Supervised WSD systems are data hungry.",
        "They suffer from the \"knowledge acquisition bottleneck\", it takes them mere seconds to digest all of the processed corpus contained in training materials that take months to annotate manually.",
        "So, although Machine Learning classifiers are undeniably effective, they are not feasible until we can obtain reliable unsupervised training data.",
        "Ng (1997) estimates that the manual annotation effort necessary to build a broad coverage word-sense annotated English corpus is about 16 person-years; and this effort would have to be replicated for each different language.",
        "Unfortunately, many people think that Ng’s estimate might fell short, as the annotated corpus thus produced is not guaranteed to enable high accuracy WSD.",
        "Some recent work is focusing on reducing the acquisition cost and the need for supervision 2 See the conclusions of the SENSEVAL-2 competition: http://www.sle.sharp.co.uk/senseval2/ in corpus-based methods for WSD.",
        "Leacock et al.",
        "(1998) and Mihalcea and Moldovan (1999) automatically generate arbitrarily large corpora for unsupervised WSD training, using the synonyms or definitions of word senses provided in WordNet to formulate search engine queries over the Web.",
        "In another line of research, (Yarowsky, 1995) and (Blum and Mitchell, 1998) have shown that it is possible to reduce the need for supervision with the help of large amounts of unannotated data.",
        "Applying these ideas, (Agirre and Martínez, 2000) has developed knowledge-based prototypes for obtaining accurate examples from the web for specific WordNet synsets, as well as, large quantities of unannotated examples.",
        "But in order to make significant advances in WSD system accuracy, systems need to be able to use types of lexical knowledge that are not currently available in wide-coverage lexical knowledge bases: for example subcategorisation frequencies for predicates (particularly verbs) rely on word senses, selectional preferences of predicates for classes of arguments, amongst others (Carroll and McCarthy, 2000; McCarthy et al., 2001; Agirre and Martínez, 2002;)."
      ]
    },
    {
      "heading": "2.3 Dealing with multilingualism",
      "text": [
        "Language diversity is at the same time a valuable cultural heritage worth preserving, and an obstacle to achieving a more cohesive social and economic development.",
        "This situation has been further stressed as a major challenge in IST research lines.",
        "Improving language communication capabilities is a prerequisite for increasing industrial competitiveness, this way leading to a sound growth in key economic sectors.",
        "However, this obstacle can be helpful because all languages realize the meaning in different ways.",
        "We can benefit from this fact using a novel multilingual mapping process that exploits the EuroWordNet architecture.",
        "In EuroWordNet local wordnets are linked via an Inter-Lingual-Index (ILI) allowing the connection from words in one language to translation equivalent words in any of the other languages.",
        "In that way, technological advances in one language can help the other.",
        "For instance, for Basque, being an agglutinative language with very rich morphological-syntactic information, it is possible to extract semantic relations that would be more difficult to capture in other languages.",
        "Below we can see an example of the relation betwewen silversmith and silver, extracted from the Basque words zilargile – zilar respectively.",
        "This relation has been disambiguated into the «maker_of» lexico-semantic relation (Agirre & Lersundi, 2000).",
        "On the contrary, Basque is not largely present in the web as the others.",
        "Using this approach it is possible to balance both gaps.",
        "Although the technology to provide compatibility across wordnets exits (Daudé et al., 1999, 2000, 2001), new research is needed for porting and uploading the various types of knowledge across languages, and new ways to test the validity of the ported knowledge in the target languages."
      ]
    },
    {
      "heading": "3. The MEANING Roadmap",
      "text": [
        "The improvements mentioned above have been explored separately with relative success.",
        "In fact, no research group in isolation has tried to combine all this aforementioned factors.",
        "We designed the MEANING project3 convinced that only a combination of all relevant knowledge and resources will be able to produce significant advances in this crucial research area.",
        "MEANING will treat the web as a (huge) corpus to learn information from, since even the largest conventional corpora available (e.g. the Reuters corpus, the British National Corpus) are not large enough to be able to acquire reliable information in sufficient detail about language behaviour.",
        "Moreover, most languages do not have large or diverse enough corpora available.",
        "MEANING proposes an innovative bootstrapping process to deal with the interdependency between WSD and knowledge acquisition: 1.",
        "Train accurate WSD systems and apply them to very large corpora by coupling knowledge-based techniques on the existing EuroWordNet (e.g. to populate it with domain labels, to induce automatically",
        "training examples) with ML techniques that combine very large amounts of labeled and unlabeled data.",
        "When ready, use also the knowledge acquired in 2.",
        "2.",
        "Use the obtained accurate WSD data in conjunction with shallow parsing techniques and domain tagging to extract new linguistic knowledge to incorporate into EuroWordNet.",
        "This method will be able to break this interdependency in a series of cycles thanks to the fact that the WSD system will be based on all domain information, sophisticated linguistic knowledge, large numbers of automatically tagged examples from the web, and a combination of annotated and unannotated data.",
        "The first WSD system will have weaker linguistic knowledge, but the sole combination of the rest of the factors will produce significant performance gains.",
        "Besides, some of the required linguistic knowledge can be acquired from unnanotated data, and can therefore be acquired without using any WSD system.",
        "Once acceptable WSD is available, the acquired knowledge will be of a higher quality, and will allow for better WSD performance.",
        "Multilingualism will be also helpful for MEANING.",
        "The idiosyncratic way the meaning is realised in a particular language will be captured and ported to the rest of languages involved in the project4 using EuroWordNet as a Multilingual Central Repository in three consecutive phases (see figure 1).",
        "For instance, selectional preferences acquired for verb senses based on the English corpora, can be uploaded into the Multilingual Central Repository.",
        "As the selectional prefenrece relation is keyed to concepts in the repository, this knowledge can be ported to the other languages.",
        "Of course, the ported knowledge needs to be checked in order to evaluate the validity of this approach.",
        "Below, we can see the selectional preference for the first sense of know from (Agirre & martinez, 2002).",
        "The first sense of know is univocally linked to <know, cognize, cognise>, which in EuroWordNet is linked to"
      ]
    },
    {
      "heading": "4 Conclusions",
      "text": [
        "Where the acquisition of knowledge from large-scale document collections will be one of the major challenge for the next generation of text processing applications, MEANING emphasises multilingual content-based access to web content.",
        "Moreover, it can provide a keystone enabling technologies for the semantic web.",
        "In particular, the Multilingual Central Repository produced by MEANING is going to constitute the natural knowledge resource for a number of semantic processes that need large amounts of linguistic data to be effective tools (e.g. web ontologies).",
        "NLP tools and software of the next generation will benefit from the MEANING outcomes.",
        "Current web access applications are based on words; MEANING will open the way for access to the multilingual web based on concepts, providing applications with capabilities that significantly exceed those currently available.",
        "MEANING will facilitate development of concept-based open domain Internet applications (such as Question/Answering, Cross Lingual Information Retrieval, Summarisation, Text Categorisation, Event Tracking, Information Extraction, Machine Translation, etc.).",
        "Furthermore, MEANING will supply a common conceptual structure to Internet documents, thus facilitating knowledge management of web content.",
        "This common conceptual structure is a decisive enabling technology for allowing the semantic web."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The MEANING project is funded by the European Commission (IST-2001-34460)."
      ]
    }
  ]
}
