{
  "info": {
    "authors": [
      "Hiroshi Echizen-ya",
      "Kenji Araki",
      "Yoshio Momouchi"
    ],
    "book": "SIGLEX Workshop on Deep Lexical Acquisition",
    "id": "acl-W05-1010",
    "title": "Automatic Acquisition of Bilingual Rules for Extraction of Bilingual Word Pairs from Parallel Corpora",
    "url": "https://aclweb.org/anthology/W05-1010",
    "year": 2005
  },
  "references": [
    "acl-C02-1158",
    "acl-C94-2178",
    "acl-C96-1006",
    "acl-C96-2098",
    "acl-J00-2004",
    "acl-J03-1002",
    "acl-J04-2003",
    "acl-J93-2003",
    "acl-J96-1001",
    "acl-P99-1067",
    "acl-W95-0114"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we propose a new learning method to solve the sparse data problem in automatic extraction of bilingual word pairs from parallel corpora with various languages.",
        "Our learning method automatically acquires rules, which are effective to solve the sparse data problem, only from parallel corpora without any bilingual resource (e.g., a bilingual dictionary, machine translation systems) beforehand.",
        "We call this method Inductive Chain Learning (ICL).",
        "The ICL can limit the search scope for the decision of equivalents.",
        "Using ICL, the recall in three systems based on similarity measures improved respectively 8.0, 6.1 and 6.0 percentage points.",
        "In addition, the recall value of GIZA++ improved 6.6 percentage points using ICL."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Many studies of automatic extraction of bilingual word pairs have been reported.",
        "Most studies have used similarity measures (Manning and Schütze, 1999; Sadat et al., 2002) because they are language-independent.",
        "However, these studies are insufficient because of the sparse data problem.",
        "For example, we would like to obtain (book; ^ [/ion]) as the bilingual word pair from (Your book is on the table.",
        "; :r – ~?",
        ")V/\\Z./ tbl3.lt/<Dfà/1$/$> <9 / [teburu ni anata no hon ga art masu.])",
        "using the Dice coefficient (Smadja et al., 1996) automatically.",
        "The Dice coefficient is denned as In that equation, 'a' is the number of pieces in which both the Source Language (SL) word Ws and Target Language (TL) word Wt were found; 'b' is the number of pieces in which only Ws was found; and 'c' is the number of pieces in which only Wt was found.",
        "In the case of using the Dice coefficient, the system cannot extract only (book; 2fc [hon]) when the respective frequencies of \"book\", \"2£ [/ion]\" and \"x – ~7)V [teburu]\" are 1.",
        "That is, the similarity value between \"book\" and \"^ [/ion]\" becomes 1.0(= fqpj); the similarity value between \"book\" and \"x – ~?",
        ")V [teburu]\" alsobecomes 1.0(= fqpj).",
        "This obstacle is common among methods based on similarity measures.",
        "We propose a new learning method to solve this sparse data problem.",
        "We call this method Inductive Chain Learning (ICL).",
        "For example, in (Your book is on the table.",
        "; X – ~?",
        ")V/ /$> X) / [teburu ni anata no hon ga art masu.",
        "]), a system using ICL uses the information that \"your\" corresponds to \"<£>&/£/© [anata no].\" Moreover, it uses the information that equivalents of words that adjoin the right side of \"your\" exist on the right side of \"<£>&/£/© [anata no]\" in TL sentences.",
        "Using such bilingual rules, the system can extract only (book; 2fc [hon]).",
        "This fact indicates that the system limits the search scope for the decision of equivalents in TL sentences.",
        "Consequently, ICL is effective to solve the sparse data problem.",
        "In this study, bilingual rules are acquired automatically only from parallel corpora by view of learning (Echizen-ya et al., 2002).",
        "The system using ICL extracts bilingual word pairs by applying the acquired bilingual rules to bilingual sentence pairs in parallel corpora.",
        "Therefore, the system using ICL causes a chain reaction in the acquisition of bilingual rules and the extraction of bilingual word pairs.",
        "The main advantages of ICL are the following three:",
        "(1) The system using ICL requires no bilingual resource (e.g., a bilingual dictionary, machine translation systems) beforehand.",
        "All bilingual rules are acquired automatically solely from the parallel corpora.",
        "Moreover, the system using ICL extracts bilingual word pairs using only acquired bilingual rules to solve the sparse data problem.",
        "(2) The system using ICL is effective for parallel corpora with various languages for which the grammatical structures of SL differ from the grammatical structures of TL (i.e., English - Japanese, not English - French, English - German) through the use of acquired bilingual rules.",
        "The bilingual rules can locate the information to cope with the difference word orders of SL and TL.",
        "(3) The system using ICL can extract bilingual word pairs even when the frequencies of the pairs of the co-occurrence words and the bilingual word pairs are only 1 in a parallel corpus.",
        "For example, when the bilingual rule (your @; 'CD/©[anata no @]) exists, the system using ICL can extract (book; 2^ [hon]) even when the frequency of the pairs of \"your\" and \"book\" is only 1.",
        "This fact indicates that the system using ICL can extract not only high-frequency bilingual word pairs, but also low-frequency bilingual word pairs.",
        "We applied this ICL to three systems based on the Dice coefficient, Yates' \\ (Hisamitsu and Niwa, 1996), and Akaike's Information Criterion (AIC) (Akaike, 1974).",
        "For evaluation experiments, five kinds of parallel corpora: English - Japanese, French - Japanese, German - Japanese, Shanghai-Chinese - Japanese and Ainu - Japanese parallel corpora were used as evaluation data.",
        "Evaluation experiments indicated that, using ICL in the systems based on the Dice coefficient, Yates' x and AIC, the respective recall values improved 8.0, 6.1 and 6.0 percentage points.",
        "In addition, using ICL, the recall of the statistical word-alignment model GIZA++ (Och, 2003) improved 6.6 percentage points.",
        "Therefore, we confirmed that ICL is effective to solve the sparse data problem in the extraction of bilingual word pairs from parallel corpora with various languages.",
        "Several methods based on the co-occurrence of words have been proposed.",
        "(Fung, 1995) proposed a method that specifically examines context heterogeneity, which indicates the number of kinds of words that adjoin SL words.",
        "(Rapp, 1999) proposed a method that uses cooccurrence vectors based on the two words that adjoin SL words on the right side and left side.",
        "Moreover, (Fung, 1998; Kaji and Aizono, 1996) proposed methods that uses co-occurrence vectors based on all words that exist in the existing bilingual dictionary, among sentences.",
        "(Tanaka and Iwasaki, 1996) presented a translation matrix that provides co-occurring information translated from the source into the target, and obtains bilingual word pairs by determining the best translation matrix.",
        "Ultimately, these methods depend on the existing bilingual dictionary.",
        "Therefore, it is difficult to extract bilingual word pairs from parallel corpora with various languages when a sufficient bilingual dictionary does not exist.",
        "In contrast, the system using ICL automatically can extract bilingual word pairs without an existing bilingual dictionary as a bilingual resource.",
        "Regarding methods for acquisition translation templates, (McTait, 1997; Giivenir and Cicekli, 1998) proposed methods that acquires bilingual templates using common parts and different parts.",
        "However, such methods require many similar bilingual sentence pairs to extract sufficient translation templates.",
        "Moreover, K-vec (Fung and Church, 1994) is unable to extract low-frequency bilingual word pairs.",
        "The algorithm is applicable only to bilingual word pairs that occur with a frequency greater than three.",
        "In addition, statistical word-alignment methods (Brown et al., 1993; Melamed, 2000; Och and Ney, 2003; Nie/3en and Ney, 2004) have been proposed, but they are also insufficient.",
        "That is, the statistical word-alignment methods cannot extract bilingual word pairs efficiently when the frequencies of many bilingual word pairs are low.",
        "(Watanabe and Sumita, 2003) proposed a method by which the decoder uses some translation examples whose source part is similar to the input.",
        "However, numerous translation examples are necessary as a bilingual resource.",
        "That is, it is difficult to deal with languages for which translation examples are not sufficiently obtainable.",
        "In contrast, ICL can extract bilingual rules and bilingual word pairs efficiently, even from a small parallel corpus."
      ]
    },
    {
      "heading": "2 Outline",
      "text": [
        "First, the user inputs the SL words of bilingual word pairs.",
        "In methods based on bilingual rules, the system extracts bilingual word pairs using the acquired bilingual rules in the dictionary for bilingual rules.",
        "In this paper, the bilingual rules are the rules for extracting new bilingual word pairs.",
        "In all extracted bilingual word pairs, similarity values between SL words and TL words are assigned using similarity measure.",
        "In the method based on two bilingual sentence pairs, the system obtains bilingual word pairs and new bilingual rules using the bilingual sentence pairs that SL words exist and other bilingual sentence pairs.",
        "Moreover, in the decision process of bilingual word pairs, the system chooses the most suitable bilingual word pairs using their similarity values when several bilingual word pairs candidates exist.",
        "The system compares the similarity values of chosen bilingual word pairs with a threshold value.",
        "Consequently, the system registers the chosen bilingual word pairs to the dictionary for bilingual word pairs when their re1: Input: TL sentence of bilingual sentence pair that SL word exists 2: m= 1 3: if TLDPm exists on the left side of TLCPj then 4: If TLDPm corresponds to word then Extraction of TLDPm (i.e., the part from word at the beginning of TL sentence to word that adjoins the left side of TLCPj) 14: if TLDPm corresponds to word then 23: if TLDPm exists on the right side of TLCP^Lj-p then 24: if TLDPm corresponds to word then 2^ Extraction of TLDPm (i.e., the part from word that adjoins the right side of TLCP,™™ to word at the end of TL sentence) 28: Output: TLDPs that correspond to words spective similarity values are greater than the threshold value.",
        "In the method based on similarity measure, the system extracts bilingual word pairs using only one similarity measure (i.e., the Dice coefficient, Yates' x, AIC) from bilingual sentence pairs that SL words exist without ICL.",
        "It does so when their similarity values are not greater than the threshold or when no bilingual word pairs are extracted in the ICL process."
      ]
    },
    {
      "heading": "3 Process",
      "text": [
        "In the method based on two bilingual sentence pairs, the system acquires bilingual rules using the bilingual sentence pairs that SL words exist and other bilingual sentence pairs.",
        "The bilingual word pairs for SL words are also extracted.",
        "The system obtains bilingual rules using common parts between two bilingual sentence pairs.",
        "That is, the word strings for which the frequencies are very low are used as bilingual rules.",
        "Using such low-frequency word strings, the bilingual rules are acquired easily only from parallel corpus.",
        "In this paper, the respective common parts between SL sentences of two bilingual sentence pairs are called SLCPi=ii...iNSLCp; the respective common parts between TL sentences of two bilingual sentence pairs are called TLCPi=ii...iNTLCp; the respective different parts between TL sentences of two bilingual sentence pairs are called TLDPm=ii2,3,....",
        "In addition, the number of SLCPs is called NSLCP; the number of TLCPs is called NTLCP.",
        "The details of the process based on two bilingual sentence pairs are the following:",
        "SL word: house Bilingual sentence pair 1 : (Please keep it until you leave this house.",
        "!.?^y.eJ^?.5^5°riu.!).c.ti?.n.",
        "?j \\kono ie wo deru made matte i te kudasai.])",
        "Bilingual sentence pair 2 : (I'd like to send thjs letter.;ZTO/#ffi/£/JMy/fclVro/T?-f.",
        "\\kono tegamiwo okuri tai no desu.])",
        "Extracted parts : M~ SL word o TLDP, : house o W\\ie] rzS Noun bilingual word pair J: rroTgy^/aj -s/s-e/ft-s/r n vt/t£ i ■>.",
        "\\kono@ wo deru made motte i te kudasai.])",
        "in Fig. 2.",
        "However, in TL sentences of bilingual sentence pair 1, the word that adjoins the left side of TLCPi (\"C0 [kono]\") does not exist.",
        "Therefore, TLDP is not extracted by this process.",
        "The system then determines TLDPs using the parts exist between two TLCPs by the processes of lines 9 to 22 in Fig. 2.",
        "In TL sentences of bilingual sentence pair 1, one TLDP exists because the number of combinations based on two TLCPs is 1 by ntlcp:2C2 = 2\\(2-2)\\ = That is, \"M [ie]\" that exists between TLCPi (\"C0 [kono]\") and TLCP2 (\"£ [wo]\") is determined as TLDPi.",
        "Moreover, the system determines the TLDP that adjoins the right side of TLCPntlcp:2 by the processes of lines 23 to 27 in Fig. 2.",
        "In TL sentences of bilingual sentence pair 1, \"tfJ5/^T/#^/T/^/T/T$^ [deru made mot te % te kudasai]\" is determined as TLDP2 because it is the part from the word that adjoins the right side of TLCP2 (\"£ [wo]\") to the word at the end of TL sentence.",
        "Among two extracted TLDPs, the TLDP that corresponds to word of noun, verb, adjective, adverb, or conjunction is TLDPi [ie]\") that is noun word.",
        "TLDP2 (\"ffl 5/*-?/j$o/T/t, V T/Tc?^ [deru made mot te i te kudasai]\") is 1: Input: SL word while Selection of bilingual sentence pair that SL word exist, and selection of ICL 2; rule that has SLCP and TLCP to the selected bilingual sentence pair 3: if Variable exists on the right side of TLCP in TL part of ICL rule then 5: while i < NTLCP g Extraction of TL word (i.e., word of noun, verb, adjective, adverb and conjunction) that adjoins the right side of TLCP; in TL sentence 7: i = i + 1 10: _ _ if Variable exists on the left side of TLCP in TL part_of ICL rule then Extraction of TL word (i.e., word of noun, verb, adjective, adverb and conjunction) that adjoins the left side of TLCP; in TL sentence ^ Calculation of similarity value between SL word and each extracted TL word using the cosine function (1) 19: Extraction of bilingual word pair by combining SL word and each TL word 20: Output: Bilingual word pairs verb phrase, not word.",
        "Therefore, only (house; W. [ie]) is obtained by combining the SL word (\"house\") and the extracted TLDP (\"M [ief) by process Pl-(3).",
        "In addition, the system replaces \"house\" and \"W. [ie]v with variable \"@\" by process (i) of Pl-(4).",
        "As a result, (this @; C(D/@[kono @]), (this @;@/% [@ wo}) are acquired as bilingual rules by process (ii) and (iii) of Pl-(4).",
        "Similarity values in the acquired bilingual rules (this @; CO)/@[kono <§]) and (this [@ wo]) are calculated using Dice coefficient function (1) by process (iv) of Pl-(4).",
        "The similarity value of (this @; C(D/@[kono @]) is higher than that of (this @;@/fk [@ wo]) because (this @; C(D/@[kono @]) is the correct bilingual rule; and (this @;@/fk [@ wo]) is the erroneous bilingual rule.",
        "That is, \"this\" corresponds to \"d CD [kono\\\\ not \"-& [wo]\" in Japanese.",
        "In this paper, the parts extracted from SL sentences are called SL parts; the parts extracted from TL sentences are called TL parts.",
        "in the TL sentences by the use of bilingual rules.",
        "Figure 4 gives the extraction algorithm of bilingual word pairs based on bilingual rules.",
        "Extraction example 1 SL word 1: parcel Bilingual sentence pair 1 slpp\" tlpp\" (And what about this parceL-by'sea mail?",
        "[soshite, kono kotsuzumi wa senbin de wa dou desu ka?])",
        "Noun bilingual word pair and similarity value: (parcel: [kotsuzumi\\) Extraction example 2 SL word 2: eat Bilingual rule 2 (to @;@//z[@ nj\\) Bilingual sentence pair 2 slcp~~^-ilcp (After the test, we all went out for/something to eat.",
        ":isit/ro/f*/T?/.",
        "/^fcz-e/ft'^ffiaMt/fc/M-e-r. [shiken no ato de, minna de tabe ni dekake ta n desu.])",
        "Verb bilingual word pair and similarity value: In the method based on bilingual rules, the system extracts bilingual word pairs using the bilingual rules acquired by the method based on two bilingual sentence pairs.",
        "The system can limit the search scope for the decision of equivalents Figure 5 shows examples of extraction of bilingual word pairs from English-Japanese bilingual sentence pairs in the method based on bilingual rules.",
        "In example 1 of Fig. 5, (parcel; /hc*l [kot-suzumi]) is extracted as the noun bilingual word pair using (this @; C(D/@[kono @]) acquired in Fig. 3.",
        "First, the system selects bilingual sentence pair 1 that SL word 1 \"parcel\" exists from a parallel corpus.",
        "Moreover, the system selects bilingual rule 1 (this @; C(D/@[kono @]) from the dictionary for bilingual rules because the variable \"@\" exists on the right side of SLCP (\"this\") in the SL part of bilingual rule 1, and SL word 1 \"parcel\" also exists on the right side of SLCP (\"this\") in the SL sentence of bilingual sentence pair 1.",
        "The system then extracts TL words that adjoin the right side of TLCP because the variable \"@\" exists on the right side of TLCP (\"£ 0) kono\") in the TL part of bilingual rule 1.",
        "Using bilingual rule 1, noun word \"/h c*l [kotsuzumi]\", which exists on the right side of TLCP (\"iHC) kono\") is extracted from TL sentence of bilingual sentence pair 1.",
        "As a result, the system can obtain (parcel; /hx*L [kotsuzumi]) as the noun bilingual word pair.",
        "In example 2 of Fig. 5, (eat; 1ft ^ [tabe]) is extracted as the verb bilingual word pair using bilingual rule 2 (to [@ ni}).",
        "The system selects bilingual sentence pair 2, in which SL word 2 \"eat\" exists from a parallel corpus.",
        "Moreover, the system selects bilingual rule 2 (to [@ ni]) from the dictionary for bilingual rules because the variable \"@\" exists on the right side of SLCP (\"to\") in the SL part of bilingual rule 2, and SL word 2 \"eat\" also exists on the right side of SLCP (\"to\") in SL sentence of bilingual sentence pair 2.",
        "The system then extracts TL words that adjoin the left side of TLCP because the variable \"@\" exists on the left side of TLCP (\"H [ni]\") in the TL part of bilingual rule 2.",
        "Using bilingual rule 2, verb word \"Ift^ [tabe]\", which adjoins the left side of TLCP (\"fc [ni]\") is extracted from the TL sentence of bilingual sentence pair 2.",
        "The system calculates the similarity value between \"eat\" and \"Ift^ [tabe]\" using the Dice coefficient function (1), and registered (eat; 1ft ^ [tabe]) into the dictionary of bilingual word pairs.",
        "The system determines the most suitable bilingual word pairs according to their similarity values when several bilingual word pairs have been extracted as described in section 3.3.",
        "Using the bilingual rules, the system can decrease the number of candidates of equivalents for SL words.",
        "In example 2 of Fig. 5, the system could decrease the number of candidates of equivalents for \"eat\" using the bilingual rule (to @;@/(I [@ ni]).",
        "All words of nouns, or verbs uMWi [shiken]\", \"ft [ato]\", ufrfvt£[minna]\", \"^ [tabe]\", \"fflAHt [dekake]\", and \"A, [n]\" become candidates of equivalents for \"eat\" when ICL is not used.",
        "In contrast, only \"1ft ^ [tabe]\" becomes candidates of equivalents for \"eat\" using ICL.",
        "This fact indicates that ICL is effective to solve the sparse data problem.",
        "Moreover, the system can extract bilingual word pairs from parallel corpora of various languages for which the grammatical structure of SL differs from the structure of TL.",
        "For example, in the bilingual rule 2 (to [@ ni]), the variable \"@\" exists on the right side of \"to.\" In contrast, in the TL part, the variable \"@\" exists on the left side of \"(31 [ni].\" Therefore, bilingual rules have the knowledge to cope with the different word order between SL and TL.",
        "The system determines the most suitable bilingual word pairs according to their similarity values when several bilingual word pairs have been extracted.",
        "The details of this process are the following:"
      ]
    },
    {
      "heading": "4 Performance Evaluation",
      "text": [
        "Five kinds of parallel corpora were used in this paper as experimental data.",
        "These parallel corpora are for English - Japanese, French - Japanese, German - Japanese, Shanghai-Chinese - Japanese and Ainu - Japanese.",
        "They were taken from textbooks(Harukawa and Snelling, 1998; Chikushi, 2001; Oshio, 2004; Emoto and Han, 2004; Nakagawa and Nakamoto, 2004).",
        "The number of bilingual sentence pairs was 1,794; the average numbers of words in SL and TL sentences were 6.8 and 8.8, respectively.",
        "We inputted all 1,081 SL words of nouns, verbs, adjectives, adverbs, and conjunctions in five parallel corpora to six systems: a system based on the Dice coefficient; a system based on the Dice coefficient in which AIL is applied (herein, we call it the system based on Dice+ICL); a system based on Yates' x; asystem based on Yates' x in which ICL is applied (herein, the system based on Yates+ICL); a system based on AIC; and a system based on AIC in which ICL is applied (herein, the system based on AIC+ICL).",
        "Initially, the dictionary for bilingual word pairs and the bilingual rule dictionary are empty.",
        "Moreover, the system uses 0.5 as its best threshold.",
        "We repeated the experiments for each parallel corpus using respective systems.",
        "We evaluated whether or not correct bilingual word pairs exist in the dictionary.",
        "Moreover, we calculated the recall.",
        "The recall is the rate for the number of correct bilingual word pairs to the number of all bilingual word pairs in the parallel corpora (i.e., 1,081).",
        "Table 1 shows the results of the experiments.",
        "The respective recall values of the systems based on Dice+ICL, Yates+ICL, and AIC+ICL were more than 8.0, 6.1, and 6.0 percentage points higher than those of the systems based on the Dice coefficient, Yates' x> and AIC.",
        "These results indicate that ICL is effective for various similarity measures.",
        "Particularly, the recall values of the bilingual word pairs for which the frequencies are 1 improved to 11.0, 9.7 and 9.9 percentage points using ICL.",
        "In systems without ICL, many bilingual word pairs for which the frequencies are 1 were erroneous bilingual word pairs created by data sparseness problems, as described in section 1.1.",
        "Therefore, improvement of the recall values of bilingual word pairs for which the frequencies are 1 indicates that ICL is effective to solve the sparse data problem.",
        "On the other hand, the precision values the rates of the number of correct bilingual word pairs to the number of all extracted bilingual word pairs - are all equal to the recall values.",
        "Among all 1,081 SL words, the correct bilingual word pairs or erroneous bilingual word pairs were obtained by the method based on similarity measure when the ICL process extracted no bilingual word pairs.",
        "Consequently, the numbers of all bilingual word pairs in the parallel corpora and of all extracted bilingual word pairs became 1,081.",
        "That is, the precision values are identical to the recall values.",
        "Table 2 shows examples of bilingual word pairs extracted by ICL and their similarity values.",
        "Table 2 indicates that ICL can extract not only bilingual word pairs that the number of words is 1, but also bilingual word pairs that the number of words is over 1.",
        "Furthermore, we applied ICL to GIZA++.",
        "Table 3 shows those experimental results.",
        "The total recall of GIZA++ +ICL was more than 6.6 percentage points higher than that of GIZA++.",
        "Table 3 indicates that ICL is very effective for parallel corpora between languages for which the grammatical structure of SL differs from the grammar structure of TL.",
        "Grammatical structures of English, French, and German are SVO, whereas the Japanese grammatical structure is SOV.",
        "Using ICL, the recall improved 15.3 percentage points on average in English - Japanese, French - Japanese, and German - Japanese parallel corpora."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "This paper presented Inductive Chain Learning (ICL) as a new learning method to solve the sparse data problem in extraction of bilingual word pairs among various languages.",
        "From experimental results, we confirmed that ICL is effective to solve the sparse data problem in extraction of bilingual word pairs from parallel corpora with various languages.",
        "Future studies will solve the problem of word-ambiguity.",
        "Moreover, we apply our method to a multilingual machine translation system and an cross-language information retrieval system."
      ]
    },
    {
      "heading": "6 Acknowledgements",
      "text": []
    }
  ]
}
