{
  "info": {
    "authors": [
      "Marie Meteer",
      "Borukhov Bensiin",
      "Mike Crivaro",
      "Michael Shafir",
      "Attapol Thamrongrattanarit"
    ],
    "book": "BioNLP: Proceedings of the 2012 Workshop on Biomedical Natural Language Processing",
    "id": "acl-W12-2417",
    "title": "MedLingMap: A growing resource mapping the Bio-Medical NLP field",
    "url": "https://aclweb.org/anthology/W12-2417",
    "year": 2012
  },
  "references": [
    "acl-N07-1031",
    "acl-W12-2415"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 2012 Workshop on Biomedical Natural Language Processing (BioNLP 2012), pages 140?145, Montre?al, Canada, June 8, 2012. c?2012 Association for Computational Linguistics MedLingMap: A growing resource mapping the Bio-Medical NLP field Marie Meteer, Bensiin Borukhov, Michael Crivaro, Michael Shafir, Attapol Thamrongrattanarit {mmeteer, bborukhov, mcrivaro, mshafir, tet}@brandeis.edu Department of Computer Science Brandeis University Waltham, MA 02453, USA Abstract The application of natural language processing (NLP) in the biology and medical domain crosses many fields from Healthcare Information to Bioinformatics to NLP itself.",
        "In order to make sense of how these fields relate and intersect, we have created ?MedLingMap?",
        "(www.medlingmap.org) which is a compilation of references with a multifaceted index.",
        "The initial focus has been creating the infrastructure and populating it with references annotated with facets such as topic, resources used (ontologies, tools, corpora), and organi-zations.",
        "Simultaneously we are applying NLP techniques to the text to find clusters, key terms and other relationships.",
        "The goal for this paper is to introduce MedLingMap to the community and show how it can be a powerful tool for research and exploration in the field.",
        "1 Introduction In any field, understanding the scope of the field as well as finding materials relevant to a particular project paradoxically gets more difficult as the field gets larger.",
        "This is even more difficult in a field such as Bio-Medical NLP, since it is at the crossroads of multiple disciplines.",
        "The drawbacks of keyword search, even using a specific engine such as Google Scholar, are well documented (Stoica et.",
        "al 2007) and recent trends in content aggregation and content curation have emerged to attempt to address the problem.",
        "Uses of curation range from those in library science to ensure material remain accessible as format and electronic readers change and to make that information more findable (e.g.",
        "Peer and Green 2012) to those in marketing to increase revenue by providing more relevant content (Beaulaurier 2012).",
        "However, these approaches still have chal-lenges.",
        "Automatic aggregation over a large body of content still provides too many results without additional filtering mechanism.",
        "Content curation, which filters content by value and annotates it to ensure higher quality returns, is expensive since annotating large collections of content with the metadata needed to support faceted search and navigation is a huge challenge.",
        "The goal of the work described in this paper is to provide a framework for creating a useful resource tool bounded by the interests of a specific community which can take advantage of automated clustering and keyword extraction techniques and the use of community based annotation through crowd sourcing and social tatting to provide valuable curation.",
        "What is an impossible task for a single team because doable when we successfully harness and empower the community.",
        "The MedLingMap site is available at www.medlingmap.org.",
        "Currently MedLingMap has over 300 references many of which are annotated according to a set of ?contextual?",
        "facets (de-scribed below).",
        "We first provide some use cases for the system and then go into more detail on the content, infrastructure and origins of the system.",
        "We welcome members of the field to join MedLingMap as a curator to help extend the re-source.",
        "Just email info@medlingmap.org to get an account.",
        "Please include your affiliation.",
        "2 Use Cases MedLingMap was started as a class project in a Brandeis graduate course on NLP in the Medical Domain to provide a means of finding and organizing the publications in the field and as a data source for exploring trends in topics and relation",
        "ships among researchers.",
        "While there are many use cases for such a resource, three stand out.",
        "The first is simply the ability to find material that meets very specific criteria.",
        "for example, to find papers using ?MetaMap?",
        "for named entity extraction over clinical data.",
        "MedLingMap's growing collection of references and the necessary meta-data to make it useful is well suited to this task.",
        "The second is to support the exploration of an area.",
        "If I'm interested in clinical coding, I can select that subject area and am presented with a number of papers.",
        "I notice that Phil Resnik is on a number of papers and may want to follow up on his work.",
        "I also see many of the papers are tagged with AHIMA, including an entire proceedings that is worth exploring.",
        "I select a paper and see the abstract mentions a particular challenge that is also worth following up on.",
        "We are in the process of developing a personal ?workspace?",
        "that will let researchers record searches, annotate findings, and keep a queue of the ?next directions?",
        "that might be worth following up.",
        "The third use case gets back to one of the original premises of the work, which is that a ?map?",
        "of a field goes beyond a collection of materials, it also provides context and can be used to see ?hot spots?",
        "and trends.",
        "In order to provide this information and visualization, we have developed a set of tools applying a variety of NLP techniques, such as clus-tering, topic identification and tf-idf to the content of the papers.",
        "This work is described in more detail in (Thamrongrattanarit, et al. 2012).",
        "an entire file.",
        "A reference can be added through a form interface as well.",
        "We have added BioNLP and related workshops dating back to 2002 as well as many other docu-ments.",
        "In addition to the references, there are entries for a variety of organizations and resources"
      ]
    },
    {
      "heading": "6 Value for Stakeholders The value of MedLingMap varies with the audience. We first talk about the value to the current community and contrast MedLingMap to similar resources already available. We then look at stakeholders outside or entering the community and the value MedLingMap brings to them. 6.1 BioMedical NLP community For members of the community, a central repository for papers in the field is a ?nice to have?. There is information that is surfaced by seeing the organization of the information and links to resources in one place, but if you have been attending conferences and workshops regularly, this is not new information. You know the players and already follow the work you are interested in. In addition, similar information is available elsewhere, though in a more distributed form. ACL has made all of the proceedings to conferences and workshops available3. Similarly ACM and IEEE Xplore provide access to all of the papers they control. The significant difference is that in these collections even the advance search is relying on standard bibliographic elements, such as author and title, and keyword search and there is no segmentation of the material by field, which introduces significant ambiguity as the same term can mean different things in different fields. Similarly PubMed and GoPubMed offer documents and advanced search on a huge body of literature, but focused on biology and medicine, not the application of NLP techniques to those fields. MedLing-Map is designed to be focused on a smaller community with more like interests. It is also important to note that MedLingMap is providing links to papers, not the actual papers, which are controlled by the publishers. While many papers are readily available using the links provided or can be found through the Google Scholar link for each reference, if you need a subscription to see the entire paper such as for IEEE, you still need to go through your standard method to get those papers. LREC's Resource Map is more similar in that it provides more in depth information that the aggregations described above, however the focus is on 3 http://aclweb.org/anthology-new/",
      "text": [
        "mapping the resources themselves, not necessarily all of the publications that have taken advantage of those resources, though some of that information may be available by following the links.",
        "LREC is also using a crowd sourcing method for growing the resource by asking those who submit papers also submit the information about the resources they used.",
        "This is an interesting model in that it assures that those contributing have a stake in the result since they are members of the community by virtue of submitting a paper.",
        "Organizations such as BioNLP.org and Sig-BioMed are also important resource aggregators for the community.",
        "Neither are focused on publications and we hope that MedLingMap willl become one more resource they would point to.",
        "6.2 From the outside For students or those who come to the field from a neighboring field, the aggregation of the material in MedLingMap can save considerable time and provide overview or ?map?",
        "of the field.",
        "Queries that are ambiguous in Google Scholar are more precise when the domain is limited.",
        "<example> This increase in the ability of newcomers in the field to find what they are looking for actual turns into benefits for those in the field in two ways: First, one's own papers become more findable, increasing citations and potential collaborations.",
        "Second, for those who teach, MedLingMap provides a great environment for the students to do targeted research.",
        "Letting them loose in a constrained search environment increases the likelihood they will find a rich body of material to learn from and build on without having to always hand select the papers.",
        "7 Growing the resource The real challenge for a community resource such as MedLingMap is how to grow it to be comprehensive and keep it up to date, specifically how to: ?",
        "grow the number of references and resources ?",
        "increase high quality annotations that go beyond what can be extracted automatically.",
        "?",
        "provide visualizations that bring to light the connections in the material.",
        "?",
        "maintain the quality of the data, for example by fining and merging duplicate entries and",
        "ensuring information about resources and organizations is up to data.",
        "The two choices for growing are automatic techniques and human annotation.",
        "We discuss the former in a related paper (Thamrongrattanarit 2012).",
        "Here we describe how manual annotation can be feasible.",
        "7.1 Distributed Power The key to high quality documents and tagging is community involvement.",
        "There are two complementary approaches that are key to the MedLing-Map project: crowd sourcing and social tagging.",
        "Crowd sourcing involves the community in finding relevant resources, particularly those that are fairly obscure and predate the internet.",
        "The second is social tagging which lets individuals check on their own materials or materials in areas related to their own work and adding or adjusting the tags to make the content more searchable.",
        "The key to making these tactics work is setting up the right support in the underlying system.",
        "For-tunately, the MedLingMap infrastructure allows for easy signup for those volunteering to contrib-ute.",
        "These technique have been used successfully in patent prior art search by Article One, Inc.4 which puts out a call to researchers to find art on a particular patent.",
        "If the client selects that art to support their case, the contributor is paid.",
        "The patent office itself attempted something similar in the Peer to Patent program5, which depended on people's desire to improve the quality of patents by letting them contribute art.",
        "It was moderately suc-cessful, but without the kind of specific reward the Article One provides, they did not get nearly as much material as they would have liked.",
        "MedLingMap, SpeechMap and other efforts of its kind have the same problem: no one has enough time.",
        "So how do we address it?",
        "How do we create a convincing value proposition?",
        "Here are a couple suggestions: Teaching: MedLingMap is a great teaching tool.",
        "Not only can students use it to do research on the material that's in it, we as educators can enlist them to both tag material and go out on the web to find additional material to tag and add.",
        "In just one semester we have made considerable progress.",
        "If 4 http://www.articleonepartners.com/ 5 http://peertopatent.org/ everyone teaching a similar course enlisted their students, the students would gain and the resource would grow.",
        "Research support: With the implementation of the personal workspace described above, the system will provide a unique service not available from other aggregators or content owners.",
        "Funded project: Being able to hire student annotators would accelerate the process.",
        "For the SpeechMap project we have a proposal into the US Patent Office for funding.",
        "We are open to suggestions about funding sources for MedLingMap.",
        "Conclusion With MedLingMap's infrastructure in place and enough content to provide an exemplar of how it can grow, the challenge now is engaging the community in what we see as an exiting experiment in harnessing the resources of the internet through crowd sourcing and social tagging to create a living resource that will benefit both the current and future members of the field.",
        "MedLingMap also provides a resource for exploring automated ways of annotating and organizing research materials.",
        "We also hope that this can be a map itself, to build similar ?maps?",
        "in other subfields.",
        "References Allen, RB.",
        "1995.",
        "Retrieval from Facet Spaces, Electronic Publishing Chichester, Vol.",
        "8(2 & 3), 247?257.",
        "Beaulaurier, Joe.",
        "2012.",
        "Content Curating for Fun and Profit, http://whatcommarketing.com/content-curating-for-fun-and-profit/.",
        "Hearst, Marti.",
        "2006.",
        "Design Recommendations for Hierarchical Faceted Search Interfaces.",
        "ACM SIGIR Workshop on Faceted Search, August, 2006 Peer, L. Green, A.",
        "2012.",
        "Building an Open Data Repository for a Specialized Research Community: Process, Challenges and Lessons, International Journal of Digital Curation, Vol 7, No 1.",
        "E. Stoica, M.A.",
        "Hearst, and M. Richardson.",
        "2007.",
        "Au- tomating Creation of Hierarchical Faceted Metadata Structures.",
        "In Human Language Technologies: The Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL-HLT 2007), pages 244?251.",
        "Thamrongrattanarit, A., Shafir, M., Crivaro, M., Boruk-hov, B. , Meteer, M. What can NLP tell us about Bio NLP?",
        "BioNLP Workshop, Montreal, CA, 2012"
      ]
    }
  ]
}
