{
  "info": {
    "authors": [
      "Yuejie Zhang",
      "Yang Wang",
      "Xiangyang Xue"
    ],
    "book": "ACL-IJCNLP: Short Papers",
    "id": "acl-P09-2033",
    "title": "English-Chinese Bi-Directional OOV Translation based on Web Mining and Supervised Learning",
    "url": "https://aclweb.org/anthology/P09-2033",
    "year": 2009
  },
  "references": [
    "acl-D07-1106",
    "acl-P06-2026"
  ],
  "sections": [
    {
      "text": [
        "Yuejie Zhang, Yang Wang and Xiangyang Xue",
        "China",
        "{yjzhang,072021176,xyxue}@fudan.edu.cn",
        "In Cross-Language Information Retrieval (CLIR), Out-of-Vocabulary (OOV) detection and translation pair relevance evaluation still remain as key problems.",
        "In this paper, an English-Chinese Bi-Directional OOV translation model is presented, which utilizes Web mining as the corpus source to collect translation pairs and combines supervised learning to evaluate their association degree.",
        "The experimental results show that the proposed model can successfully filter the most possible translation candidate with the lower computational cost, and improve the OOV translation ranking effect, especially for popular new words."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In Cross-Language Information Retrieval (CLIR), most of queries are generally composed of short terms, in which there are many Out-of-Vocabulary (OOV) terms like named entities, new words, terminologies and so on.",
        "The translation quality of OOVs directly influences the precision of querying relevant multilingual information.",
        "Therefore, OOV translation has become a very important and challenging issue in CLIR.",
        "The translation of OOVs can either be acquired from parallel or comparable corpus (Lee, 2006) or mining from Web (Lu, 2004).",
        "However, how to evaluate the degree of association between source query term and its target translation is quite important.",
        "In this paper, an OOV translation model is established based on the combination pattern of Web mining and translation ranking.",
        "Given an OOV, its related information are gotten from search results by search engine, from which the possible translation terms in target language can be extracted and then ranked through supervised learning such as Support",
        "Vector Machine (SVM) and Ranking-SVM (Cao, 2006).",
        "The basic framework of the translation model is shown in Figure 1."
      ]
    },
    {
      "heading": "2. Related Research Work",
      "text": [
        "With the rapid growth of Web information, increasing new terms and terminologies cannot be found in bilingual dictionaries.",
        "The state-of-art OOV translation strategies tend to use Web itself as a big corpus (Wang, 2004; Zhang, 2004).",
        "The quick and direct way of getting required information from Web pages is to use search engines, such as Google, Altavista or Yahoo.",
        "Therefore, many OOV translation models based on Web mining are proposed by researchers (Fang, 2006; Wu, 2007).",
        "By introducing supervised learning mechanism, the relevance between original OOV term and extracted candidate translation can be accurately evaluated.",
        "Meanwhile, the model proposed exhibits better applicability and can also be applied in processing OOVs with different classes."
      ]
    },
    {
      "heading": "3. Chinese OOV Extraction based on PAT-Tree",
      "text": [
        "For a language that has no words boundary like Chinese, PAT-Tree data structure is adopted to extract OOV terms (Chien, 1997).",
        "The most outstanding property of this structure is its Semi Infinite String, which can store all the semistrings of whole corpus in a binary tree.",
        "In this tree, branch nodes indicate direction of search and child nodes store information about index and frequency of semi infinite strings.",
        "With common strings being extracted, large amounts of noisy terms and fragments are also extracted.",
        "For example, when searching for the translation of English abbreviation term \"FDA\", some noisy Chinese terms are extracted, such as \"Hlftpn\" (17 times), \"HH-friS\" (16 times), \"HHfrnS H\" (9 times).",
        "In order to filter noisy fragments, the simplified Local-Maxima algorithm is used (Wang, 2004)."
      ]
    },
    {
      "heading": "4. Translation Ranking based on Supervised Learning",
      "text": [
        "Based on the extracted terms, the correct translation can be chosen further.",
        "A direct option is to rank them by their frequency or length.",
        "It works well when the OOV term has a unique meaning and all the Web snippets are about the same topic.",
        "However, in much more cases only the highly related fragments of OOV terms can be found, rather than their correct translations.",
        "To evaluate the relevance of translation pair precisely, SVM and Ranking-SVM are employed as classifier and ordinal regression model respectively.",
        "The same feature set is utilized by SVM and",
        "Ranking-SVM.",
        "(1) Term frequency: fq denotes the frequency of OOV to be translated in all the Web snippets of search results.",
        "tfi indicates the number of the translation candidate in all the snippets.",
        "dfi represents the number of Web snippets that contains the candidate.",
        "dft means the number of snippets that contains both OOV to be translated and the candidate.",
        "(2) Term length: Len( ) is the length of the candidate.",
        "(3) Cooccurrence Distance: C-Dist is the average distance between the OOV query and the translation candidate, computed as follows.",
        "where Sum(Dist) is the sum of distance in each translation pair of every snippet.",
        "(4) Leng h Ra io: This is the ratio of OOV query length and translation candidate length.",
        "i.",
        "Top Rank (T-Rank): The rank of snippet that first contains the candidate.",
        "This value indicates the rank given by search engine.",
        "ii.",
        "Average Rank (A-Rank): It is the average position of candidate in snippets of search results, shown as follows.",
        "where Sum(Rank) denotes the sum of every single rank value of snippets that contains the candidate.",
        "iii.",
        "Simple Rank (S-Rank): It is computed based on Rank(i)=f*Len(i), which aims at investigating the impact of these two features on ranking translation.",
        "iv.",
        "R-Rank: This rank method is utilized as a comparison basis, computed as follows.",
        "where a is set as 0.25 empirically, |Sn| represents the length of candidate term, L is the largest length of candidate terms, fn is tfi, and foov is fq in Feature (1).",
        "v. Df_Rank (D-Rank): It is similar to S-Rank and computed based on Rank(i)= df *Len(i).",
        "(6) Mark feature: Within a certain distance (usually less than 10 characters) between the original OOV and candidate, if there is such a term like \"^T, \"tJCi%%\",",
        "\"HM\", \"H5C^;*f, this feature will be labeled as else instead.",
        "Among these features above, some features come from search engine like (1) and (5) and some ones from heuristic rules like (3) and (6).",
        "Through the establishment of feature set, the translation candidate can be optimized efficiently and the noisy information can also be filtered."
      ]
    },
    {
      "heading": "5. Experiment and Analysis 5.1 Data Set",
      "text": [
        "For the performance evaluation of Chinese-English OOV translation, the corpus of NER task in SIGHAN 2008 provided by Peking University is used.",
        "The whole corpus contains 19,866 person names, 22,212 location names and 7,837 organization names, from which 100 person names, 100 location names and 100 organization names are selected for testing.",
        "Meanwhile, 300 English named entities are chosen randomly from the terms of 9 categories, which include movie name, book title, organization name, brand name, terminology, idiom, rare animal name, person name and so on.",
        "These new terms are used as the testing data for English-Chinese OOV translation.",
        "Three parameters are used for the evaluation of translation and ranking candidates.",
        "N - Inclusion - Rate number of correct translation in top N translations total number ofOOV terms to be translated R - Precision(termi ) number of correct transaltion in top R translations",
        "number ofcorrect translations for termi to be translated R Precision",
        "y R - PrecisionRermj",
        "total number of OOV terms to be translated",
        "where T denotes the number of testing entities.",
        "The first one is a measurement for translation and the others are used for ranking measurement.",
        "Frequency and length are two crucial features for translation candidates.",
        "To get the most related terms into top 10 before the final ranking, a pre-rank testing is performed based on S-Rank, R-Rank and D-Rank.",
        "It can be seen from Figure 2 that the pre-rank by D-Rank exhibits better performance in translation experiment._",
        "In search results, for some English OOV terms such as \"BYOB( g^PlKc)\", there are few candidates with better quality in top 20 snippets.",
        "Therefore, in order to find how many snippets are suitable in translation, the experiment on snippet number is performed.",
        "It can be observed from Figure 3 that the best performance can be obtained by utilizing 200 snippets.",
        "5.4 Experiment On English-Chinese BiDirectional OOV Translation",
        "The experimental results on 300 English new terms are shown in Table 1.",
        "The experimental results on 300 Chinese named entities are shown in Table 2.",
        "It can be observed from Table 2 that the performance of Chinese location name translation is much higher than the other two categories.",
        "This is because most of the location names are famous cities or countries.",
        "The experimental results above demonstrate that the proposed model can be applicable in all kinds of OOV terms.",
        "In SVM-based and Ranking-SVM-based ranking experiment, the statistics on training data are shown in Table 3.",
        "For SVM training data, the \"Related\" candidates are neglected.",
        "The experimental results on ranking in English-Chinese and Chinese-English OOV translation are shown in Table 4 and 5 respectively.",
        "N-Inclusion-Rate",
        "English-Chinese OOV Translation",
        "Top-1",
        "0.SiS",
        "Top-3",
        "0.587",
        "Top-5",
        "0.627",
        "Top-7",
        "0.707",
        "Top-9",
        "0.76S",
        "N-Inclusion-Rate",
        "Person Name",
        "Location Name",
        "Organization Name",
        "Top-1",
        "0.2i0",
        "0.5i0",
        "0.ii0",
        "Top-3",
        "0.S90",
        "0.800",
        "0.280",
        "Top-5",
        "0.490",
        "0.900",
        "0.400",
        "Top-7",
        "0.5S0",
        "0.920",
        "0.480",
        "Top-9",
        "0.540",
        "0.9S0",
        "0.6S0",
        "Number of Candidates",
        "Correct",
        "Related",
        "Indifferent",
        "English-Chinese",
        "2S4",
        "i4i",
        "250",
        "Chinese-English",
        "240",
        "i44",
        "S7S",
        "English-Chinese",
        "Top-1 Inclusion",
        "Top-3 Inclusion",
        "R-",
        "Precision",
        "D-Rank",
        "0.SiS",
        "0.587",
        "0.4i7",
        "T-Rank",
        "0.2i7",
        "0.4S0",
        "0.2i7",
        "SVM",
        "0.5S0",
        "0.687",
        "0.5SS",
        "Ranking-SVM",
        "0.550",
        "0.687",
        "0.547",
        "Chinese-English OOV translation.",
        "From the experiments above, it can be concluded that the supervised learning significantly outperform the conventional ranking strategies.",
        "Through analysis about the experimental results in extraction and ranking, it can be observed that the OOV translation quality is highly related to the following aspects.",
        "(1) The translation results are related to the search engine used, especially for some specific OOV terms.",
        "For example, given a query OOV term \" M/^Hil\", the mining result based on Google in China is \"three direct links\", while some meaningless information is mined by the other engines like Live Trans.",
        "(2) Some terms are conventional terminologies and cannot be translated literally.",
        "For example, \"woman pace-setter\", a proper name with the particular Chinese characteristic, should be translated into \"HAtLSS^\", rather than \"iC^WMT or",
        "(3) The proposed model is sensitive to the notability degree of OOV term.",
        "For famous person name and book title, the translation performance is very promising.",
        "However, for other OOV terms with lower notability, such as \"and \"^LtLih\", the correct translation cannot even be retrieved by search engine.",
        "(4) Word Sense Disambiguation (WSD) should be added to improve the whole translation performance.",
        "Although most of OOVs have unique semantic definition, there are still a few OOVs with ambiguity.",
        "For example, \"Rice\" can either be a person name or a kind of food.",
        "Another example is \"AARP\", which also has two kinds of meaning, that is, \"HH iltt#tfr£\" and \"ilMjlft^tW'."
      ]
    },
    {
      "heading": "6. Conclusions and Future Work",
      "text": [
        "In this paper, the proposed model improves the acquirement ability for OOV translation through Web mining and solves the translation pair evaluation problem in a novel way by introducing supervised learning in translation ranking.",
        "In addition, it is very significant to apply the key techniques in traditional machine translation into OOV translation, such as OOV recognition, statistical machine learning, alignment of sentence and phoneme, and WSD.",
        "The merits of these techniques should be integrated.",
        "All these aspects above will become the research focus in our future work."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This paper is supported by National Natural Science Foundation of China (No.",
        "60773124), National Science and Technology Pillar Program",
        "Municipal R&D Foundation (No.",
        "08dz1500109).",
        "Yang Wang is the corresponding author.",
        "Chinese-English",
        "Top-1 Inclusion",
        "Top-3 Inclusion",
        "R-",
        "Precision",
        "TF-Rank",
        "0.277",
        "0.490",
        "0.287",
        "T-Rank",
        "0.197",
        "0.387",
        "0.207",
        "SVM",
        "0.347",
        "0.587",
        "0.347",
        "Ranking-SVM",
        "0.357",
        "0.613",
        "0.387"
      ]
    }
  ]
}
