{
  "info": {
    "authors": [
      "Andreas Maletti"
    ],
    "book": "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies",
    "id": "acl-P11-1083",
    "title": "How to train your multi bottom-up tree transducer",
    "url": "https://aclweb.org/anthology/P11-1083",
    "year": 2011
  },
  "references": [
    "acl-C04-1012",
    "acl-C08-1138",
    "acl-C90-3045",
    "acl-J08-3004",
    "acl-J90-2002",
    "acl-J93-2003",
    "acl-N04-1035",
    "acl-N10-1130",
    "acl-P05-1033",
    "acl-P08-1064",
    "acl-P09-1103",
    "acl-P10-1108",
    "acl-W07-0412"
  ],
  "sections": [
    {
      "text": [
        "Universität Stuttgart, Institute for Natural Language Processing Azenbergstraße 12, 70174 Stuttgart, Germany",
        "andreas.maletti@ims.uni-stuttgart.de",
        "The local multi bottom-up tree transducer is introduced and related to the (non-contiguous) synchronous tree sequence substitution grammar.",
        "It is then shown how to obtain a weighted local multi bottom-up tree transducer from a bilingual and biparsed corpus.",
        "Finally, the problem of non-preservation of regularity is addressed.",
        "Three properties that ensure preservation are introduced, and it is discussed how to adjust the rule extraction process such that they are automatically fulfilled."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "A (formal) translation model is at the core of every machine translation system.",
        "Predominantly, statistical processes are used to instantiate the formal model and derive a specific translation device.",
        "Brown et al.",
        "(1990) discuss automatically trainable translation models in their seminal paper.",
        "However, the IBM models of Brown et al.",
        "(1993) are string-based in the sense that they base the translation decision on the words and their surrounding context.",
        "Contrary, in the field of syntax-based machine translation, the translation models have full access to the syntax of the sentences and can base their decision on it.",
        "A good exposition to both fields is presented in (Knight, 2007).",
        "In this paper, we deal exclusively with syntax-based translation models such as synchronous tree substitution grammars (STSG), multi bottom-up tree transducers (MBOT), and synchronous tree-sequence substitution grammars (STSSG).",
        "Chiang (2006) gives a good introduction to S TSG, which originate from the syntax-directed translation schemes ofAho and Ullman (1972).",
        "Roughly speaking, an STSG has rules in which two linked nonterminals are replaced (at the same time) by two corresponding trees containing terminal and nonterminal symbols.",
        "In addition, the nonterminals in the two replacement trees are linked, which creates new linked nonterminals to which further rules can be applied.",
        "Henceforth, we refer to these two trees as input and output tree.",
        "M BOT have been introduced in (Arnold and Dauchet, 1982; Lilin, 1981) and are slightly more expressive than STSG.",
        "Roughly speaking, they allow one replacement input tree and several output trees in a single rule.",
        "This change and the presence of states yields many algorithmically advantageous properties such as closure under composition, efficient binarization, and efficient input and output restriction [see (Maletti, 2010)].",
        "Finally, STSSG, which have been derived from rational tree relations (Raoult, 1997), have been discussed by Zhang et al.",
        "(2008a), Zhang et al.",
        "(2008b), and Sun et al.",
        "(2009).",
        "They are even more expressive than the local variant of the multi bottom-up tree transducer (LMBOT) that we introduce here and can have several input and output trees in a single rule.",
        "In this contribution, we restrict MBOT to a form that is particularly relevant in machine translation.",
        "We drop the general state behavior of M BOT and replace it by the common locality tests that are also present in STSG, STSSG, and STAG (Shieber and Schabes, 1990; Shieber, 2007).",
        "The obtained device is the local mbot (lmbot).",
        "Maletti (2010) argued the algorithmical advantages of MBOT over STSG and proposed MBOT as an implementation alternative for STSG.",
        "In particular, the training procedure would train STSG; i.e., it would not utilize the additional expressive power of mbot.",
        "However, Zhang et al.",
        "(2008b) and Sun et al.",
        "(2009) demonstrate that the additional expressivity gained from non-contiguous rules greatly improves the translation quality.",
        "In this contribution we address this separation and investigate a training procedure for lmbot that allows non-contiguous fragments while preserving the algorithmic advantages of m bot.",
        "To this end, we introduce a rule extraction and weight training method for lmbot that is based on the corresponding procedures for stsg and stssg.",
        "However, general lmbot can be too expressive in the sense that they allow translations that do not preserve regularity.",
        "Preservation of regularity is an important property for efficient representations and efficient algorithms [see (May et al., 2010)].",
        "Consequently, we present 3 properties that ensure that an lmbot preserves regularity.",
        "In addition, we shortly discuss how these properties could be enforced in the rule extraction procedure."
      ]
    },
    {
      "heading": "2. Notation",
      "text": [
        "The set of nonnegative integers is N. We write [k] for the set {i | 1 < i < k}.",
        "We treat functions as special relations.",
        "For every relation R ç A x B and S ç A, we write where R-1 is called the inverse of R.",
        "The set Ts of all E-trees is the smallest set T such that a(t) G T for all a G E and t G T*.",
        "We generally use boldface characters (like t) for sequences, and we refer to their elements using subscripts (like Consequently, a tree t consists of a labeled root node a followed by a sequence t of its children.",
        "To improve readability we sometimes write a sequence t1 • • • tk as t1,..., tk.",
        "The positions pos(t) ç N* of a tree t = a(t) are",
        "inductively defined by pos(t) = {e}Upos(t), where pos(t) = [J {ip | p G pos(ti)} .",
        "Note that this yields an undesirable difference between pos(t) and pos(t), but it will always be clear from the context whether we refer to a single tree or a sequence.",
        "Note that positions are ordered via the (standard) lexicographic ordering.",
        "Let t G and p G pos(t).",
        "The label of t at position p is t(p), and the subtree rooted at position p is t|p.",
        "Formally, they are defined by a if p = e t(p) otherwise i-NT/(t) = {p G pos(t) | t(p) G NT, p leaf in t} .",
        "Later NT will be the set of nonterminals, so that the elements of iNT(t) will be the leaf nonterminals of t. We extend the notion to sequences t by iNT(t) = [J {ip | p G iNT(ti)} .",
        "We also need a substitution that replaces subtrees.",
        "Let p1,...,pn G pos(t) be pairwise incomparable positions and t1,... ,tn G .",
        "Then t[pi – ti | 1 < i < n] denotes the tree that is obtained from t by replacing (in parallel) the subtrees at pi by ti for every i [k].",
        "L(M) = {t G Ts | 6(t) n F = 0} .",
        "A tree language L ç Ts is regular if there exists a finite tree automaton M such that L = L(M).",
        "Given an alphabet E, the set of all words (or sequences) over E is E*, of which the empty word is e. The concatenation of two words u and w is simply denoted by the juxtaposition uw.",
        "The length of a word w = a1 • • • ak with ai G E for all i G [k] is |w| = k. Given 1 < i < j < k, the span w[i, j] of w is aiai+1 • • • aj.",
        "t|p otherwise for all t = a(t) and 1 < i < | t| .",
        "As demonstrated, these notions are also used for sequences.",
        "A position p G pos(t) is a leaf (in t) if pi G pos(t).",
        "Given a subset NT ç E, we let",
        "Finally, let us recall regular tree languages.",
        "A finite tree automaton M is a tuple (Q, E, 6, F) such that Q is a finite set, 6 ç Q* x E x Q is a finite relation, and F ç Q.",
        "We extend 6 to a mapping 6 : Ts 2Q by for every a G E and t G Ts.",
        "The finite tree automaton M recognizes the tree language"
      ]
    },
    {
      "heading": "3. The model",
      "text": [
        "In this section, we recall particular multi bottom-up tree transducers, which have been introduced by Arnold and Dauchet (1982) and Lilin (1981).",
        "A detailed (and English) presentation of the general model can be found in Engelfriet et al.",
        "(2009) and Maletti (2010).",
        "Using the nomenclature of Engel-friet et al.",
        "(2009), we recall a variant of linear and nondeleting extended multi bottom-up tree transducers (MBOT) here.",
        "Occasionally, we will refer to general MBOT, which differ from the local variant discussed here because they have explicit states.",
        "Throughout the article, we assume sets E and A of input and output symbols, respectively.",
        "Moreover, let NT ç E U A be the set of designated nonterminal symbols.",
        "Finally, we avoid weights in the formal development to keep it simple.",
        "It is straightforward to add weights to our model.",
        "Essentially, the model works on pairs (t, u) consisting of an input tree t T and a sequence u G T** of output trees.",
        "Each such pair is called a pre-translation and the rank rk((t, u)) the pre-translation (t, u) is |u|.",
        "In other words, the rank of a pre-translation equals the number of output trees stored in it.",
        "Given a pre-translation (t, u) G Ts x and i G [k], we call ui the ith translation of t. An alignment for the pre-translation (t, u) is an injective mapping 0 : iNT(u) – |NT(t) x N such that and j G [i].",
        "In other words, an alignment should request each translation of a particular subtree at most once and if it requests the ith translation, then it should also request all previous translations.",
        "Definition 1 A local multi bottom-up tree transducer (lmbot) is a finite set R of rules such that every rule, written l – ^ r, contains a pre-translation (l, r) and an alignment 0 for it.",
        "The component l is the left-hand side, r is the right-hand side, and 0 is the alignment of a rule l – ^ r G R. The rules of an LMBOT are similar to the rules of an STSG (synchronous tree substitution grammar) of Eisner (2003) and Shieber (2004), but right-hand sides of LMBOT contain a sequence of trees instead of just a single tree as in an stsg.",
        "In addition, the alignments in an STSG rule are bijective between leaf nonterminals, whereas our model permits multiple alignments to a single leaf nonterminal in the left-hand side.",
        "A model that is even more powerful than LMBOT is the non-contiguous version of STSSG (synchronous tree-sequence substitution grammar) of Zhang et al.",
        "(2008a), Zhang et al.",
        "(2008b), and Sun et al.",
        "(2009), which allows sequences of trees on both sides of rules [see also (Raoult, 1997)].",
        "Figure 1 displays sample rules of an LMBOT using a graphical representation of the trees and the alignment.",
        "Next, we define the semantics of an LMBOT R. To avoid difficulties, we explicitly exclude rules like l – r where l G NT or r G NT*; i.e., rules where the left-or right-hand side are only leaf nonterminals.",
        "We first define the traditional bottom-up semantics.",
        "Let p = l – ^ r G R be a rule and p G iNT(l).",
        "The prank rk(p, p) of p is rk(p,p) = |{i G N | (p,i) G 0(iNT(r))}|.",
        "Definition 2 The set t (R) of pre-translations of an LMBOT R is inductively defined to be the smallest set such that: If p = l – ^ r G R is a rule, (tp, up) G t(R) is a pre-translation of R for every p G i NT(l), and",
        "I I En NN-PROP",
        "signed IN NP",
        "NP-OBJ NP PP",
        "DET-NN PREP NP",
        "AltwqyE En NN-PROP twlY NP PP",
        "DET-NN PREP NP AltwqyE En NN-PROP",
        "Figure 2: Top left: (a) Initial pre-translation; Top right: (b) Pre-translation obtained from the left rule ofFig 1 and (a); Bottom: (c) Pre-translation obtained from the right rule of Fig 1 and (b)• u = r[p' – (up//)i | p' G 0-1(p'', i)].",
        "In plain words, each nonterminal leaf p in the left-hand side of a rule p can be replaced by the input tree t of a pre-translation (t, u) whose root is labeled by the same nonterminal In addition, the rank rk(p, p) of the replaced nonterminal should match the rank rk((t, u)) of the pre-translation and the nonterminals in the right-hand side that are aligned to p should be replaced by the translation that the alignment requests, provided that the nonterminal matches with the root symbol of the requested translation.",
        "The main benefit of the bottom-up semantics is that it works exclusively on pre-translations.",
        "The process is illustrated in Figure 2.",
        "Using the classical bottom-up semantics, we simply obtain the following theorem by Maletti (2010) because the mbot constructed there is in fact an lmbot.",
        "Theorem 3 For every stsg, an equivalent lmbot can be constructed in linear time, which in turn yields a particular mbot in linear time.",
        "Finally, we want to relate lmbot to the stssg of Sun et al.",
        "(2009).",
        "To this end, we also introduce the top-down semantics for lmbot.",
        "As expected, both semantics coincide.",
        "The top-down semantics is introduced using rule compositions, which will play an important rule later on.",
        "Definition 4 The set Rk of k-fold composed rules is inductively defined as follows:",
        "pp = lp – ipp rp G Rk such that for every p G iNT(l) and p' G iNT(r) where",
        "- <p(p'p) = p''0p// (ip) for all positions p' G 0-1(p'', i) and ip G iNT(rp// ).",
        "The rule closure R<°° of R is R<°° = Ui>1 Ri.",
        "The top-down pre-translation ofR is",
        "Tt(R) = {(l, r ) | l – ^ r G R<°°, Int(l) = 0} .",
        "The composition of the rules, which is illustrated in Figure 3, in the second item of Definition 4 could also be represented as p(p1, .",
        ".",
        ".",
        ", pk) where p1 , .",
        ".",
        ".",
        ", pk is an enumeration of the rules { pp | p G i NT(l)} used in the item.",
        "The following theorem is easy to prove.",
        "Theorem 5 The bottom-up and top-down semantics coincide; i.e., t(R) = Tt(R).",
        "Chiang (2005) and Graehl et al.",
        "(2008) argue that stsg have sufficient expressive power for syntax-based machine translation, but Zhang et al.",
        "(2008a) show that the additional expressive power of tree-sequences helps the translation process.",
        "This is mostly due to the fact that smaller (and less specific) rules can be extracted from bi-parsed word-aligned training data.",
        "A detailed overview that focusses on stsg is presented by Knight (2007).",
        "Theorem 6 For every lmbot, an equivalent stssg can be constructed in linear time."
      ]
    },
    {
      "heading": "4. Rule extraction and training",
      "text": [
        "In this section, we will show how to automatically obtain an lmbot from a bi-parsed, word-aligned parallel corpus.",
        "Essentially, the process has two steps: rule extraction and training.",
        "In the rule extraction step, an (unweighted) lmbot is extracted from the corpus.",
        "The rule weights are then set in the training procedure.",
        "The two main inspirations for our rule extraction are the corresponding procedures for stsg (Galley et al., 2004; Graehl et al., 2008) and for stssg (Sun et al., 2009).",
        "stsg are always contiguous in both the left-and right-hand side, which means that they (completely) cover a single span of input or output words.",
        "On the contrary, stssg rules can be noncontiguous on both sides, but the extraction procedure of Sun et al.",
        "(2009) only extracts rules that are contiguous on the left-or right-hand side.",
        "We can adjust its 1st phase that extracts rules with (potentially) non-contiguous right-hand sides.",
        "The adjustment is necessary because lmbot rules cannot have (contiguous) tree sequences in their left-hand sides.",
        "Overall, the rule extraction process is sketched in Algorithm 1.",
        "Algorithm 1 Rule extraction for lmbot Require: word-aligned tree pair (t, u) Return: lmbot rules R such that (t, u) G t(R) while there exists a maximal non-leaf node p G pos(t) and minimal p1,... ,pk G pos(u) such that t|p and (u|pi,..., u|pk) have a consistent alignment (i.e., no alignments from within t|p to a leaf outside (u|pi,..., u|pk) and vice versa) do",
        "u – u[pi – u(pi) | i G {1,..., k}] 6: establish alignments according to position end while",
        "The requirement that we can only have one input tree in lmbot rules indeed might cause the extraction of bigger and less useful rules (when compared to the corresponding stssg rules) as demonstrated in (Sun et al., 2009).",
        "However, the stricter rule shape preserves the good algorithmic properties of lmbot.",
        "The more powerful stssg rules can cause nonclosure under composition (Raoult, 1997; Radmacher, 2008) and parsing to be less efficient.",
        "Figure 4 shows an example of biparsed aligned parallel text.",
        "According to the method of Galley et al.",
        "(2004) we can extract the (minimal) stsg rule displayed in Figure 5.",
        "Using the more liberal format of lmbot rules, we can decompose the stsg rule of Figure 5 further into the rules displayed in Figure 1.",
        "The method of Sun et al.",
        "(2009) would also extract the rule displayed in Figure 6.",
        "Let us reconsider Figures 1 and 2.",
        "Let p1 be the top left rule of Figure 2 and p2 and p3 be the",
        "NP-SBJ VP",
        "JJ NNP Voislav sign d IN NP Yugoslav President for NNP AltwqyE En NN-PrOP Alr}ys AlywgwslAfy fwyslAf DeT-NN pReT Jp DET-NN DET-ADJ NN-pROP twlY NP ^PP NP^ jNp",
        "NP-OBJ NP-SBJ left and right rule of Figure 1, respectively.",
        "We can represent the lower pre-translation of Figure 2 by p30 • • , p2(p1)), where p2(p1) represents the upper right pre-translation of Figure 2.",
        "If we name all rules of R, then we can represent each pre-translation of t (R) symbolically by a tree containing rule names.",
        "Such trees containing rule names are often called derivation trees.",
        "Overall, we obtain the following result, for which details can be found in (Arnold and Dauchet, 1982).",
        "Theorem 7 The set D(R) is a regular tree language for every lmbot R, and the set of derivations is also regular for every mbot.",
        "signed for twlY",
        "Moreover, using the input and output product constructions of Maletti (2010) we obtain that even the set Dt M(R) of derivations for a specific input tree t and output tree u is regular.",
        "Since Dt M(R) is regular, we can compute the inside and outside weight of each (weighted) rule of R following the method of Graehl et al.",
        "(2008).",
        "Similarly, we can adjust the training procedure of Graehl et al.",
        "(2008), which yields that we can automatically obtain a weighted lmbot from a bi-parsed parallel corpus.",
        "Details on the runtime can be found in (Graehl et al., 2008)."
      ]
    },
    {
      "heading": "5. Preservation of regularity",
      "text": [
        "Clearly, lmbot are not symmetric.",
        "Although, the backwards application of an lmbot preserves regularity, this property does not hold for forward application.",
        "We will focus on forward application here.",
        "Given a set T of pre-translations and a tree language",
        "L ç Ts, we let which collects all translations of input trees in L. We say that T preserves regularity if TC(L) is regular for every regular tree language L ç Ts.",
        "Correspondingly, an lmbot R preserves regularity if its set t (R) of pre-translations preserves regularity.",
        "As mentioned, an lmbot does not necessarily preserve regularity.",
        "The rules of an lmbot have only alignments between the left-hand side (input tree) and the right-hand side (output tree), which are also called inter-tree alignments.",
        "However, several alignments to a single nonterminal in the left-hand side can transitively relate two different nonterminals in the output side and thus simulate an intra-tree alignment.",
        "For example, the right rule of Figure 1 relates a 'PV' and an 'NP-OBJ' node to a single 'VP' node in the left-hand side.",
        "This could lead to an intra-tree alignment (synchronization) between the 'PV' and 'NP-OBJ' nodes in the right-hand side.",
        "Figure 7 displays the rules R of an lmbot that does not preserve regularity.",
        "This can easily be seen on the leaf (word) languages because the lmbot can translate the word x to any element of L = {wcwc | w G {a, b}*}.",
        "Clearly, this word language L is not context-free.",
        "Since the leaf language of every regular tree language is context-free and regular tree languages are closed under intersection (needed to single out the translations that have the symbol Y at the root), this also proves that t(R)c(Ts) is not regular.",
        "Since Ts is regular, this proves that the lmbot does not preserve regularity.",
        "Preservation of regularity is an important property for a number of translation model manipulations.",
        "For example, the bucket-brigade and the on-the-fly method for the efficient inference described in (May et al., 2010) essentially build on it.",
        "Moreover, a regular tree grammar (i.e., a representation of a regular tree language) is an efficient representation.",
        "More complex representations such as context-free tree grammars [see, e.g., (Fujiyoshi, 2004)] have worse algorithmic properties (e.g., more complex parsing and problematic intersection).",
        "In this section, we investigate three syntactic restrictions on the set R of rules that guarantees that the obtained lmbot preserves regularity.",
        "Then we shortly discuss how to adjust the rule extraction algorithm, so that the extracted rules automatically have these property.",
        "First, we quickly recall the notion of composed rules from Definition 4 because it will play an essential role in all three properties.",
        "Figure 3 shows a composition of two rules from Figure 7.",
        "Mind that R might not contain all rules of R, but it contains all those without leaf nonterminals.",
        "Definition 8 An lmbot R is finitely collapsing if there is n G N suchthat 0 : |NT (r) – iNT(l)x{1} for every rule l – ^ r G Rn.",
        "The following statement follows from a more general result of Raoult (1997), which we will introduce with our second property.",
        "Theorem 9 Every finitely collapsing lmbot preserves regularity.",
        "Often the simple condition 'finitely collapsing' is fulfilled after rule extraction.",
        "In addition, it is automatically fulfilled in an lmbot that was obtained from an stsg using Theorem 3.",
        "It can also be ensured in the rule extraction process by introducing collapsing points for output symbols that can appear recursively in the corpus.",
        "For example, we could enforce that all extracted rules for clause-level output symbols (assuming that there is no recursion not involving a clause-level output symbols) should have only 1 output tree in the right-hand side.",
        "However, 'finitely collapsing' is a rather strict property.",
        "Finitely collapsing lmbot have only slightly more expressive power than stsg.",
        "In fact, they could be called stsg with input desynchro-nization.",
        "This is due to the fact that the alignment in composed rules establishes an injective relation between leaf nonterminals (as in an stsg), but it need not be bijective.",
        "Consequently, there can be leaf nonterminals in the left-hand side that have no aligned leaf nonterminal in the right-hand side.",
        "In this sense, those leaf nonterminals are desynchronized.",
        "This feature is illustrated in Figure 8 and such an lmbot can compute the transformation { ( t, a) | t G Ts } , which cannot be computed by an stsg (assuming that Ts is suitably rich).",
        "Thus stsg with input desynchronization are more expressive than stsg, but they still compute a class of transformations that is not closed under composition.",
        "Theorem 10 For every stsg, we can construct an equivalent finitely collapsing lmbot in linear time.",
        "Moreover, finitely collapsing lmbot are strictly more expressive than stsg.",
        "Next, we investigate a weaker property by Raoult (1997) that still ensures preservation of regularity.",
        "Definition 11 An lmbot R has finite synchronization if there is n G N such that for every rule l – ^ r G Rn and p G iNT(l) there exists i G N with 0-1({p} x N) ç {iw | w G N*}.",
        "In plain terms, multiple alignments to a single leaf nonterminal at p in the left-hand side are allowed, but all leaf nonterminals of the right-hand side that are aligned to p must be in the same tree.",
        "Clearly, an lmbot with finite synchronization is finitely collapsing.",
        "Raoult (1997) investigated this restriction in the context of rational tree relations, which are a generalization of our lmbot.",
        "Raoult (1997) shows that finite synchronization can be decided.",
        "The next theorem follows from the results of Raoult (1997).",
        "Theorem 12 Every lmbot with finite synchronization preserves regularity.",
        "mbot can compute arbitrary compositions of stsg (Maletti, 2010).",
        "However, this no longer remains true for mbot (or lmbot) with finite synchronization.",
        "In Figure 9 we illustrate a translation that can be computed by a composition of two stsg, but that cannot be computed by an mbot (or lmbot) with finite synchronization.",
        "Intuitively, when processing the chain of 'X's of the transformation depicted in Figure 9, the first and second suc-",
        "cessor of the 'Z'-node at the root on the output side must be aligned to the 'X'-chain.",
        "This is necessary because those two mentioned subtrees must reproduce t1 and t2 from the end of the 'X'-chain.",
        "We omit the formal proof here, but obtain the following statement.",
        "Theorem 13 For every stsg, we can construct an equivalent lmbot with finite synchronization in linear time.",
        "lmbot and mbot with finite synchronization are strictly more expressive than stsg and compute classes that are not closed under composition.",
        "Again, it is straightforward to adjust the rule extraction algorithm by the introduction of synchronization points (for example, for clause level output symbols).",
        "We can simply require that rules extracted for those selected output symbols fulfill the condition mentioned in Definition 11.",
        "Finally, we introduce an even weaker version.",
        "Definition 14 An lmbot R is copy-free if there is n G N such that for every rule l – ^ r G Rn and p G iNT(l) we have (i) 0-1({p} x N) ç N, or (ii) 0-1({p} x N) ç {iw | w G N*} for an i G N.",
        "Intuitively, a copy-free lmbot has rules whose right hand sides may use all leaf nonterminals that are aligned to a given leaf nonterminal in the left-hand side directly at the root (of one of the trees in the right-hand side forest) or group all those leaf nonterminals in a single tree in the forest.",
        "Clearly, the lmbot of Figure 7 is not copy-free because the second rule composes with itself (see Figure 10) to a rule that does not fulfill the copy-free condition.",
        "Theorem 15 Every copy-free lmbot preserves regularity.",
        "Proof sketch: Let n be the integer of Definition 14.",
        "We replace the lmbot with rules R by the equivalent lmbot M with rules Rn.",
        "Then all rules have the form required in Definition 14.",
        "Moreover, let L ç Ts be a regular tree language.",
        "Then we can construct the input product of t(M) with L. In this way, we obtain an mbot M', whose rules still fulfill the requirements (adapted for mbot) of Definition 14 because the input product does not change the structure of the rules (it only modifies the state behavior).",
        "Consequently, we only need to show that the range of the mbot M' is regular.",
        "This can be achieved using a decomposition into a relabeling, which clearly preserves regularity, and a deterministic finite-copying top-down tree transducer (Engel-friet et al., 1980; Engelfriet, 1982).",
        "□ Figure 11 shows some relevant rules of a copy-free lmbot that computes the transformation of Figure 9.",
        "Clearly, copy-free lmbot are more general than lmbot with finite synchronization, so we again can obtain copy-free lmbot from stsg.",
        "In addition, we can adjust the rule extraction process using synchronization points as for lmbot with finite synchronization using the restrictions of Definition 14.",
        "Theorem 16 For every stsg, we can construct an equivalent copy-free lmbot in linear time.",
        "Copy-free lmbot are strictly more expressive than lmbot with finite synchronization."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "We have introduced a simple restriction of multi bottom-up tree transducers.",
        "It abstracts from the general state behavior of the general model and only uses the locality tests that are also present in stsg, stssg, and stag.",
        "Next, we introduced a rule extraction procedure and a corresponding rule weight training procedure for our lmbot.",
        "However, lmbot allow translations that do not preserve regularity, which is an important property for efficient algorithms.",
        "We presented 3 properties that ensure that regularity is preserved.",
        "In addition, we shortly discussed how these properties could be enforced in the presented rule extraction procedure."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The author gratefully acknowledges the support by Kevin Knight, who provided the inspiration and the data.",
        "Jonathan May helped in many fruitful discussions.",
        "The author was financially supported by the German Research Foundation (DFG) grant MA/4959/ 1-1.",
        "XX",
        "X",
        "1 A",
        "A",
        "X a X",
        "aX",
        "/\\",
        ".",
        "a .",
        ".",
        ".",
        ", a ."
      ]
    }
  ]
}
