{
  "info": {
    "authors": [
      "Svetlana Stoyanchev",
      "Amanda J. Stent"
    ],
    "book": "HLT-NAACL, Companion Volume: Short Papers",
    "id": "acl-N09-2048",
    "title": "Lexical and Syntactic Adaptation and Their Impact in Deployed Spoken Dialog Systems",
    "url": "https://aclweb.org/anthology/N09-2048",
    "year": 2009
  },
  "references": [
    "acl-A00-2027",
    "acl-J97-1006",
    "acl-P08-1044"
  ],
  "sections": [
    {
      "text": [
        "Lexical and Syntactic Priming and Their Impact in Deployed Spoken Dialog",
        "Systems",
        "Svetlana Stoyanchev and Amanda Stent",
        "In this paper, we examine user adaptation to the system's lexical and syntactic choices in the context of the deployed Let's Go!",
        "dialog system.",
        "We show that in deployed dialog systems with real users, as in laboratory experiments, users adapt to the system's lexical and syntactic choices.",
        "We also show that the system's lexical and syntactic choices, and consequent user adaptation, can have an impact on recognition of task-related concepts.",
        "This means that system prompt formulation, even in flexible input dialog systems, can be used to guide users into producing utterances conducive to task success."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Numerous studies have shown that people adapt their syntactic and lexical choices in conversation to those of their conversational partners, both human (Brennan, 1996; Pickering et al., 2000; Lockridge and Brennan, 2002; Reitter et al., 2006) and computer (Branigan et al., 2003; Brennan, 1991; Brennan, 1996; Gustafson et al., 1997; Ward and Litman, 2007).",
        "User adaptation to the system's lexical and syntactic choices can be particularly useful in flexible input dialog systems.",
        "Limited input dialog systems, including most commercial systems, require the user to respond to each system prompt using only the concept and words currently requested by the system.",
        "Flexible input dialog systems allow the user to respond to system prompts with concepts and words in addition to or other than the ones currently requested, and may even allow the user to take task initiative.",
        "Speech recognition (ASR) accuracy in limited input systems is better than in flexible input systems (Danieli and Gerbino, 1995; Smith and Gordon, 1997).",
        "However, task completion rates and times are better in flexible input systems (Chu-Carroll and Nickerson, 2000; Smith and Gordon, 1997).",
        "With user adaptation, in flexible input dialog systems prompts can be formulated to maximize ASR accuracy and reduce the number of ASR timeouts (Sheeder and Balogh, 2003).",
        "Previous research on user adaptation to dialog systems was conducted in laboratory settings.",
        "However, the behavior of recruited subjects in a quiet laboratory may differ from that of real users in the noisy world (Ai et al., 2007).",
        "Here we present the first study, to the best of our knowledge, that investigates the adaptive behavior of real users of a live dialog system.",
        "We analyze dialogs from CMU's Let s Go!",
        "dialog system (Raux et al., 2005).",
        "We look at the effects of the system's lexical and syntactic choices on: 1) lexical and syntactic choices in user responses; and 2) concept identification rates for user responses.",
        "We confirm prior results showing that users adapt to the system's lexical and syntactic choices.",
        "We also show that particular choices for system prompts can lead to higher concept identification rates."
      ]
    },
    {
      "heading": "2. Experimental Method",
      "text": [
        "We conducted our experiment using the Let s Go!",
        "telephone-based spoken dialog system that provides information about bus routes in Pittsburgh (Raux et al., 2005).",
        "The users are naive callers from the general population seeking information about bus schedules.",
        "In order to provide the user with route information, Let s Go!",
        "elicits a departure location, a destination, a departure time, and optionally a bus route number.",
        "Each concept value provided by the user is explicitly confirmed by the system.",
        "Figure 1 shows an example dialog with the system.",
        "Let's Go!",
        "is a flexible input dialog system.",
        "The user can respond to a system prompt using a single word or short phrase, e.g.",
        "Downtown, or a complete sentence, e.g.",
        "I am leaving from downtown.",
        "We ran four experimental conditions for two months.",
        "The conditions varied in the lexical choice and syntax of system prompts for two system request location tasks and two system confirm location tasks (see Table 1).",
        "System prompts differed by presence of a verb (to leave, to go) or a preposition (to, from), and by the syntactic form of the verb.",
        "The request location prompt contained both a verb and a preposition in the experimental conditions (1, 3, and 4).",
        "The confirm location prompt contained both a verb and a preposition in conditions 1 and 4, only a preposition in condition 2, and neither verb nor preposition in condition 3.",
        "In conditions 1 and 4, both request and confirmation prompts differed in the verb form (leaving/leave, going/go).",
        "2184 dialogs were used for this analysis.",
        "For each experimental condition, we counted the percentages of verbs, verb forms, prepositions, and locations in the ASR output for user responses to system request location and confirm location prompts.",
        "Although the data contains recognition errors, the only difference in system functionality between the conditions is the formulation of the system prompt, so any statistically significant difference in user responses between different conditions can be attributed to the formulation of the prompt."
      ]
    },
    {
      "heading": "3. Syntactic Adaptation",
      "text": [
        "We analyze whether users are more likely to use action verbs (leave, leaving, go, or going) and prepositions (to, from) in response to system prompts that use a verb or a preposition.",
        "This analysis is interesting because ASR partially relies on context words, words related to a particular concept type such as place, time or bus route.",
        "For example, the likelihood of correctly recognizing the location Oakland in the utterance \"going to Oakland\" is different from the likelihood of correctly recognizing the single word utterance \"Oakland\" .",
        "condition",
        "request departure",
        "confirm departure",
        "request arrival",
        "confirm arrival",
        "location",
        "location",
        "location",
        "location",
        "(1)",
        "Where are you leav-",
        "Leaving from X, is this",
        "Where are you going",
        "Going to X, is this",
        "ing from?",
        "correct?",
        "to?",
        "correct",
        "(2)",
        "Where are you leav-",
        "From X, is this cor-",
        "Where are you going",
        "To X, is this correct",
        "ing from?",
        "rect?",
        "to?",
        "(3)",
        "What is the place of your departure",
        "X, is this correct?",
        "What is the place of your arrival?",
        "X, is this correct",
        "(4)",
        "Where do you want to",
        "You want to leave from",
        "Where do you want to",
        "You want to go to X,",
        "leave from?",
        "X, is this correct?",
        "goto?",
        "is this correct",
        "Spkr",
        "Task type",
        "Utterance",
        "Sys",
        "Open",
        "Welcome to the CMU Let's",
        "Go bus information system.",
        "What can I do for you?",
        "Usr",
        "61A schedule",
        "Sys",
        "Request",
        "Where do you wanna leave",
        "Departure",
        "from?",
        "Usr",
        "Location",
        "From downtown",
        "Sys",
        "Confirm",
        "Leaving from downtown.",
        "Is",
        "Departure",
        "this correct?",
        "Usr",
        "Location",
        "Yes",
        "Sys",
        "Request",
        "Where are you going to?",
        "Arrival",
        "Usr",
        "Location",
        "Oakland",
        "Sys",
        "Confirm",
        "Going to Waterfront.",
        "Is this",
        "Arrival",
        "correct?",
        "Usr",
        "Location",
        "No, to Oakland",
        "Table 2: Percentages of user utterances containing verbs and prepositions.",
        "* indicates a statistically significant difference (p<0.01) from the no action verb condition (3).",
        "4k indicates a statistically significant difference from the no action verb in confirmation condition (2).",
        "in each experimental condition that contain a verb and/or a preposition.",
        "We observe adaptation to the presence of a verb in user responses to request location prompts.",
        "The prompts in conditions 1, 2 and 4 contain a verb, while those in condition 3 do not.",
        "The differences between conditions 1 and 3, and between conditions 4 and 3, are statistically significant (p<0.01).",
        "The difference between conditions 2 and 3 is not statistically significant, perhaps due to the absence of a verb in a prior confirm location prompt.",
        "A similar adaptation to the presence of a verb in the system prompt is seen in user responses to confirm location prompts.",
        "The prompts in conditions 1 and 4 contain a verb while those in conditions 2 and 3 do not.",
        "The differences between conditions 1 and 2, and between conditions 1 and 3, are statistically significant (p<.01), while the difference between conditions 4 and 2 exhibits a trend.",
        "We hypothesize that the lack of the statistically significant differences between conditions 4 and 2, and conditions 4 and 3, is caused by the low relative frequency in our data of dialogs in condition 4.",
        "We do not find statistically significant differences in the use of prepositions.",
        "However, we observe a trend showing higher likelihood of a preposition in user responses to confirm location in the conditions where the system uses a preposition.",
        "Prepositions are short closed-class context words that are more likely to be misrecognized (Goldwater et al., 2008).",
        "Table 3 : Usage of verb forms in user utterances",
        "Hence, more data (or human transcription) may be required to see a statistically significant effect."
      ]
    },
    {
      "heading": "4. Lexical Adaptation",
      "text": [
        "We analyze whether system choice of a particular verb form affects user choice of verb form.",
        "For this analysis we only consider user utterances in response to a request location or confirm location prompt that contain a concept and at least one of the verb forms leaving, going, leave, or go .",
        "Table 3 shows the total counts and percentages of each verb form in the progressive form condition (condition 1), and the neutral condition (condition 3), and the simple form condition (condition 4).",
        "We find that the system's choice of verb form has a statistically significant impact on the user's choice (X test, p<0.01).",
        "In the neutral condition, users are more likely to choose the progressive verb form.",
        "In the progressive form condition, this preference increases by 13.2% for the verb to leave, and by 17.8% for the verb to go.",
        "By contrast, in the simple form condition, this preference decreases by 18.3% for the verb to leave and by 20.1% for the verb to go, making users slightly more likely to choose the simple verb form than the progressive verb form."
      ]
    },
    {
      "heading": "5. Effect of Adaptation on Speech Recognition Performance",
      "text": [
        "The correct identification and recognition of task-related concepts in user utterances is an essential functionality of a dialog system.",
        "Table 4 shows",
        "Cond.",
        "Sys uses",
        "Sys uses",
        "% with",
        "%with",
        "verb",
        "prep",
        "verb",
        "prep",
        "Responses to request location prompt",
        "(1)",
        "yes",
        "yes",
        "2.3% *",
        "5.6%",
        "(2)",
        "yes",
        "yes",
        "1.9%",
        "4.3%",
        "(3)",
        "no",
        "no",
        "0.7%",
        "4.5%",
        "(4)",
        "yes",
        "yes",
        "2.4%*",
        "6.0%",
        "Responses to confirm location prompt",
        "(1)",
        "yes",
        "yes",
        "15.7% * *",
        "23.4%",
        "(2)",
        "no",
        "yes",
        "3.9%",
        "16.9%",
        "(3)",
        "no",
        "no",
        "6.4%",
        "12.7%",
        "(4)",
        "yes",
        "yes",
        "10.8%",
        "22.0%",
        "Condition/",
        "LEAVING",
        "LEAVE",
        "total",
        "User's verb",
        "(progressive)",
        "(simple)",
        "(1) Progressive",
        "74.5%",
        "25.5%",
        "55",
        "(3) Neutral",
        "61.3%",
        "38.7%",
        "31",
        "(4) Simple",
        "43%",
        "57%",
        "42",
        "Condition/",
        "GOING",
        "GO",
        "total",
        "User's verb",
        "(progressive)",
        "(simple)",
        "(1) Progressive",
        "84.4%",
        "15.6%",
        "45",
        "(3) Neutral",
        "66.6%",
        "33.4%",
        "21",
        "(4) Simple",
        "46.5%",
        "53.5%",
        "43",
        "Table 4: Concept identification rates following request location prompts.",
        "* indicates a statistically significant difference (p<0.01 with Bonferroni adjustment) from condition 4.",
        "the percentage of user utterances following a request location prompt that contain an automatically-recognized location concept.",
        "Condition 4, where the system prompt uses the verb form to leave, achieves the highest concept identification rates.",
        "The differences in concept identification rates between conditions 1 and 4, and between conditions 3 and 4, are statistically significant for request arrival location (t-test, p<.01).",
        "Other differences are not statistically significant, perhaps due to lack of data."
      ]
    },
    {
      "heading": "6. Conclusions and Future Work",
      "text": [
        "In this paper, we showed that in deployed dialog systems with real users, as in laboratory experiments, users adapt to the lexical and syntactic choices of the system.",
        "We also showed that user adaptation to system prompts can have an impact on recognition of task-related concepts.",
        "This means that the formulation of system prompts, even in flexible input dialog systems, can be used to guide users into producing utterances conducive to task success.",
        "In future work, we plan to confirm these results using transcribed data.",
        "We also plan additional experiments on adaptation in Let s Go!, including an analysis of the time course of adaptation and further analyses of the impact of adaptation on ASR performance."
      ]
    },
    {
      "heading": "7. Acknowledgements",
      "text": [
        "We would like to thank the Let s Go!",
        "researchers at CMU for making Let s Go!",
        "available.",
        "This research was supported by the NSF under grant no.",
        "0325188.",
        "System",
        "Arrival",
        "Departure",
        "prompt",
        "request",
        "request",
        "(1)",
        "72.2% *",
        "63.8%",
        "(2)",
        "77.4%",
        "61.0%",
        "(3)",
        "74.5% *",
        "61.5%",
        "(4)",
        "82.0%",
        "66.0%"
      ]
    }
  ]
}
