{
  "info": {
    "authors": [
      "Rens Bod"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E03-1005",
    "title": "An Efficient Implementation of a New DOP Model",
    "url": "https://aclweb.org/anthology/E03-1005",
    "year": 2003
  },
  "references": [
    "acl-A00-2018",
    "acl-C00-1011",
    "acl-C92-2066",
    "acl-C92-3126",
    "acl-C96-1058",
    "acl-C96-2215",
    "acl-J02-1005",
    "acl-J93-2004",
    "acl-J98-4004",
    "acl-P00-1008",
    "acl-P00-1058",
    "acl-P01-1010",
    "acl-P02-1034",
    "acl-P92-1017",
    "acl-P92-1024",
    "acl-P96-1025",
    "acl-P97-1003",
    "acl-P97-1021",
    "acl-W96-0214"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Two apparently opposing DOP models exist in the literature: one which computes the parse tree involving the most frequent subtrees from a treebank and one which computes the parse tree involving the fewest subtrees from a treebank.",
        "This paper proposes an integration of the two models which outperforms each of them separately.",
        "Together with a PCFG-reduction of DOP we obtain improved accuracy and efficiency on the Wall Street Journal treebank.",
        "Our results show an 11 % relative reduction in error rate over previous models, and an average processing time of 3.6 seconds per WSJ sentence."
      ]
    },
    {
      "heading": "1 Introduction: A Little History",
      "text": [
        "The distinctive feature of the DOP approach when it was proposed in 1992 was to model sentence structures on the basis of previously observed frequencies of sentence structure fragments, without imposing any constraints on the size of these fragments.",
        "Fragments include, for instance, subtrees of depth 1 (corresponding to context-free rules) as well as entire trees.",
        "To appreciate these innovations, it should be noted that the model was radically different from all other statistical parsing models at the time.",
        "Other models started off with a predefined grammar and used a corpus only for estimating the rule probabilities (as e.g. in Fujisaki et al.",
        "1989; Black et al.",
        "1992, 1993; Briscoe and Thanks to Ivan Sag for this pun.",
        "Waegner 1992; Pereira and Schabes 1992).",
        "The DOP model, on the other hand, was the first model (to the best of our knowledge) that proposed not to train a predefined grammar on a corpus, but to directly use corpus fragments as a grammar.",
        "This approach has now gained wide usage, as exemplified by the work of Collins (1996, 1999), Charniak (1996, 1997), Johnson (1998), Chiang (2000), and many others.",
        "The other innovation of DOP was to take (in principle) all corpus fragments, of any size, rather than a small subset.",
        "This innovation has not become generally adopted yet: many approaches still work either with local trees, i.e. single level rules with limited means of information percolation, or with restricted fragments, as in Stochastic Tree-Adjoining Grammar (Schabes 1992; Chiang 2000) that do not include non-lexicalized fragments.",
        "However, during the last few years we can observe a shift towards using more and larger corpus fragments with fewer restrictions.",
        "While the models of Collins (1996) and Eisner (1996) restricted the fragments to the locality of head-words, later models showed the importance of including context from higher nodes in the tree (Charniak 1997; Johnson 1998a).",
        "The importance of including nonhead-words has become uncontroversial (e.g. Collins 1999; Charniak 2000; Goodman 1998).",
        "And Collins (2000) argues for \"keeping track of counts of arbitrary fragments within parse trees\", which has indeed been carried out in Collins and Duffy (2002) who use exactly the same set of (all) tree fragments as proposed in Bod (1992).",
        "Thus the major innovations of DOP are:",
        "1. the use of corpus fragments rather than grammar rules, 2. the use of arbitrarily large fragments rather than restricted ones",
        "Both have gained or are gaining wide usage, and are also becoming relevant for theoretical linguistics (see Bod et al.",
        "2003a).",
        "One instantiation of DOP which has received considerable interest is the model known as DOP1 (Bod 1992).",
        "DOP1 combines subtrees from a treebank by means of node-substitution and computes the probability of a tree from the normalized frequencies of the subtrees (see Section 2 for a full definition).",
        "Bod (1993) showed how standard parsing techniques can be applied to DOP1 by converting subtrees into rules.",
        "However, the problem of computing the most probable parse turns out to be NP-hard (Sima'an 1996), mainly because the same parse tree can be generated by exponentially many derivations.",
        "Many implementations of DOP1 therefore estimate the most probable parse by Monte Carlo techniques (Bod 1998; Chappelier & Rajman 2000), or by Viterbi «-best search (Bod 2001), or by restricting the set of subtrees (Sima'an 1999; Chappelier et al.",
        "2002).",
        "Sima'an (1995) gave an efficient algorithm for computing the parse tree generated by the most probable derivation, which in some cases is a reasonable approximation of the most probable parse.",
        "Goodman (1996, 1998) developed a polynomial time PCFG-reduction of DOP1 whose size is linear in the size of the training set, thus converting the exponential number of subtrees to a compact grammar.",
        "While Goodman's method does still not allow for an efficient computation of the most probable parse in DOP1, it does efficiently compute the \"maximum constituents parse\", i.e. the parse tree which is most likely to have the largest number of correct constituents.",
        "Johnson (1998b, 2002) showed that DOPl's subtree estimation method is statistically biased and inconsistent.",
        "Bod (2000a) solved this problem by training the subtree probabilities by a maximum likelihood procedure based on Expectation-Maximization.",
        "This resulted in a statistically consistent model dubbed ML-DOP.",
        "However, ML-DOP suffers from overlearning if the subtrees are trained on the same treebank trees as they are derived from.",
        "Cross-validation is needed to avoid this problem.",
        "But even with cross-validation, ML-DOP is outperformed by the much simpler DOP1 model on both the ATIS and OVIS treebanks (Bod 2000b).",
        "Bonnema et al.",
        "(1999) observed that another problem with DOPl's subtree-estimation method is that it provides more probability to nodes with more subtrees, and therefore more probability to larger subtrees.",
        "As an alternative, Bonnema et al.",
        "(1999) propose a subtree estimator which reduces the probability of a tree by a factor of two for each non-root non-terminal it contains.",
        "Bod (2001) used an alternative technique which samples a fixed number of subtrees of each depth and which has the effect of assigning roughly equal weight to each node in the training data.",
        "Although Bod's method obtains very competitive results on the Wall Street Journal (WSJ) task, the parsing time was reported to be over 200 seconds per sentence (Bod 2003).",
        "Collins & Duffy (2002) showed how the perceptron algorithm can be used to efficiently compute the best parse with DOPl's subtrees, reporting a 5.1% relative reduction in error rate over the model in Collins (1999) on the WSJ.",
        "Goodman (2002) furthermore showed how Bonnema et al.",
        "'s (1999) and Bod's (2001) estimators can be incorporated in his PCFG-reduction, but did not report any experiments with these reductions.",
        "This paper presents the first published results with Goodman's PCFG-reductions of both Bonnema et al.",
        "'s (1999) and Bod's (2001) estimators on the WSJ.",
        "We show that these PCFG-reductions result in a 60 times speedup in processing time w.r.t.",
        "Bod (2001, 2003).",
        "But while Bod's estimator obtains state-of-the-art results on the WSJ, comparable to Charniak (2000) and Collins (2000), Bonnema et al.",
        "'s estimator performs worse and is comparable to Collins (1996).",
        "In the second part of this paper, we extend our experiments with a new notion of the best parse tree.",
        "Most previous notions of best parse tree in D0P1 were based on a probabilistic metric, with Bod (2000b) as a notable exception, who used a simplicity metric based on the shortest derivation.",
        "We show that a combination of a probabilistic and a simplicity metric, which chooses the simplest parse from the n likeliest parses, outperforms the use of these metrics alone.",
        "Compared to Bod (2001), our results show an 11 % improvement in terms of relative error reduction and a speedup which reduces the processing time from 220 to 3.6 seconds per WSJ sentence."
      ]
    },
    {
      "heading": "2 PCFG-Reductions of DOP",
      "text": [
        "DOP1 parses new input by combining treebank-subtrees by means of a leftmost node-subsitution operation, indicated as °.",
        "The probability of a parse tree is computed from the occurrence-frequencies of the subtrees in the treebank.",
        "That is, the probability of a subtree t is taken as the number of occurrences of t in the training set, I 11, divided by the total number of occurrences of all subtrees f with the same root label as t. Let r(t) return the root label of t: The probability of a derivation t\\°...°tn is computed by the product of the probabilities of its subtrees tf An important feature of DOP1 is that there may be several derivations that generate the same parse tree.",
        "The probability of a parse tree T is the sum of the probabilities of its distinct derivations.",
        "Let tid be the /-th subtree in the derivation d that produces tree T, then the probability of T is given by Thus DOP1 considers counts of subtrees of a wide range of sizes in computing the probability of a tree: everything from counts of single-level rules to counts of entire trees.",
        "A disadvantage of this model is that an extremely large number of subtrees (and derivations) must be taken into account.",
        "Fortunately, there exists a compact PCFG-reduction of DOP 1 that generates the same trees with the same probabilities, as shown by Goodman (1996, 2002).",
        "Here we will only sketch this PCFG-reduction, which is heavily based on Goodman (2002).",
        "Goodman assigns every node in every tree a unique number which is called its address.",
        "The notation A@k denotes the node at address k where A is the nonterminal labeling that node.",
        "A new nonterminal is created for each node in the training data.",
        "This nonterminal is called A Nonterminals of this form are called \"interior\" nonterminals, while the original nonterminals in the parse trees are called \"exterior\" nontermimals.",
        "Ixt ay represent the number of subtrees headed by the node A@j.",
        "Let a represent the number of subtrees headed by nodes with nonterminal A, that is a = JLj aj.",
        "Goodman (1996, 2002) further illustrates this by a node A@j of the following form: To see how many subtrees it has, Goodman first considers the possibilities of the left branch.",
        "There are non-trivial subtrees headed by B@k, and there is also the trivial case where the left node is simply B.",
        "Thus there are + 1 different possibilities on the left branch.",
        "Similarly, there are ci + 1 possibilities on the right branch.",
        "We can create a subtree by choosing any possible left subtree and any possible right subtree.",
        "Thus, there are aj = (b]i+ l)(c/ + 1) possible subtrees headed by A@j. Goodman then gives a simple small PCFG with the following property: for every subtree in the training corpus headed by A, the grammar will generate an isomorphic subderivation with probability IIa.",
        "Thus, rather than using the large, explicit DOP1 model, one can also use this small PCFG that generates isomorphic derivations, with identical probabilities.",
        "Goodman's construction is as follows.",
        "For the node in figure 1, the following eight PCFG rules are generated, where the number in parentheses following a rule is its probability.",
        "Goodman then shows by simple induction that subderivations headed by A with external nonterminals at the roots and leaves, internal nonterminals elsewhere have probability 1/a.",
        "And subderivations headed by Aj with external nonterminals only at the leaves, internal nonterminals elsewhere, have probability 1/ay (Goodman 1996).",
        "Goodman's main theorem is that this construction produces PCFG derivations isomorphic to DOP derivations with equal probability.",
        "This means that summing up over derivations of a tree in DOP yields the same probability as summing over all the isomorphic derivations in the PCFG.",
        "Note that Goodman's reduction method does still not allow for an efficient computation of the most probable parse tree of a sentence: there may still be exponentially many derivations generating the same tree.",
        "But Goodman shows that with his PCFG-reduction he can efficiently compute the aforementioned maximum constituents parse.",
        "Moreover, Goodman's PCFG reduction may also be used to estimate the most probable parse by Viterbi n-best search which computes the n most likely derivations and then sums up the probabilities of the derivations producing the same tree.",
        "While Bod (2001) needed to use a very large sample from the WSJ subtrees to do this, Goodman's method can do the same job with a more compact grammar.",
        "DOP1 has a serious bias: its subtree estimator provides more probability to nodes with more subtrees (Bonnema et al.",
        "1999).",
        "The amount of probability given to two different training nodes depends on how many subtrees they have, and, given that the number of subtrees is an exponential function, this means that some training nodes could easily get hundreds or thousands of times the weight of others, even if both occur exactly once.",
        "Bonnema et al.",
        "(1999) show that as a consequence too much weight is given to larger subtrees, and that the parse accuracy of DOP1 deteriorates if (very) large subtrees are included.",
        "Although this property may not be very harmful for small corpora with relatively small trees, such as the ATIS, Bonnema et al.",
        "give evidence that it leads to severe biases for larger corpora such as the WSJ.",
        "There are several ways to fix this problem.",
        "For example, Bod (2001) samples a fixed number of subtrees of each depth, which has the effect of assigning roughly equal weight to each node in the training data, and roughly exponentially less probability for larger trees (see Goodman 2002: 12).",
        "Bod reports state-of-the-art results with this method, and observes no decrease in parse accuracy when larger subtrees are included (using subtrees up to depth 14).",
        "Yet, his grammar contains more than 5 million subtrees and processing times of over 200 seconds per WSJ sentence are reported (Bod 2003).",
        "In this paper, we will test a simple extension of Goodman's compact PCFG-reduction of DOP which has the same property as the normalization proposed in Bod (2001) in that it assigns roughly equal weight to each node in the training data.",
        "Let a be the number of times nonterminals of type A occur in the training data.",
        "Then we slightly modify the PCFG-reduction in figure 2 as follows: We will also test the proposal by Bonnema et al.",
        "(1999) which reduces the probability of a subtree by a factor of two for each non-root nonterminal it contains.",
        "It easy to see that this is equivalent to reducing the probability of a tree by a factor of four for each pair of nonterminals it contains, resulting in the PCFG reduction in figure 4.",
        "Tested on the OVIS corpus, Bonnema et al.",
        "'s proposal obtains results that are comparable to Sima'an (1999) -- see Bonnema et al.",
        "(1999).",
        "This paper presents the first published results with this estimator on the WSJ.",
        "By using these PCFG-reductions we can thus parse with all subtrees in polynomial time.",
        "However, as mentioned above, efficient parsing does not necessarily mean efficient disambiguation: the exact computation of the most probable parse remains exponential.",
        "In this paper, we will estimate the most probable parse by computing the 10,000 most probable derivations by means of Viterbi «-best, from which the most likely parse is estimated by summing up the probabilities of the derivations that generate the same parse."
      ]
    },
    {
      "heading": "3 A New Notion of the Best Parse Tree",
      "text": []
    },
    {
      "heading": "3.1 Two Criteria for the Best Parse Tree: Likelihood vs. Simplicity",
      "text": [
        "Most DOP models, such as in Bod (1993), Goodman (1996), Bonnema et al.",
        "(1997), Sima'an (2000) and Collins & Duffy (2002), use a likelihood criterion in defining the best parse tree: they take (some notion of) the most likely (i.e. most probable) tree as a candidate for the best tree of a sentence.",
        "We will refer to these models as Likelihood-DOP models, but in this paper we will specifically mean by \"Likelihood-DOP\" the PCFG-reduction of Bod (2001) given in Section 2.2.",
        "In Bod (2000b), an alternative notion for the best parse tree was proposed based on a simplicity criterion: instead of producing the most probable tree, this model produced the tree generated by the shortest derivation with the fewest training subtrees.",
        "We will refer to this model as Simplicity-DOP.",
        "In case the shortest derivation is not unique, Bod (2000b) proposes to back off to a frequency ordering of the subtrees.",
        "That is, all subtrees of each root label are assigned a rank according to their frequency in the treebank: the most frequent subtree (or subtrees) of each root label gets rank 1, the second most frequent subtree gets rank 2, etc.",
        "Next, the rank of each (shortest) derivation is computed as the sum of the ranks of the subtrees involved.",
        "The derivation with the smallest sum, or highest rank, is taken as the final best derivation producing the best parse tree in Simplicity-DOP.",
        "Although Bod (2000b) reports that Simplicity-DOP is outperformed by Likelihood-DOP, its results are still rather impressive for such a simple model.",
        "What is more important, is, that the best parse trees predicted by Simplicity-DOP are quite different from the best parse trees predicted by Likelihood-DOP.",
        "This suggests that a model which combines these two notions of best parse may boost the accuracy.",
        "Simplicity-DOP: SL-DOP & LS-DOP The underlying idea of combining Likelihood-DOP and Simplicity-DOP is that the parser selects the simplest tree from among the n most probable trees, where n is a free parameter.",
        "A straightforward alternative would be to select the most probable tree from among the n simplest trees.",
        "We will refer to the first combination (which selects the simplest among the n likeliest trees) as Simplicity-Likelihood-DOP or SL-DOP, and to the second combination (which selects the likeliest among the n simplest trees) as Likelihood-Simplicity-DOP or LS-DOP.",
        "Note that for n=l, SL-DOP is equal to Likelihood-DOP, since there is only one most probable tree to select from, and LS-DOP is equal to Simplicity-DOP, since there is only one simplest tree to select from.",
        "Moreover, if n gets large, SL-DOP converges to Simplicity-DOP while LS-DOP converges to Likelihood-DOP.",
        "By varying the parameter n, we will be able to compare Likelihood-DOP, Simplicity-DOP and several instantiations of SL-DOP and LS-DOP.",
        "Note that Goodman's PCFG-reduction method summarized in Section 2 applies not only to Likelihood-DOP but also to Simplicity-DOP.",
        "The only thing that needs to be changed for Simplicity-DOP is that all subtrees should be assigned equal probabilities.",
        "Then the shortest derivation is equal to the most probable derivation and can be computed by standard Viterbi optimization, which can be seen as follows: if each subtree has a probability p then the probability of a derivation involving n subtrees is equal to pn, and since 0<p<l, the derivation with the fewest subtrees has the greatest probability.",
        "For SL-DOP and LS-DOP, we first compute either n likeliest or n simplest trees by means of Viterbi optimization.",
        "Next, we either select the simplest tree among the n likeliest ones (for SL -DOP) or the likeliest tree among the n simplest ones (for LS-DOP).",
        "In our experiments, n will never be larger than 1,000."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "For our experiments we used the standard division of the WSJ (Marcus et al.",
        "1993), with sections 2 through 21 for training (approx.",
        "40,000 sentences) and section 23 for testing (2416 sentences < 100 words); section 22 was used as development set.",
        "As usual, all trees were stripped off their semantic tags, co-reference information and quotation marks.",
        "Without loss of generality, all trees were converted to binary branching (and were reconverted to nary trees after parsing).",
        "We employed the same unknown (category) word model as in Bod (2001), based on statistics on word-endings, hyphenation and capitalization in combination with Good-Turing (Bod 1998: 8587).",
        "We used \"evalb\" to compute the standard PARSEVAL scores for our results (Manning & Schütze 1999).",
        "We focused on the Labeled Precision (LP) and Labeled Recall (LR) scores, as these are commonly used to rank parsing systems.",
        "Our first experimental goal was to compare the two PCFG-reductions in Section 2.2, which we will refer to resp.",
        "as BodOl and Bon99.",
        "Table 1 gives the results of these experiments and compares them with some other statistical parsers (resp.",
        "Collins 1996, Charniak 1997, Collins 1999 and Charniak 2000).",
        "While the PCFG reduction of Bod (2001) obtains state-of-the-art results on the WSJ, comparable to Charniak (2000), Bonnema et al.",
        "'s estimator performs worse and is comparable to Collins (1996).",
        "As to the processing time, the PCFG reduction parses each sentence (< 100 words) in 3.6 seconds average, while the parser in Bod (2001, 2003), which uses over 5 million subtrees, is reported to take about 220 seconds per sentence.",
        "This corresponds to a speedup of over 60 times.",
        "It should be mentioned that the best precision and recall scores reported in Bod (2001) are slightly better than the ones reported here (the difference is only 0.2% for sentences < 100 words).",
        "This may be explained by the fact our best results in Bod (2001) were obtained by testing various subtree restrictions until the highest accuracy was obtained, while in the current experiment we used all subtrees as given by the PCFG-reduction.",
        "In the following section we will see that our new definition of best parse tree also outperforms the best results obtained in Bod (2001).",
        "Note that there is an increase in accuracy for both SL-DOP and LS-DOP if the value of n increases from 1 to 12.",
        "But while the accuracy of SL-DOP decreases after n=14 and converges to Simplicity-DOP, the accuracy of LS-DOP continues to increase and converges to Likelihood-DOP.",
        "The highest accuracy is obtained by SL-DOP at 12 < n < 14: an LP of 90.8% and an LR of 90.7%.",
        "This is roughly an 11% relative reduction in error rate over Charniak (2000) and Bod's PCFG-reduction reported in Table 1.",
        "Compared to the reranking technique in Collins (2000), who obtained an LP of 89.9% and an LR of 89.6%, our results show a 9% relative error rate reduction.",
        "While SL-DOP and LS-DOP have been compared before in Bod (2002), especially in the context of musical parsing, this paper presents the first results of SL-DOP and LS-DOP with a compact PCFG-reduction."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "The DOP approach is based on two distinctive features: (1) the use of corpus fragments rather than grammar rules, and (2) the use of arbitrarily large fragments rather than restricted ones.",
        "While the first feature has been generally adopted in statistical NLP, the second feature has for a long time been a serious bottleneck, as it results in exponential processing time when the most probable parse tree is computed.",
        "This paper showed that a PCFG-reduction of DOP in combination with a new notion of the best parse tree results in fast processing times and very competitive accuracy on the Wall Street Journal treebank.",
        "This paper also reaffirmed that the coarsegrained approach of using all subtrees from a treebank outperforms the fine-grained approach of specifically modeling lexical-syntactic dependencies (as e.g. in Collins 1999 and Charniak 2000)."
      ]
    }
  ]
}
