{
  "info": {
    "authors": [
      "Megan Moser",
      "Johanna D. Moore"
    ],
    "book": "Workshop on Intentionality and Structure in Discource Relations",
    "id": "acl-W93-0225",
    "title": "Investigating Discourse Relations",
    "url": "https://aclweb.org/anthology/W93-0225",
    "year": 1993
  },
  "references": [
    "acl-J86-3001",
    "acl-J92-4007",
    "acl-T78-1013"
  ],
  "sections": [
    {
      "text": [
        "In this paper, we present the theoretical foundations which underlie our current research.",
        "We emphasize a methodological point: connections among proposed theories of discourse structure must be carefully explicated.",
        "By making these connections, we can determine whether theories make equivalent claims, consistent but unrelated claims or differ in substantive issues.",
        "A synthesis of current theories is required, a descriptive framework which assumes the common ground and which highlights issues to be resolved.",
        "Further, there are two distinct factors to guide us in developing such a synthesis.",
        "First, the descriptive framework must facilitate the formulation of controversial issues in terms of empirical predictions.",
        "Then, the ,synthesis can be developed and refined by linguistic studies.",
        "Second, the framework must be applicable to computer processing of natural language, both understanding and generation.",
        "Our particular interest is the computer generation of explanations in a tutoring system.",
        "Ideally, the framework will provide a means through which the results of discourse analysis and computational linguistics can inform one another.",
        "In its broadest outline, the goal is to understand the precise interaction between features of form, meaning and function in the creation of discourse coherence.",
        "What kind of form, meaning and function links occur between utterances and how are these three kinds of links recognized?",
        "In a first step towards the synthesis we would like to see, we will discuss the perspective which the GXLS (Grosz and Sidner 1986) and RST (=Rhetorical Structure Theory, Mann and Thompson 1988) theories take on links of meaning and function.",
        "We conclude with a brief description of an empirical study suggested by this theory comparison.",
        "Note that we consider only monologic discourse at this time, believing generalizations between this and multi-agent discourse to be premature.",
        "In the study and discussion of rhetorical relations, the terminology has become nonstandard and confusing.",
        "Here, we adopt the term \"discourse relations\" to mean all tIme connections among the expressions in discourse which, taken together, account for its coherence.",
        "So, in order to be a discourse relation in the sense used here, two criteria are required.",
        "One, the relation concerns elements of a sentence utterance and other utterances in the context.",
        "Two, the relation must be recognized in order to understand the discourse, i.e., it contributes to coherence rather than another concern such as style.",
        "As suggested above, sonic feature of form, meaning or function defines a discourse relation.",
        "These will be termed textual, informational and intentional discourse relations respectively.",
        "Informational and intentional discourse relations are essentially non-linguistic in the sense that they do not originate with language.",
        "Mn`ch recent work on discourse relations either explicitly discusses or implictly uses a distinction between informational and intentional relations (Schiffrin 1987, Redeker 1990, Hovy and Maier 1992, Moore and Pollack 1992, Moser 1992, Sanders, Spooren and Noordman 1992, inter alia).",
        "The distinction, a kind of semantic-pragmatic distinction, concerns the source of discourse relations, whether a relation orginates with what is being talked about (informational) or with why we are talking about it (intentional).",
        "Informational discourse relations arise because the meanings of expressions in utterances, the things being talked about, stand in some relation in the domain of discourse.",
        "CAUSE, for example, is an informational relation because it is a relation between things that are being talked about, the fact of one situation or",
        "event causing another.",
        "Intentional relations, in contrast, concern how one span is intended to affect the hearer's mental attitude about another, i.e., why the speaker included some span of text.",
        "For example, the EVIDENCE relation holds between two text spans if one is intended to increase the hearer's belief in the other.",
        "G&S take a speaker's plan to be the source of discourse structure.",
        "A general intention may dominate several subintentions which may themselves be further refilled.",
        "At the bottom of the hierarchical structure are intentions which are realized by producing utterances in the discourse.",
        "Intentions higher in the intention structure are realized by the subintentions they dominate and, possibly, additional utterances which express the higher level intention.",
        "Intentions are related by dominance, when one intention generates one or more subintentions, or by satisfaction-precedence, when the realization of one intention is a. precondition for the realization of another.",
        "In this theory, spans of text are related indirectly by the relations between the intentions they realize.",
        "In the original formulation of R,ST, the informational-intentional distinction was noted (there called \"subject matter\" and \"presentational\" relations), but wa.s not fully appreciated.",
        "Text is hierarchically structured and exactly one RST relation is postulated between contiguous spans.",
        "Moore and Pollack (1992) propose that, in fact, two contiguous spans of text may be in both an informational and an intentional relation simultaneously and that recognition of one kind of relation can facilitate recognition of the other.",
        "They note that intentional relations arise because \"consecutive discourse elements are related to one another by means of the ways in which they Participate in [a speaker's] plan.\" (p. 2).",
        "An intentional relation indicates both a direction of effect and a kind of effect.",
        "Both elements of an intentional relation in R.ST correspond to elements in the relations among intentions in G,V,S.",
        "First of all, one span is contributed with the intention of affecting the purpose of another span.",
        "In the original RST with only a single relation between spans, the direction of the relation (from satellite to nucleus) always represented the direction of effect.",
        "In introducing simultaneous intentional and informational relations, nuclea,rity is an aspect of intentional relations only.",
        "The direction of an intentional relation in RST corresponds to dominance in GkS.",
        "That is, the satellite span, S, affects the purpose of the nucleus span, N, only if the intention that S realizes is dominated by the intention that S and N (and possibly others) realize together.",
        "Second of all, in R,ST, one span is intended to affect another in one of several ways.",
        "For example, a satellite span, S, may be intended to affect a, hearer's belief in the nucleus span, N, (the EVIDENCE relation); or S may be intended to affect a hearer's desire to perform the action indicated by N (the MOTIVATION relation).",
        "Correspondingly in GkS, intentions of various kinds may dominate other intentions.",
        "Roughly speaking, intentions realized by speaking are to either affect a hearer's beliefs or her actions.",
        "An R.ST EVIDENCE relation can occur only when the dominating intention is to affect another's belief.",
        "Similarly, an RST MOTIVATION relation can occur only when the dominating intention is to affect another's action.",
        "Thus the different kinds of intentional effects in RST correspond to different kinds of dominating intentions in G&S. However, R.ST makes more distinctions among kinds of effects than G&S, e.g., both EVIDENCE and JUSTIFICATION are ways of affecting beliefs and both MOTIVATION and ENABLEMENT are ways of affecting actions.",
        "Now we turn to the status of informational relations in the two theories.",
        "In R.ST, a single informational relation is assigned between spans of text.",
        "As a, result, R.ST informational relations concern the sorts of entities denoted by entire spans, such as situations and events.",
        "If we adopt the view of Moore and Pollack, recognizing that, informational and intentional relations occur simultaneously, the informational relations are simplified.",
        "As noted above, nuclearity, which was an element of the unique R,ST relation between spans N and 5, is now an element, of the intentional relation and is independent of the informational relation.",
        "That is, informational relations no longer conflate the semantic link between situations expressed by two spans and the dominance of speaker",
        "intentions realized by those spans.",
        "In fact, without this conflation, it is unclear whether the semantic relations between situations and events is in principle different from semantic links between other kinds of entities.",
        "Is the informational relation between two spans of text necessarily a, relation between the entire spans?",
        "Or, is it possible that the informational relation is a series of links between various expressions contained in the spans?",
        "Examples of these links between smaller constituents are would are coreference and a causal link between expressions such as \"run a red light\" and \"the ticket.\" GkS stresses that intentions of the speaker are the primary source of discourmr structure.",
        "Domain knowledge plays a role in recognizing the intentional structure, but it is doubtful whether any special distinction would be made between knowledge about events and situations and knowledge about other kinds of domain entities.",
        "In comparing the status of intentional and informational discourse relations in both R.ST and GkS, at least two issues were specified whose resolution is currently presumed by both theories in isolation.",
        "First, what types of dominance are distinguished by the theory – just dominance, dominance by belief-affecting intention versus dominance by action-affecting intention, or the full range of RST intentional relations?",
        "Second, do semantic links between whole spans of text play a. role in the theory, or do semantic relations between all sorts of entities have the same status?",
        "Both these questions can be answered separately depending on whether they are meant as a question about linguistic theory or about its application to language processing.",
        "Space precludes a discussion of textual discourse relations a.s yell a,s questions about how the three kinds of relations interact.",
        "Further, proposals from linguists (Schiffrin 1987; Redeker 1992) must be integrated into the synthesis.",
        "We conclude by sketching a discourse analysis study which begins to address the first question cited above, one which we plan to do.",
        "Using a broad range of text types, we select as tokens the pairs of spans that are related by lexical markers of discourse relations such as \"so,\" \"because\" and \"therefore.\" For each token, we code the informational and intentional relations that co-occur with it.",
        "As emphasized by Moore and Paris (1992), there is not a one-to-one mapping between intentional and informational relations.",
        "Though not completely independent, the possibilities for informational relations given the occurrence of a patticular intentional relation are rurally, and vice versa.",
        "By investigating the range of combinations of informational and intentional relations which occur with a lexical marker, we can identify the minimal description of the marker in terms of discourse relations.",
        "That is, we can see whether a. marker correlates highly with a particular disconrse relation or combination of informational and intentional relations.",
        "Such a. study will produce results that are useful for computational models of both natural language understanding and generation.",
        "If a certain marker correlates highly with certain discourse relations, the understander can form hypotheses about the discourse relations that are present when it encounters a. marker.",
        "Similarly, if a generator must express two utterances connected by a. certain combination of relations, it can use the information about the correlation between markers and combinations of discourse relations to choose the most appropriate marker.",
        "In addition, this study will allow us to determine whether the distinction among types of dominance plays a. role in accounting for the distribution of markers.",
        "If the study confirms the relevance of this distinction, then dominance types have a role to play in a. linguistic theory of discourse coherence.",
        "If the study does not confirm the distinction, a. crucial theoretical question is whether there is any direct formal linguistic pattern other than these markers that makes essential use of dominance types in its description.",
        "Should further research fail to identify such a pattern, then the status of dominance types in linguistic theory is called into question.",
        "However, even if it turns out that dominance types are not formally marked by language, it remains an open question whether their application to computer generation and understanding will be useful."
      ]
    }
  ]
}
