{
  "info": {
    "authors": [
      "Vito Pirrelli",
      "Stefano Federici"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1037",
    "title": "\"Derivational\" Paradigms in Morphonology",
    "url": "https://aclweb.org/anthology/C94-1037",
    "year": 1994
  },
  "references": [
    "acl-E89-1008"
  ],
  "sections": [
    {
      "heading": "INTRODUCTION.",
      "text": [
        "Traditionally, paradigms were used to deal with inflection in inflectionally rich languages.",
        "Only recently (Calder, 1989; Carstairs-McCarthy, 1988, 1992) paradigms have been the object of a far-reaching investigation covering their formal and computational properties.",
        "This investigation has highligthed the significance of a paradigm-based treatment of morphonological phenomena and its theoretical implications.",
        "In this paper, we show how derivational processes in Morphology can be treated paradigmatically by• using a morphonological network.",
        "The approach is not only theoretical speculation but has been subjected to the practical test of a computer implementation.",
        "This implementation leads, in our opinion, to a conceptually and computationally cleaner treatment of Morphonology."
      ]
    },
    {
      "heading": "1 THE PROBLEM.",
      "text": [
        "There are two basic ways to relate a pair of morphonological representations derivationally: 1) to take either of them as basic, and derive the other from it via a process of rule-governed phonological change (Fig.1 below); 2) to assume a third representation (somewhat intermediate between the two) as underlying, and make the other two derive from it either by substitution of some phonological segments, or by tilling in an underspecitied phonological representation (Fig.2 below).",
        "Hereafter, we will refer to both I) and 2) as derivational accounts of morphonological relations.",
        "Usually, solution 1 stores the basic form only in the lexicon, while the derivative is, as it were, cranked out on demand by rule application I.",
        "On the other hand, solution 2 requires that only one underlying, abstract representation be stored in the lexicon: the two related forms arc yielded from their common lexical source by rules.",
        "If b and c are the morphonological representations to relate, the two approaches can be illustrated as shown in Figg.",
        "I and 2.",
        "In Fig.1, b and c are taken to he on a different footing: the form at the top is more basic than the one at the bottom, the arrow indicating a derivational relation.",
        "The following assumption is made: given two forms to relate, it is always possible to specify the direction of the arrow.",
        "This assumption stumbles upon a number of difficulties.",
        "Let us consider a small hut crucial portion of English segmental Phonology as classically analysed since Chomsky and Halle (1968).",
        "First, schwa is well known to alternate with full vowels within the Phonology of English.",
        "Derivational series such as in Fig.3 below show that full vowels under stress correspond to schwas in unstressed positions.",
        "[lowtogrmf] / [fowto'grmfik] / [f 't o gro fi] Fig. 3 derivational alternations This alternation is captured by a rule of vowel reduction: full vowels are reduced to schwa in unstressed position (e.g., he/ -> schwa in photography).",
        "Another systematic phonological alternation in English involves derivational pairs such as sane-sanity (rscjnYrsamili1), which strongly suggest a derivational rule like ej -> te.",
        "However, other alternations appear to go in the opposite direction.",
        "For example in a triple like marginal I Alternatively, both representations can be stored in the Lexicon, and related through the statement of some redundancy lexical rule (Jackendoff, 1975).",
        "c) prof nditi",
        "/marginality/ marginalia, the following alternation in the underlined vowel emerges: schwandej.",
        "If we posit hc/ as underlying, then we end up having to set up an he/ -> /ej/ change, which is the mirror-image of the /ej/->he/ relation posited for the derivational pair r'sejn1/1:sieniti1 (more on this in Durand, 1990).",
        "The solution illustrated in Fig.2 above is a way to solve this apparent paradox.",
        "A third abstract segment hel is assumed to be basic relative to /schwa/te/cj/.",
        "This means that /schwahe/ej/ can be derived from he:/ through application of some phonological rules.",
        "A derivational chain of this sort can be rather complex, since hel and /ej/ are, phonologically, far removed from each other, and many intermediate changes can he needed (as in l'saiml -> -> l'sejnl; sec Italie and Mohanan, (1985) for more examples).",
        "More reservations on chains of this sort have been expressed recently in a series of psycholinguistic experiments, aimed at probing the reality of the derivational assumptions (Jaeger, 1986; Wang and Derwing, 1986).",
        "In the literature, an altogether different approach from both derivational accounts 1) and 2) above has been suggested (Vennemann, 1974): b and e should simply be listed in the Lexicon, one beside the other, on a par: pro 'fawnd .4111 pr o'f A nditi Fig. 4 morphonological relations and lexical listing Formulated in this way, the relation in Fig.4 is always \"true on the surface\", since there is no abstract representation involved in this account.",
        "Moreover, no rule ordering problems arise (i.e., concerning the direction of the arrow).",
        "IF the solution in l7ig.4 is adopted, however, it is not at all clear what type of lexical architecture one is suggesting: i.e., it is moot whether b and c are somehow related in the lexicon, or they arc simply listed together.",
        "More worringly, the notion \"true on the surface\" is of little theoretical help lior explaining some well-known cases of alternation.",
        "Take, for example, the opposition between the American English pronunciation of writer and rider, respectively /rajFer/ and hia:j1-eil, where both /t/ and /d/ have been turned into a flap (Ill).",
        "If the only difference between the two phonological realizations is the surface-true lengthening of /a/ in /ra:Ter/, then one is missing the relation between vowel length and the verbal bases of the two derivatives, a relation that represents an important, productive generalization within the American English phonological system (Durand, 1990).",
        "An American English speaker, when asked to derive a new agentive in er from verbs ending in It!, will produce flapping with no lengthening.",
        "In contrast, (s)he will produce both a lengthened vowel and a flap if the base is a verb ending in /d/.",
        "Derivational accounts capture this generalization in an elegant way, through rule ordering: vowel lengthening takes place before flapping does, in the context \"vowel followed by a voiced consonant\", so that when either /t/ or /d/ disappears, lengthening has already applied (or tinted to).",
        "In contrast, accounts based on lexical listing are clearly incapable of grasping this significant hidden relation, since the opposition between /t/ and /d/ is no longer true on the surface in pairs such as /rajl ier/ vs /ra:jl'er/, where the opposition is neutralized by a flap.",
        "To sum up, derivational accounts of morphonological alternations face a number of theoretical and practical problems.",
        "In what follows, we will illustrate the working of a set of analogy-based principles and the design of a general parallel architecture for their implementation.",
        "These principles dispense with both rule ordering and surface untrue representations by using paradigms of alternations instead of derivational chains.",
        "\"l'he implemented architecture proves to be accurate and computationally efficient."
      ]
    },
    {
      "heading": "2 THE GENERAL MODEL.",
      "text": [
        "In this section the idea is illustrated that redundancies among linguistic data can he used to convey interesting linguistic generalizations if data are stored in an incremental network.",
        "I,ct us consider the general case first, exemplified by the following list of abstract cases and their categorial classification:",
        "Suppose that the sequence of numerals 13 7 represents the form of a linguistic object (say a word); x is its category.",
        "We can represent these data by exploiting the redundancies that they show at both the formal and categorial level of description as follows: Fig. 5 a formal core and its category The idea is to interconnect all forms classified the same way by letting them share a common formal core if there is any (for a rigorous definition of the notion of formal core, see Pirrelli, 1993).",
        "In Fig.5, -37 is the formal core.",
        "A core with its category (x in the example at hand) is called a nucleus.",
        "The graph in iiig.5 can be seen as a network of nodes.",
        "Nodes which are linked through a solid line have been witnessed in input as co-occurring in the same lmn.",
        "Nodes which are not linked do not co-occur.",
        "Moreover, if two nodes alternate, that is if they arc in complementary distribution with respect to a shared core, they occupy the same column in the figure.",
        "In other words, nodes on the same column in Fig.5 are mutually exclusive, paradigmatically related alternations.",
        "Let us consider now how this network can be used to associate forms with categories.",
        "Assume that more data have been stored in the network so that the configuration shown in Fig.6 overleaf is built up.",
        "In Fig.6 a is another possible category (different from x), and 38 <=> a another nUeleus.",
        "Given a network like this, network cores are activated by an input string if they are contained by it.",
        "The network output will then be the category associated with the activated core.",
        "<=> x",
        "<=> x then picked up; 2b) there are at least two cores which are fully activated.",
        "2a) can be seen as a degenerate case of I) above, when AcR I.",
        "As to 2b), in this case the activation ratio is clearly no longer conclusive.",
        "One needs to gauge a further ratio, called Analogy Ratio, whose definition follows: <=> 0 total number of numerals in the activated core total number of numerals in input Pig.",
        "6 rival cores in a multicategory network More concretely, if a certain form, say 437, is given as input to the network, the system tries to guess the right category on the basis of the analogy of 437 (called the target string) with already stored items (called base strings).",
        "This is carried out through the following steps.",
        "Network cores arc activated by 437: this is done through a simple string-matching routine2.",
        "For example, 37 will be activated, and its category x is a candidate response of the system for the input 437.",
        "What happens when more than one core gets activated by the same input token?",
        "If the activated cores have the same category, the corresponding multiple responses would reinforce each other: the only category activated is given as output.",
        "The case of multiple responses with different categories (and thus potentially different outputs) is more complex.",
        "We can distinguish two cases: I) there is no core which is fully activated 2) there is at least one fully activated core.",
        "A core is fully activated when it is entirely contained by the input string: in the example above 437 fully activates the core -37.",
        "This contrasts with partial activation, when the core is only partially contained by the input string: for example, 437 partially activates the core -38 of Fig.6 above, since it contains 3 in the second position, but not 8 in the third.",
        "Let us consider case I) above first.",
        "If there is no core which is fully activated, then the system goes through the following two steps: Ia) for each candidate response, the system gauges an Activation Ratio: number of numerals of the activated core contained in input total number of numerals in the activated core The activation ratio (AcR) is then 0 < AcR S I.",
        "The case of full activation (AcR= 1) is dealt with in 2); 1b) the core with the highest AcR wins out over the others.",
        "Let us consider now ease 2).",
        "If there exists at least one fully activated core, then two further subcases need be distinguished: 2a) there is only one core which is fully activated: the category borne out by that core is 2 More on string-matching will he said in section 4 of this paper.",
        "Again, the analogy ratio (AnR) is 0 < AnR 13.",
        "To sum up, a certain pattern is analogically activated if the following conditions are met in this order: I) it is activated by an input pair",
        "2) it has got the highest activation ratio 3) it has got the highest analogy ratio",
        "So far, we have been assuming that the network produces cores incrementally as more data are input.",
        "In fact, the network progressively extracts reduced cores.",
        "Fitch full form is already a core in its own right, otherwise it would never get activated.",
        "The extraction of smaller cores represents the process of acquiring generalizations on the basis of the analogy between data (redundancies).",
        "In the network, an exception is simply an isolated case, that is a nucleus which is fully activated only when it is witnessed in input in its entirety (AnR = I)."
      ]
    },
    {
      "heading": "3 AN ANALOGY-BASED NETWORK FOR THE SYNTHESIS OF MORPHON-°LOGICAL ALTERNATIONS.",
      "text": [
        "How is it possible to model the synthesis of the set of systematic alternations illustrated in section 1 by means of a network such as the one in Fig.6?",
        "Fig.7-a) overleaf illustrates the result of storing four phonological representations, namely I'vejnI (vane), rseinl (sane), I'vamitil (vanity) and Itmenitil (inanity), plus an (abstract) categorial feature string (instead of an atom) for each of them: respectively xo, yo„tj and zj.",
        "1:.ach categorial feature string is supposed to contain lex ico-semantie information (e.g., a capsule representation of the meaning of the relevant lemma) and morphosyntactic information (such as grammatical category, gender, number, tense etc.",
        "): the content of the feature string, however, will he relatively neglected here.",
        "The machinery of core reduction outlined above obtains for categorial feature strings as well as for their forms.",
        "venitill and lejrid are formal cores; x, i and o are categorial cores.",
        "In Fig.7-b) the arrows between 15-1 and kenitil, and y and j, pictures an instance of paradigm extension.",
        "Paradigm extension is based on an intuitive idea: if sone shares with vane one nucleus, then it is expected to share all other paradigmatically-related nuclei.",
        "This may not always he true, but is certainly a governing principle in the theory of paradigms.",
        "For example, when faced with an unknown 0-ending adjectival form such as obsoleto 'obsolete'), an Italian speaker would also predict that obsolete is feminine singular, obsoleti masculine plural, obsolete feminine plural, according to the paradigm of lour-way adjectives in Italian (Matthews, 1992).",
        "By the same token, the extension in Eig.7-b) above represents the expectation that the nominalization of sane is f'sa:nitil, by paradigmatic analogy with Computationally, this extension is implemented as a continuous path of inter-node connections (say from to kenitili through [ejnl and Ivi in Fig:7-h).",
        "it Flapping and lengthening, in the American English pronunciation of writer and rider, can be represented in analogical terms by the two diagrams in Eig.8.",
        "There, we have represented the pronunciation of writer and rider in two separate analogical patterns, respectively i) (without lengthening), and ii) (with lengthening).",
        "In fact, i) and ii) should be merged into the same larger pattern.",
        "However, it quickly becomes impossible to picture multidimensional links on a page.",
        "Eig.8-i is the result of the exposure of the network to the following lour word forms: Irajt1 (write), lrajl'erl (write?",
        "), I fail' erl (fighter) and IlajtI (light).",
        "Inch word form is given with its categorial feature string: xk for [rail], xo for [raj 1 er], yo for 'fail 'erl and wk for llajtj.",
        "Eig.8-ii is what the system yields when it conies across the following three word forms: Iga:j1-erl (quieter), Iga:jcil (guide) and Ira:jd1 (ride).",
        "Again, forms arc given with their categorial string: jo for lga:jl'erl, jk for Iga:jdl and zk for Ira:j(11.",
        "The reader will note that formal cores are parasitic on phonological redundancies, since cores are extracted on the basis of systematic surface-true analogies between morphonological representations.",
        "The difference between suppletion and (semi)regular alternations is easily captured: (semi)regular alternations exploit cores more systematically than do suppletive alternations.",
        "Moreover, the structure of the analogical network makes it possible to express hidden phonological constraints as paradigms of phonological alternations.",
        "This allows the system to avoid the questionable use of surface untrue, underlying phonological representations, typical of derivational accounts (as in Fig.2 above).",
        "To make the last two points clearer, let us turn to a concrete instance of word synthesis by analogy.",
        "A typical objection levelled at representations which treat alternations by' listing them, is that crude lists of stored items do not make a clear distinction between regular alternations and irregular ones.",
        "Given a raw list of eases, it is objected, nothing can he predicted from such a list, in touch the same way as nothing can be predicted from - say the suppletive alternation go/went i) Eig.",
        "8 rival paradigms in a morphonological 1:ig.",
        "9 word synthesis through morphonological network paradigms",
        "However, paradigmatic extension accounts for the Pact that napping is a productive alternation in American English.",
        "Let us suppose that the system has to produce the agentive nominalization (lighter) of ['lajt] , whose surface form and lexical content has been already stored in the network (Fig.9-i above).",
        "A flap (with no lengthening) would then automatically appear in the place of surface [-t], according to the following steps: a) the input conditions are represented by the lexical content of the verb light (w in Fig.9-i), and the categorial information \"agentive nominalization\" (o in Fig.9); b) w activates the [I] of Pajti in the paradigm i) of Fig.9 above; c) the activated core a triggers the flap alternation [-ajLer] of word-final [-ail] in Fig.9-i, and the alternation [a:jFer] of word final [-a:jd] in Fig.9-ii; d) the form ['lajFer] is thus produced, since there is a path of pradigmatic links between [1] and [ajr er], while there being no such a path linking [1] and the alternation [a:jFer] by paradigm extension.",
        "It should be noted that only (semi)regular alternations share some (sub)core(s) in common.",
        "Suppletions such as go/went simply do not.",
        "Nevertheless, no clear-cut distinction is drawn here between minor alternations and irregular forms, since all of them are simply stored in an analogy-based network.",
        "Their difference is accounted for in terms of a gradation, defined by the fact that regular alternations overlap with other forms more extensively than do suppletions.",
        "We believe that this solution is empirically superior to the Anaximander's principle invoked by Hudson (1974), to the effect that, since there exists no clear-cut distinction between suppletions and systematic alternations, all of them should be listed in the lexicon."
      ]
    },
    {
      "heading": "4 LIMITS OF THE MODEL AND FURTHER IMPROVEMENTS.",
      "text": [
        "The network has been implemented in C, and proved to be 95% accurate in analysis after a training on 20,000 Italian word forms, and 75% accurate in synthesis, as reported in Pirrelli and Federici (1991).",
        "These performances have been obtained by using the simplified model illustrated here.",
        "It should be noted, however, that this model works well for the Morphology of those languages (such as Italian and English) where affixation is commonly realized through a concatenativc operation (suffixation or prefixation).",
        "In these cases, string-matching is a fairly simple head-and-tail operation.",
        "Clearly, this model is far from having a universal, cross-linguistic validity though.",
        "For example, it does not work well with cases of circumfixation (known also as parasynthesis), let alone the Morphology of nonconcatenative languages.",
        "Nevertheless, we contend that the set of analogy-based principles illustrated here hold for a wider spectrum of languages than purely concatenative ones: by making string-matching a more flexible and powerful operation, we can successfully adapt our model to the requirements of noncatenative languages such as Arahic, or to the treatment of discontinuous affixation.",
        "What follows sketchily illustrates this line of development.",
        "Given two strings of characters/phonemes to match (called the base and the target string), the new string-matching algorithm (discontinuous string-matching) we are currently experimenting on is, informally: start from the left corner of both the target and base string and scan them rightwards; extract, down the way, all characters/phonemes which appear in both, and in the same order.",
        "Take the Italian word forms [inve'k:jare] (invecchiare, English 'to age' a parasynthetic verbal derivative of the adjective vecchio, 'old'4) and (intimidire, English 'to make shy, intimidate', a parasynthetic derivative of timid°, 'timid, shy), or the Arabic pair Ikulaybi ('little dog') and [kali)] ('dog') in the diagrams in Fig.10.",
        "In the Arabic example, the shared portion of meaning (DOG) triggers the extraction of a tentative core (a stem).",
        "13y using a discontinuous string-matching, the meaning DOG is associated with the match k_lb.",
        "The remaining portions of morphological features of the Iwo word forms are respectively associated with the substrings left out of the match.",
        "Note that the two a's which arc linked by a dotted line will not he extracted in the same pattern as k_ lb, since they are ordered differently relative to the position of I (in the top string, a follows I, while in the bottom string, a precedes it).",
        "In the Italian example, the shared morphological feature infinitive triggers the extraction of.",
        "the circumfix [in re].",
        "kulayb Ay kalb Fig.",
        "II) the use of discontinuous string-matching in Italian and Arabic.",
        "Discontinuous string-matching captures an important range of phenomena which would be treated clumsily by using a simple head-and-tail matching.",
        "A further advantage of this routine over even more unconstrained conceivable routines is that it reduces considerably the number of candidate matches.",
        "On the more negative side, we are not able to find matches whose order in the base string is interchanged relative to the order in the target, as in English urn-re-do and re-tot-pack in Fig.] 1-a) overleaf.",
        "This by no means implies that phenomena such as so-called inversion or metathesis, as in the Rotuman example of Fig.11-b) overleaf, are beyond the reach of our approach.",
        "The idea is that a match is extracted only when a base and a target string show the same order of interchangeable characters, as in Fig.11-c) overleaf.",
        "The productive morphological relation between, say, pa and ap in the word 'pigeon' in Rotuman is accounted for paradigmatically, as explained in section 3 of this paper.",
        "Intuitively, we do not say that a sequence pa is transformed into ap under 4 We depart, here, from Scalise's analysis of invecchiare as the product of the sequential application of a suffix [- arc] and a prefix lin-1 in this order (Scalise, 1983).",
        "inve'k:jare intimi'dire",
        "particular circumstances.",
        "Rather, the sequence pa alternates with the sequence op within a certain paradigm."
      ]
    },
    {
      "heading": "5 CONCLUSIONS.",
      "text": [
        "The architecture illustrated here can be looked at tis a model of the morphonological competence of a native speaker, and functions both in analysis and generation.",
        "At this point, a question naturally arises: is it a lexicon or a grammar?",
        "In our opinion, it is both: a sell-modelling lexicon which extracts generalizations on the basis of the analogies between already storm items, and uses these generalizations as repair strategies for lack of direct evidence provided by an already stored item.",
        "This interpenetration of lexicon and grammar offers a few advantages in dealing with the problem at hand: - phonological concreteness of lexical representations: known lexical items are given a full surface phonological representation in the lexical network: no abstract phonological segments such as Ite:I in the phonological representation of profound in Fig.2 are needed ; - alternations vs deletions and inversions: changes in the phonological structure of a given entry are always expressed as alternations, never as deletions; this has the obvious implication that all alternating segments are encoded in the network and can be retrieved at any time: e.g., one does not say that flapping makes a dental disappear, but that flapping can appear only in those paradigmatic contexts where a dental is also present; this limits the computational power of the required rule set considerably, since deletive rules are computationally most costly; moreover, by treating cases of metathesis paradigmatically, the system further spares the computational price of a transformational operation such as inversion.",
        "- unordered rules: the context for a given phonological change to take place can be specified in terms of a whole paradigm; this formulation has the immediate advantage of avoiding the need for rule-ordering: for example, the fact that writer in the American-English pronunciation has no lengthened Iaj is traditionally accounted for by ordering vowel lengthening before flapping; this move is no longer needed as long as one can restrict the application of vowel lengthening lo the paradigm of those nuclei which present ltejl in the base form of a verb, as we showed above; - phonological concreteness of extracted generalizations: phonological generalizations are expressed in terms of extracted nuclei; nuclei represent what is shared by two (or more) stored items; it follows that no phonological features appear in extracted nuclei other than those which occur in the surface representations front winch nuclei are derived; - use of direct evidence: as we saw, smaller nuclei (morphemes) come into play as repair strategies only; that is, if and only if there exists no whole lexical representation (an already known word) which matches either the input (in analysis) or the output (in generation) in its entirety; otherwise, bigger nuclei always override smaller ones; this accounts for phenomena of lexical blocking (Arotiolf, 1976), when say - the word business is never interpreted as the 'quality of being busy'.",
        "From a more dynamic perspective the network illustrated above can be seen as an abstract model of the gradual learning of morphonological phenomena by a speaker.",
        "In fact, the principles illustrated above were originally developed as principles informing machine language learning as such (Federici, 1990), and tested in dealing with some complex cases of unsupervised acquisition of particular linguistic capabilities (e.g., in tasks of hi-lingual translation).",
        "Research carried out in this paper proves that morphonological phenomena are within the grasp of these learning principles.",
        "This represents an important a-posteriori confirmation of the validity of the integration between models of machine learning tind computational models of linguistic competence, an integration that has already shown its merits in cognitive approaches to language learning and linguistic theorizing (Pinker, 1989; Carstairs-McCarthy and Stemherger, 1988)."
      ]
    },
    {
      "heading": "REFERENCES.",
      "text": []
    },
    {
      "heading": "Lexicon",
      "text": []
    }
  ]
}
