{
  "info": {
    "authors": [
      "Tim Fernando"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E99-1012",
    "title": "Ambiguous Propositions Typed",
    "url": "https://aclweb.org/anthology/E99-1012",
    "year": 1999
  },
  "references": [
    "acl-E93-1013",
    "acl-P92-1005"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Ambiguous propositions are analyzed in a type system where disambiguation is effected during assembly (i.e. by coercion).",
        "Ambiguity is introduced through a layer of types that are underspecified relative to a preexisting collection of dependent types, construed as unambiguous propositions.",
        "A simple system of reasoning directly with such underspecification is described, and shown to be sound and complete for the full range of disambiguations.",
        "Beyond erasing types, the system supports constraints on disambiguations, including covariation."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "A widely held view expressed in (Carbonell and Hayes, 1987) is that \"if there were one word to describe why natural language processing is hard, it is ambiguity.\" For any given natural language utterance, a formal language such as predicate logic typically offers several non-equivalent (well- formed) formulas as possible translations.",
        "An obvious approach is to take the disjunction of all alternatives, assuming (for the sake of the argument) that the disjunction is a formula.",
        "Even if it were, however, various objections have been raised against this proposal (e.g. (Deemter, 1996)).",
        "For the purposes of the present paper, what is interesting about a word, phrase, sentence or discourse that is ambiguous in isolation is how it may get disambiguated when combined with other expressions (or, more generally, when placed in a wider context); the challenge for any theory of ambiguity is to throw light on that process of disambiguation.",
        "*From June to mid-August 1999, I will be visiting IMS, Uni Stuttgart, Azenbergstr 12, 70174 Stuttgart, Germany.",
        "Where I might be after that is unclear.",
        "More concretely, suppose were a binary connective on propositions A and B such that A B is a proposition ambiguous between A and B.",
        "Under the \"propositions-as-types\" paradigm (e.g. (Girard et al., 1989)) identifying proofs of a proposition with programs of the corresponding type (so that \"t: A\" can be read as t is a proof of proposition A, or equivalently, t is a program of type A), disambiguation may take the form of type coercion.",
        "An instructive example with r as the context",
        "Evidently, there is something conjunctive (never mind disjunctive) about .",
        "; but beyond the question as to whether the unambiguous propositions constituting the possible readings of an ambiguous proposition form a conjunctive or disjunctive set (whatever that may precisely mean), there is also the matter of the interconnected choices from such sets, mediated by terms such as p.,(x) and q.",
        "(y).",
        "To ground these abstract considerations in natural language processing, a few words about how to think of the terms t and types A are useful.",
        "For predicate logic formulas A, the terms t might be intuitionistic natural deduction proofs, related by the Curry-Howard isomorphism to a suitable typed A-calculus.",
        "A notable innovation made in Intuitionistic Type Theory (ITT, (Martin-Laf,",
        "1984)) is to allow proofs to enter into judgments of well-formedness (propositionhood).",
        "This stands in sharp contrast to ordinary predicate logic (be it intuitionistic or classical), where well-formedness is a trivial matter taken for granted (rather than analyzed) by the Curry-Howard isomorphism.",
        "For a natural language, however, it is well-formedness that is addressed by building types A over sentences, nouns, etc (in categorial grammar; e.g. (Morrill, 1994)) or LFG f-structures (in the \"glue\" approach, (Dalrymple et al., 1993; Dalrymple et al., 1997)).",
        "Now, while ITT's rules for propositionhood hardly constitute an account of grammaticality in English, the combination (in ITT) of assertions of well-formedness (A type) and theoremhood (t: A) reintroduces matters of information content (over and above grammatical form), which have been applied in (Ranta, 1994) (among other places) to discourse semantics (in particular, anaphora).",
        "The present paper assumes the machinery of dependent functions and sums in ITT, without choosing between grammatical and semantic applications.",
        "In both cases, what ambiguity contributes to the pot is indeterminacy in typing, the intuition being that an expression is ambiguous to the extent that its typing is indeterminate.",
        "That said, let us return to (1) and consider how to capture sequent inferences such as r I x : (A --+ B) Cr I y:D A F H ap(p.(x), q.",
        "(y)): B and more complicated cases from iterated applications of., nested among other type constructs.",
        "The idea developed below is to set aside the connective (as well as notational clutter p., 4.",
        "), and to step up from assertions t : A to (roughly) t :: A, where A is a set of types A (roughly, t : A : A).",
        "For instance, a direct transcription of the -*-introduction rule into :: is",
        "where A B abbreviates the set {A ->BIAEAandBEB}.",
        "But what exactly could t:: A mean?",
        "The disjunctive conception t:: A if t: A for some A E A(3) would have as a consequence the implication t :: A and A C B implies t :: B.",
        "Now, if combinatorial explosion is a problem for ambiguity, then surely we ought to avoid feeding it with cases of spurious ambiguity.",
        "A complementary alternative is conjunction, t:: A if t: A for all A E A ,(4) the object this time being to identify the C-largest such set A, as (4) supports t:: A and B C A implies t :: B.",
        "But while (4) and (2) will do for Ax.y where y is a variable distinct from x, (4) suggests that (2) overgenerates for Ax.x.",
        "Spurious ambiguity may also arise to the left of I (not just to the right), if we are not careful to disambiguate the context.",
        "(1) illustrates the point; compare F H x::{A -4, B, C}r H y:: {A, D} (5) r H ap(x,y)::{B} where the context r is left untouched, to F H x :: {A -+ B , C}r H y::{A,D}",
        "(i) attach variables onto sets A of types, to form decorated expressions a and (ii) collect constraints on a's in sets C, hung as subscripts, hc, on H. (3) and (4) are then sharpened by a contextual characterization, semantically interpreting judgments of the form t:: a and a typ by disambiguations respecting suitable constraints."
      ]
    },
    {
      "heading": "2 Two systems",
      "text": [
        "Let us begin with a system of dependent types, confining our attention to three forms of judgments, r context, A type and t : A.",
        "(That is, for simplicity, we leave out equations between types and between terms.)",
        "Contexts can be formed from the empty sequence ()",
        "where the context gets trimmed.",
        "(5) and (2) yield H Ax.Ay.ap(x, y):: {A -> B , C} -> ({A, D} -> {B}) whereas (6) and (2) yield I Ax.Ay.ap(x, y) :: {A 4 B} 4 ({A} -> {B}) .",
        "To weed out spurious ambiguity, we will",
        "Now for the novel part: a second system, with terms t as before, but colons squared, and :- types A, B replaced by decorated expressions a, 0 and unadorned expressions A generated simultaneously according to A :== al (11x::a)A I (Ex::a)A ce,13 :== AxF (11x::a)0 I (Ex::a)0 aaft} aP I ag{t} where a belongs to a fixed countable set X of variables.",
        "The intent (made precise in the next section) is that a u-expression A describes a set of :-types, while a d-expression a denotes a choice from such a set.",
        "D-expressions of the form a, a{t} and af{t} are said to be non-dependent, and are used, in conjunction with constraints of the form fcn(a, /3), sum(a) and eq(a, f3), to infer sequents relativized to finite sets C of constraints as follows",
        "with the side condition a 0 7.",
        "The intuition (formalized in clauses (c2)-(c4) of the next section) is that the constraint eq(a, 7) is satisfied by a disambiguation equating a with -y, fcn(a, i3) is satisfied by a disarnbiguation of a and /3 to :-types of the form (fix: A)B and A respectively and",
        "I-cue r,Y::(Ex::a)8 oct where (11c) and (Ec) each have the side condition y Var(r)U {x}."
      ]
    },
    {
      "heading": "3 Disambiguating ::",
      "text": [
        "Let Ty be the collection of :-type expressions A, and for every d-expression a, let - X(a) be the set of variables in X occurring in a -D(a) be the set of (sub-)d-expressions occurring in a (including a) and -U(a) be the set of (sub-)u-expressions A occurring in a. Suppressing the tedious inductive definitions of D(a) and U(a), let us just note that, for instance, D((1Ix::az)(E y ::dy)az) is f(rix::az)(E Y::ceg)az, (EY::dy)az, az, cey, az} and U(({1 s::az)(E y::asy)az) is {(11x::az)(Ey::(4)a, (Ey::4)a, a, al .",
        "Next, given a d-expression ao and a function p: D(a0) Ty, let .1) be the function from U(cto) to Pow(Ty) such that for a E X(ao), aPTy, for (n x::a)A E U(a0),",
        "Now, call p a disambiguation of ao if the following conditions hold:",
        "(i) for every Az E D(ao), p(Ax) E AP (ii) for every (n x::cc)13 E D(ao), P((il x::a)/3) = (II x:P(a))/0) (iii) for every (E x::a)0 E D(ao), P((E x::c00) = (Ex:P(a))P(0) (iv) for every ap{t} E D(120), P(a) = (II x:P(0))A for some x and A with A[x := t] = p(ao{t}) (v) for every ce E Wan), p(a) = (E x: p(aP))B for some x and B and (vi) for every a{t} E D(ceo), p(a) = (Ex:A)B",
        "for some x, A and B with B[x := t] = p(a{t}).",
        "Next, let us pass from a single d-expression ao to a fixed set Do of d-expressions.",
        "A disambiguation of the set Do of d-expressions is a function p from U{D(a) I a E Do} to Ty such that for all a E Do, p restricted to D(a) is a disambiguation of a.2 A disambiguation p of Do respects a set C of constraints if there is an extension p+ D p so that",
        "Let us say that Fc cxt can be disambiguated to I I, context if there is a disambiguation p of ima(r) respecting C such that r = rp.",
        "F }-c a typ (t a) can be disambiguated to r IA type (t : A) if there is a disambiguation p of ima(r) U {a} respecting C such that r = rp and A = p(a).",
        "21t is crucial for this formulation that the set Var(r) mentioned in side conditions for various rules in the previous section include all variables in r, whether they occur freely or bound."
      ]
    },
    {
      "heading": "4 Relating the derivations",
      "text": [
        "Observe that to derive a sequent other than H 0 context in the first system, or Ho () cxt in the second, we need to assume a non-empty set T of sequents.",
        "Let us agree to write r FT 0 to mean that the sequent r F 9 is derivable from T, and IT r context to mean that F r context is derivable from T. Similarly, for the second system (with H replaced by Hc, context by cxt, etc).",
        "As every rule (R) for the first system has a counterpart (R) in the second system, it is tempting to seek a natural translation .",
        "from the first system to the second system validating the following Claim: r IT 9 implies r0 FT: e. For example, if T consists of the sequent I A type, F is empty, and 0 is Ax.x: (nx:A)A, then T is {Ho a typ}, r is empty, and 0 is Ax.x (fi x a.)a..",
        "Replacing r by y: A, and 0 by Ax.y : (11 x: A)A, we get y at, for r and Ax.y (n.::az)ay for To pin down a systematic definition of ., it is easy enough to fix a 1-1 mapping X 1-+ ax of atomic :-types X to variables ax in X, and set",
        "While (11) induces a translation r of a context F, what about (t : A), where t is not just, as in (11), a variable x?",
        "Before revising the definition of d-expressions a to accommodate subscripts t on A, let us explore what we can do with (7)- (11).",
        "Define a simple type base T to be a set of sequents of the form r F. A type.",
        "Given a simple type base T, let T be its translation into :: according to equations (11) and (10).",
        "By induction on derivations from 7, we can prove a reformulation of the claim above, where r and 00 are replaced by disambiguations.",
        "Proposition 1.",
        "Let T be a simple type base.",
        "(a) IT r context implies Her r c.xt for some r such that F-0 cxt can be disambiguated to F context.",
        "(b) r FT A type implies r H-or a typ for some F' and a such that r Ho a typ can be disambiguated to r F A type.",
        "(c) r IT t: A implies r Fr t :: a for some r, and a such that I Ho t :: a can be disambiguated to r t: A.",
        "Moreover, as the rules (fin), (E np) and (E nq) can, for disambiguations that meet the appropriate constraints, be replaced by (n E), (E Ep) and (E Eq), it follows that Proposition 2.",
        "Let T be a simple type base.",
        "(a) If }--r r oct and Ic r cxt can be disambiguated to I r context, then IT context.",
        "(b) /IF hr a typ and F Hc typ can be disambiguated to I F A type, then I\" HT A type.",
        "(c) If r Frcr t :: a and rt:: a can be disambiguated to r t: A, then I FT t: A. Conversely, going from (HE), (E E) and (E Eg) to (Fin), (E np) and (E rig), we have Proposition 3.",
        "Let T be a simple type base.",
        "(a) If Hr F' context and kc r cxt can be disam- biguated to F r, context, then Fr F cxt.",
        "(b)IT A type and r F-c typ can be ciisarn-biguated to r, F A type, then r Hr a typ.",
        "(c) if r FT t : A and rt :: a can be disambiguated to r F t: A, then r Fr t:: a.",
        "Proposition 3(c) is roughly of (3), while Proposition 2(c) approximates of (4).",
        "If Proposition 2 says that the system for :: above is sound, Proposition 3 says it is complete.3 To tie together Propositions 2 and 3 in an equivalence, it is useful to define a set C of constraints to be satisfiable if 0 is a disambiguation (of 0) respecting C. Note that sequents Hc r and F 0 have disambiguations exactly when C is satisfiable.",
        "Consequently, Propositions 2 and 3 yield (focussing on ::) Corollary 4.",
        "Given a simple type base T and a satisfiable set C of constraints, the following are equivalent.",
        "(i) r Hz t:: a (ii) F' FT t : A, for every sequentt : A to which rt a can be disambiguated FT t: A, for some sequentF- t : A to which r Hc t ::a can be disambiguated.",
        "3 As for how this relates to soundness and completeness in say, classical predicate logic, please see the discussion of translation versus entailment in the concluding paragraph below.",
        "Proceedings of EACL '99 The formulation above of Corollary 4 depends on the possibility of deriving sequents r kc 0 where C is not satisfiable.",
        "We could have, of course, added side conditions to (fin), (E n9) and (E nq) checking that the constraints are satisfiable.",
        "By electing not to do so, we have exposed a certain separability of inference from constraint satisfaction, which we will explore in the next section.",
        "For now, turning to the general case of a set T of :-sequents, observe that if T is to be compatible with the first system, then whenever r F Ax.t:C belongs to T, C must have the form (jjx:A)B with 1\",x:A FT t:B",
        "(ii) whenever I' F (t, u):C belongs to T, C must have the form (E x:A)B with /LA and r FT u:B[x := (iii) whenever r H ap(t,u):B belongs to T, /HT t: (11x : A)B for some x and A such that r IT u: A (iv) whenever r H p(t): A belongs to T, /FT t: (E x: A)B for some x and B (v) whenever r F q(t):B belongs to T, F FT t:(Ex:A)B for some x and A (vi) whenever r H 0 belongs to T, HT r context (vii) whenever H r, x: A context or rt: A",
        "belongs to T, r HT A type and (viii) whenever r H (ux:A)B type or H (E x :A)B type belongs to T, /HT A type and r, x: A HT B type.",
        "Thus, a base set T compatible with the first system can be assumed without loss of generality to consist of sequents of two forms: r H A type and F H t:B, where A and t are atomic (i.e. indecomposable by n, E and A, (, ), ap, p, q respectively).",
        "By clause (vii) above, it follows that for every sequent r Ht:B in T, there is some To C T such that r F70 B type.",
        "So starting with simple type bases To, we can take (for B) the D expression /3 which Proposition 1(b) returns, given F HT.",
        "B type.",
        "We can then define T by translating r Ht:B as r F t ::/3.",
        "Alternatively, we might make do with simple type bases by reformulating t as a variable xt, and smuggling xt into enriched contexts r for which a 7-derivation of H 9, is sought (with 0' adjusted for xt, rather than t).",
        "That is, instead of injecting t on top of F (within some superscript T), we might add it (along with the context it depends on) to the left of F. 5 Variations and refinements The sequent rules for :: chosen above lie between two extremes.",
        "The first is obtained by dropping the side conditions of (fin), (E np) and (E ng), rendering the four rules (HE), (E E9), (E ng ) and (n E)0 redundant.",
        "The idea is to put off constraint satisfaction to the very end.",
        "Alternatively, the side conditions of (11n), (E np), (E ng) and (n E)s might be strengthened to check that the constraints are satisfiable (adding to (fin), for example, the requirement that sum(a) CUC' and eq(a03') 0 C U C' for all )3' E D(/3)).",
        "Assuming that we did, we might as well rewrite the relevant d-expressions, and dispense with the subscript C. (For example, with the appropriate side conditions, (lin) might be revised to r t::ar H u::0 r[a (n x::(3)a] F ap(t,u)::a[x where r[a := (n x :43)a] is r with a replaced by ([1 x::f3)a.)",
        "An increase in complexity of the side conditions is a price that we may well be willing to pay to get rid of subscripts C. Or perhaps not.",
        "Among the considerations relevant to the interplay between inference and constraint satisfaction are: (I) the difficulty/ease of applying/abusing inference rules (D) the difficulty of disambiguating (i.e. of verifying the assumption in Corollary 4 of a \"satisfiable set C\" ) (W) wasted effort on spurious readings (i.e. sequents r 0 with non-satisfiable C).",
        "Designing sequent rules balancing (I), (D) and (W) is a delicate language engineering problem, about which it is probably best to keep an open mind.",
        "Consider again the binary connective mentioned in the introduction (which we set aside to concentrate instead on certain underspecified representations).",
        "It is easy enough to refine the notion of a disambiguation to an &disambiguation, where e is a function encoding the readings specified by In particular, example (1) can be re-conceptualized in terms of",
        "with the side condition that a is non-dependent, and E is consistent with ei (i.e. for every a in the domain of both E and e', e(a) n e'(a) 0 0) and where C\" is C U C' U {fcn(a, 0)} and c\" combines e and c' in the obvious way (e.g. mapping every a in the domain of both c and c' to c(a)ne (a)).",
        "(Subscripts C, e may, as in the case of 0, e, be construed as single constraint sets, which are convenient for certain purposes to decompose into pairs C, e.) We could put a bit more work into (fin) as follows.",
        "Given an integer k > 0, let Dk(13) be 'We can also introduce as a binary connective on u-expressions and/or on d-expressions, although this would require a bit more work and would run against the spirit of underspecified representations, insofar as spells out possible disambiguations.",
        "the subset of the set D(0) of sub-d-expressions of 0, from which 0 can be constructed with < k applications of d-expression formation rules.",
        "(For example, Di ((E c)m ::13)7) is f(E x::ct)(11Y::13)7, (ll Y:43)-Y, a} with and 7 buried too deeply to be included.)",
        "Now, for a fixed k, add to the side condition of (11n) the requirement that sum(a) C U C' and eq(a, 0') 0 C U C' for all 0' E Dk(0); and choose Ell to also rule out the possibility that a is )3' for some /3' E D,(/3).",
        "Clearly, the larger k is, the stronger the rule becomes.",
        "But so long as a satisfiability check is made after inference (as suggested by Corollary 4), it is not necessary that the constraint set C in a sequent r 0 that has been derived be reduced (to make all its consequences explicit) any more than it is necessary to require that C be satisfiable.",
        "(Concerning the latter, notice also that spurious sequents may drop out as further inferences are made, eliminating the need there to ever disambiguate.)",
        "To establish (the analog of) Corollary 4, a crucial property for a sequent rule (*) r to have is monotonicity: for every disambiguation p respecting C, p respects Ci for 1 <i n.5 (This is a generalization of Ci C C, suggested by the encoding above of c-disambiguations/.",
        "in terms of constraints.)",
        "To weed out spurious readings (consideration (W) above), side conditions might be imposed on (*), which ought (according to (I)) to be as simple as possible.",
        "The trick in designing C (and (*)) is to make inference just complicated enough so as, (D), not to put an undue burden on disambiguating at the end.",
        "The whole idea is to distribute the work between inferring sequents and (subsequently) checking satisfiability.",
        "The claim is that the middle ground between the two extremes mentioned at the beginning of this section (i.e. between lax side conditions that leave the bulk of the work to disambiguation at the end, and strict side conditions that essentially reduce:: to :) is fertile."
      ]
    },
    {
      "heading": "6 Discussion",
      "text": [
        "More than one reader (of a previous draft of this paper) has asked about linguistic examples.",
        "The",
        "Proceedings of EACL '99 short, easy answer is that the sort of ambiguity addressed here can be syntactic (with types A ranging over grammatical categories) or semantic (with types drawn, say, from a higher-order predicate logic).",
        "Clearly, more must be said for example, to properly motivate the rules (:: c), (11c) and (Ec) mentioned at the end of 2.",
        "Detailed case studies are bound to push :: in various directions; and no doubt, after applying enough pressure, the system above will break.",
        "Be that as it may, I hope that case studies will be carried out (by others and/or by myself), testing, by stretching, the basic idea above.",
        "I close with a few words on that idea, and, begging the reader's indulgence, on the theoretical background out of which, in my experience, it grew.",
        "From examining the binary connective in (Fernando, 1997), I concluded that is unlike any ordinary logical connective related to entailment because the force of is best understood relative not to entailment, but to translation.",
        "Underlying the distinction between entailment and translation is that between well-formed formulas and possibly ambiguous expressions (corresponding, in the present work, to :-types, on the one hand, and d and u-expressions, on the other).",
        "An abstract picture relating the processes of translation and entailment is framed in (Fernando, in press), which I have attempted to flesh out here for the case of ITT, with a view to extending ITT's applications beyond anaphora to underspecification.",
        "The obvious step is to drop all types, and construe the terms as belonging to a type-free A calculus.",
        "The twist above is that ambiguous expressions are typed by d-expressions cx, distinct from u-expressions A.",
        "The construction is, in fact, quite general, and can be applied to linear derivations as well.",
        "The essential point is to break free from a generative straitjacket, relaxing the inference rules for derivations by collecting constraints that are enforced at various points of the derivation, including the end."
      ]
    }
  ]
}
