{
  "info": {
    "authors": [
      "John C. Mallery"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P85-1005",
    "title": "Universality and Individuality: The Interaction of Noun Phrase Determiners in Copular Clauses",
    "url": "https://aclweb.org/anthology/P85-1005",
    "year": 1985
  },
  "references": [],
  "sections": [
    {
      "heading": "UNIVERSALITY AND INDIVIDUALITY: THE INTERACTION OF NOUN PHRASE DETERMINERS IN COPULA'? CLAUSES",
      "text": []
    },
    {
      "heading": "Abstract",
      "text": [
        "This paper presents in implemented theory for quantifying noun phrases in clauses containing copular verbs (e.g.. 'be' and 'become.).",
        "Proceeding from recent theoretical work by Jackendolf WWI, this computational theory recognizes the dependence ()I' the quantification decision on the definiteness.",
        "indefiniteness, or clir;sness ()I both the subject and object of copular verbs in English.",
        "Jackendoffs intuition about the quantilicational interdependence of subject and object has been imported from his broader cognitive theory and reformulated within a constraint propagation framework, Extensions reported here include.",
        "the addition of more active determiners.",
        "the expansion of determiner categories, and the treatment or displaced objects.",
        "A further finding is that quantilicational constraints may propagate across some clausal boundaries.",
        "The algorithm is used by the RELATUS Natural Language Understanding System during a phase of analysis that posts constraints to produce a 'constraint tree.' This phase conies after creation of syntactic deep structure and before sentential reference in a semantic-network model.",
        "Incorporation of the quantification algorithm in a larger system that parses sentences and builds semantic models from them makes RELATUS able to acquire taxonotnic and identity information from text."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "-1 lie quantification of noun phrases, determining their universality or individuality, is critical for the automatic acquisition of taxonomic and identity information from natural language sentences.",
        "Automatic acquisition can convert ordinary texts into sources of taxonomic and identity information for use by learning and reasoning programs in artificial intelligence.",
        "Such information can also find use in efforts to develop selection restrictions from lexical sources.",
        "or course, proper quantification of noun phrases also plays a key role in computer programs that endeavor to understand natural language.",
        "'the theory for computing the quantilicational status of noun phrases for the case ()I' copular verbs (e.g.. 'be' and 'become') was inspired by recent theoretical work of tackentloff tackendolf noted that quantification of noun phrases for copular ,,erhs depends jointly on the dot:limners of both the subject NI) and the ohject NI' f1983, 00-01, 061.1 I lis intuition has heen reformulated, augmented, and implemented in the RELATUS Natural I .anguage Understanding Ssstem.2 'the implemented quantification theory is used by RELATUS as it incrementally builds a semantic model.",
        "'Ibis method recovers class and identity information from ordinary English sentences.",
        "Although the semantic model must be occasionally queried to resolve quantilicational ambiguities, die in( [hod is primarily syntactic and does not require reasoning.",
        "-the computational simplicity and broad co■crage of the theory allow successful quantification of noun phrases in most copular clauses.",
        "Wolk is in progress to extend the analysis to partitives and thereby yield a comprehensie analysis.",
        "While this approach does not treat such difficult issues such as belief contexts and metaphorical usages, it does address most literal cases.",
        "Since the quantification",
        "theory is deployed in a natural language system that parses sentences and builds a :iemantic model from them.",
        "RELATUS becomes, among other things, a system for acquiring class structure information from ordinary English texts."
      ]
    },
    {
      "heading": "Fig. I. Sentence Processing in RELATUS",
      "text": []
    },
    {
      "heading": "Syntactic Analysis Input: Text Stream Output: Surface Structure I /cep Structure Sentential Constraint Posting Input: Surface Structure I )eep Structure Output: Sentential Constraint Tree Sentential Reference",
      "text": [
        "Input:"
      ]
    },
    {
      "heading": "Sentential Constraint Tree Semantic Representation",
      "text": [
        "Output:"
      ]
    },
    {
      "heading": "Sentence Mereed into Semantic Representation",
      "text": [
        "• The quantification Algorithm is embedded in a sentential consti.aint-posting process [Duffy and Mallery, 19841 shown in figure 1.",
        "Sentential constraint-posting creates a constraint tree that corresponds to roughly what riansf(trnimional ;:itinunitrians call ingios/ fin-in.",
        "The constraint tree is used to perform intersentential reference (merging successive sentences into a single semantic-network model) [Mallery, 19)01. l'he input to constraint-posting phase is both surface structure and deep structure canonic:di/cif hy a transformational parser Puffy, 195a.",
        "In a depth-first, bottom up walk of the deep structure, constraints describing grammatical felatious are posted on non-terminal parse-graph nodes.3 When verbs in minor clauses (ix.. clauses other than relative clatises or clausal adjuncts) are reached, they",
        "supervise the quantification of noun phrases they command.",
        "H. these verbs are copular verhs, the copular interconstraint algorithm is applied.",
        "In other cases, another experimental algorithm perliirms quantification by drawing on logical relations from surface structure.",
        "The result of this process is the sentential constraint tree.",
        "It is a hierarchical description of grammatical and logical relations that is suitable input for the reference system.",
        "By sequentially referencing the sentences ()I a text, a semantic model of the text is incrementally constructed."
      ]
    },
    {
      "heading": "The Copular Interconstraint Algorithm",
      "text": [
        "Within a constraint-posting framework, the basic task of NP quantification is to decide whether to post a constraint marking the NP as an individual or a universal.",
        "Since the task involves knowing the specific subject and object of a copular verb, it is delegated to a higher constituent, the verb.",
        "I his delegation is motivated by the principle of local decision-molting which holds that decisions should be located where all required inlOrmation is both available and proximate.",
        "In this case, only the verb knows the identities (if both noun phrases due to the hierarchical structure ut iaininiaiicul relations.",
        "•I'hus, when a verb posts its own left:rent ial constraints, it also directs the quantification of NI's that it dominates (e.g., its subject and object).",
        "This procedure was reformulated in a constraint propagation [Waltz, 19751 franiev.rrik because features of a single constituent cannot be determined independently of other constituents in the sentential &Ovation.",
        "Since miantilicational umstraint propagates in both directions, this process is a type of raint Foittmately, the possible states or NPs are only three: definite.",
        "indefinite.",
        "and class.",
        "Because the number of possible Ni' states is small (3) and the numher of variables is also small (2), a simple table-lookup ally.iothin 'compiles' subject and object quantifications For all possible configurations ot NP deliniteness.5",
        "3.",
        "At present.",
        "the RFLATUS system builds sentential constraints using the canonical grammatical relations of the sentence, the quantification status of noun phrases, and the truth values of verbs.",
        "Work is in progress to incorporate temporal constraints on verbs.",
        "temporal adjectives, and various types of context markers.",
        "4.",
        "The RF.LATUS parser uses non-standard parse graphs.",
        "A",
        "'kern' corresponds to a clause while a 'verbal* is something like a verb phrase except that the kern tells it what its subject, object, and modifiers are at constraint-posting time.",
        "For further details.",
        "sec Dully [19854",
        "The actual task of determining the quantificational status of the Nt's decomposes into three steps.",
        "(1) The definiteness of the noun phrases is ascertained by examining the determiners and several other parameters.",
        "The algorithm is summarized by figure 2.",
        "Another algorithm described by figure 3 is used for determinerless plural NPs.",
        "(2) The quantificational status of the subject and object is determined by looking each case up in",
        "the table depicted by Figure 4.",
        "Potentially ambiguous cases (marked with an asterisk) may require referencing the noun phrase in the semantic inodel to resolve the ambiguity.",
        "Example sentences for the cases in figure 4 are found in figure 5.",
        "(3) The verb-phrase node informs each NP of its quantification (the results of step 2).",
        "and they in 5.",
        "The conversion of constraint propagation into a table lookup approach is possible in this special case because there arc only two variables, the subject and the object.",
        "In the general case, the size of the table is exponential in the number of variables.",
        "turn post corresponding constraints on themselves.",
        "In his discussion, tackendolf [1983: 77-106, esp.",
        "88-91.",
        "94-1061 only categorizes determiners according to the distinction between definite and indefinite .",
        "I have added classness to his scheme in order to cope with such determiners as 'any' and 'every'.",
        "While lackendoffs examples use only the determiners 'a'.",
        "'an', and 'the', I have found interpretations or additional determiners which are summarized in figure 2.",
        "Jackendoll considers proper nouns to be definite and the same is done here, except in certain cases of phiral proper nouns which are interpreted as the plural indefinite (see S2I in figure 5).",
        "The addition of the class categorization calls fig the class determiners in the bottom of ligure 2.",
        "The determiner, 'no', is treated as the negation of Thus, the NP is quantified as a class and the copula negated.",
        "While SW and S18 in figure 5 are valid.",
        "S19 is not.",
        "There are restrictions on where 'no* can appear.",
        "It cannot modify both the subject and object.",
        "Nor can it modify the object when the subject is indefinite (S19) or a universal (520), but it can when the subject is definite (S18).",
        "These restrictions seem generally valid Or literal cases even though some idiomatic and metaphorical constructions may violate them.",
        "Various cases of determiner-less NPs are handled by the algorithm that determines NP definiteness.",
        "Those cases are listed in figure 3.",
        "The indefinite category may be incompletely handled because the theory does not yet encompass partitives -- indefinite NPs that partition collections of individuals or universals.",
        "Thus, determiner-less NI's with plural head nouns are not analyzed for partitive readings.",
        "Partitive determiners may engender two readings.",
        "I he NPs they modify can he read as either collections of individuals or universals.",
        "Some partitive determiners such as 'some; 'each, 'most', 'few', or 'many' are used to make statements about subsets of a collection.",
        "With the exception of 'some,' these are missing from figure 2 pending research about how to determine their quantification.",
        "'Soine' is interpreted just as an indefinite because of its high frequency.",
        ".1 he determiners 'all,' 'any,' and 'every,' were included because they refer to the entirety of a collection.",
        "None of the partitive determiners, even the ones currently used to determine classness, vill he adequately handled until completion of continuing work on the syntactic parse graphs and the interaction characteristics of partitives.",
        "Sometimes copular verbs take adjectives in the object position, leaving no apparent object.",
        "Some of these adjectives have a displaced object as in S2, S11, Si), SI5 and S16 in figure S. Were there actually no object, the quantification of the subject would he determined in isoiution (using a dilThrent algorithm).",
        "When the adjective has an object.",
        "that object is used to perform the NP interconstraint with the subject.",
        "Cases C6 and C3 are impossible (S22 and S24) unless the sentences have displaced objects (Sll and S1)), I lowever, this is not the case for CO where a copular verb is modal and has a partitive determiner on its object.",
        "This suggests that partitive readings of class determiners may make these cases acceptable and that displaced objects simply make such a reading easier.",
        "nbplaced .mbjeds appear as the NPs to which 'relative pronouns bind in relative clauses or appositives.",
        "515 provides an example of interconstraint across a relative clause.",
        "There, 'a philosopher' is the displaced subject of the displaced object, *an Ionian stoic.' Interestingly, 'a philosopher' is also a displaced object with respect to Alary.' Recall that constraint posOng proceeds from the bottom of the paise graph up the hierarchy of grammatical relations with quantification following along and being governed by major verbs.",
        "In SI5, quantification interconstramt is first applied to .a philosopher' and an Ionian stoic' by the copula of the relative clause.",
        "[hen, it is applied to 'Mary' and 'a philosopher' hy the major copula.",
        "Since the liist NP intercrnstraint fixes 'a philosopher' as a universal, that result is then carried over into the Intel-constraint with 'Mary..",
        "In both S15 and S16, the quantificational constrain', propagates across clausal boundaries because both clause share the same NP as an object and a subject.",
        "Cases such as these should not lead to inconsistent quantifications.",
        "Instead, they should agree.",
        "attesting to the soundness of the algorithm.",
        "Jackendolf [P)83: 971 argues that cases C4 and C5 in figure 4 are semantically ambiguous.",
        "This ambiguity seems only to hold for the determiner 'the' and is resolved by a simple relerence of the NP in the semantic representation.6 if the ambiguous NP has no referent in the current discourse focus [Gross, 1971, then the NP must be a universal.",
        "If there is a referent, it is either a universal or an individual, and the same",
        "quantification should be chosen.",
        "Where both appear relation, identity between them is represented.",
        "rdentity in the discourse focus, the individual reading is preferred.",
        "between two universals is represented with two generic This is particularly important for C4 because the status of classifications indicating that each universal is a subset of the subject is needed to predict that of object.",
        "In either the other.",
        "For predicate adjectives, a special token (e.g., case, both must have the same quantificational status.",
        "'HQ,' 'HAS-QUALITY') is used as the i.elation and the adjective as the object in order to represent a one-place property [Winston 1980, 19821.",
        "This avoids confusion when a word token has uses both as an adjective and a noun.",
        "Because RH .ATUS incorporates a theory of ituerprelive semantics, where syntactic canonicalization is performed on input and semantic equivalence is determined ()illy through reasoning over a syntactically canonical rcpresentation, this encoding system is particularly appropriate.",
        "Because no post-processing is needed Lou substitute distinct tokens lin- the different types of linking relations, this encoding also simplifies quantification ()I' copular clauses, and Mei-chive, the constraint posting process in general.",
        "The encoding method only requires a small constant mocasc in tune br walking the created class structure, thus, the potential gamin efficiency by using a mute explicit encoding technique is marginal.",
        "not mittht he olket by other factors.",
        "'File analysis of NP quantification in copular clauses is significantly simplified by the fact that there is no need to analyze quantifier scoping.",
        "this R)Ilows from the absence of a passive interpretation for copular verbs.",
        "lbey are specialized in conveying classilicational intOrmation rather than expressing active changes of state.",
        "Since there is no agent and no object which is acted upon, passive constructions can have no meaningful interpretation.",
        "Interchanging the subject and the object either has no effect on identity statements or inverts the",
        "partitives is completed.",
        "the :dim will cover an even larger proportion of copular verh cases.",
        "Work has been done on copular questions hut is too complex for discussion 'here, largely due to pragmatic interactions.",
        "Conjunctions have been treated just like ordinary.",
        "NPs, except that error checking en ,iires that all Nps in conjunctions agree in definiteness.",
        "fhe idea of constraint propagation has been extended experimentally to ntin-copular verbs using a different propagation algorithm.",
        "'lite approach has been successful thus far.",
        "However, mole research is required to analyze interw ions between various quantification ;i1gorithins and to aho.a tain the propae.",
        ":oion characteristics of different verbs, according to their senses and meanings.",
        "Quantifier sowing, algorithm interaction, and differential propagation are some ()I' characteristics of general constituent interconstraint that make it more difficult.",
        "In general.",
        "propagation of quantificational constraints, seems a promising approach to previously recalcitrant imoblems.",
        "Even so, strong psychological claims must await further research and exhaustive analyses across languages.",
        "A Climpse At Semantics Since RFTXFUS incrementally constructs a semantic model of the sentences it analyzes, the copular interconstraint algorithm allows a class structure to be automatically acquired.",
        "Ihe way in which this inlOrmation is represented in RELATUS exploits the encoding scheme underlying f-:nglish usage of wpular fhis encoding method allows limr types of linking relations to he encoded using a single token.",
        "(i.e., 'be.).",
        "Ibis encoding is swum:toted in figure 6.",
        "Since the types can he differentiated according to the quantification of the nodes linked.",
        "the unique representation of each link type does not require the introduction of ad hoc' tokens.",
        "Ordinary and generic classification are used to construct the taxonomy.",
        "When two individuals are linked by a 'be' 6.",
        "Such a strategy has been followed for other types of 40 ambiguous preposition and clause bindings [Hirst.",
        "1981, 1984; Duffy, 1985b1.",
        "Recent interest in developing lexicons to support computer understanding of natural language [Walker and Amsler, 19851 suggests the need for effective methods of augmenting our lexicographical knowledge using large corpora and unrestricted text.",
        "Selection restrictions are an important type of information to accumulate because they are needed not only to distinguish different senses of words but also to recognize metaphorical uses.",
        "Since accumulation of selection restrictions requires it, acquisition of taxonomic information is a priority.",
        "The copular interconstraint algorithm introduced in this paper provides a basis fbr acquiring large taxonomies from unrestricted texts.",
        "A lifter can he used to quickly prune all non-copular sentences zis well as difficult copular sentences involving belief, and perhaps, time contexts.",
        "The remaining sentences can be parsed, quantified and represented in a large semantic model.",
        "This research would not only advance our knowledge of natural taxonomies and selection restrictions hut it would also generate empirical data useful Ibr those studying 'default logics and stereotype hierarchies [Minsky, 1975; Keil, 1979; Reiter, 1980; Brachman, 1982; Etherington and Reiter, 19831.",
        "One difficulty with this research program is that an uncertainty principle is at work: The taxonomy used to determine selection restrictions itself depends on recognition of metaphors through selection restrictions.",
        "Success in this lexicographical task will require the careful development of effective research strategies."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This paper was improved by comments from Jonathan Connell, Gavan Duffy, Margaret Fleck, Robert Ingria, David McAllester, Rick Lathrop, and David Waltz.",
        "This research was encouraged and supported in various ways by Hayward Alker, Mike Brady, Berthold Horn, Tom Knight, Marvin Minsky, Gerald Sussman, and Patrick Winston, Gavan Dully's parse graphs made this research possible.",
        "The RELATUS system was designed and implemented by the author and Gavan Duffy.",
        "Tliis research was done at the Artificial Intelligence Laboratory of the Massachusetts Institute of Technology.",
        "Support for the Laboratory's artificial intelligence research is provided in part by the Advanced Research Projects Agency of the Department of Defense under Office of Naval Research contract number N00014-80-C-0505.",
        "Responsibility for the content, of course, remains with the author."
      ]
    }
  ]
}
