{
  "info": {
    "authors": [
      "Leonardo Lesmo",
      "Livio Robaldo",
      "Jelle Gerbrandy"
    ],
    "book": "Proceedings of the Fifth International Workshop on Inference in Computational Semantics",
    "id": "acl-W06-3905",
    "title": "Towards a redundancy elimination algorithm for underspecified descriptions",
    "url": "https://aclweb.org/anthology/W06-3905",
    "year": 2006
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Quantifiers in Dependency Tree Semantics",
        "Leonardo Lesmo, Livio Robaldo, Jelle Gerbrandy",
        "Dipartimento di Informatica - Universita di Torino [lesmo, robaldo, gerbrand }@di.",
        "unite it",
        "Dependency Tree Semantics (DTS) is an underspecified formalism for representing quantifier scope ambiguities in natural language.",
        "DTS features a direct interface with a Dependency grammar and an incremental, constraint-based disambiguation mechanism.",
        "In this paper, we discuss the meaning of quantifier dependency in DTS by translating its well formed structures into formulae of a Second Order Logic augmented with Mostowskian generalized quantifiers."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Dependency Tree Semantics (DTS) is an underspecified formalism for dealing with quantifier scope ambiguity.",
        "DTS tries to keep the advantages of most common underspecification techniques: it has a straightforward syntax-semantics interface with a Dependency Grammar, just as QLF has [1], and it allows for monotonically adding constraints to take partial disambiguations into account, just as in UDRT [12], MRS [3] or CLLS [4].",
        "These features have been presented in [7] and [8], whereas in [9] DTS is proposed as a possible underspecified semantic structure of Meaning^Text Theory [10].",
        "This paper discusses a third property of DTS in further depth: the possibility to represent branching quantifier (BQ) readings.",
        "Branching quantification in DTS has partially been discussed in [7] and [8], in which we compared DTS with First Order Logic (FOL).",
        "However, FOL is limited in that it allows to represent only standard quantifiers (3 and V); in this paper we compare DTS with the logic developed in [13] and [14], which is a fragment of Second Order Logic which allows for a representation of branching quantification with Generalized Quantifiers.",
        "The key idea of DTS is to specify quantifier scope by explicitly showing the dependencies between involved (quantified) groups of entities, i.e. by implementing a sort of \" Skolemization\" in the underspecified representation.",
        "Well-formed structures in DTS are based on a simple graph G that represents the predicate-arguments relations, without any quantification.",
        "The nodes of G are either predicates or discourse referents; each arc connects a predicate with a discourse referent and is labelled with the number of the predicate argument position.",
        "With each discourse referent we associate a quantifier (given by a function QUANT from discourse referents to quantifiers) and its restriction, which is given by a function RESTR that associates a subgraph of G to each discourse referent.",
        "In (1), we show a first simple example (1) Two students study three theorems",
        "Quant(x)= two",
        "Quant(y)= tree",
        "The representation in (1) is still ambiguous; to disambiguate, we need to specify how the quantiiers depend on each other.",
        "This is done by inserting dotted arcs between discourse referents, named semdep arc.",
        "In figure 1.a and ig 1.b two fully-speciied representations of sentence (1) are given.",
        "Fig.1.a shows the reading in which the quantifier 'three' depends on (has scope inside) the quantifier 'two'.",
        "In figure 1.b, the arc linking x to y specifies that the two students depend on the theorems.",
        "In both interpretations, the wide-scope quantifier is linked to a new node called Ctx - the context.",
        "But DTS allows for very natural representation of a third reading of sentence (1): in figure 1.c, both discourse referents are linked to the context.",
        "This is the branching quantifier (BQ) reading.",
        "As we will see, the BQ reading is true only in those models in which we can ind a set of two students and a set of three theorems, for which it holds that each student in the irst set studies each theorem in the second one.",
        "In NL, there are many cases in which the correct",
        "Fig.",
        "1.",
        "The three readings of sentence (1)",
        "truth conditions can be captured only via a BQ reading; in fact, it is easy to add some context elements in the sentence in order to force the two involved sets to be constant; for instance, in (2.i), the involved students and theorems are explicitly mentioned in two appositions, while in (2.ii) the prepositional modifier with my sister favours an interpretation in which three persons, two friends of mine and my sister, went together to three same concerts.",
        "x",
        "1",
        "Restr(y) =",
        "y",
        "1",
        "stud'",
        "theor'",
        "x",
        "y",
        "*",
        "1",
        "_",
        "1_",
        "1",
        "_",
        "_",
        "_",
        "1",
        "stud'",
        "theor'",
        "stud'",
        "theor'",
        "stud'",
        "theor'",
        "Finally, even if there are not explicit syntactic elements forcing a BQ reading, in many cases this is done by world knowledge; for example, in (2.iii), world knowledge seems to render the reading in which two students have seen the same three drug dealers the most salient; in fact, the presence of drug-dealers in front of a school is (fortunately) a rare event and this induces to prefer the reading minimizing the number of involved drug dealers.",
        "(2) (i) Two students, John and Jack, study three theorems: the first three of the book.",
        "(ii) Two friends of mine went to three concerts with my sister.",
        "(iii) Two students of mine have seen three drug dealers in front of the school.",
        "Not all possible conigurations of semdep arcs are allowed.",
        "For instance, a well-formed DTS cannot contain cycling paths, which would correspond to a reading in which two sets of entities depend on each other, which is clearly absurd.",
        "Furthermore, there are constraints to reduce the available readings to those admitted in NL.",
        "In this paper, we will focus on the expressivity of the general formalism, and provide a precise deinition of the meaning of all conigurations that respect a minimal set of syntactic constraints, and abstract from the question whether they correspond to an actual reading in NL.",
        "In other words, in DTS the set of logical admitted readings is kept separate from the subset of readings admitted in NL, and this paper focus on the former.",
        "A well-formed structure (wfs) in DTS is a Scoped Dependency Graph (SDG) as defined below.",
        "We take as given a set of predicates pred and a set of discourse referents D.",
        "Definition 1.1 [Flat Dependency Graphs (FDG)]",
        "A Flat Dependency Graph is a tuple (N, L, A, Dom, f ) s.t.",
        ":",
        "- N is a set of nodes {ni,n2,..., nk}.",
        "- L is a set of labels l2, .",
        ".",
        "lm}; in fig.1, L={1, 2}.",
        "- Dom = pred U D is a set domain objects: predicates and discourse referents",
        "- f is a function f : N – Dom, specifying the node referent, i.e. the domain object with which the node is associated.",
        "In the following, whenever f (n) G X, we will say that node n is of type X.",
        "- A is a set of arcs.",
        "An arc is a triple (ns, nd, l), where ns,nd G N, ns is of type pred, nd is of type D and l G L.",
        "Without going into further details, we stipulate that Gf is a connected acyclic graph such that each node of type pred has one node of type D for each of its places.",
        "Note that there can be two different nodes u and v s.t.",
        "f (u)=f (v), i.e. the nodes in N can be seen as occurrences of symbols from Dom.",
        "Definition 1.2 [Scoped Dependency Graph (SDG)]",
        "A Scoped Dependency Graph is a tuple (Gf, ctx, Q, quant, restr, SemDep) s.t.",
        ":",
        "- Gf = (N, L, A, Dom, f) is an FDG.",
        "- ctx is a special element called the context.",
        "- Q is a set of 2-place Mostowskian quantifiers {every, most, two, ...} - quant is a total function ND – Q, where ND Ç N are the nodes of type D",
        "- restr is a function assigning to each d G ND its restriction, which is a subgraph of Gf.",
        "- SemDep is a relation ND x (ND U {{ctx}}).",
        "When SemDep(d, d'), we say that d depends on dd.",
        "Note that a discourse referent can depend on more than one other discourse referent.",
        "The dependence relation needs to satisfy the following constraints:",
        "• The transitive closure of SemDep is a partial order on all discourse referents and ctx, with ctx as its maximal element.",
        "• Let d be a discourse referent, and let R(d) be the smallest set that contains d, and for which it holds that if d is in R(d) and d occurs in the restriction of d , then also d G D. It must hold that:",
        "• If d1 G R(d), d2 G R(d), and d1 depends on d2, then also d depends on d2",
        "• If d1 G R(d), d2 G R(d), and d2 depends on d1, then also d depends on d1",
        "These last two constraints serve to exclude certain dependency relations that are 'logically impossible', and make sure that, for example, a sentence like \"Most representatives of a company took every sample\" does not get a reading in which 'a' depends on (only) 'every' and 'every' depends (only) on 'most'."
      ]
    },
    {
      "heading": "2. Branching quantification",
      "text": [
        "Branching quantification was introduced by Henkin [5] in the context of FOL; Hintikka [6] showed that it can occur also in NL.",
        "A great step toward the deinition of a model-theoretic schema for BQ was made by Barwise [2] who merged Hintikka's BQ account with the theory of Generalized Quantiiers.",
        "Barwise's idea was that the truth-conditions of BQ readings are connected with the monotonicity of the involved quantiiers.",
        "He claimed that there is no uniform schema for BQ: the formulae associated to sentences featuring all monotone increasing (M|) quantifiers are different from those associated to sentences featuring all monotone decreasing (MJ) quantifiers.",
        "According to Barwise, sentences with mixed quantifiers (some M| and some MJ) make no sense from a linguistic point of view.",
        "On the other hand, Sher [13], [14] observed that since the semantics of linearly ordered quantiication is provided regardless to monotonicity, there seems to be no methodological reason for imposing further constraints in case of partially ordered quantiication.",
        "In other words, even if readings from NL are not available, this should not exclude their logical interpretation.",
        "Sher speciied the semantics of BQ on the basis of a precise deinition of the involved groups, according to so-called maximality conditions; roughly, her claim is that the interpretation of a BQ reading with quantiiers of any type corresponds to the one of Barwise for M| quantifiers augmented with a maximality condition requiring that the involved sets are maximal with respect to the body of the formula.",
        "Consider the two following sentences:",
        "(3) (i) Most of the dots and most of the stars are all connected by lines.",
        "(ii) Few of the dots and few of the stars are all connected by lines.",
        "In Sher's logic (let us name it L0) sentences in (3) are associated with formulas of the following form:",
        "where Q1 and Q2 are the Mostowskian quantiiers corresponding to the determiners in our example: Q1=Q2=Most for (3.i); and Q1=Q2=Few for (3.ii).",
        "The symbols C1, C2, IN are labels on the subformulae and Max((P1, P2), IN) is an abbreviation for a maximality condition that states that two sets P1 and P2 are maximal with respect to the formula with label IN, in the sense that there are no strict supersets of P1 and P2 that satisfy IN.",
        "Formally, the maximality condition in (4) is the following formula:",
        "Sher generalizes the schema of (4), so that it applies to any partially ordered set of arbitrary quantiiers.",
        "To achieve this, it is necessary to existentially quantify nary generalized Skolem functions Hi rather than simple sets Pi, and to assert maximality conditions also on the subformulae with label Ci.",
        "Here, an nary Skolem function is just an n + 1-ary relation H - we will write H(x1,...xn+1) if x1 ...x^,^ stand in the relation H, but also write H(x1... xn) for the set of objects xn+1 s.t.",
        "H(x1,... xn+1).",
        "Consider now a branching reading such as in the following sentence:",
        "(5) Few men inserted a coin in three coffee machines.",
        "Fewx(man'(x)) .",
        "Threey(CoffeeMach'(y)) '",
        "In this reading, the quantifier A depends on both Three and Few: there can be a different coin for every pair of a man and a coffee machine.",
        "This is reflected by the fact that Hz, the Skolem function associated with the quantifier A, is a 2-ary function, while Hx, Hy are 0-ary Skolem functions (that is, predicates).",
        "The formula states that we have to find witnesses Hx,Hy and Hz such that Hz corresponds to the extension of inserted', and Hx and Hy are maximal sets of individuals x and y such that the set of objects z inserted by x in y, Hz(x,y,z), includes at least one coin; Hx is a set of a \"few men\" and Hycontains \"three coffee machines\".",
        "See [14] for the formal details."
      ]
    },
    {
      "heading": "3. Nested Quantification",
      "text": [
        "A limitation of Sher's logic is that it does not handle the case in which one quantifier occurs in the syntactical restriction of another quantifier.",
        "Consider:",
        "(6) Two representatives of three African countries arrive.",
        "Quant(y)= tree Quant(x)= two",
        "In this example, the quantifier Three occurs in the syntactic restriction of Two.",
        "This corresponds to the fact that the discourse referent y occurs in the graph RESTR(x).",
        "This type of reading cannot be directly represented in Sher's logic.",
        "Therefore, we propose to extend her definitions to accommodate for these cases as well.",
        "Lack of space does not permit us to state the precise definitions; we will give two examples instead which should illustrate how the definitions work.",
        "Before discussing the three possible disambiguations of (6), we introduce a new abbreviation to increase readability.",
        "If $ is a well formed formula, xi... xn a sequence of discourse referents, and",
        "Si,..., Sn a sequence of predicates, we define:",
        "We will omit the reference to the variables xi... xn in the notation when this does not lead to confusion.",
        "By using – , the formula in (5) can be replaced by the following equivalent",
        "For representing the restriction of quantifiers in the logic, in addition to the Skolem functions Hx that represent the body of the quantifiers, we introduce restriction sets The three readings of (6) can now be represented as:",
        "Let us shortly discuss each of these readings.",
        "In the first reading, y depends on x, which is reflected in the fact that ^y and",
        "Hy are unary Skolem functions whose values depend on the value for x.",
        "The restriction set of 'three', ^y(x), is (for each x) the set of all African countries, while Hy(x) is the set of objects represented by x.",
        "Therefore, the restriction set of 'two', is a maximal set of individuals x that represent three African countries.",
        "Two of these individuals must be in Hx - the set of those that arrive.",
        "In the second reading, x depends on y.",
        "The set ^y consists of all African countries.",
        "The set Hy must contain three of these, and it is required that for each element y in Hy there are two individuals in the set of all its representatives ^x(y) that are in Hx(y), which consists of all individuals that arrive.",
        "The third formula represents the branching reading of the sentence, in which the two discourse referents do not depend on each other.",
        "This formula states that there are sets ^x and Hy such that each individual in ^x represents all elements from Hy (this is expressed by the maximality condition on the pair (^x,Hy)), and for which it holds that Hy contains three African countries, and that two of the representatives from ^x must arrive.",
        "In the following, we report a last complex example:",
        "(7) Everyx teacher failed twoy students that studied less than halfz of the topics in thew program.",
        "The following DTS represents a reading of (7) in which the discourse referent w depends on both y and z, and y and z depend on x.",
        "topic of'",
        "Quant(w)= the",
        "This DTS gets the translation reported below; in this interpretation, the two students and the program depend on a teacher, while the set of topics depends both on a program and on a student.",
        "In the formula, the pair of students associated to a teacher x G Hx has to belong to the set ^y, i.e. the set of students y such that the set of things studied by y, i.e. Hz(x,y,w), contains less than half elements of ^z, i.e. the set of topic in Hw (x), i.e. the program of x."
      ]
    },
    {
      "heading": "4. Conclusions and further works",
      "text": [
        "In this paper, a comparison between Dependency Tree Semantics and Sher's work on Branching Quantification and Generalized Quantifiers has been presented.",
        "In particular, we have shown how disambiguated DTS structures can be related to formulae of an extension of the formalism from [14] to represent branching quantification.",
        "This provides a way to model-theoretically interpret disambiguated DTS structures.",
        "Concerning further work, one of the next steps in research on DTS will be extending its expressivity in order to deal with cumulativity, which is a topic that has received very little attention in recent studies on underspecification.",
        "Cumulative readings arise from a different kind of branching quantification, as argued in [13], so the step for including them is more natural in DTS than in other underspecified logics that do not take BQ into account."
      ]
    }
  ]
}
