{
  "info": {
    "authors": [
      "Scott McGlashan",
      "Norman M. Fraser",
      "Nigel Gilbert",
      "Eric Bilange",
      "Paul Heisterkamp",
      "Nick J. Youd"
    ],
    "book": "Applied Natural Language Processing Conference",
    "id": "acl-A92-1040",
    "title": "Dialogue Management for Telephone Information Systems",
    "url": "https://aclweb.org/anthology/A92-1040",
    "year": 1992
  },
  "references": [
    "acl-E89-1004",
    "acl-J86-3001"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "A distributed approach to spoken dialogue management for real-time telephone information systems is outlined."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The approach to dialogue managenaent described here has been developed as part of the Sundial project (Speech UNderstanding in DIALogue) whose goal is to build real-time integrated computer systems capable of maintaining cooperative dialogues with users over standard telephone lines.",
        "1 Systems have been developed for four languages - French, German, Italian and English - within the task domains of flight reservations and enquiries and train enquiries.",
        "Each system consists of five components: a speech recognition component inputs acoustic speech signals fi'om the telephone and outputs a word lattice; a parser extracts a plausible string from the lattice and assigns it syntactic and semantic representations; a dialogue manager gives these representations an interpretation, decides how the dialogue lnay continue and, if it is the system's turn to speak, plans a system utterance; a text.",
        "generator constructs a. detailed linguistic representation from the plan; and a text-to-speech system synthesizes the representation for transmissiol~ by telephone.",
        "'2"
      ]
    },
    {
      "heading": "2 Two Problems of Dialogue",
      "text": [
        "The SUNDIAL dialogue manager addresses two problems facing spoken dialogue systems.",
        "The first is that, for maxinmm usefulness, dialogue management needs to be generic: i.e. the dialogue manager module must be able to interpret and generate utterances in more system.",
        "thai\\] one language and across more than one task domain.",
        "The.",
        "second problem is that dialogue management must provide cooperative interaction with the user.",
        "To achieve this, the system needs to produce utterances which are perceived by the user as natural, coherent and helpful within the context of the dialogue.",
        "The purpose and modality of the dialogue forms part of this context: in our case, task-driven spoken dialogues.",
        "The system needs to deal with inconsistent task information, such as that obtained when the speech recognizer and parser yield a. plausible but incorrect interpretation; for exampie, the user said 1 want to fly to Lannion, but the system understands London rather than Lannion."
      ]
    },
    {
      "heading": "Management",
      "text": [
        "The SUNDIAL dialogue manager addresses two problems facing spoken dialogue systems.",
        "The first is that, for maxinmm usefulness, dialogue management needs to be generic: i.e. the dialogue manager module must be able to interpret and generate utterances in more system.",
        "thai\\] one language and across more than one task domain.",
        "The.",
        "second problem is that dialogue management must provide cooperative interaction with the user.",
        "To achieve this, the system needs to produce utterances which are perceived by the user as natural, coherent and helpful within the context of the dialogue.",
        "The purpose and modality of the dialogue forms part of this context: in our case, task-driven spoken dialogues.",
        "The system needs to deal with inconsistent task information, such as that obtained when the speech recognizer and parser yield a. plausible but incorrect interpretation; for exampie, the user said 1 want to fly to Lannion, but the system understands London rather than Lannion."
      ]
    },
    {
      "heading": "3 A Distributed Solution",
      "text": [
        "The Sundial solution to these problems lies, in part, ill the distributed architecture of the dialogue manager.",
        "Tile dialogue manager is responsible for providing a cooperative interaction with the user (Gerlach and ttoracek, 1989).",
        "From the user's point of view, system utterances must be appropriate and helpful to the user iTi the cur'rel~t dialogue context.",
        "To achieve this, both interpretation of user utterances and planning of system utterances must.",
        "be informed by the past and current states of the interaction.",
        "Cooperative dialogue managemeut, therefore, requires the construction and maintenance of an interactional model: i.e. a model which specifies the layers of st.ructure which can be distinguished in dialogues.",
        "Following Grosz and Sidner (1986) we distinguish linguistic structure, attentional, or belief structure, and intelltionM structure.",
        "Intentional structure is further differentiated into dialogue structure and task structure (Bunt, 1989).",
        "tiowever, rather than using a unitary model where these layers are given as a single structured representation, we have adopted a distributed model where these layers are distributed across a. number of modules.",
        "Each rnodule consists of a partial model of the interaction, rules for updating the model as well as associated dialogue management flmctions.",
        "\\[\"urthern~ore, modules may need to collaborate with each other in order to determine how to update their model: their update rules may depend upon information maintained in another module.",
        "The interactionM model is falsification definite since agents assume rather than infer that their belief model corresponds to that of the other agent.",
        "This places an obligation on agents to make explicit the state of their belief model so as to give the other agent the opportunity to correct or modify it.",
        "For example, if the system utters You want to.",
        "go to London in response to the user's request, the user has an opportunity to contest the current state of the system's belief model.",
        "The Sundial dialogue manager consists of five modules.",
        "The linguistic interface module interfaces the dialogue manager with the parser and is responsible for maintaining a linguistic model of system and user utterances.",
        "The dialogue module is responsible for maintaining a model of dialogue context, building an interpretation of user utterances and determining how the dialogue should continue.",
        "Dialogue structure is based on the framework of Roulet and Moeschler in which dialogue is hierarchically structured il/to exchanges, interventions and dialogue acts (Moeschler, 1989).",
        "In order to determine the appropriate contextual interpretation of user utterances, the dialogue module interacts with the belief module which maintains a model of belief containing not just concepts created directly as a result of user utterances, but also inferential extensions.",
        "For example, if the system initiated an exchange to determine tile departure date of a flight, this exchange can be closed if the belief model can interpret the user's utterance as refierencing a 'date' concept.",
        "The belief module requires context information from the dialogue module in order to guide the interpretation process.",
        "For example, the second can reference date or flight concepts (the second of May or the second flight) depending on the context.",
        "The belief module additionally eoopera.tes with the message plaT~ning module in order to provide selnantic descriptions of concepts referenced in the plan of system utterances.",
        "Finally, the task module is responsible for maintaining a model of the task structure of the dialogue, consulting domain-specific application databases and informing the dialogue module of the current state of t.he ta.sk.",
        "Typically, this involves deciding whether sufficient task information has been provided by the user and, if not, which additional parameters are required.",
        "1,ess frequent are int~'ractions which arise when a user provides sulficient, but incorrect, information: for example, there is no flight to the stated destination city.",
        "Rather than simply informing the dialogue module that the task cannot be satisfied, the task module a.ttempts to relax task parameters and suggest, alternative vMues for them (Guyomard and Siroux, 1988).",
        "For example, if there are no flights available ill the morning of the given departure day, flights in the afternoon n-my be suggested.",
        "In such cases, system utterances are selected and formulated so as to make explicit to the user the fact that an alternative is being offered."
      ]
    }
  ]
}
