{
  "info": {
    "authors": [
      "Vincent Ng",
      "Claire Cardie"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P02-1014",
    "title": "Improving Machine Learning Approaches to Coreference Resolution",
    "url": "https://aclweb.org/anthology/P02-1014",
    "year": 2002
  },
  "references": [
    "acl-J01-4004",
    "acl-J94-4002",
    "acl-M95-1005",
    "acl-M95-1010",
    "acl-M95-1014",
    "acl-N01-1008",
    "acl-P95-1017",
    "acl-W97-1303"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present a noun phrase coreference system that extends the work of Soon et al.",
        "(2001) and, to our knowledge, produces the best results to date on the MUC6 and MUC-7 coreference resolution data sets – F-measures of 70.4 and 63.4, respectively.",
        "Improvements arise from two sources: extralinguistic changes to the learning framework and a large-scale expansion of the feature set to include more sophisticated linguistic knowledge."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Noun phrase coreference resolution refers to the problem of determining which noun phrases (NPs) refer to each real-world entity mentioned in a document.",
        "Machine learning approaches to this problem have been reasonably successful, operating primarily by recasting the problem as a classification task (e.g. Aone and Bennett (1995), McCarthy and Lehnert (1995)).",
        "Specifically, a pair of NPs is classified as co-referring or not based on constraints that are learned from an annotated corpus.",
        "A separate clustering mechanism then coordinates the possibly contradictory pairwise classifications and constructs a partition on the set of NPs.",
        "Soon et al.",
        "(2001), for example, apply an NP coreference system based on decision tree induction to two standard coreference resolution data sets (MUC-6, 1995; MUC7, 1998), achieving performance comparable to the best-performing knowledge-based coreference engines.",
        "Perhaps surprisingly, this was accomplished in a decidedly knowledge-lean manner – the learning algorithm has access to just 12 surface-level features.",
        "This paper presents an NP coreference system that investigates two types of extensions to the Soon et al.",
        "corpus-based approach.",
        "First, we propose and evaluate three extralinguistic modifications to the machine learning framework, which together provide substantial and statistically significant gains in coreference resolution precision.",
        "Second, in an attempt to understand whether incorporating additional knowledge can improve the performance of a corpus-based coreference resolution system, we expand the Soon et al.",
        "feature set from 12 features to an arguably deeper set of 53.",
        "We propose additional lexical, semantic, and knowledge-based features; most notably, however, we propose 26 additional grammatical features that include a variety of linguistic constraints and preferences.",
        "Although the use of similar knowledge sources has been explored in the context of both pronoun resolution (e.g. Lap-pin and Leass (1994)) and NP coreference resolution (e.g. Grishman (1995), Lin (1995)), most previous work treats linguistic constraints as broadly and unconditionally applicable hard constraints.",
        "Because sources of linguistic information in a learning-based system are represented as features, we can, in contrast, incorporate them selectively rather than as universal hard constraints.",
        "Our results using an expanded feature set are mixed.",
        "First, we find that performance drops significantly when using the full feature set, even though the learning algorithms investigated have built-in feature selection mechanisms.",
        "We demonstrate empirically that the degradation in performance can be attributed, at least in part, to poor performance on common noun resolution.",
        "A manually selected subset of 22–26 features, however, is shown to provide significant gains in performance when chosen specifically to improve precision on common noun resolution.",
        "Overall, the learning framework and linguistic knowledge source modifications boost performance of Soon’s learning-based coreference resolution approach from an F-measure of 62.6 to 70.4, and from 60.4 to 63.4 for the MUC-6 and MUC-7 data sets, respectively.",
        "To our knowledge, these are the best results reported to date on these data sets for the full NP coreference problem.",
        "The rest of the paper is organized as follows.",
        "In sections 2 and 3, we present the baseline coreference system and explore extralinguistic modifications to the machine learning framework.",
        "Section 4 describes and evaluates the expanded feature set.",
        "We conclude with related and future work in Section 5."
      ]
    },
    {
      "heading": "2 The Baseline Coreference System",
      "text": [
        "Our baseline coreference system attempts to duplicate both the approach and the knowledge sources employed in Soon et al.",
        "(2001).",
        "More specifically, it employs the standard combination of classification and clustering described above.",
        "Building an NP coreference classifier.",
        "We use the C4.5 decision tree induction system (Quinlan, 1993) to train a classifier that, given a description of two NPs in a document, NPi and NPj, decides whether or not they are coreferent.",
        "Each training instance represents the two NPs under consideration and consists of the 12 Soon et al.",
        "features, which are described in Table 1.",
        "Linguistically, the features can be divided into four groups: lexical, grammatical, semantic, and positional .2 The classification associated with a training instance is one of COREFERENT or NOT COREFERENT depending on whether the NPs co-refer in the associated training text.",
        "We follow the procedure employed in Soon et al.",
        "to cre",
        "ate the training data: we rely on coreference chains from the MUC answer keys to create (1) a positive instance for each anaphoric noun phrase, NPj, and its closest preceding antecedent, NPi; and (2) a negative instance for NPj paired with each of the intervening NPs, NPi+1, NPi+2,..., NPj_1.",
        "This method of negative instance selection is further described in Soon et al.",
        "(2001); it is designed to operate in conjunction with their method for creating coreference chains, which is explained next.",
        "Applying the classifier to create coreference chains.",
        "After training, the decision tree is used by a clustering algorithm to impose a partitioning on all NPs in the test texts, creating one cluster for each set of coreferent NPs.",
        "As in Soon et al., texts are processed from left to right.",
        "Each NP encountered, NPj, is compared in turn to each preceding NP, NPi, from right to left.",
        "For each pair, a test instance is created as during training and is presented to the coreference classifier, which returns a number between 0 and 1 that indicates the likelihood that the two NPs are coreferent.3 NP pairs with class values above 0.5 are considered COREFERENT; otherwise the pair is considered NOT COREFERENT.",
        "The process terminates as soon as an antecedent is found for NPj or the beginning of the text is reached."
      ]
    },
    {
      "heading": "2.1 Baseline Experiments",
      "text": [
        "We evaluate the Duplicated Soon Baseline system using the standard MUC-6 (1995) and MUC7 (1998) coreference corpora, training the coreference classifier on the 30 “dry run” texts, and applying the coreference resolution algorithm on the 20–30 “formal evaluation” texts.",
        "The MUC-6 corpus produces a training set of 26455 instances (5.4% positive) from 4381 NPs and a test set of 28443 instances (5.2% positive) from 4565 NPs.",
        "For the MUC-7 corpus, we obtain a training set of 35895 instances (4.4% positive) from 5270 NPs and a test set of 22699 instances (3.9% positive) from 3558 NPs.",
        "Results are shown in Table 2 (Duplicated Soon Baseline) where performance is reported in terms of recall, precision, and F-measure using the model-theoretic MUC scoring program (Vilain et al., 1995).",
        "features.",
        "Non-relational features test some property P of one of the NPs under consideration and take on a value of YES or NO depending on whether P holds.",
        "Relational features test whether some property P holds for the NP pair under consideration and indicate whether the NPs are COMPATIBLE or INCOMPATIBLE w.r.t.",
        "P; a value of NOT APPLICABLE is used when property P does not apply.",
        "*’d features are in the hand-selected feature set (see Section 4) for at least one classifier/data set combination.",
        "The system achieves an F-measure of 66.3 and 61.2 on the MUC-6 and MUC-7 data sets, respectively.",
        "Similar, but slightly worse performance was obtained using RIPPER (Cohen, 1995), an information-gain-based rule learning system.",
        "Both sets of results are at least as strong as the original Soon results (row one of Table 2), indicating indirectly that our Baseline system is a reasonable duplication of that system.4 In addition, the trees produced by Soon and by our Duplicated Soon Baseline are essentially the same, differing only in two places where the Baseline system imposes additional conditions on coreference.",
        "The primary reason for improvements over the original Soon system for the MUC-6 data set appears to be our higher upper bound on recall (93.8% vs. 89.9%), due to better identification of NPs.",
        "For MUC-7, our improvement stems from increases in precision, presumably due to more accurate feature value computation."
      ]
    },
    {
      "heading": "Framework",
      "text": [
        "This section studies the effect of three changes to the general machine learning framework employed by Soon et al.",
        "with the goal of improving precision in the resulting coreference resolution systems.",
        "Best-first clustering.",
        "Rather than a right-to-left search from each anaphoric NP for the first coreferent NP, we hypothesized that a right-to-left search for a highly likely antecedent might offer more precise, if not generally better coreference chains.",
        "As a result, we modify the coreference clustering algorithm to select as the antecedent of NP✄ the NP with the highest coreference likelihood value from among preceding NPs with coreference class values above 0.5.",
        "Training set creation.",
        "For the proposed best-first clustering to be successful, however, a different method for training instance selection would be needed: rather than generate a positive training example for each anaphoric NP and its closest antecedent, we instead generate a positive training examples for its most confident antecedent.",
        "More specifically, for a non-pronominal NP, we assume that the most confident antecedent is the closest non",
        "pronominal preceding antecedent.",
        "For pronouns, we assume that the most confident antecedent is simply its closest preceding antecedent.",
        "Negative examples are generated as in the Baseline system.5 String match feature.",
        "Soon’s string match feature (SOONSTR) tests whether the two NPs under consideration are the same string after removing determiners from each.",
        "We hypothesized, however, that splitting this feature into several primitive features, depending on the type of NP, might give the learning algorithm additional flexibility in creating coreference rules.",
        "Exact string match is likely to be a better coreference predictor for proper names than it is for pronouns, for example.",
        "Specifically, we replace the SOONSTR feature with three features – PROSTR, PNSTR, and WORDSSTR – which restrict the application of string matching to pronouns, proper names, and non-pronominal NPs, respectively.",
        "(See the first entries in Table 3.)",
        "Although similar feature splits might have been considered for other features (e.g.",
        "GENDER and NUMBER), only the string match feature was tested here.",
        "Results and discussion.",
        "Results on the learning framework modifications are shown in Table 2 (third block of results).",
        "When used in combination, the modifications consistently provide statistically significant gains in precision over the Baseline system 5 This new method of training set creation slightly alters the class value distribution in the training data: for the MUC-6 corpus, there are now 27654 training instances of which 5.2% are positive; for the MUC-7 corpus, there are now 37870 training instances of which 4.2% are positive.",
        "without any loss in recall.6 As a result, we observe reasonable increases in F-measure for both classifiers and both data sets.",
        "When using RIPPER, for example, performance increases from 64.3 to 67.2 for the MUC-6 data set and from 60.8 to 63.2 for MUC-7.",
        "Similar, but weaker, effects occur when applying each of the learning framework modifications to the Baseline system in isolation.",
        "(See the indented Learning Framework results in Table 2.)",
        "Our results provide direct evidence for the claim (Mitkov, 1997) that the extralinguistic strategies employed to combine the available linguistic knowledge sources play an important role in computational approaches to coreference resolution.",
        "In particular, our results suggest that additional performance gains might be obtained by further investigating the interaction between training instance selection, feature selection, and the coreference clustering algorithm."
      ]
    },
    {
      "heading": "4 NP Coreference Using Many Features",
      "text": [
        "This section describes the second major extension to the Soon approach investigated here: we explore the effect of including 41 additional, potentially useful knowledge sources for the coreference resolution classifier (Table 3).",
        "The features were not derived empirically from the corpus, but were based on common-sense knowledge and linguistic intuitions",
        "regarding coreference.",
        "Specifically, we increase the number of lexical features to nine to allow more complex NP string matching operations.",
        "In addition, we include four new semantic features to allow finer-grained semantic compatibility tests.",
        "We test for ancestor-descendent relationships in WordNet (SUBCLASS), for example, and also measure the WordNet graph-traversal distance (WNDIST) between NPj and NPi .",
        "Furthermore, we add a new positional feature that measures the distance in terms of the number of paragraphs (PARANUM) between the two NPs.",
        "The most substantial changes to the feature set, however, occur for grammatical features: we add 26 new features to allow the acquisition of more sophisticated syntactic coreference resolution rules.",
        "Four features simply determine NP type, e.g. are both NPs definite, or pronouns, or part of a quoted string?",
        "These features allow other tests to be conditioned on the types of NPs being compared.",
        "Similarly, three new features determine the grammatical role of one or both of the NPs.",
        "Currently, only tests for clausal subjects are made.",
        "Next, eight features encode traditional linguistic (hard) constraints on coreference.",
        "For example, coreferent NPs must agree both in gender and number (AGREEMENT); cannot SPAN one another (e.g. “government” and “government officials”); and cannot violate the BINDING constraints.",
        "Still other grammatical features encode general linguistic preferences either for or against coreference.",
        "For example, an indefinite NP (that is not in apposition to an anaphoric NP) is not likely to be coreferent with any NP that precedes it (ARTICLE).",
        "The last subset of grammatical features encodes slightly more complex, but generally non-linguistic heuristics.",
        "For instance, the CONTAINSPN feature effectively disallows coreference between NPs that contain distinct proper names but are not themselves proper names (e.g. “IBM executives” and “Microsoft executives”).",
        "Two final features make use of an in-house naive pronoun resolution algorithm (PRORESOLVE) and a rule-based coreference resolution system (RULERESOLVE), each of which relies on the original and expanded feature sets described above.",
        "Results and discussion.",
        "Results using the expanded feature set are shown in the All Features block of Table 2.",
        "These and all subsequent results also incorporate the learning framework changes from Section 3.",
        "In comparison, we see statistically significant increases in recall, but much larger decreases in precision.",
        "As a result, F-measure drops precipitously for both learning algorithms and both data sets.",
        "A closer examination of the results indicates very poor precision on common nouns in comparison to that of pronouns and proper nouns.",
        "(See the indented All Features results in Table 2.7) In particular, the classifiers acquire a number of low-precision rules for common noun resolution, presumably because the current feature set is insufficient.",
        "For instance, a rule induced by RIPPER classifies two NPs as coreferent if the first NP is a proper name, the second NP is a definite NP in the subject position, and the two NPs have the same semantic class and are at most one sentence apart from each other.",
        "This rule covers 38 examples, but has 18 exceptions.",
        "In comparison, the Baseline system obtains much better precision on common nouns (i.e. 53.3 for MUC-6/RIPPER and 61.0 for MUC7/RIPPER with lower recall in both cases) where the primary mechanism employed by the classifiers for common noun resolution is its high-precision string matching facility.",
        "Our results also suggest that data fragmentation is likely to have contributed to the drop in performance (i.e. we increased the number of features without increasing the size of the training set).",
        "For example, the decision tree induced from the MUC-6 data set using the Soon feature set (Learning Framework results) has 16 leaves, each of which contains 1728 instances on average; the tree induced from the same data set using all of the 53 features, on the other hand, has 86 leaves with an average of 322 instances per leaf.",
        "Hand-selected feature sets.",
        "As a result, we next evaluate a version of the system that employs manual feature selection: for each classifier/data set combination, we discard features used primarily to induce low-precision rules for common noun resolution and retrain the coreference classifier using the reduced feature set.",
        "Here, feature selection does not depend on a separate development corpus and",
        "is guided solely by inspection of the features associated with low-precision rules induced from the training data.",
        "In current work, we are automating this feature selection process, which currently employs a fair amount of user discretion, e.g. to determine a precision cut-off.",
        "Features in the hand-selected set for at least one of the tested system variations are *’d in Tables 1 and 3.",
        "In general, we hypothesized that the hand-selected features would reclaim precision, hopefully without losing recall.",
        "For the most part, the experimental results support this hypothesis.",
        "(See the Hand-selected Features block in Table 2.)",
        "In comparison to the All Features version, we see statistically significant gains in precision and statistically significant, but much smaller, drops in recall, producing systems with better F-measure scores.",
        "In addition, precision on common nouns rises substantially, as expected.",
        "Unfortunately, the hand-selected features precipitate a large drop in precision for pronoun resolution for the MUC-7/C4.5 data set.",
        "Additional analysis is required to determine the reason for this.",
        "Moreover, the Hand-selected Features produce the highest scores posted to date for both the MUC6 and MUC-7 data sets: F-measure increases w.r.t.",
        "the Baseline system from 64.3 to 70.4 for MUC6/RIPPER, and from 61.2 to 63.4 for MUC-7/C4.5.",
        "In one variation (MUC-7/RIPPER), however, the Hand-selected Features slightly underperforms the Learning Framework modifications (F-measure of 63.1 vs. 63.2) although changes in recall and precision are not statistically significant.",
        "Overall, our results indicate that pronoun and especially common noun resolution remain important challenges for coreference resolution systems.",
        "Somewhat disappointingly, only four of the new grammatical features corresponding to linguistic constraints and preferences are selected by the symbolic learning algorithms investigated: AGREEMENT, ANIMACY, BINDING, and MAXIMALNP.",
        "Discussion.",
        "In an attempt to gain additional insight into the difference in performance between our system and the original Soon system, we compare the decision tree induced by each for the MUC-6",
        "data set.8 For our system, we use the tree induced on the hand-selected features (Figure 1).",
        "The two trees are fairly different.",
        "In particular, our tree makes use of many of the features that are not present in the original Soon feature set.",
        "The root feature for Soon, for example, is the general string match feature (SOONSTR); splitting the SOONSTR feature into three primitive features promotes the ALIAS feature to the root of our tree, on the other hand.",
        "In addition, given two non-pronominal, matching NPs (SOONSTRNONPRO=C), our tree requires an additional test on ANIMACY before considering the two NPs coreferent; the Soon tree instead determines two NPs to be coreferent as long as they are the same string.",
        "Pronoun resolution is also performed quite differently by the two trees, although both consider two pronouns coreferent when their strings match.",
        "Finally, intersentential and intrasentential pronominal references are possible in our system while intersentential pronominal references are largely prohibited by the Soon system."
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "We investigate two methods to improve existing machine learning approaches to the problem of",
        "noun phrase coreference resolution.",
        "First, we propose three extralinguistic modifications to the machine learning framework, which together consistently produce statistically significant gains in precision and corresponding increases in F-measure.",
        "Our results indicate that coreference resolution systems can improve by effectively exploiting the interaction between the classification algorithm, training instance selection, and the clustering algorithm.",
        "We plan to continue investigations along these lines, developing, for example, a true best-first clustering coreference framework and exploring a “supervised clustering” approach to the problem.",
        "In addition, we provide the learning algorithms with many additional linguistic knowledge sources for coreference resolution.",
        "Unfortunately, we find that performance drops significantly when using the full feature set; we attribute this, at least in part, to the system’s poor performance on common noun resolution and to data fragmentation problems that arise with the larger feature set.",
        "Manual feature selection, with an eye toward eliminating low-precision rules for common noun resolution, is shown to reliably improve performance over the full feature set and produces the best results to date on the MUC-6 and MUC-7 coreference data sets – F-measures of 70.4 and 63.4, respectively.",
        "Nevertheless, there is substantial room for improvement.",
        "As noted above, for example, it is important to automate the precision-oriented feature selection procedure as well as to investigate other methods for feature selection.",
        "We also plan to investigate previous work on common noun phrase interpretation (e.g. Sidner (1979), Harabagiu et al.",
        "(2001)) as a means of improving common noun phrase resolution, which remains a challenge for state-of-the-art coreference resolution systems."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Thanks to three anonymous reviewers for their comments and, in particular, for suggesting that we investigate data fragmentation issues.",
        "This work was supported in part by DARPA TIDES contract N66001-00-C-8009, and NSF Grants 0081334 and 0074896."
      ]
    }
  ]
}
