{
  "info": {
    "authors": [
      "Tomas Holan",
      "Vladislav Kuboň",
      "Karel Oliva",
      "Martin Platek"
    ],
    "book": "Workshop on Processing of Dependency-Based Grammars",
    "id": "acl-W98-0503",
    "title": "Two Useful Measures of Word Order Complexity",
    "url": "https://aclweb.org/anthology/W98-0503",
    "year": 1998
  },
  "references": [
    "acl-A97-1022"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents a class of dependency-based formal grammars (FODG) which can be parametrized by two different but similar measures of non-projectivity.",
        "The measures allow to formulate constraints on the degree of word-order freedom in a language described by a FODG.",
        "We discuss the problem of the degree of word-order freedom which should be allowed by a FODG describing the (surface) syntax of Czech."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In [Kubofi,Holan,Platek.1997) we have introduced a class of formal grammars.",
        "Robust fire-Order Dependency Grammars (RFODG's), in order to provide for a formal foundation to the way we are developing a grammar-checker for Czech.",
        "a natural language with a considerable level of word-order freedom.",
        "The design of RFODG's was inspired by the commutative CF-grammars (see [Huynh.831), and several types of dependency based grammars (cf.. e.g., [Gaifman, 1965].",
        "[Bileckij.1967], [Platek,1974], [MelZuk.1988]).",
        "Also in Wubon.Holan.Plitek,1997].",
        "we have introduced different measures of incorrectness and of non-projectivity of a sentence.",
        "The measures of the non-projectivity create the focus of our interest in this paper.",
        "They are considered as the measures of word-order freedom.",
        "Considering this aim we work here with a bit simplified version of RFODG's. namely with Free-Order Dependency Grammars (FODG's).",
        "The measures of word-order freedom are used to formulate constraints which can be imposed on FODG's globally, or on their individual rules.",
        "Two types of syntactic structures, namely DR – trees (delete-rewrite-trees), and De – trees (dependency trees), are connected with FODG's. Any DR-tree can be transformed into a De-tree in an easy and uniform way.",
        "In [Kubofi,Holan.Platek.1997] the measures of non-projectivity are introduced with the help of DR-trees only.",
        "Here we discuss one of them, called node-gaps complexity (Ng).",
        "It has some very interesting properties.",
        "CFL's are characterized by the complexity 0 of Ng.",
        "The Ng also characterizes the time complexity of the parser used by the above-nientioned grammar-checker.",
        "The sets of sentences with the Ng less than a fixed constant are parsable in a polynomial time.",
        "This led us to the idea to look for a fixed upper bound of Ng for all Czech sentences with a correct word order.",
        "In Diubofi,Holan,Pletek.1997] we even worked with the conjecture that such an upper bound can be set to 1.",
        "We will show in Section 5 that it is theoretically impossible to find such an upper bound, and that even for practical purposes, e.g.. for grammar-checking.",
        "it should be set to a value considerably higher than I.",
        "This is shown with the help of the measure dNg which is introduced in the same way as Ng.",
        "but on the dependency trees.",
        "dNg creates the lower estimation for Ng.",
        "The advantage of d.Ng is that it is linguistically transparent.",
        "It allows for an easy discussion of the complexity of individual examples (e.g.. Czech sentences).",
        "On the other hand, it allows neither for characterizing the class of CFL's, nor for imposing the context-free interpretation for some individual rules of a FODG.",
        "Also.",
        "no useful relation between dNg and some upper estimation of the time complexity of parsing has been established yet.",
        "These complementary properties of Ng and dNg force us to consider both of them simultaneously here."
      ]
    },
    {
      "heading": "2 FOD-Grammars",
      "text": []
    },
    {
      "heading": "The basic notion we work with are free-order dependency grammars (FODG's). In the sequel the FODG's are analytic (recognition) grammars.",
      "text": [
        "Definition -(FODG).",
        "Fly( •MTIt'r &pen& nry grammar (FOD() is a tuple G (T. N. St. 11.",
        "where the union of N and T is denoted as I'.",
        "T is the set.",
        "of terminals.",
        "N is the set.",
        "of now erminals.",
        "St C V is the set.",
        "of root-symbols (starling symbols).",
        "and P is the set of rewriting rules of two types of the form:",
        "a) A ix BC.",
        "where A E N. B,C E V. X is denoted as the subscript of the rule, X E R}.",
        "b) .4 B. where AEN.BE",
        "The letters L (R) in the subscripts of the rules mean that.",
        "the first (second) symbol on the right-hand side of the rule is considered dominant, and the other dependent.",
        "If a rule has only one symbol on its right-hand side, we consider the symbol to be dominant.",
        "A rule is applied (for a reduction) in the following way: The dependent symbol is deleted (if there is one on the right-hand side of the rule) , and the dominant one is rewritten (replaced) by the symbol standing on the left-hand side of the rule.",
        "The rules A – *1, BC, A .-1?",
        "BC, can be applied for a reduction of a string z to any of the occurrences of symbols B,C in z; where B precedes (not necessarily immediately) C in z.",
        "For the sake of the following explanations it is necessary to introduce a notion of a DR-tree (delete-rewrite-tree) according to G. A DR-tree maps the essential part of history of deleting dependent symbols and rewriting dominant symbols, performed by the rules applied.",
        "Put informally, a DR-tree (created by a FODG G) is a finite tree with a root and with the following two types of edges: a) vertical: these edges correspond to the rewriting of the dominant symbol by the symbol which is on the left-hand side of the rule (of G) used.",
        "The vertical edge leads (is oriented) from the node containing the original dominant symbol to the node containing the symbol from the left-hand side of the rule used.",
        "b) oblique: these edges correspond to the deletion of a dependent symbol.",
        "Any such edge is oriented from the node with the dependent deleted symbol to the node containing the symbol from the left-hand side of the rule used.",
        "Let us now proceed more formally.",
        "The following technical definition allows to derive a corresponding dependency tree from a DR-tree in a natural way.",
        "to define the notion of coverage of a node, and to define two measures of non-project ivity.",
        "In the sequel the symbol Nat means the set of natural numbers (without zero).",
        "Definition -('DR-Ire).",
        "A tuple Tr = (Nod.",
        "Ed.",
        "RI) is called DR-tree created by a FODG G ( where Nod means t lie set of nodes.",
        "Ed the set of edges.",
        "and RI means the root node).",
        "if the following points hold for any 17 E Nod:",
        "where k,p E Nat.",
        "The .4 is called symbol of U. the number i is called horizontal index of U. j it called vertical index, e is called domination index.",
        "The horizontal index expresses the correspondence of U with the i-th input symbol.",
        "The vertical index corresponds to the length increased by 1 of the path leading bottom-up to U from the leaf with the horizontal index i.",
        "The domination index either represents the fact.",
        "that no edge starts in U (e = 0) or it represents the final node of the edge starting in U (e = kr, cf. also the point e) below).",
        "exactly one node U1 of the form [Bei, 5 – 1, ij] in Tr, such that the pair (UI.",
        "U) creates a (vertical) edge of Tr, and there is a rule in G with A on its left-hand side, and with B in the role of the dominant symbol of its right-hand side.",
        "c) Let U =[A,i, j,e).",
        "Then U is a leaf if and only if A ET (terminal symbol of G), and j = 1. d) Letql = [A,1.",
        "j,e].",
        "U = RI iff it is the single node with the domination index (e) equal to 0. e) Let U = i.j,e].",
        "If e = kr and k < i (resp.",
        "k> i).",
        "then an oblique edge leads from U (dependent node) to its mother node Urn with the horizontal index k. and vertical index p. Further a vertical edge leads from some node U. to Um.",
        "Let C be the symbol from Um.",
        "B from U. then there exists a rule in G of the shape C L BA (resp.",
        "C in AB).",
        "f) Let U = [A.i.j.e].",
        "If e = kr.",
        "and k = 1. then p.= j + 1, and a vertical edge leads (bottom up) from U to its mother node with the same horizontal index i. and with the vertical index j +1.",
        "We will say that a DR-tree Tr is complete if for any of its leaves U = i.1,e].",
        "where i> 1• it holds that there is exactly one leaf with the horizontal index – 1 in Tr.",
        "Example 1.",
        "This formal example illustrates the notion of FODG.",
        "The following grammars GI.",
        "G., are FODG's. G1= (Ni,T1.(.5).",
        "Pi).",
        "T2 = (a. b.c).",
        "= (T,S}.",
        "P3 = (.5 L aTISS, S R Ta.",
        "T bc,T -+n 61.",
        "= (N2, T2.",
        "(S) P2), = {o.b,c.d}.",
        "= {S. , .52), P2 = {S – in Staid, S1 in 526, S2 in Sc}.",
        "Fig.1 .",
        "displays a DR-tree generated by G1 for the input sentence aabbcc.",
        "= [a. I.",
        "0].",
        "A'?",
        "= [a.",
        "2.",
        "1].",
        "N3 = [b.",
        "3, 2].",
        "N4 = [b.4, 1].",
        "N5 = [c, 5.",
        "31, N6 = [c, 6, 4].",
        "Let w = w E T. Tr E TN(G).",
        "and let [at.1,1.e(i)] denote the i-th leaf of Tr for i = 1, n In such a case we say that the string w is parsed into Tr by G. The symbol L(G) represents the set of strings (sentences) parsed into some DR – tree from TN(G).",
        "We will also write TN(w,G)= {Tr: w is parsed into Tr by G}.",
        "Example 2.",
        "Let us take the grammar G1 from the example 1.",
        "Then L(G3) {w E {a,b.c}+Iw contains the same number of a's. Vs. and c's }.",
        "Let us take the G2.",
        "Then L(G2) = {dulte E L(G1).L(G2) are two variants of a well known non-context-free language.",
        "Let us now introduce dependency trees parsed from a,string.",
        "Informally, a dependency tree is obtained by contracting each vertical path of a DR-tree into its (starting) leaf."
      ]
    },
    {
      "heading": "Definition - (De-tree). Let Tr E TN(w.G) (te",
      "text": [
        "is parsed into Tr by G), where u.",
        "= The dependency tree dT(Tr) contracted from Tr is defined as follows: The set of nodes of dT(Tr) is the set of 3-tuples [at.",
        "i. k(i)] (note that ai is the i-th symbol of w).",
        "k(i) = 0 if and only if the root of Tr has the horizontal index i (then the [of.",
        "i. k(i)] is also the root of dT(Tr)).",
        "k(i) E Nat Wand only if in 'Fr an oblique edge leads from some node with the horizontal index i to some node with the horizontal index k(i).",
        "We can see that the edges of dT(Tr) correspond (one to one) to the oblique edges of Tr, and that they are fully represented by the second and the third slot of nodes of dT(Tr).",
        "The second slot is called horizontal inder of the node.",
        "The symbol dTN(w,G) denotes the set of dT(Tr).",
        "where Tr E TN(w.G).",
        "The symbol dTN(G) denotes the union of all dTN(tv,G) for w E L(G).",
        "We say that dTN(G) is the set of De-trees parsed by G. An example of a dependency tree is given in Fig. 2."
      ]
    },
    {
      "heading": "3 Discontinuity measures",
      "text": [
        "In this section we introduce two measures of non-project ivity (discontinuity).",
        "First we introduce the notion of a coverage of a node of a DR-tree.",
        "Definition.",
        "Let Tr be a DR – tree.",
        "Let u be a node of Tr.",
        "As Cov(u. Tr) we denote the set.",
        "of horizontal indices of nodes from which a path (bottom up) leads to u.",
        "(Cor(ti,Tr) obligatorily contains the horizontal index oft,).",
        "We say that Cov(u. Tr) is the coverage of u (according to Ti').",
        "- Example 3.",
        "This example shows the coverage of",
        "individual nodes of Tri from Fig.l.",
        "Cor([T, 4.",
        "2.",
        "I2], Tr) = (4.6).",
        "Cot.([T.",
        "3.",
        "2.",
        "22].",
        "Tr' ) = (3.",
        "5).",
        "Let us define a (complexity) measure of non-projectivity by means of the notion of a coverage for each type of trees: Definition.",
        "Let Tr be a DR – tree.",
        "Let it be a node of Tr, Cov(u, Tr) = {it, i2, ..., in), and it < i2 in_ < in.",
        "We say that the pair forms a gap if 1 < j < n, and ii4.1 – ij > 1.",
        "The symbol Ng(u, Tr) represents the number of gaps in Cov(u, Tr).",
        "Ng(Tr) denotes the maximum from g(u,Tr); u E Tr}.",
        "We say that Ng(Tr) is the node-gaps complerity of Tr.",
        "In the same way dNg(dTr) can be introduced for any dependency tree dTr.",
        "Example 4.",
        "We stick to the DR-tree Tri from previous examples.",
        "The following coverages contain gaps: Cov([T, 4, 2, 12), Tri) = (4,6) Cov([T, 3, 2, 22], Tri) = (3,5) Cov([S, 2.",
        "2, 13], Tri) = (2, 3, 5) Cov([S, 1, 2, 13], Tri ) = (1, 4, 6) has one gap (4,6), has one gap (3.5), has one gap (3.5), has two gaps (1.4) and (4.6).",
        "We can see that Trt has three different gaps (1.4),(3,5).(4.6).",
        "and Ng(Tri)= 2.",
        "Example 5.",
        "This example shows the coverages of the nodes of dTri from Figure 2.",
        "Cor([a.1,0],dTri)= 1.",
        "2.",
        "3, 4, 5.",
        "6).",
        "Cor([a.",
        "2. lbdTri) = {2.3.5).",
        "Coral.. 3.",
        "2).",
        "dTri) = {3.",
        "5} .",
        "Cot ([b.",
        "4.",
        "1], dTri) = (4.",
        "6), Gor([e. 5.",
        "3].",
        "dTri ) = (5), Cov([c. 6.",
        "4].",
        "dTri) = (6) We can see that dTri has two different gaps (3.5).(4,6).",
        "and dNg(dTri)= 1.",
        "Definitions.",
        "Let i E (NatU{O)U{*)) and let * be greater than any natural number.",
        "Let us denote as TN (tr.G.",
        "i) the set of DR-trees from TN(w, G) such that tht value of the measure Ng does not exceed i on them.",
        "When i is the symbol *.",
        "it means that no limitation is imposed on the corresponding value of the measure Ng.",
        "Let us denote LN(G. i) = {id TN(tv.",
        "G. i) 0).",
        "TN(G, 1) denotes the union of all TN(tr,G.i) over all tr E L(G,i).",
        "TN(i) denotes the class of sets (of DR-trees) T N (G. i).",
        "for all FOD-grammars G. LN (i) denotes the class of languages LN(G,i).",
        "for all FOD-grammars G. The denotations dTN(w.(7.1).",
        "d LN (G. i).",
        "dTN(1).",
        "(i) ran be introduced stepwise in the same way for De-trees as TN( G. L N (G. i)."
      ]
    },
    {
      "heading": "4 Formal observations",
      "text": [
        "This section contains some observations concerning the notions defined above.",
        "Due to space limitations.",
        "they are not accompanied by (detailed) proofs.",
        "The symbol CF+ denotes the set of context-free languages without the empty string and corriCF+ denotes the set of commutative context-free languages without the empty string (L is a commutative CF-language if it is composed from a CF-language and from all permutations of its words (see, e.g., (0)): note, in particular, that L need not be a context-free language, actually the classes C F+ ,comCF+ are incomparable).",
        "The rules of a FODG not allowing any gaps are interpreted in an usual context-free way.",
        "b) dLN(0) contains non-context-free languages.",
        "Such a language is, e.g.. L(G2) from example 2.",
        "It holds that all De-trees from dT(G2) do not have any gaps.",
        "On the other hand the number of gaps in the set of DR-trees parsed by G2 is not bounded by any constant..",
        "It easy to see the inclusion.",
        "The fact that it is a proper inclusion can be shown by the context-free language fan cbnin > 0), a language which is not commutative context-free.",
        "and is obviously from LN(i) for any i E (Na!",
        "U {0) U {*}) d) The L(Gt).",
        "L(G2) from the example 2 are commutative CF-languages which are not context-free.",
        "The language Lei = {eV' eV\" antn.",
        "m > 0) is from CF+, but it is not from LX(*).",
        "It means that the classes LX(*) and LA(0) = CF+ are incomparable.",
        "e) LN(i) C dLN(i) for any natural number i (since Ng(Tr) > dNg(dT(Tr)) for any DR-tree Tr).",
        "f) Any language L from LN(i).",
        "where i E (Nat U (0)), is recognizable in a polynomial time compared to the size of the input.",
        "We have implemented (see [Holan.Kubott, Plitek.",
        "1994 [Holan.Kubon.",
        "Plitek.",
        "1997].)",
        "a natural bottom-up parsing algorithm based on the stepwise computation of pairs of the shape ((7.",
        "Ct.).",
        "where U means a node of a DR-tree and Cr means its coverage.",
        "Wit It the Ng (it can be interpreted as the maximum of the number of gaps in the coverages during a computation oft he parser) limited by a constant.",
        "t he number",
        "of such pairs depends polynomially on the size of the input.",
        "The assertion f) is derived from this observation.",
        "g) Because a limited dNg for a language L does not ensure also the limited Ng (see the item b)) for L. the limited dNg need not ensure the parsing in a polynomial time for the language L."
      ]
    },
    {
      "heading": "5 A measure of word order freedom",
      "text": []
    },
    {
      "heading": "of syntactically correct Czech sentences",
      "text": [
        "In this section we describe linguistic observations concerning the word-order complexity of the surface Czech syntax.",
        "The notions defined above are used in this section.",
        "We are going to discuss the fact that for Czech syntax (described by means of a FODG GE) there is no adequate upper estimate of the boundary of correctness of word-order freedom based on node-gaps complexities.",
        "It means that we are going to show that there is no i0 such that each De-tree belonging to drN(GE,i) – dTN(GE,i0) for i > io is (quite clearly) syntactically incorrect.",
        "Let us now show a number of examples of non-projective constructions in Czech.",
        "In the previous work (see (Holan.Kuboh.Plitek,19971) we have put forward a hypothesis that from the practical point of view it is advisable to restrict the (possible) local number of gaps to one.",
        "However, we found out soon that this is not generally true because it is not very difficult to find a perfectly natural, understandable and syntactically well-formed sentence with dNg higher than one.",
        "Such a sentence may for example look like this: Tuto knihu jsem se mu rozhodl ddt k narozeninam.",
        "(Lit.",
        ": This book 1-have-Refl.",
        "him decided [to) give to birthday.)",
        "[I decided to give him this book to birt hday.)",
        "The Fig.3 shows one of possible De-trees representing.",
        "this sentence: The node[ckit,7,6] has a coverage containing two gaps.",
        "Since no other node has a coverage with more gaps, then (according to the definition of &Ng) the dependency node-gaps complexity of this dependency tree is equal to 2.",
        "It is even quite clear that it is not possible to find a linguistically adequate De-tree representing the same sentence with a lower value of dNg (words jsetn, se and rozhodl will always cause gaps in the coverage of dot).",
        "The maximum empirically attested number of verbal participatits is 5 in Czech (see [Sgall,Panevova.1988/t49]).",
        "The previous example showed that the infinitives of verbs with h such a number of participants may quite naturally form constructions containing four gaps.",
        "It.",
        "might, even suggest.",
        "that.",
        "the number four might.",
        "hence, serve RS an upper estimation of dNg (based on the highest.",
        "possible number of participants of an infinitive).",
        "However, this conclusion would not be correct, since in the general case it.",
        "is necessary to take into account.",
        "also the possibility that.",
        "participants are combined with free modifiers, and from this it follows that.",
        "it is not reasonable to set a certain constant as an upper boundary of dNg .",
        "In order to exemplify this, we present the sentence Za &mini krize by se lidem jako Petr kvedi jejich prijmtim takovg byt ddn maji-lel domu tu cenu nemohl na tak dlouhou dobu sneit pronajimat.",
        "(Lit.",
        ": In today's crisis would Refl.",
        "people (dot.)",
        "as Petr because-of their income such flat no owner of-a-house for that price couldn't for such long time try to-rent) Em n today's crisis no landlord would try to rent a flat for that.",
        "price for such a long time to such people as Petr because of their income.)",
        "Similarly as in the previous case.",
        "Fig.5 shows a dependency tree representing the structure of the sample sentence.",
        "The words by , majitel.",
        "snalit and pronajimat depend (immediately) on the main verb nemohl.",
        "They are together with their dependents interlocked with the set of word groups {Za dneini krize; lidem jako Petr; takorg by!",
        ": za tu cenu and no tak dlouhou dobu } dependent on the subordinated verb in infinitive form (pronajimat - to rent), creating thus five gaps in the local tree whose governor is pronajimat.",
        "The previous claim is supported also by another example of combination of different types of non-projectivities inside one clause.",
        "Apart from gaps caused by complementations.",
        "the following syntactically correct sentence contains also a gap between a wh-pronoun and a noun.",
        "The Fig.4 shows that the value of dNg is equal to 3 for this sentence.",
        "Ke kolikdigm jsem se mu nakonec tubo knihu rozhodl ddt narozenineim?",
        "(Lit.",
        ": To which I-have-Refl.",
        "him finally this book decided to give birthday) [Which birthday I finally decided to give him this book to?)",
        "The examples presented above illustrate the fact that the measure of dNg has (in Czech) similar properties as some other simple measures of complexity of sentences (the length of a sentence, the level of center-embedding.",
        "etc.).",
        "It is quite clear that for the sake of readability and simplicity it is advisable to produce sentences with a low score of these simple measures.",
        "On the other hand.",
        "it is not possible to",
        "Ke kolilcityrn jsem se mu nakonec tuto knihu rozhodl dist narozeninim?",
        "[1.111 (2.113 [3.91 (4.9) 15.103 tray (7.8) (8.103 (9.0) (10,9 (111 01 To which I have Refl.",
        "him this book decided go] give birthday?",
        "set a fixed threshold above which the sentence may be considered ungrammatical.",
        "Similarly as very long sentences or sentences with complex self-embedding, also the sentences containing a large number of gaps may be considered stylistically inappropriate, but not syntactically ill-formed."
      ]
    },
    {
      "heading": "6 An enhancing of FODG",
      "text": [
        "Even when the examples presented above show the unlimited nature of nonprojective constructions in Czech, it is necessary to point out that there are some constructions, which do not allow non-projectivity at all.",
        "These constructions therefore require a limitation applied to particular grammar rules handling them.",
        "For example, some of the grammar rules then allow only projective interpretation of input data.",
        "As an example of such a construction in Czech we may take an attachment of a nominal modifier in genitive case to a governing noun",
        "shop).",
        "Only the words modifying (directly or indirectly) one of the nouns may appear in between the two nouns.",
        "no 'gap\" is allowed.",
        "(obchod s potravinami nacho otce) Formally we add the previously described \"projectivity\" constraint to a rule of the form _4 -4x CB with help of an upper index 0.",
        "Hence the augmented rule has the following form A – OA-CB.",
        "It means that any node of a DR-tree created by this rule (corresponding to the left-hand side _4) can be a root of a subtree without gaps only.",
        "We can easily see that with such a type of rules.",
        "the power of (enhanced) FODG's increases substantially.",
        "Formal observation.",
        "The class of languages parsed (generated) by enhanced FODG's contains CF+ and comCF+.",
        "This type of enhanced FODG is used for our current.",
        "robust parser of Czech.",
        "We outline a further enhancing of FODG's: We can imagine that if we write for some natural number i a rule of the shape .4-41,vCB it means that any node created by this rule can have a coverage with at most i gaps.",
        "We can easily see that with such a type of rules.",
        "the power of FODG's enhanced in this way again increases substantially."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "We have not considered some other natural measures of non-project ivity here.e.g.. the number of crossings ([1:u nze.1972]).",
        "the size of gaps or the tree-gaps complexity ([Holan.",
        "Nubian.",
        "Platek.I995]).",
        "By t his measures it is much easier to show the nonexistence of their upper boundaries concerning the non-projerlivily (.7zech than by dNg.",
        "The presented measure's Ng and d N g help us to show that it is not easy to describe the Czech syntax (in part ic-ular.",
        "to reflect the word-order) fully and adequately.",
        "It is further shown that.",
        "it.",
        "is not easy (maybe impossible) to find an algoritm which should guarantee parsing of any correct Czech sentence with a (not too high) polynomial time complexity according to its size.",
        "We will try in future to improve the description, and also the parsing algorithm, in order to come closer to meeting this challenge."
      ]
    },
    {
      "heading": "8 Aknowledgement",
      "text": [
        "We are very thankful to prof. Haji.tovi and prof.Panevova for their recomendations.",
        "The work on this paper is a part of the project"
      ]
    }
  ]
}
