{
  "info": {
    "authors": [
      "Victor Kapustin",
      "Anna Jamsen"
    ],
    "book": "Workshop on TextGraphs: Graph-Based Algorithms for Natural Language Processing",
    "id": "acl-W07-0213",
    "title": "Vertex Degree Distribution for the Graph of Word Co-Occurrences in Russian",
    "url": "https://aclweb.org/anthology/W07-0213",
    "year": 2007
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Vertex Degree Distribution for the Graph of Word Co-Occurrences",
        "in Russian",
        "Faculty of Philology Saint-Petersburg State University Saint-Petersburg, Russia 199178 vak@icape.nw.ru",
        "Degree distributions for word forms cooccurrences for large Russian text collections are obtained.",
        "Two power laws fit the distributions pretty good, thus supporting Dorogovtsev-Mendes model for Russian.",
        "Few different Russian text collections were studied, and statistical errors are shown to be negligible.",
        "The model exponents for Russian are found to differ from those for English, the difference probably being due to the difference in the collections structure.",
        "On the contrary, the estimated size of the supposed kernel lexicon appeared to be almost the same for the both languages, thus supporting the idea of importance of word forms for a perceptual lexicon of a human."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Few years ago Ferrer and Sole (2001a) draw the attention of researchers to the fact that the lexicon of a big corpus (British National Corpus - BNC in the case) most probably consists of two major components: a compact kernel lexicon of about 10 10 words, and a cloud of all other words.",
        "Ferrer and Sole studied word co-occurrence in BNC in (2001b).",
        "Two word forms in BNC were considered as \"interacting\" when they appeared in the same sentence and the words' distance didn't exceed 2.",
        "Ferrer and Sole (2001b) treated also some other noAnna Jamsen",
        "Faculty of Philology Saint-Petersburg State University Saint-Petersburg, Russia 199178 tions of word interaction, but the results obtained don't differ qualitatively.",
        "The interacting words form a graph, where the vertices are the words themselves, and the edges are the words' cooccurrences.",
        "The fact of the collocation considered to be important, not the number of collocations of the same pair of words.",
        "Ferrer and Sole (2001b) studied vertices degree distribution and found two power laws for that distribution with a crossover at a degree approximately corresponding to the previously found size of the supposed kernel lexicon of about 10 - 10 words.",
        "In (Sole et al., 2005) word co-occurrence networks were studied for small (about 10 lines of text) corpora of English, Basque, and Russian.",
        "The authors claim the same two-regime word degree distribution behavior for all the languages.",
        "Dorogovtsev and Mendes (2001, 2003: 151-156) offered an abstract model of language evolution, which provides for two power laws for word degree distribution with almost no fitting, and also explains that the volume of the region of large degrees (the kernel lexicon) is almost independent of the corpus volume.",
        "Difference between word (lemma) and word form for an analytic language (e.g. English) seems to be small.",
        "Dorogovtsev-Mendes model certainly treats word forms, not lemmas, as vertices in a corpus graph.",
        "Is it really true for inflecting languages like Russian?",
        "Many researchers consider a word form, not a word (lemma) be a perceptual lexicon unit (Zasorina, 1977; Ventsov and Kas-sevich, 1998; Verbitskaya et.",
        "al., 2003; Ventsov et.",
        "al., 2003).",
        "So a hypothesis that word forms in a corpus of an inflecting language should exhibit degree distribution similar to that of BNC looks appealing.",
        "An attempt to investigate word frequency rank statistics for Russian was made by Gelbukh and Si-dorov (2001), but they studied only Zipf law on too small texts to reveal the kernel lexicon effects.",
        "To study the hypothesis one needs a corpus or a collection of texts comparable in volume with the BNC part that was examined in (Ferrer and Sole, 2001b), i.e. about 4.10 word occurrences.",
        "Certainly, texts that were analyzed in (Sole et al., 2005) were much smaller.",
        "Recently Kapustin and Jamsen (2006) and Ka-pustin (2006) studied a big (~5.10 word occurrences) collection of Russian.",
        "The collection exhibited power law behavior similar to that of BNC except that the vertex degree at the crossover point and the average degree were about 4-5 times less than that of BNC.",
        "These differences could be assigned either to a collection nature (legislation texts specifics) or to the properties of the (Russian) language itself.",
        "We shall reference the collection studied in (Kapustin and Jamsen, 2006; Kapustin, 2006) as \"RuLegal\".",
        "In this paper we present a study of another big collection of Russian texts.",
        "We have found that degree distributions (for different big sub-collections) are similar to those of BNC and of RuLegal.",
        "While the exponents and the kernel lexicon size are also similar to those of BNC, the average degree for these collections are almost twice less than the average degree of BNC, and the nature of this difference is unclear still.",
        "The rest of the paper has the following structure.",
        "Technology section briefly describes the collection and the procedures of building of cooccurrence graph and of calculation of exponents of power laws.",
        "In Discussion section we compare the results obtained with those of Kapustin and Jamsen (2006), Kapustin (2006), and (Ferrer and Sole, 2001b).",
        "In Conclusion some considerations for future research are discussed."
      ]
    },
    {
      "heading": "2. Technology",
      "text": [
        "At present Russian National Corpus is unavailable for bulk statistical research due to copyright considerations.",
        "So we bought a CD (\"World Literature in Russian\") in a bookstore - a collection of fiction translations to Russian.",
        "We'll call the collection WLR.",
        "The size of the whole collection is more than 10 word occurrences.",
        "The source format of the collection is HTML, but its files contain essentially no formatting, just plain paragraphs.",
        "We made three non-overlapping samples from WLR (WLR1-3).",
        "The samples were approximately of the same size.",
        "Each sample was processed the same way.",
        "The idea behind using more than one sample was to estimate statistical errors.",
        "We used open source Russian grapheme analysis module (Sokirko, 2001) to strip HTML and to split the texts into words and sentences.",
        "Word cooccurrences were defined as in (Ferrer and Sole, 2001b): two words are \"interacting\" if and only if they: (a) appear in the same sentence, and (b) the word distance is either 1 (adjacent words) or 2 (one word or a number or a date in-between).",
        "A found co-occurred pair of words was tried out against MySQL database of recorded word pairs, and if it wasn't found in the database, it was put there.",
        "Then we use a simple SQL query to get a table of count of vertices p(k) vs. vertex degree k.",
        "The raw results for one of the samples are shown on Fig. 1.",
        "For the two other samples the distributions are similar.",
        "All distributions are almost linear (in log-log coordinates, that means that they obey power law), but fitting is impossible due to high fluctuations.",
        "As noted by Dorogovtsev and Mendes (2003: 222-223), cumulative distribution P(k) = Sj^k p(K) fluctuates much less, so we calculated the cumulative degree distributions (Fig.2).",
        "Cumulative degree distributions for all three WLR samples are very similar.",
        "o",
        "log(k",
        ">",
        "\\",
        "J",
        "%",
        "i",
        "o o",
        "«H9»",
        "<X O",
        "«1",
        "oo o cono o",
        "DOGWOOD",
        "mamtco o",
        "0",
        "L'",
        "ooceo o",
        " – \"",
        "oo"
      ]
    },
    {
      "heading": "3. Discussion",
      "text": [
        "To estimate statistical errors we have normalized the distributions to make them comparable: the degree ranges were reduced to the largest one, then the cumulative degree distribution was sampled with the step of 1/3, as in (Ferrer and Sole, 2001a, Dorogovtsev and Mendes, 2003: 222-223).",
        "When we use WLR samples only, the statistical errors are less than 7% in the middle of the curves and reach a margin of 77% in small degrees region.",
        "With the inclusion of RuLegal sample, difference between samples becomes larger - up to 13% in the middle of the curves), but are still small enough.",
        "In both cases (with and without RuLegal) we attempted to fit either a single power law (a straight line in log-log coordinates) or two/three power laws with one/two crossover points.",
        "Strong changes and large statistical errors of the distributions in the low degree region prevent meaningful usage of these points for fitting.",
        "We have made attempts to fit all three approximations for all points, and omitting one or two points with the lowest degrees.",
        "To choose between the hypotheses we minimized Schwarz information criterion (Schwarz, 1978):",
        "where pi - cumulative distribution at i-th point; p\"i - fitting law at the same point; N - number of sampling points (13-15, depending on the number of",
        "omitted points); m - number of fitting parameters (2, 4 or 6)",
        "Clearly two power laws fit the curves better.",
        "The exponents, the crossover degree and estimated size of the kernel lexicon (number of vertices with high degrees above the crossover) for the best fits (two powers, zero/one omitted point) are shown in Table 2.",
        "The exponents for the raw distributions are Yi and Y2 minus 1.",
        "Disagreement between English and Russian seems to exist.",
        "Probably, the differences are still due to the collections' nature (the difference between different Russian collections is noticeable)."
      ]
    },
    {
      "heading": "4. Conclusion",
      "text": [
        "We found that ergodic hypothesis for word form degree distribution seems to work for large text collections - differences between the distributions are small (except for the few smallest degrees).",
        "At least, a single big enough sample permits reliable calculation of degree distribution parameters.",
        "Omitted points",
        "SIC (1/2/3 power laws)",
        "WLR1-S",
        "WLR1-S + RuLegal",
        "0",
        "-44 / -85 / -68",
        "-42 / -93 / -77",
        "1",
        "-46 / -85 / -65",
        "-43 / -93 / -73",
        "2",
        "-47 / -80 / -60",
        "-44 / -86 / -67",
        "WLR1-S",
        "WLR1-S",
        "RuLegal",
        "BNC",
        "+ RuLegal",
        "Yl",
        "-0.95",
        "-0.95",
        "-0.95",
        "-0.5",
        "-1.44",
        "-1.46",
        "-1.75",
        "-1.7",
        "k",
        "670",
        "670",
        "510",
        "2000",
        "Vkernel",
        "4.10",
        "4.10",
        "4.10",
        "5.10",
        "k",
        "^average",
        "36",
        "31",
        "15",
        "72",
        "Collection size",
        "3.10",
        "14.10",
        "5.10",
        "4.10",
        "Dorogovtsev-Mendes model, which yields two power laws for the degree distribution for the word forms graph, gives pretty good explanation both for an analytic language (English) and for an inflecting one (Russian), though numeric parameters for both languages differ.",
        "The estimated sizes of the supposed kernel lexicons for the both languages are almost the same, the fact supports the point that word form is a perceptual lexicon unit.",
        "To make more rigorous statements concerning statistical properties of various languages, we plan to calculate other important characteristics of the co-occurrence graph for Russian: clustering coefficient and average shortest path.",
        "Also we hope that legal obstacles to Russian National Corpus usage will have been overcome.",
        "Other statistical language graph studies are also interesting; among them are investigation of networks of lemmas, and statistical research of agglutinated languages."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The authors are grateful to the anonymous reviewers, the comments of whom were of much help.",
        "The work is supported in part by Russian Foundation for Basic Research, grants 06-06-80434 and 06-06-80251."
      ]
    }
  ]
}
