{
  "info": {
    "authors": [
      "Partha Pratim Talukdar",
      "Thorsten Brants",
      "Mark Y. Liberman",
      "Fernando Pereira"
    ],
    "book": "Conference on Computational Natural Language Learning CoNLL",
    "id": "acl-W06-2919",
    "title": "A Context Pattern Induction Method for Named Entity Extraction",
    "url": "https://aclweb.org/anthology/W06-2919",
    "year": 2006
  },
  "references": [
    "acl-N04-1043",
    "acl-P05-1001",
    "acl-W02-1028",
    "acl-W03-0425",
    "acl-W03-0434"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present a novel context pattern induction method for information extraction, specifically named entity extraction.",
        "Using this method, we extended several classes of seed entity lists into much larger high-precision lists.",
        "Using token membership in these extended lists as additional features, we improved the accuracy of a conditional random field-based named entity tagger.",
        "In contrast, features derived from the seed lists decreased extractor accuracy."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Partial entity lists and massive amounts of unlabeled data are becoming available with the growth of the Web as well as the increased availability of specialized corpora and entity lists.",
        "For example, the primary public resource for biomedical research, MEDLINE, contains over 13 million entries and is growing at an accelerating rate.",
        "Combined with these large corpora, the recent availability of entity lists in those domains has opened up interesting opportunities and challenges.",
        "Such lists are never complete and suffer from sampling biases, but we would like to exploit them, in combination with large unlabeled corpora, to speed up the creation of information extraction systems for different domains and languages.",
        "In this paper, we concentrate on exploring utility of such resources for named entity extraction.",
        "Currently available entity lists contain a small fraction of named entities, but there are orders of magnitude more present in the unlabeled data1.",
        "In this paper, we test the following hypotheses: i.",
        "Starting with a few seed entities, it is possible to induce high-precision context patterns by exploiting entity context redundancy.",
        "ii.",
        "New entity instances of the same category can be extracted from unlabeled data with the induced patterns to create high-precision extensions of the seed lists.",
        "iii.",
        "Features derived from token membership in the extended lists improve the accuracy of learned named-entity taggers.",
        "Previous approaches to context pattern induction were described by Riloff and Jones (1999), Agichtein and Gravano (2000), Thelen and Riloff (2002), Lin et al.",
        "(2003), and Etzioni et al.",
        "(2005), among others.",
        "The main advance in the present method is the combination of grammatical induction and statistical techniques to create high-precision patterns.",
        "The paper is organized as follows.",
        "Section 2 describes our pattern induction algorithm.",
        "Section 3 shows how to extend seed sets with entities extracted by the patterns from unlabeled data.",
        "Section 4 gives experimental results, and Section 5 compares our method with previous work."
      ]
    },
    {
      "heading": "2 Context Pattern Induction",
      "text": [
        "The overall method for inducing entity context patterns and extending entity lists is as follows:",
        "1.",
        "Let E = seed set, T = text corpus.",
        "2.",
        "Find the contexts C of entities in E in the corpus T (Section 2.1).",
        "3.",
        "Select trigger words from C (Section 2.2).",
        "4.",
        "For each trigger word, induce a pattern automaton (Section 2.3).",
        "5.",
        "Use induced patterns P to extract more entities E' (Section 3).",
        "6.",
        "Rank P and E' (Section 3.1).",
        "7.",
        "If needed, add high scoring entities in E' to E",
        "and return to step 2.",
        "Otherwise, terminate with patterns P and extended entity list E U E' as results."
      ]
    },
    {
      "heading": "2.1 Extracting Context",
      "text": [
        "Starting with the seed list, we first find occurrences of seed entities in the unlabeled data.",
        "For each such occurrence, we extract a fixed number W (context window size) of tokens immediately preceding and immediately following the matched entity.",
        "As we are only interested in modeling the context here, we replace all entity tokens by the single token -ENT-.",
        "This token now represents a slot in which an entity can occur.",
        "Examples of extracted entity contexts are shown in Table 1.",
        "In the work presented in this papers, seeds are entity instances (e.g. Google is a seed for organization category).",
        "increased expression of -ENT- in vad mice the expression of -ENT- mrna was greater expression of the -ENT- gene in mouse",
        "The set of extracted contexts is denoted by C. The next step is to automatically induce high-precision patterns containing the token -ENT- from such extracted contexts."
      ]
    },
    {
      "heading": "2.2 Trigger Word Selection",
      "text": [
        "To induce patterns, we need to determine their starts.",
        "It is reasonable to assume that some tokens are more specific to particular entity classes than others.",
        "For example, in the examples shown above, expression can be one such word for gene names.",
        "Whenever one comes across such a token in text, the probability of finding an entity (of the corresponding entity class) in its vicinity is high.",
        "We call such starting tokens trigger words.",
        "Trigger words mark the beginning of a pattern.",
        "It is important to note that simply selecting the first token of extracted contexts may not be a good way to select trigger words.",
        "In such a scheme, we would have to vary W to search for useful pattern starts.",
        "Instead of that brute-force technique, we propose an automatic way of selecting trigger words.",
        "A good set of trigger words is very important for the quality of induced patterns.",
        "Ideally, we want a trigger word to satisfy the following:",
        "• It is frequent in the set C of extracted contexts.",
        "• It is specific to entities of interest and thereby to extracted contexts.",
        "We use a term-weighting method to rank candidate trigger words from entity contexts.",
        "IDF (Inverse Document Frequency) was used in our experiments but any other suitable term-weighting scheme may work comparably.",
        "The IDF weight fw for a word w occurring in a corpus is given by:",
        "where N is the total number of documents in the corpus and nw is the total number of documents containing w. Now, for each context segment c E C, we select a dominating word dc given by",
        "There is exactly one dominating word for each c E C. All dominating words for contexts in C form multiset M. Let mw be the multiplicity of the dominating word w in M. We sort M by decreasing mw and select the top n tokens from this list as potential trigger words.",
        "Selection criteria based on dominating word frequency work better than criteria based on simple term weight because high term weight words may be rare in the extracted contexts, but would still be misleadingly selected for pattern induction.",
        "This can be avoided by using instead the frequency of dominating words within contexts, as we did here."
      ]
    },
    {
      "heading": "2.3 Automata Induction",
      "text": [
        "Rather than using individual contexts directly, we summarize them into automata that contain the most significant regularities of the contexts sharing a given trigger word.",
        "This construction allows us to determine the relative importance of different context features using a variant of the forward-backward algorithm from HMMs.",
        "For each trigger word, we list the contexts starting with the word.",
        "For example, with “expression” as the trigger word, the contexts in Table 1 are reduced to those in Table 2.",
        "Since “expression” is a left-context trigger word, only one token to the right of -ENT- is retained.",
        "Here, the predictive context lies to the left of the slot -ENT- and a single token is retained on the right to mark the slot’s right boundary.",
        "To model predictive right contexts, the token string can be reversed and the same techniques as here applied on the reversed string.2",
        "Similar contexts are prepared for each trigger word.",
        "The context set for each trigger word is then summarized by a pattern automaton with transitions that match the trigger word and also the wildcard -ENT-.",
        "We expect such automata to model the position in context of the entity slot and help us extract more entities of the same class with high precision.",
        "We use a simple form of grammar induction to learn the pattern automata.",
        "Grammar induction techniques have been previously explored for information extraction (IE) and related tasks.",
        "For instance, Freitag (1997) used grammatical inference to improve precision in IE tasks.",
        "Context segments are short and typically do not involve recursive structures.",
        "Therefore, we chose to use 1-reversible automata to represent sets of contexts.",
        "An automaton A is k-reversible iff (1) A is deterministic and (2) A' is deterministic with k tokens of lookahead, where A' is the automaton obtained by reversing the transitions of A. Wrapper induction using k-reversible grammar is discussed by Chidlovskii (2000).",
        "In the 1-reversible automaton induced for each trigger word, all transitions labeled by a given token go to the same state, which is identified with that token.",
        "Figure 1 shows a fragment of a 1-reversible automaton.",
        "Solan et al.",
        "(2005) describe a similar automaton construction, but they allow multiple transitions between states to distinguish among sentences.",
        "Each transition e = (v, w) in a 1-reversible automaton A corresponds to a bigram vw in the contexts used to create A.",
        "We thus assign each transition the probability",
        "where C(v, w) is the number of occurrences of the bigram vw in contexts for W. With this construction, we ensure words will be credited in proportion to their frequency in contexts.",
        "The automaton may overgenerate, but that potentially helps generalization."
      ]
    },
    {
      "heading": "2.3.2 Pruning",
      "text": [
        "The initially induced automata need to be pruned to remove transitions with weak evidence so as to increase match precision.",
        "The simplest pruning method is to set a count threshold c below which transitions are removed.",
        "However, this is a poor method.",
        "Consider state 10 in the automaton of Figure 2, with c = 20.",
        "Transitions (10,11) and (10,12) will be pruned.",
        "C(10,12) « c but C(10,11) just falls short of c. However, from the transition counts, it looks like the sequence “the -ENT-” is very common.",
        "In such a case, it is not desirable to prune (10,11).",
        "Using a local threshold may lead to overpruning.",
        "We would like instead to keep transitions that are used in relatively many probable paths through the automaton.",
        "The probability of path p is P(p) =",
        "which can be efficiently computed by the forward-backward algorithm (Rabiner, 1989).",
        "We can now remove transitions leaving state v whose posterior probability is lower than pv = k(maxw P(v, w)), where 0 < k < 1 controls the degree of pruning, with higher k forcing more pruning.",
        "All induced and pruned automata are trimmed to remove unreachable states."
      ]
    },
    {
      "heading": "3 Automata as Extractor",
      "text": [
        "Each automaton induced using the method described in Sections 2.3-2.3.2 represents high-precision patterns that start with a given trigger word.",
        "By scanning unlabeled data using these patterns, we can extract text segments which can be substituted for the slot token -ENT-.",
        "For example, assume that the induced pattern is “analyst at -ENT- and” and that the scanned text is “He is an analyst at the University of California and ...”.",
        "By scanning this text using the pattern mentioned above, we can figure out that the text “the University of California” can substitute for “-ENT-”.",
        "This extracted segment is a candidate extracted entity.",
        "We now need to decide whether we should retain all tokens inside a candidate extraction or purge some tokens, such as “the” in the example.",
        "One way to handle this problem is to build a language model of content tokens and retain only the maximum likelihood token sequence.",
        "However, in the current work, the following heuristic which worked well in practice is used.",
        "Each token in the extracted text segment is labeled either keep (K) or droppable (D).",
        "By default, a token is labeled K. A token is labeled D if it satisfies one of the droppable criteria.",
        "In the experiments reported in this paper, droppable criteria were whether the token is present in a stopword list, whether it is non-capitalized, or whether it is a number.",
        "Once tokens in a candidate extraction are labeled using the above heuristic, the longest token sequence corresponding to the regular expression K[D K] * K is retained and is considered a final extraction.",
        "If there is only one K token, that token is retained as the final extraction.",
        "In the example above, the tokens are labeled “the/D University/x of/D California/x”, and the extracted entity will be “University of California ”.",
        "To handle runaway extractions, we can set a domain-dependent hard limit on the number of tokens which can be matched with “-ENT-”.",
        "This stems from the intuition that useful extractions are not very long.",
        "For example, it is rare that a person name longer than five tokens."
      ]
    },
    {
      "heading": "3.1 Ranking Patterns and Entities",
      "text": [
        "Using the method described above, patterns and the entities extracted by them from unlabeled data are paired.",
        "But both patterns and extractions vary in quality, so we need a method for ranking both.",
        "Hence, we need to rank both patterns and entities.",
        "This is difficult given that there we have no nega",
        "tive labeled data.",
        "Seed entities are the only positive instances that are available.",
        "Related previous work tried to address this problem.",
        "Agichtein and Gravano (2000) seek to extract relations, so their pattern evaluation strategy considers one of the attributes of an extracted tuple as a key.",
        "They judge the tuple as a positive or a negative match for the pattern depending on whether there are other extracted values associated with the same key.",
        "Unfortunately, this method is not applicable to entity extraction.",
        "The pattern evaluation mechanism used here is similar in spirit to those of Etzioni et al.",
        "(2005) and Lin et al.",
        "(2003).",
        "With seeds for multiple classes available, we consider seed instances of one class as negative instances for the other classes.",
        "A pattern is penalized if it extracts entities which belong to the seed lists of the other classes.",
        "Let pos(p) and neg(p) be respectively the number of distinct positive and negative seeds extracted by pattern p. In contrast to previous work mentioned above, we do not combine pos(p) and neg(p) to calculate a single accuracy value.",
        "Instead, we discard all patterns p with positive neg(p) value, as well as patterns whose total positive seed (distinct) extraction count is less than certain threshold 77pattern.",
        "This scoring is very conservative.",
        "There are several motivations for such a conservative scoring.",
        "First, we are more interested in precision than recall.",
        "We believe that with massive corpora, large number of entity instances can be extracted anyway.",
        "High accuracy extractions allow us to reliably (without any human evaluation) use extracted entities in subsequent tasks successfully (see Section 4.3).",
        "Second, in the absence of sophisticated pattern evaluation schemes (which we are investigating – Section 6), we feel it is best to heavily penalize any pattern that extracts even a single negative instance.",
        "Let G be the set of patterns which are retained by the filtering scheme described above.",
        "Also, let I(e,p) be an indicator function which takes value 1 when entity e is extracted by pattern p and 0 otherwise.",
        "The score of e, S(e), is given by",
        "This whole process can be iterated by including extracted entities whose score is greater than or equal to a certain threshold 77entity to the seed list."
      ]
    },
    {
      "heading": "4 Experimental Results",
      "text": [
        "For the experiments described below, we used 18 billion tokens (31 million documents) of news data as the source of unlabeled data.",
        "We experimented with 500 and 1000 trigger words.",
        "The results presented were obtained after a single iteration of the Context Pattern Induction algorithm (Section 2)."
      ]
    },
    {
      "heading": "4.1 English LOC, ORG and PER",
      "text": [
        "For this experiment, we used as seed sets subsets of the entity lists provided with CoNLL-2003 shared task data.3 Only multi-token entries were included in the seed lists of respective categories (location (LOC), person (PER) & organization (ORG) in this case).",
        "This was done to partially avoid incorrect context extraction.",
        "For example, if the seed entity is “California”, then the same string present in “University of California” can be incorrectly considered as an instance of LOC.",
        "A stoplist was used for dropping tokens from candidate extractions, as described in Section 3.",
        "Examples of top ranking induced patterns and extracted entities are shown in Table 9.",
        "Seed list sizes and experimental results are shown in Table 3.",
        "The precision numbers shown in Table 3 were obtained by manually evaluating 100 randomly selected instances from each of the extended lists.",
        "The overlap4 between the induced ORG list and the Fortune-500 list has 357 organization names, which is significantly higher than the seed list overlap of 22 (see Section 1).",
        "This shows that we have been able to improve coverage considerably."
      ]
    },
    {
      "heading": "4.2 Watch Brand Name",
      "text": [
        "A total of 17 watch brand names were used as seeds.",
        "In addition to the pattern scoring scheme",
        "of Section 3.1, only patterns containing sequence “watch” were finally retained.",
        "Entities extracted with ηentity = 2 are shown in Table 5.",
        "Extraction precision is 85.7%.",
        "This experiment is interesting for several reasons.",
        "First, it shows that the method presented in this paper is effective even with small number of seed instances.",
        "From this we conclude that the unambiguous nature of seed instances is much more important than the size of the seed list.",
        "Second, no negative information was used during pattern ranking in this experiment.",
        "This suggests that for relatively unambiguous categories, it is possible to successfully rank patterns using positive instances only."
      ]
    },
    {
      "heading": "4.3 Extended Lists as Features in a Tagger",
      "text": [
        "Supervised models normally outperform unsupervised models in extraction tasks.",
        "The downside of supervised learning is expensive training data.",
        "On the other hand, massive amounts of unlabeled data are readily available.",
        "The goal of semi-supervised learning to combine the best of both worlds.",
        "Recent research have shown that improvements in supervised taggers are possible by including features derived from unlabeled data (Miller et al., 2004; Liang, 2005; Ando and Zhang, 2005).",
        "Similarly, automatically generated entity lists can be used as additional features in a supervised tagger.",
        "For this experiment, we started with a conditional random field (CRF) (Lafferty et al., 2001) tagger with a competitive baseline (Table 6).",
        "The baseline tagger was trained5 on the full CoNLL-2003 shared task data.",
        "We experimented with the LOC, ORG and PER lists that were automatically generated in Section 4.1.",
        "In Table 7, we show the accuracy of the tagger for the entity types for which we had induced lists.",
        "The test conditions are just baseline features with no list membership, baseline plus seed list membership features, and baseline plus induced list membership features.",
        "For completeness, we also show in Table 8 accuracy on the full CoNLL task (four entity types) without lists, with seed list only, and with the three induced lists.",
        "The seed lists (Section 4.1) were prepared from training data itself and hence with increasing training data size, the model overfitted as it became completely reliant on these seed lists.",
        "From Tables 7 & 8 we see that incorporation of token membership in the extended lists as additional membership features led to improvements across categories and at all sizes of training data.",
        "This also shows that the extended lists are of good quality, since the tagger is able to extract useful evidence from them.",
        "Relatively small sizes of training data pose interesting learning situation and is the case with practical applications.",
        "It is encouraging to observe that the list features lead to significant improvements in such cases.",
        "Also, as can be seen from Table 7 & 8, these lists are effective even with mature taggers trained on large amounts of labeled data."
      ]
    },
    {
      "heading": "5 Related Work",
      "text": [
        "The method presented in this paper is similar in many respects to some of the previous work on context pattern induction (Riloff and Jones, 1999; Agichtein and Gravano, 2000; Lin et al., 2003; Etzioni et al., 2005), but there are important differences.",
        "Agichtein and Gravano (2000) focus on relation extraction while we are interested in entity extraction.",
        "Moreover, Agichtein and Gravano (2000) depend on an entity tagger to initially tag unlabeled data whereas we do not have such requirement.",
        "The pattern learning methods of Riloff and Jones (1999) and the generic extraction patterns of Etzioni et al.",
        "(2005) use language-specific information (for example, chunks).",
        "In contrast, the method presented here is language independent.",
        "For instance, the English pattern induction system presented here was applied on German data without any change.",
        "Also, in the current method, induced automata compactly represent all induced patterns.",
        "The patterns induced by Riloff and Jones (1999) extract NPs and that determines the number of tokens to include in a single extraction.",
        "We avoid using such language dependent chunk information as the patterns in our case include right6 boundary tokens thus explicitly specifying the slot in which an entity can occur.",
        "Another interesting deviation here from previous work on context pattern induction is the fact that on top of extending"
      ]
    },
    {
      "heading": "6 In case of predictive left context.",
      "text": [
        "seed lists at high precision, we have successfully included membership in these automatically generated lexicons as features in a high quality named entity tagger improving its performance."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "We have presented a novel language-independent context pattern induction method.",
        "Starting with a few seed examples, the method induces in an unsupervised way context patterns and extends the seed list by extracting more instances of the same category at fairly high precision from unlabeled data.",
        "We were able to improve a CRF-based high quality named entity tagger by using membership in these automatically generated lists as additional features.",
        "Pattern and entity ranking methods need further investigation.",
        "Thorough comparison with previously proposed methods also needs to be carried out.",
        "Also, it will be interesting to see whether the features generated in this paper complement some of the other methods (Miller et al., 2004; Liang, 2005; Ando and Zhang, 2005) that also generate features from unlabeled data."
      ]
    },
    {
      "heading": "7 Acknowledgements",
      "text": [
        "We thank the three anonymous reviewers as well as Wojciech Skut, Vrishali Wagle, Louis Monier, and Peter Norvig for valuable suggestions.",
        "This work is supported in part by NSF grant EIA-0205448."
      ]
    }
  ]
}
