{
  "info": {
    "authors": [
      "Yoshimitsu Torii",
      "Dipankar Das",
      "Sivaji Bandyopadhyay",
      "Manabu Okumura"
    ],
    "book": "Proceedings of the 2nd Workshop on Computational Approaches to Subjectivity and Sentiment Analysis (WASSA 2.011)",
    "id": "acl-W11-1710",
    "title": "Developing Japanese WordNet Affect for Analyzing Emotions",
    "url": "https://aclweb.org/anthology/W11-1710",
    "year": 2011
  },
  "references": [
    "acl-L08-1086",
    "acl-P05-1017",
    "acl-P97-1023",
    "acl-W07-2013",
    "acl-W07-2022",
    "acl-W09-3401",
    "acl-W10-0204"
  ],
  "sections": [
    {
      "text": [
        "Yoshimitsu Torii Dipankar Das Sivaji Bandyopadhyay Manabu Okumura",
        "This paper reports the development of Japanese WordNet Affect from the English WordNet Affect lists with the help of English SentiWordNet and Japanese WordNet.",
        "Expanding the available synsets of the English WordNet Affect using SentiWord-Net, we have performed the translation of the expanded lists into Japanese based on the synsetIDs in the Japanese WordNet.",
        "A baseline system for emotion analysis of Japanese sentences has been developed based on the Japanese WordNet Affect.",
        "The incorporation of morphology improves the performance of the system.",
        "Overall, the system achieves average precision, recall and F-scores of 32.76%, 53% and 40.49% respectively on 89 sentences of the Japanese judgment corpus and 83.52%, 49.58% and 62.22% on 1000 translated Japanese sentences of the SemEval 2007 affect sensing test corpus.",
        "Different experimental outcomes and morphological analysis suggest that irrespective of the google translation error, the performance of the system could be improved by enhancing the Japanese WordNet Affect in terms of coverage."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Emotion analysis, a recent sub discipline at the crossroads of information retrieval (Sood et al., 2009) and computational linguistics (Wiebe et al., 2006) is becoming increasingly important from application view points of affective computing.",
        "The majority of subjective analysis methods that are related to emotion is based on textual keywords spotting that use specific lexical resources.",
        "Senti-WordNet (Baccianella et al., 2010) is a lexical resource that assigns positive, negative and objective scores to each WordNet synset (Miller, 1995).",
        "Subjectivity wordlist (Banea et al., 2008) assigns words with the strong or weak subjectivity and prior polarities of types positive, negative and neutral.",
        "Affective lexicon (Strapparava and Valitutti, 2004), one of the most efficient resources of emotion analysis, contains emotion words.",
        "To the best of our knowledge, these lexical resources have been created for English.",
        "A recent study shows that non-native English speakers support the growing use of the Internet.",
        "Hence, there is a demand for automatic text analysis tools and linguistic resources for languages other than English.",
        "In the present task, we have prepared the Japanese WordNet Affect from the already available English WordNet Affect (Strapparava and Valitutti, 2004).",
        "Entries in the English WordNet Affect are annotated using Ekman's (1993) six emotional categories (joy, fear, anger, sadness, disgust, surprise).",
        "The collection of the English WordNet Affect synsets that are used in the present work was provided as a resource in the \"Affective Text\" shared task of SemEval-2007 Workshop.",
        "The six WordNet Affect lists that were provided in the shared task contain only 612 synsets in total with 1536 words.",
        "The words in each of the six emotion lists have been observed to be not more than 37.2% of the words present in the corresponding SentiWordNet synsets.",
        "Hence, these six lists are expanded with the synsets retrieved from the",
        "http://www.internetworldstats.com/stats.htm http://www.cse.unt.edu/~rada/affectivetext/",
        "English SentiWordNet (Baccianella et al., 2010).",
        "We assumed that the new sentiment bearing words in English SentiWordNet might have some emotional connotation in Japanese even keeping their part-of-speech (POS) information unchanged.",
        "The numbers of entries in the expanded word lists are increased by 69.77% and 74.60% at synset and word levels respectively.",
        "We have mapped the synsetID of the WordNet Affect lists with the syn-setID of the WordNet 3.0.",
        "This mapping helps in expanding the WordNet Affect lists with the recent version of SentiWordNet 3.0 as well as translating with the Japanese WordNet (Bond et al., 2009).",
        "Some affect synsets (e.g., 00115193-a huffy, mad, sore) are not translated into Japanese as there are no equivalent synset in the Japanese WordNet.",
        "Primarily, we have developed a baseline system based on the Japanese WordNet Affect and carried out the evaluation on a Japanese judgement corpus of 89 sentences.",
        "The system achieves the average F-score of 36.39% with respect to six emotion classes.",
        "We have also incorporated an open source Japanese morphological analyser.",
        "The performance of the system has been increased by 4.1% in average F-score with respect to six emotion classes.",
        "Scarcity of emotion corpus in Japanese motivated us to apply an open source google translatorto build the Japanese emotion corpus from the available English SemEval-2007 affect sensing corpus.",
        "The baseline system based on the Japanese WordNet Affect achieves average precision, recall and F-score of 83.52%, 49.58% and 62.22% respectively on 1000 translated test sentences.",
        "The inclusion of morphological processing improves the performance of the system.",
        "Different experiments have been carried out by selecting different ranges of annotated emotion scores.",
        "Error analysis suggests that though the system performs satisfactorily in identifying the sentential emotions based on the available words of the Japanese WordNet Affect, the system suffers from the translated version of the corpus.",
        "In addition to that, the Japanese WordNet Affect also needs an improvement in terms of coverage.",
        "The rest of the paper is organized as follows.",
        "Different developmental phases of the Japanese WordNet Affect are described in Section 3.",
        "Preparation of the translated Japanese corpus, different experiments and evaluations based on morphology and the annotated emotion scores are elaborated in Section 4.",
        "Finally Section 5 concludes the paper."
      ]
    },
    {
      "heading": "2. Related Works",
      "text": [
        "The extraction and annotation of subjective terms started with machine learning approaches (Hat-zivassiloglou and McKeown, 1997).",
        "Some well known sentiment lexicons have been developed, such as subjective adjective list (Baroni and Veg-naduzzo, 2004), English SentiWordNet (Esuli et.",
        "al., 2006), Taboada's adjective list (Voll and Taboada, 2007), SubjectivityWord List (Banea et al., 2008) etc.",
        "Andreevskaia and Bergler (2006) present a method for extracting positive or negative sentiment bearing adjectives from WordNet using the Sentiment Tag Extraction Program (STEP).",
        "The proposed methods in (Wiebe and Riloff, 2006) automatically generate resources for subjectivity analysis for a new target language from the available resources for English.",
        "On the other hand, an automatically generated and scored sentiment lexicon, SentiFul (Neviarouskaya et al., 2009), its expansion, morphological modifications and distinguishing sentiment features also shows the contributory results.",
        "But, all of the above mentioned resources are in English and have been used in coarse grained sentiment analysis (e.g., positive, negative or neutral).",
        "The proposed method in (Takamura et al., 2005) extracts semantic orientations from a small number of seed words with high accuracy in the experiments on English as well as Japanese lexicons.",
        "But, it was also aimed for sentiment bearing words.",
        "Instead of English WordNet Affect (Strapparava and Valitutti, 2004), there are a few attempts in other languages such as, Russian and Romanian (Bobicev et al., 2010), Bengali (Das and Bandyop-adhyay, 2010) etc.",
        "Our present approach is similar to some of these approaches but in contrast, we have evaluated our Japanese WordNet Affect on the SemEval 2007 affect sensing corpus translated into Japanese.",
        "In recent trends, the application of mechanical turk for generating emotion lexicon (Mohammad and Turney, 2010) shows promising results.",
        "In the present task, we have incorporated the open source, available and accessible resources to achieve our goals."
      ]
    },
    {
      "heading": "3. Developmental Phases",
      "text": [
        "The English WordNet Affect, based on Ekman's six emotion types is a small lexical resource compared to the complete WordNet but its affective annotation helps in emotion analysis.",
        "Some collection of WordNet Affect synsets was provided as a resource for the shared task of Affective Text in SemEval-2007.",
        "The whole data is provided in six files named by the six emotions.",
        "Each file contains a list of synsets and one synset per line.",
        "An example synset entry from WordNet Affect is as follows.",
        "a#00117872 angered enraged furious infuriated maddened",
        "The first letter of each line indicates the part of speech (POS) and is followed by the affectID.",
        "The representation was simple and easy for further processing.",
        "We have retrieved and linked the compatible synsetID from the recent version of WordNet 3.0 with the affectID of the WordNet Affect synsets.",
        "We have searched each WordNet Affect synset in WordNet 3.0.",
        "If a matching WordNet 3.0 synset is found, the WordNet 3.0 synsetID is mapped to the WordNet Affect affectID.",
        "The linking between two synsets of WordNet Affect and WordNet 3.0 is shown in Figure 1.",
        "Net Affect and WordNet",
        "tiWordNet",
        "It has been observed that the WordNet Affect contains fewer number of emotion word entries.",
        "The six lists provided in the SemEval 2007 shared task contain only 612 synsets in total with 1536 words.",
        "The detail distribution of the emotion words as well as the synsets in the six different lists according to their POS is shown in Table 1.",
        "Hence, we have expanded the lists with adequate number of emotion words using SentiWordNet before attempting any translation of the lists into Japanese.",
        "SentiWordNet assigns each synset of WordNet with two coarse grained subjective scores such as positive and negative along with an objective score.",
        "SentiWordNet contains more number of coarse grained emotional words than WordNet Affect.",
        "We assumed that the translation of the coarse grained emotional words into Japanese might contain more or less fine-grained emotion words.",
        "One example entry of the SentiWordNet is shown below.",
        "The POS of the entry is followed by a synset ID, positive and negative scores and synsets containing sentiment words.",
        "SentiWordNet:",
        "Our aim is to increase the number of emotion words in the WordNet Affect using SentiWordNet, both of which are developed from the WordNet.",
        "Hence, each word of the WordNet Affect is replaced by the equivalent synsets retrieved from SentiWordNet if the synset contains that emotion word.",
        "The POS information in the WordNet Affect is kept unchanged during expansion.",
        "A related example is shown in Figure 2.",
        "The distributions of expanded synsets and words for each of the six emotion classes based on four different POS types (noun N, verb V, adjective Adj.",
        "and adverb Adv.)",
        "are shown in Table 1.",
        "But, we have kept the duplicate entries at synset level for identifying the emotion related scores in our future attempts by utilizing the already associated positive and negative scores of SentiWordNet.",
        "The percentage of entries in the updated word lists are increased by 69.77 and 74.60 at synset and word levels.",
        "We have mapped the affectID of the WordNet Affect to the corresponding synsetID of the WordNet 3.0.",
        "This mapping helps to expand the WordNet Affect with the recent version of SentiWordNet 3.0 as well as translating the expanded lists into Japanese using the Japanese WordNet (Bond et al., 2009).",
        "WordNet Affect:",
        "a#02336957 annoyed harassed harried pestered vexed WordNet:",
        "02455845-a annoyed harassed harried pestered vexed Linked Synset ID with Affect ID:",
        "harried pestered vexed_",
        "Emotion Classes Anger Disgust Fear Joy Sadness Surprise Affect Synset (S) and Word (W) [After SentiWordNet updating]",
        "Table 1: Number of POS based Synsets and Words in six WordNet Affect lists before and after updating using SentiWordNet",
        "a, mm, outlet, mxß, outë, mxß, vm, m, mtë, im, mu^t...",
        "SentiWordNet synsets containing \"choler\":",
        "07552729-n fretfulness, fussiness, crossness, petulance, peevishness, irritability, choler 05406958-n choler, yellow_bile Expanded Affect word:",
        "As the Japanese WordNet is freely available and it is being developed based on the English WordNet, the synsets of the expanded lists are automatically translated into Japanese equivalent synsets based on the synsetIDs.",
        "The number of translated Japanese words and synsets for six affect lists are shown in Table 2 and Table 3 respectively.",
        "The following are some translated samples that contain word as well as phrase level translations.",
        "07510348-n surprise – f§à, Wà 07503260-n disgust – tî#OË, MM 07532440-n unhappiness, sadness ffjH^",
        "Table 3: Number of translated (Trans) and non translated (Non-Trans) synsets (Syn), words (W) and phrases (P) in six Japanese WordNet Affects.",
        "Some SentiWordNet synsets (e.g., 00115193-a huffy, mad, sore) are not translated into Japanese as there are no equivalent synset entries in the Japanese WordNet.",
        "There were a large number of word combinations, collocations and idioms in the Japanese WordNet Affect.",
        "These parts of synsets show problems during translation and therefore manual translation is carried out for these types.",
        "Some of the English synsets ('07517292-n lividity') were not translated into Japanese.",
        "But, an equivalent gloss of the word 'lividity' that is present in the Japanese WordNet is \"a state of fury so great the face becomes discolored\".",
        "One of the reasons of such translation problems may be that no equivalent Japanese word sense is available for such English words.",
        "Emotion Classes",
        "Translated WordNet Affect list in Japanese (#Words)",
        "N V Adj Adv",
        "Anger",
        "861 501 231 9",
        "Disgust",
        "49 63 219 10",
        "Fear",
        "375 235 334 104",
        "Joy",
        "1959 1831 772 154",
        "Sadness",
        "533 307 575 39",
        "Surprise",
        "144 218 204 153",
        "Emotion Classes",
        "Japanese WordNet Affect list",
        "Trans (#Syn)",
        "Non-Trans (#Syn)",
        "Translated Morphemes",
        "(#W) (#P)",
        "Anger",
        "254",
        "159",
        "1033 450",
        "Disgust",
        "57",
        "24",
        "218 97",
        "Fear",
        "146",
        "74",
        "615 315",
        "Joy",
        "628",
        "238",
        "2940 1273",
        "Sadness",
        "216",
        "97",
        "846 519",
        "Surprise",
        "112",
        "25",
        "456 216"
      ]
    },
    {
      "heading": "4. Evaluation and Analysis",
      "text": [
        "We have evaluated the lexical coverage of the developed Japanese WordNet Affect on a small emotional judgment corpus and SemEval 2007 affect sensing corpus.",
        "The judgment corpus that is being developed by the Japan System Applications Co. Ltd. contains only 100 sentences of emotional judgments.",
        "But, this corpus is not an open source till date.",
        "We have evaluated our Japanese WordNet Affect based baseline system on these 100 sentences and the results for each of the six emotion classes are shown in Table 4.",
        "We have also incorporated an open source morphological analyzer in our baseline system.",
        "The algorithm is that, if a word in a sentence is present in any of the Japanese WordNet Affect lists; the sentence is tagged with the emotion label corresponding to that affect list.",
        "But, if any word is not found in any of the six lists, each word of the sentence is passed through the morphological process to identify its root form which is searched through the Japanese WordNet Affect lists again.",
        "If the root form is found in any of the six Japanese WordNet Affect lists, the sentence is tagged accordingly.",
        "Otherwise, the sentence is tagged as nonemotional or neutral.",
        "The average F-Score of the baseline system has been improved by 4.1% with respect to the six emotion classes.",
        "Due to the fewer number of sentential instances in some emotion classes (e.g., joy, sadness, surprise), the performance of the system gives poor results even after including the morphological knowledge.",
        "One of the reasons may be the less number of words and synset entries in some WordNet Affect lists (e.g., fear).",
        "Hence, we have aimed to translate the English SemEval 2007 affect sensing corpus into Japanese and evaluate our system on the translated corpus.",
        "(#Sentences) Judgment Corpus (in %)",
        "Before Morphology [After Morphology] _ Precision",
        "Table 4: Precision, Recall and F-Scores (in %) of the system per emotion class on the Judgment corpus by including and excluding morphology.",
        "The English SemEval 2007 affect sensing corpus consists of news headlines only.",
        "Each of the news headlines is tagged with a valence score and scores for all the six Ekman's emotions.",
        "The six emotion scores for each sentence are in the range of 0 to 100.",
        "We have considered that each sentence is assigned a single sentential emotion tag based on the maximum emotion score out of six annotated emotion scores.",
        "We have used the Google translator API to translate the 250 and 1000 sentences of the trial and test sets of the SemEval 2007 corpus respectively.",
        "The experiments regarding morphology and emotion scores are conducted on the trial corpus.",
        "We have carried out different experiments on 1000 test sentences by selecting different ranges of emotion scores.",
        "The corresponding experimental results are also shown in Table 5.",
        "Incorporation of morphology improves the performance of the system.",
        "On the other hand, it is observed that the performance of the system decreases by increasing the range of Emotion Scores (ES).",
        "The reason may be that the numeric distribution of the sentential instances in each of the emotion classes decreases as the range in emotion scores increases.",
        "http://www.jsa.co.jp/ http://mecab.sourceforge.net/",
        "Table 6: Precision, Recall and F-Scores (in %) of the system per emotion class on the translated Japanese SemEval 2007 test corpus before and after including morphology on different ranges of Emotion Scores.",
        "Japanese affect lists include words as well as phrases.",
        "We deal with phrases using Japanese morphology tool to find affect words in a sentence and substitute an affect word into its original conjugated form.",
        "One of the main reasons of using a morphology tool is to analyze the conjugated form and to identify the phrases.",
        "For example, the Japanese word for the equivalent English word 'anger' is \"1 5 (o ko ru)\" but there are other conjugated word forms such as \"lo 7c (o ko tta)\" that means 'angered' and it is used in past tense.",
        "Similarly, other conjugated form \"lot^fc (o ko tte i ta)\" denotes the past participle form 'have angered' of the original word 'anger'.",
        "The morphological form of its passive sense is \"1 bfl5 (o ko rare ru)\" that means 'be angered'.",
        "We identify the word forms from their corresponding phrases by using the morpheme information.",
        "For example, the phrase \"1 bfl5 (o ko rare ru)\" consists of two words, one is \"l h (o ko ra) that is in an imperfective form and other word is \"fl 5 (re ru) which is in an original form.",
        "The original form of the imperfective word l h (o ko ra) is \"15 (o ko ru)\".",
        "It has been found that some of the English multi-word phrases have no equivalent Japanese phrase available.",
        "Only the equivalent Japanese words are found in Japanese WordNet.",
        "For exam ple, the following synset contains a multi-word phrase 'see-red'.",
        "Instead of any equivalent phrases, only words are found in Japanese WordNet.",
        "01787106-v anger, see red – 'ff6, ïllt"
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "The present paper describes the preparation of Japanese WordNet Affect containing six types of emotion words in six separate lists.",
        "The automatic approach of expanding, translating and sense disambiguation tasks reduces the manual effort.",
        "The resource is still being updated with more number of emotional words to increase the coverage.",
        "The sense disambiguation task needs to be improved further in future by incorporating more number of translators and considering their agreement into account.",
        "In future we will adopt a corpus-driven approach for updating the resource with more number of emotion words and phrases for extending the emotion analysis task in Japanese."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The work reported in this paper is supported by a grant from the India-Japan Cooperative Programme (DST-JST) 2009 Research project entitled \"Sentiment Analysis where AI meets Psychology\" funded by Department of Science and Technology (DST), Government of India.",
        "Emotion Classes",
        "Japanese Translated SemEval 2007 Test Corpus (in %)",
        "Before Morphology [After Morphology]",
        "Emotion Score (ES) > 0",
        "Emotion Score (ES) > 10",
        "Precision Recall F-Score",
        "Precision Recall F-Score",
        "Anger",
        "61.01[68.75] 18.83[51.16] 28.78[42.88]",
        "44.65[52.08] 25.54[55.52] 32.49[40.55]",
        "disgust",
        "79.55[85.05] 8.35[16.06] 15.12[27.01]",
        "40.91[41.46] 9.89[18.07] 15.93[24.97]",
        "Fear",
        "93.42[95.45] 10.26[16.77] 18.49[28.52]",
        "77.63[81.82] 13.32[21.42] 22.74[54.05]",
        "Joy",
        "69.07[72.68] 57.03[80.50] 62.48[76.29]",
        "53.89[55.61] 56.50[96.22] 55.17[70.40]",
        "sadness",
        "83.33[84.29] 10.58[19.54] 18.77[51.67]",
        "67.78[69.87] 11.78[19.88] 20.07[50.86]",
        "surprise",
        "94.94[94.94] 7.84[15.65] 14.48[25.99]",
        "72.15[74.58] 8.25[15.87] 14.81[26.50]",
        "Emotion Score (ES) > 30",
        "Emotion Score (ES) > 50",
        "Anger 21.38[28.12] 39.08[62.45] 27.64[58.59]",
        "6.92[10.42] 57.89[78.02] 12.36[18.26]",
        "disgust 2.27[5.04] 3.70[6.72] 2.82[6.15]",
        "NIL NIL NIL",
        "Fear 44.74[56.82] 16.67[28.76] 24.29[58.45]",
        "21.05[29.55] 17.98[51.26] 19.39[50.79]",
        "Joy 31.48[55.42] 56.86[97.08] 40.52[50.55]",
        "12.04[24.98] 61.32[87.66] 20.12[59.10]",
        "sadness 37.78[69.86] 15.60[25.31] 22.08[57.22]",
        "13.33[25.07] 12.12[22.57] 12.70[18.71]",
        "surprise 17.72[20.54] 8.14[18.56] 11.16[20.55]",
        "3.80[8.50] 7.50[12.50] 5.04[10.11]"
      ]
    }
  ]
}
