{
  "info": {
    "authors": [
      "Nizar Habash",
      "Ryan Roth",
      "Owen Rambow",
      "Ramy Eskander",
      "Nadi Tomeh"
    ],
    "book": "NAACL",
    "id": "acl-N13-1044",
    "title": "Morphological Analysis and Disambiguation for Dialectal Arabic",
    "url": "https://aclweb.org/anthology/N13-1044",
    "year": 2013
  },
  "references": [
    "acl-A00-2013",
    "acl-E06-1047",
    "acl-J95-4004",
    "acl-N06-2013",
    "acl-N12-1006",
    "acl-N13-1036",
    "acl-N13-1066",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P05-1071",
    "acl-P06-1073",
    "acl-P06-1086",
    "acl-P07-2045",
    "acl-P08-2030",
    "acl-P12-2063",
    "acl-W05-0708",
    "acl-W05-0909",
    "acl-W07-0812",
    "acl-W08-0509",
    "acl-W11-2602",
    "acl-W12-2301"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The many differences between Dialectal Arabic and Modern Standard Arabic (MSA) pose a challenge to the majority of Arabic natural language processing tools, which are designed for MSA.",
        "In this paper, we retarget an existing state-of-the-art MSA morphological tag-ger to Egyptian Arabic (ARZ).",
        "Our evaluation demonstrates that our ARZ morphology tagger outperforms its MSA variant on ARZ input in terms of accuracy in part-of-speech tagging, diacritization, lemmatization and to-kenization; and in terms of utility for ARZ-toEnglish statistical machine translation."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Dialectal Arabic (DA) refers to the day-to-day native vernaculars spoken in the Arab World.",
        "DA is used side by side with Modern Standard Arabic (MSA), the official language of the media and education (Holes, 2004).",
        "Although DAs are historically related to MSA, there are many phonological, morphological and lexical differences between them.",
        "Unlike MSA, DAs have no standard orthographies or language academies.",
        "Furthermore, different DAs, such as Egyptian Arabic (henceforth, ARZ), Levan-tine Arabic or Moroccan Arabic have important differences among them, similar to those seen among Romance languages (Holes, 2004; Abdel-Massih et al., 1979).",
        "Most tools and resources developed for natural language processing (NLP) of Arabic are designed for MSA.",
        "Such resources are quite limited when it comes to processing DA, e.g., a state-of-the-art MSA morphological analyzer only has 60% coverage of Levantine Arabic verb forms (Habash and Rambow, 2006).",
        "In this paper, we describe the process of retar-geting an existing state-of-the-art tool for model-ing MSA morphology disambiguation to ARZ, the most commonly spoken DA.",
        "The MSA tool we extend is MADA ?",
        "Morphological Analysis and Disambiguation of Arabic (Habash and Rambow, 2005).",
        "The approach used in MADA, which was inspired by earlier work by Hajic?",
        "(2000), disambiguates in context for every aspect of Arabic morphology, thus solving all tasks in ?one fell swoop?.",
        "The disadvantage of the MADA approach is its dependence on two complex resources: a morphological analyzer for the language and a large collection of manually annotated words for all morphological features in the same representation used by the an-alyzer.",
        "For ARZ, such resources have recently become available, with the development of the CALIMA ARZ morphological analyzer (Habash et al., 2012b) and the release by the Linguistic Data Consortium (LDC) of a large ARZ corpus annotated morphologically in a manner compatible with CAL-IMA (Maamouri et al., 2012a).",
        "In the work presented here, we utilize these new resources within the paradigm of MADA, transforming MADA into MADA-ARZ.",
        "The elegance of the MADA solution makes this conceptually a simple extension.",
        "Our evaluation demonstrates that our Egyptian DA version of MADA, henceforth MADA-ARZ, outperforms MADA for MSA on ARZ morphological tagging and improves the quality of ARZ to English statistical machine translation (MT).",
        "The rest of this paper is structured as follows: Section 2 discusses related work.",
        "Section 3 presents the challenges of processing Arabic dialects.",
        "Section 4 outlines our approach.",
        "And Section 5 presents and discusses our evaluation results."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "There has been a considerable amount of work on MSA morphological analysis, disambiguation, part-of-speech (POS) tagging, tokenization, lemmatization and diacritization; for an overview, see (Habash, 2010).",
        "Most solutions target specific problems, such as diacritization (Zitouni et al., 2006), tokenization or POS tagging (Diab et al., 2007).",
        "In contrast, MADA provides a solution to all of these problems together (Habash and Rambow, 2005).",
        "Previous work on DA morphological tagging focused on creating resources, using noisy or incomplete annotations, and using unsupervised/semisupervised methods.",
        "Duh and Kirchhoff (2005) adopt a minimally supervised approach that only requires raw text data from several DAs, as well as a MSA morphological analyzer.",
        "They report a POS accuracy of 70.9% on a rather coarse-grained POS tagset (17 tags).",
        "Al-Sabbagh and Girju (2012) describe a supervised tagger for Egyptian Arabic social networking corpora trained using transformation-based learning (Brill, 1995).",
        "They report 94.5% F-measure on tokenization and 87.6% on POS tagging.",
        "Their tokenization and POS tagsets are comparable to the set used by the Arabic Treebank (ATB).",
        "We do not compare to them since their data sets are not public.",
        "Stallard et al. (2012) show that unsupervised methods for learning DA tokenization can outperform MSA tokenizers on MT from Levantine Arabic to English.",
        "We do not compare to them directly since our work is on ARZ.",
        "However, we carry a similar MT experiment in Section 5.",
        "Mohamed et al. (2012) annotated a small corpus of Egyptian Arabic for morphological segmentation and learned segmentation models using memory-based learning (Daelemans and van den Bosch, 2005).",
        "Their best system achieves a 91.90% accuracy on the task of morpheme-segmentation.",
        "We compare to their work and report on their test set in Section 5.",
        "There are some other morphological analyzers for DA.",
        "Kilany et al. (2002) worked on ARZ, but the analyzer has very limited coverage.",
        "Their lexicon was used as part of the development of CALIMA (Habash et al., 2012b).",
        "Other efforts are not about ARZ (Habash and Rambow, 2006; Salloum and Habash, 2011).",
        "Given the similarity between MSA and DA, there has been some work on mapping DA to MSA to exploit rich MSA resources (Chiang et al., 2006; Abo Bakr et al., 2008; Salloum and Habash, 2011; Salloum and Habash, 2013).",
        "Other researchers have studied the value of simply combining DA and MSA data, such as Zbib et al. (2012) for DA to English MT.",
        "In our approach, we target DA directly, and we evaluate the use of additional MSA annotated resources to our training in Section 5."
      ]
    },
    {
      "heading": "3 Arabic Dialect Challenges General Arabic Challenges Arabic, as MSA or",
      "text": [
        "DA, poses many challenges for NLP.",
        "Arabic is a morphologically complex language which includes rich inflectional morphology and a number of cli-tics.",
        "For example, the MSA word A?",
        "E?J.",
        "write it [lit.",
        "and+will+they-write-they+it]?",
        "has two proclitics, one circumfix and one pronominal en-clitic.",
        "Additionally, Arabic has a high degree of ambiguity resulting from its diacritic-optional writing system and common deviation from spelling standards (e.g., Alif and Ya variants) (Buckwalter, 2007).",
        "The Standard Arabic Morphological Ana-lyzer for (SAMA) (Graff et al., 2009) produces 12 analyses per MSA word on average.",
        "Differences between ARZ and MSA As mentioned above, most tools developed for MSA cannot be expected to perform well on ARZ.",
        "This is due to the numerous differences between the two variants.",
        "Lexically, the number of differences is quite significant.",
        "For example, ARZ",
        "???A?",
        "TAwlh?.",
        "Phonologically, there are many important differences which relate to orthography in DA, e.g., the MSA consonant H /?/ is pronounced as /t/ in ARZ (or /s/ in more recent borrowings from MSA); for a fuller discussion, see (Habash, 2010; Habash et al., 2012a).",
        "Examples of morphological differences include changes in the",
        "morpheme form, e.g., the MSA future proclitic +?",
        "sa+ appears in ARZ as +?",
        "ha+.",
        "There are some morphemes in ARZ that do not exist in MSA such as the negation circum-clitic ?+ .",
        ".",
        ".",
        "+ A?",
        "mA+ .",
        ".",
        ".",
        "+?.",
        "And there are MSA features that are absent from ARZ, most notably case and mood.",
        "Since there are no orthographic standards, ARZ words may be written in a variety of ways reflecting different writing rules, e.g., phonologically or etymologically.",
        "A conventional orthography for Dialectal Arabic (CODA) has been proposed and used for writing ARZ in the context of NLP applications (Habash et al., 2012a; Al-Sabbagh and Girju, 2012; Eskander et al., 2013).",
        "Finally, MSA and ARZ coexist and are often used interchangeably, especially in more formal settings.",
        "The CALIMA morphological analyzer we use addresses several of these issues by modeling both ARZ and MSA together, including a limited set of inter-dialect morphology phenomena, and by mapping ARZ words into CODA orthography internally while accepting a wide range of spelling variants."
      ]
    },
    {
      "heading": "4 Approach",
      "text": []
    },
    {
      "heading": "4.1 The MADA Approach",
      "text": [
        "MADA is a method for Arabic morphological analysis and disambiguation (Habash and Rambow, 2005; Roth et al., 2008).",
        "MADA uses a morphological analyzer to produce, for each input word, a list of analyses specifying every possible morphological interpretation of that word, covering all morphological features of the word (diacritization, POS, lemma, and 13 inflectional and clitic features).",
        "MADA then applies a set of models (support vector machines and N-gram language models) to produce a prediction, per word in-context, for different morphological features, such as POS, lemma, gender, number or person.",
        "A ranking component scores the analyses produced by the morphological analyzer using a tuned weighted sum of matches with the predicted features.",
        "The top-scoring analysis is chosen as the predicted interpretation for that word in context."
      ]
    },
    {
      "heading": "4.2 Extending MADA into MADA-ARZ",
      "text": [
        "Adjusting MADA to handle DA requires a number of modifications.",
        "The most significant change is replacing the MSA analyzer SAMA with the ARZ analyzer CALIMA to address the differences outlined in Section 3.",
        "In addition, new feature prediction models are needed; these are trained using ARZ data sets annotated by the LDC (Maamouri et al., 2006; Maamouri et al., 2012b).",
        "The data sets were not usable as released due to numerous annotation inconsistencies and differences from CALIMA, as well due to gaps in CALIMA.",
        "We synchronized the annotations with the latest version of CALIMA following a technique described by Habash and Rambow (2005).",
        "The result of this synchronization step is the data we use in this study (for training, development and testing).",
        "Our synchronized annotations fully match the LDC annotations in 90% of the words (in full morphological tag).",
        "We performed a manual analysis on randomly chosen 100 words that did not fully match.",
        "The choice we made is correct or acceptable in 55% of the cases of mismatch with the LDC annotation, which means that the our choice is accurate in over 95% of all cases.",
        "Some of the original MADA features (which were needed for MSA) are not used in ARZ and so are dropped in MADA-ARZ; these features are case, mood, the question-marking proclitic, state and voice.",
        "Additional ARZ feature values have been added, e.g., to handle the progressive particle and future marker, among others.",
        "These are provided by CALIMA and are classified and selected by MADA-ARZ.",
        "In our current implementation, ARZ features that are not present in MSA, such as the negation and indirect-object enclitics, are not classified by MADA-ARZ classifiers, but since they are provided by CALIMA they can be selected by the whole MADA-ARZ system."
      ]
    },
    {
      "heading": "5 Evaluation",
      "text": [
        "We evaluate MADA-ARZ intrinsically ?",
        "in terms of performance on morphological disambiguation ?",
        "and extrinsically in the context of MT."
      ]
    },
    {
      "heading": "5.1 POS Tagging, Diacritization, Lemmatization and Segmentation Experimental Settings We use two sets of anno",
      "text": [
        "tated data from the LDC: ATB-123, which includes parts 1, 2 and 3 of the MSA Penn Arabic Treebank",
        "training data is ATB-123.",
        "ARZ training data is ATB-ARZ.",
        "ALL training data is ATB-123 plus ATB-ARZ.",
        "(Maamouri et al., 2004); and ATB-ARZ, the Egyptian Arabic Treebank (parts 1-5) (Maamouri et al., 2012a).",
        "For ATB-123 training, we use all of parts 1 and 2 plus the training portion of ATB-3 (as defined by Zitouni et al. (2006)); for development and test, we split Zitouni et al. (2006)'s devtest set into two.",
        "We subdivide ATB-ARZ into development, training, and test sets (roughly a 10/80/10 split).",
        "The ATB-ARZ training data has 134K words, and the ATB-123 training data has 711K words.",
        "We evaluate two systems.",
        "We used the latest release of MADA for MSA (v3.2), trained on ATB123 (MSA), as our baseline.",
        "For MADA-ARZ, we compare two training settings: using ATB-ARZ (ARZ) and combining ATB-ARZ with ATB-123 (ALL).",
        "We present our results on the ATB-ARZ development and blind test sets (21.1K words and 20.4K words).",
        "Tuning for MADA-ARZ was done using a random 10% of the ATB-ARZ training data, which was later integrated back into the training set.",
        "Metrics We use several evaluation metrics to measure the effectiveness of MADA-ARZ.",
        "Morph Tag refers to the accuracy of correctly predicting the full CALIMA morphological tag (i.e., not the diacritics or the lemma).",
        "Penn POS and MADA POS are also tag accuracy metrics.",
        "Penn POS, also known as the Reduced Tag Set, is a tag set reduction of the full Arabic morphological tag set, which was proposed for MSA (Kulick et al., 2006; Diab, 2007; Habash, 2010); since it retains no MSA-specific morphological features, it also makes sense for ARZ.",
        "MADA POS is the small POS tag set (36 tags) MADA uses internally.",
        "Diacritic and Lemma are the accuracies of the choice of diacritized form and Lemma, respectively.",
        "Full is the harshest metric, requiring that every morphological feature of the chosen analysis be correct.",
        "Finally, ATB Segmentation is the percentage of words with correct ATB segmentation (splitting off all clitics except for the determiner +?",
        "@ Al+).",
        "Results The results are shown in Table 1.",
        "MADA-ARZ performs much better than the MADA baselines in all evaluation metrics.",
        "Comparing the two MADA-ARZ systems, it is evident that adding MSA data (ATB123) results in slightly better performance only for the Penn POS, MADA POS, and ATB Segmentation metrics.",
        "Including the MSA data results in accuracy reductions for the other metrics, but the resulting system still outperforms the MADA MSA baseline in all cases.",
        "The results are consistent for development and blind test.",
        "The CMUQ-ECA Test Set Mohamed et al. (2012) reported on the task of ARZ raw orthography morph segmentation (determining the morphs in the raw word).",
        "The CMUQ-ECA test data comprised 36 ARZ political comments and jokes from the Egyptian web site www.masrawy.com.",
        "The set contains 2,445 words including punctuation.",
        "Their best system gets a 91.9% word-level accuracy.",
        "Since MADA-ARZ modifies the spelling",
        "of the word when it maps into CODA, we needed a manual analysis where no exact match with the gold occurs (11.8% of the time).",
        "We determined MADA-ARZ's accuracy on their test set for morph-segmentation to be 93.2%."
      ]
    },
    {
      "heading": "5.2 Egyptian Arabic to English MT",
      "text": [
        "MT Experimental Settings We use the open-source Moses toolkit (Koehn et al., 2007) to build a phrase-based SMT system.",
        "We use MGIZA++ for word alignment (Gao and Vogel, 2008).",
        "Phrase translations of up to 8 words are extracted in the phrase table.",
        "We use SRILM (Stolcke, 2002) with modified Kneser-Ney smoothing to build two 4 gram language models.",
        "The first model is trained on the English side of the bitext, while the other is trained on the English Gigaword data.",
        "Feature weights are tuned to maximize BLEU (Papineni et al., 2002) on a development set using Minimum Error Rate Training (Och, 2003).",
        "We perform case-insensitive evaluation in terms of BLEU , METEOR (Banerjee and Lavie, 2005) and TER (Snover et al., 2006) metrics.",
        "Data We trained on DA-English parallel data (Egyptian and Levantine) obtained from several LDC corpora.",
        "The training data amounts to 3.8M untokenized words on the Arabic side.",
        "The dev set, used for tuning the parameters of the MT system, has 15,585 untokenized Arabic words.",
        "The test set has 12,116 untokenized Arabic words.",
        "Both dev and test data contain two sets of reference translations.",
        "The English data is lower-cased and tokenized using simple punctuation-based rules.",
        "Systems We build three translation systems which vary in tokenization of the Arabic text.",
        "The first system applies only simple punctuation-based rules.",
        "The second and third systems use MADA and MADA-ARZ, respectively, to tokenize the Arabic text in the ATB tokenization scheme (Habash and Sadat, 2006).",
        "The Arabic text is also Alif/Ya normalized.",
        "Results The MT results are in Table 2, which also shows the percentage of out-of-vocabulary (OOV) words ?",
        "test words not in the training data.",
        "MADA-ARZ delivers the best translation performance according to all metrics.",
        "All MADA-ARZ improvements over MADA are statistically significant at the .01 level (except in the case of METEOR).",
        "All improvements over Punct by MADA and MADA-ARZ are also statistically significant.",
        "For BLEU scores, we observe 3.1% absolute improvement to Punct (14% relative), and 0.8% absolute improvement to MADA (3.3% relative).",
        "In addition to better morphological disambiguation, MADA-ARZ reduces the OOV ratio (16% relative to MADA), which we suspect contributes to the observed improvements in MT quality."
      ]
    },
    {
      "heading": "6 Conclusion and Future Work",
      "text": [
        "We have presented MADA-ARZ, a system for morphological tagging of ARZ.",
        "We have shown that it outperforms an state-of-the-art MSA tagger (MADA) on ARZ text, and that it helps ARZ-toEnglish machine translation more than MADA.",
        "In the future, we intend to perform further feature engineering to improve the results of MADA-ARZ, and extend the system to handle other DAs."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This paper is based upon work supported by",
        "the Defense Advanced Research Projects Agency (DARPA) under Contract No.",
        "HR0011-12-C-0014.",
        "Any opinions, findings and conclusions or recommendations expressed in this paper are those of the authors and do not necessarily reflect the views of DARPA."
      ]
    }
  ]
}
