{
  "info": {
    "authors": [
      "Robert J. Bobrow",
      "Robert J. P. Ingria",
      "David G. Stallard"
    ],
    "book": "Workshop on Speech and Natural Language",
    "id": "acl-H92-1062",
    "title": "Syntactic/Semantic Coupling in the BBN DELPHI System",
    "url": "https://aclweb.org/anthology/H92-1062",
    "year": 1992
  },
  "references": [
    "acl-H90-1048",
    "acl-H91-1033",
    "acl-H91-1042",
    "acl-J80-1001"
  ],
  "sections": [
    {
      "text": [
        "parsing showed that substantial time was spent in such logical computations, and it became clear that more efficient data structures and procedural techniques could be used to implement many such computations [3].",
        "The current version of the system uses these embedded procedural mechanisms to manipulate specialized data structures that efficently represent the binding state of a constituent, to determine if a proposed grammatical relation leads to a consistent binding state, and if so what the semantic implications of that binding are.",
        "A separate system of \"binding rules\" for each grammatical relation licenses the binding of a constituent to a head via that relation by specifying the semantic implications of binding.",
        "These rules generally specify aspects that must be true of the semantic structure of the head and bound constituent in order for the binding to take place, and may also specify certain syntactic requirements.",
        "They may take into account the existence of previous bindings to the head, allowing certain semantic roles (such as time specification) to be filled multiply, while other semantic roles may be restricted to having just one filler.",
        "As adjuncts are added to a structure the binding list is extended.",
        "As layers are added to the onion, a simple linear list of bindings is maintained representing the head and its grammatical relation to each of the constituents added with each layer of the onion.",
        "Semantic binding rules are used to verify the local semantic plausibility of a structure, i.e. the semantic plausibility of each proposed grammatical relation.",
        "The next phase of semantic interpretation takes place when the onion is complete, i.e. when a constituent X is inserted as other than the head of a larger constituent.",
        "This situation provides evidence that the outermost layer of the onion has been reached, and that no more adjuncts are to be added.",
        "At this time it is possible to evaluate semantic rules that check for completeness and produce an \"interpretation\" of the constituent.",
        "These completion rules operate directly on the binding list, not on the recursive left or right branching tree structure produced by direct application of the grammar.",
        "The actual tree structure is at this level immaterial, having been replaced by the flattened binding list representation of relational structure."
      ]
    },
    {
      "heading": "4. ROBUSTNESS BASED ON STATISTICS AND SEMANTICS",
      "text": [
        "Simply having a transduction system with semantics based on grammatical relations does not deal with the issue of robustness - the ability to make sense of an input even if it cannot be assigned a well-formed syntactic tree.",
        "The difficulty with standard syntactic techniques is that local syntactic evidence is not enough to accurately determine grammatical relations.",
        "A NP (e.g. \"John\") followed by a verb (e.g. \"flew\") may be the subject of that verb (e.g. \"John flew to Boston\") or may be unrelated (e.g. \"The man I introduced to John flew to Boston\").",
        "The standard way of getting around this is to attempt to find a globally consistent set of grammatical relation labels (i.e. a global parse!)",
        "and make use of the fact that the existence of a global parse containing a given relation is stronger evidence for that relation than local structure (although syntactic ambiguity makes even such global structures suspect).",
        "This is indeed the best approach if all you have available is a syntactic grammar.",
        "The strategy we use in DELPHI is based on the existence of two other sources of information.",
        "In the first place we have semantic constraints that can be applied incrementally, so that we can check each proposed grammatical relation for semantic coherence in the context of other assumed grammatical structures.",
        "Additionally, we have statistical information on the likelihood of various word senses, grammatical rules, and grammatical-semantic transductions.",
        "Thus we can not only rule out many locally possible grammatical relations on the basis of semantic incoherence, we can rank alternative local structures on the basis of empirically measured statistics.",
        "The net result is that even in the absence of a single global parse, we can be reasonably sure of the local grammatical relations and semantic content of various fragments (we can even give numerical estimates of the likelihood of each such structure)."
      ]
    },
    {
      "heading": "4.1 Control structure",
      "text": [
        "The DELPHI system attempts to obtain a complete parse of its input, using its agenda-based best-first parsing algorithm.",
        "If it is unable to do this it uses the parser in a fragment-production mode, producing the most probable structure for an initial segment of the input, then restarting the parser in a top down mode on the first element of the unparsed string whose lexical category provides a reasonable anchor for top-down prediction.",
        "This process is repeated until the entire input is spanned with fragments.",
        "Experiments have shown that the combination of statistical evaluation and semantic constraints lets this procedure produce a highly useful chunking of the input for interpretation by other non-syntactically driven strategies.",
        "Further details are given in the accompanying paper on the DELPHI fall-back processing strategies."
      ]
    },
    {
      "heading": "5. ADVANTAGES OF THIS APPROACH",
      "text": [
        "The separation of syntactic grammar rules from semantic binding and completion rules has important consequences for processing.",
        "First, it enables the notion of grammatical relation to be separated from the notion of tree structure, and thus greatly facilitates fragment parsing.",
        "Second, while it allows syntax and semantics to be strongly coupled in terms of processing (parsing and semantic interpretation) it allows them to be essentially decoupled in terms of notation.",
        "This makes the grammar and the semantics considerably easier",
        "to modify and maintain.",
        "We believe, however, that in the long term the most important advantage is that this view leads us to a new kind of language model, in which knowledge can be much more easily extracted through automatic training.",
        "We view the role of the grammar as codifying the way that tree structure provides evidence for grammatical relations.",
        "Thus the rule",
        "says that a noun phrase followed by a prepositional phrase provides evidence for the relation PP-COMP between the PP and NP head.",
        "The separation between rules types will allow us for the first time to consider the effect of grammatical relations on meaning, independently of the way that evidence for these relations is produced by the parser.",
        "One effect of this is to make it possible to use a hypothesized semantic interpretation of a set of tree fragments to generate a new syntactic rule.",
        "Thus, in normal operation, the primary evidence for a grammatical relation is the result of actually parsing part of an input.",
        "However, since grammatical relations between constituents entail semantic relations, if we can make an estimate of the likelihood of certain semantic relations based on domain knowledge, pragmatics, and task models, etc., it is in principle possible to use abductive reasoning to suggest likely grammatical relations, and thereby propose new grammar rules.",
        "In effect, grammatical relations form an abstract level of representation that greatly simplifies the interaction of syntactic and semantic processing."
      ]
    },
    {
      "heading": "ACKNOWLEDGEMENTS",
      "text": [
        "The work reported here was supported by the Advanced Research Projects Agency and was monitored by the Office of Naval Research under Contract No.",
        "N00014-89-C-0008.",
        "The views and conclusions contained in this document are those of the authors and should not be interpreted as necessarily representing the official policies, either expressed or implied, of the Defense Advanced Research Projects Agency or the United States Government."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": [
        "(FROMPREP) ...) with the values of the two preposition arguments reversed, or we would have needed to add the following \"lexical redundancy rule\" to the grammar:",
        "which automatically inverts the order of :PREP and :PREP1 for any verb taking two prepositional phrases.",
        "To allow \"fly\" to take a \"to\" phrase without a \"from\" phrase, as often occurs, we would need both another subcategorization specification in the lexical entry for \"fly\", and another rule in the grammar, allowing a verb to take a single PP complement.",
        "In the current grammar, all PP complements are handled by one single rule:",
        "This rule allows a verb to take a single prepositional phrase complement, or, by recursion, an indefinite number of others, consistent with its semantics.",
        "The lexical information particular to individual verbs governs the number of prepositions that the verb takes, their optionality or obligatoriness, and their semantic interpretation.",
        "Special purpose rules for different numbers and orders of PPs are not required."
      ]
    },
    {
      "heading": "3. GRAMMATICAL RELATIONS",
      "text": [
        "The chief effort over the last year has been to codify this notion of logical attachment, simplifying the set of such attachments to highlight the common underlying substructure of grammatical paraphrases.",
        "To this end we reoriented our grammar around the notion of \"grammatical relation\".",
        "Grammatical relations include the familar ones of deep-structure subject and object, as well as other relations.",
        "These relations may be seen as the end result of making the information encoded in ordering and constituency explicitly available.",
        "(In languages with freer word order this information is often encoded in morphological affixes or pre and post positions.)",
        "From the point of view of a syntactic-semantic transducer, the key point of any grammatical relation is that it licenses (one of) a small number of semantic relations between the (\"meanings\" of) the related constituents.",
        "Sometimes the grammatical relation constrains the semantic relation in ways that cannot be predicted from the semantics of the constituents alone (given \"John\", \"Mary\" and \"kissed\", only the grammatical relations or prior world knowledge determine who gave and who received).",
        "Other times the grammatical relation simply licenses the one plausible semantic relation (given \"John\", \"ate\" and \"hamburger\", if there is a relation, it is the hamburger that is most likely to have been consumed – but in the sentence \"John ate the fries but rejected the hamburger\" our knowledge of the destiny of the hamburger is mediated by its lack of a grammatical relation to \"ate\").",
        "Grammatical relations are incorporated into the grammar by giving each element of the right hand side of a grammar rule a grammatical relation as a label.",
        "Some typical rules are, in schematic form:",
        "The first indicates that an NP may have an NP as a head and a PP as an adjunct, with the grammatical relation :pp-comp holding between them (the actual operation of binding a :pp-comp splits it into a number of sub-relations based on the preposition, but that can be safely ignored here).",
        "The second indicates that the head need not occur as the first constituent on the right side.",
        "All that is required is that one of the right-hand elements is labeled as the \"head\" of the rule, and it is the source of information about the initial semantic and syntactic \"binding state\".",
        "This binding state controls whether or not the other elements of the right-hand side can \"bind\" to the head via the relation that labels them.",
        "Semantics is associated with grammatical relations, not with particular grammar rules (as are Montague-grammar and most unification-based semantics systems).",
        "3.1\"Binding rules\" – the Semantics of Grammatical Relations The implementation of the use of such binding states in the transduction of grammatical relations to semantic structure is facilitated by the procedural elements we have introduced into our unification grammar formalism.",
        "In early versions of DELPHI, grammar rules contained only unification expressions for grammatical constituents.",
        "Later versions added \"logical nodes\"--expressions which looked like constituents, but which were satisfied by deductions in a unification-based axiom set.",
        "These logical nodes were used to add various constraints to the grammar, much as in a definite clause grammar.",
        "An analysis of the time spent in",
        "parsing showed that substantial time was spent in such logical computations, and it became clear that more efficient data structures and procedural techniques could be used to implement many such computations [3].",
        "The current version of the system uses these embedded procedural mechanisms to manipulate specialized data structures that efficently represent the binding state of a constituent, to determine if a proposed grammatical relation leads to a consistent binding state, and if so what the semantic implications of that binding are.",
        "A separate system of \"binding rules\" for each grammatical relation licenses the binding of a constituent to a head via that relation by specifying the semantic implications of binding.",
        "These rules generally specify aspects that must be true of the semantic structure of the head and bound constituent in order for the binding to take place, and may also specify certain syntactic requirements.",
        "They may take into account the existence of previous bindings to the head, allowing certain semantic roles (such as time specification) to be filled multiply, while other semantic roles may be restricted to having just one filler.",
        "As adjuncts are added to a structure the binding list is extended.",
        "As layers are added to the onion, a simple linear list of bindings is maintained representing the head and its grammatical relation to each of the constituents added with each layer of the onion.",
        "Semantic binding rules are used to verify the local semantic plausibility of a structure, i.e. the semantic plausibility of each proposed grammatical relation.",
        "The next phase of semantic interpretation takes place when the onion is complete, i.e. when a constituent X is inserted as other than the head of a larger constituent.",
        "This situation provides evidence that the outermost layer of the onion has been reached, and that no more adjuncts are to be added.",
        "At this time it is possible to evaluate semantic rules that check for completeness and produce an \"interpretation\" of the constituent.",
        "These completion rules operate directly on the binding list, not on the recursive left or right branching tree structure produced by direct application of the grammar.",
        "The actual tree structure is at this level immaterial, having been replaced by the flattened binding list representation of relational structure."
      ]
    },
    {
      "heading": "4. ROBUSTNESS BASED ON STATISTICS AND SEMANTICS",
      "text": [
        "Simply having a transduction system with semantics based on grammatical relations does not deal with the issue of robustness - the ability to make sense of an input even if it cannot be assigned a well-formed syntactic tree.",
        "The difficulty with standard syntactic techniques is that local syntactic evidence is not enough to accurately determine grammatical relations.",
        "A NP (e.g. \"John\") followed by a verb (e.g. \"flew\") may be the subject of that verb (e.g. \"John flew to Boston\") or may be unrelated (e.g. \"The man I introduced to John flew to Boston\").",
        "The standard way of getting around this is to attempt to find a globally consistent set of grammatical relation labels (i.e. a global parse!)",
        "and make use of the fact that the existence of a global parse containing a given relation is stronger evidence for that relation than local structure (although syntactic ambiguity makes even such global structures suspect).",
        "This is indeed the best approach if all you have available is a syntactic grammar.",
        "The strategy we use in DELPHI is based on the existence of two other sources of information.",
        "In the first place we have semantic constraints that can be applied incrementally, so that we can check each proposed grammatical relation for semantic coherence in the context of other assumed grammatical structures.",
        "Additionally, we have statistical information on the likelihood of various word senses, grammatical rules, and grammatical-semantic transductions.",
        "Thus we can not only rule out many locally possible grammatical relations on the basis of semantic incoherence, we can rank alternative local structures on the basis of empirically measured statistics.",
        "The net result is that even in the absence of a single global parse, we can be reasonably sure of the local grammatical relations and semantic content of various fragments (we can even give numerical estimates of the likelihood of each such structure)."
      ]
    },
    {
      "heading": "4.1 Control structure",
      "text": [
        "The DELPHI system attempts to obtain a complete parse of its input, using its agenda-based best-first parsing algorithm.",
        "If it is unable to do this it uses the parser in a fragment-production mode, producing the most probable structure for an initial segment of the input, then restarting the parser in a top down mode on the first element of the unparsed string whose lexical category provides a reasonable anchor for top-down prediction.",
        "This process is repeated until the entire input is spanned with fragments.",
        "Experiments have shown that the combination of statistical evaluation and semantic constraints lets this procedure produce a highly useful chunking of the input for interpretation by other non-syntactically driven strategies.",
        "Further details are given in the accompanying paper on the DELPHI fall-back processing strategies."
      ]
    },
    {
      "heading": "5. ADVANTAGES OF THIS APPROACH",
      "text": [
        "The separation of syntactic grammar rules from semantic binding and completion rules has important consequences for processing.",
        "First, it enables the notion of grammatical relation to be separated from the notion of tree structure, and thus greatly facilitates fragment parsing.",
        "Second, while it allows syntax and semantics to be strongly coupled in terms of processing (parsing and semantic interpretation) it allows them to be essentially decoupled in terms of notation.",
        "This makes the grammar and the semantics considerably easier",
        "to modify and maintain.",
        "We believe, however, that in the long term the most important advantage is that this view leads us to a new kind of language model, in which knowledge can be much more easily extracted through automatic training.",
        "We view the role of the grammar as codifying the way that tree structure provides evidence for grammatical relations.",
        "Thus the rule",
        "says that a noun phrase followed by a prepositional phrase provides evidence for the relation PP-COMP between the PP and NP head.",
        "The separation between rules types will allow us for the first time to consider the effect of grammatical relations on meaning, independently of the way that evidence for these relations is produced by the parser.",
        "One effect of this is to make it possible to use a hypothesized semantic interpretation of a set of tree fragments to generate a new syntactic rule.",
        "Thus, in normal operation, the primary evidence for a grammatical relation is the result of actually parsing part of an input.",
        "However, since grammatical relations between constituents entail semantic relations, if we can make an estimate of the likelihood of certain semantic relations based on domain knowledge, pragmatics, and task models, etc., it is in principle possible to use abductive reasoning to suggest likely grammatical relations, and thereby propose new grammar rules.",
        "In effect, grammatical relations form an abstract level of representation that greatly simplifies the interaction of syntactic and semantic processing."
      ]
    },
    {
      "heading": "ACKNOWLEDGEMENTS",
      "text": [
        "The work reported here was supported by the Advanced Research Projects Agency and was monitored by the Office of Naval Research under Contract No.",
        "N00014-89-C-0008.",
        "The views and conclusions contained in this document are those of the authors and should not be interpreted as necessarily representing the official policies, either expressed or implied, of the Defense Advanced Research Projects Agency or the United States Government."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
