{
  "info": {
    "authors": [
      "Greg Durrett",
      "Dan Klein"
    ],
    "book": "EMNLP",
    "id": "acl-D13-1203",
    "title": "Easy Victories and Uphill Battles in Coreference Resolution",
    "url": "https://aclweb.org/anthology/D13-1203",
    "year": 2013
  },
  "references": [
    "acl-D08-1031",
    "acl-D08-1069",
    "acl-D09-1101",
    "acl-D09-1120",
    "acl-H05-1004",
    "acl-J01-4004",
    "acl-J95-2003",
    "acl-M95-1005",
    "acl-N06-1025",
    "acl-N06-2015",
    "acl-N10-1061",
    "acl-N10-1112",
    "acl-N13-1071",
    "acl-N13-1110",
    "acl-P04-1018",
    "acl-P06-1005",
    "acl-P08-4003",
    "acl-P09-1074",
    "acl-P10-2029",
    "acl-P11-1082",
    "acl-P12-1041",
    "acl-P13-1012",
    "acl-P13-1049",
    "acl-W10-4305",
    "acl-W11-1901",
    "acl-W11-1902",
    "acl-W11-1905",
    "acl-W12-4501",
    "acl-W12-4502",
    "acl-W12-4503",
    "acl-W12-4504",
    "acl-W12-4511"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Classical coreference systems encode various syntactic, discourse, and semantic phenomena explicitly, using heterogenous features computed from hand-crafted heuristics.",
        "In contrast, we present a state-of-the-art coreference system that captures such phenomena implicitly, with a small number of homogeneous feature templates examining shallow properties of mentions.",
        "Surprisingly, our features are actually more effective than the corresponding hand-engineered ones at modeling these key linguistic phenomena, allowing us to win ?easy victories?",
        "without crafted heuristics.",
        "These features are successful on syntax and discourse; however, they do not model semantic compatibility well, nor do we see gains from experiments with shallow semantic features from the literature, suggesting that this approach to semantics is an ?uphill battle.?",
        "Nonetheless, our final system1 outperforms the Stanford system (Lee et al. (2011), the winner of the CoNLL 2011 shared task) by 3.5% absolute on the CoNLL metric and outperforms the IMS system (Bjo?rkelund and Farkas (2012), the best publicly available English coreference system) by 1.9% absolute."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Coreference resolution is a multifaceted task: humans resolve references by exploiting contextual and grammatical clues, as well as semantic information and world knowledge, so capturing each of",
        "fully solve the problem.",
        "Acknowledging this complexity, coreference systems, either learning-based (Bengtson and Roth, 2008; Stoyanov et al., 2010; Haghighi and Klein, 2010; Rahman and Ng, 2011b) or rule-based (Haghighi and Klein, 2009; Lee et al., 2011), draw on diverse information sources and complex heuristics to resolve pronouns, model discourse, determine anaphoricity, and identify semantically compatible mentions.",
        "However, this leads to systems with many heterogenous parts that can be difficult to interpret or modify.",
        "We build a learning-based, mention-synchronous coreference system that aims to use the simplest possible set of features to tackle the various aspects of coreference resolution.",
        "Though they arise from a small number of simple templates, our features are numerous, which works to our advantage: we can both implicitly model important linguistic effects and capture other patterns in the data that are not easily teased out by hand.",
        "As a result, our data-driven, homogeneous feature set is able to achieve high performance despite only using surface-level document characteristics and shallow syntactic information.",
        "We win ?easy victories?",
        "without designing features and heuristics explicitly targeting particular phenomena.",
        "Though our approach is successful at modeling syntax, we find semantics to be a much more challenging aspect of coreference.",
        "Our base system uses only two recall-oriented features on nominal and proper mentions: head match and exact string match.",
        "Building on these features, we critically evaluate several classes of semantic features which intu",
        "itively should prove useful but have had mixed results in the literature, and we observe that they are ineffective for our system.",
        "However, these features are beneficial when gold mentions are provided to our system, leading us to conclude that the large number of system mentions extracted by most coreference systems (Lee et al., 2011; Fernandes et al., 2012) means that weak indicators cannot overcome the bias against making coreference links.",
        "Capturing semantic information in this shallow way is an ?uphill battle?",
        "due to this structural property of coreference resolution.",
        "Nevertheless, using a simple architecture and feature set, our final system outperforms the two best publicly available English coreference systems, the Stanford system (Lee et al., 2011) and the IMS system (Bjo?rkelund and Farkas, 2012), by wide margins: 3.5% absolute and 1.9% absolute, respectively, on the CoNLL metric."
      ]
    },
    {
      "heading": "2 Experimental Setup",
      "text": [
        "Throughout this work, we use the datasets from the CoNLL 2011 shared task2 (Pradhan et al., 2011), which is derived from the OntoNotes corpus (Hovy et al., 2006).",
        "When applicable, we use the standard automatic parses and NER tags for each document.",
        "All experiments use system mentions except where otherwise indicated.",
        "For each experiment, we report MUC (Vilain et al., 1995), B3 (Bagga and Baldwin, 1998), and CEAFe (Luo, 2005), as well as their average, the CoNLL metric.",
        "All metrics are computed using version 5 of the official CoNLL scorer.3"
      ]
    },
    {
      "heading": "3 A Mention-Synchronous Framework",
      "text": [
        "We first present the basic architecture of our coreference system, independent of a feature set.",
        "Unlike binary classification-based coreference systems where independent binary decisions are made about each pair (Soon et al., 2001; Bengtson and Roth, 2008; Versley et al., 2008; Stoyanov et al., 2010), we use a log-linear model to select at most one antecedent for",
        "version ofB3, described in Cai and Strube (2010), that was used for the CoNLL shared tasks.",
        "The implementation of CEAFe is also not exactly as described in Luo et al. (2004), but for completeness we include this metric as well.",
        "each mention or determine that it begins a new cluster (Denis and Baldridge, 2008).",
        "In this mention-ranking or mention-synchronous framework, features examine single mentions to evaluate whether or not they are anaphoric and pairs of mentions to evaluate whether or not they corefer.",
        "While other work has used this framework as a starting point for entity-level systems (Luo et al., 2004; Rahman and Ng, 2009; Haghighi and Klein, 2010; Durrett et al., 2013), we will show that a mention-synchronous approach is sufficient to get state-of-the-art performance on its own."
      ]
    },
    {
      "heading": "3.1 Mention Detection",
      "text": [
        "Our system first identifies a set of predicted mentions from text annotated with parses and named entity tags.",
        "We extract three distinct types of mentions: proper mentions from all named entity chunks except for those labeled as QUANTITY, CARDINAL, or PERCENT, pronominal mentions from single words tagged with PRP or PRP$, and nominal mentions from all other maximal NP projections.",
        "These basic rules are similar to those of Lee et al. (2011), except that their system uses an additional set of filtering rules designed to discard instances of pleonastic it, partitives, certain quantified noun phrases, and other spurious mentions.",
        "In contrast to this highly engineered approach and to systems which use a trained classifier to compute anaphoricity separately (Rahman and Ng, 2009; Bjo?rkelund and Farkas, 2012), we aim for the highest possible recall of gold mentions with a low-complexity method, leaving us with a large number of spurious system mentions that we will have to reject later."
      ]
    },
    {
      "heading": "3.2 Coreference Model",
      "text": [
        "Figure 1 shows the mention-ranking architecture that serves as the backbone of our coreference system.",
        "Assume we have extracted n mentions from a document x, where x denotes the surface properties of a document and any precomputed information.",
        "The ith mention in a document has an associated random variable ai taking values in the set {1, .",
        ".",
        ".",
        ", i?1, NEW}; this variable specifies mention i's selected antecedent or indicates that it begins a new coreference chain.",
        "A setting of the ai, denoted by a = (a1, ..., an), implies a unique set of coreference chains C that serve as our system output.",
        "choices: link to one of the i?",
        "1 preceding mentions or begin a new cluster.",
        "We place a distribution over these choices with a log-linear model.",
        "Structurally different kinds of errors are weighted differently to optimize for final coreference loss functions; error types are shown corresponding to the decisions for each mention.",
        "We use a log linear model of the conditional distribution P (a|x) as follows:",
        "where f(i, ai, x) is a feature function that examines the coreference decision ai for mention i with document context x.",
        "When ai = NEW, the features fired indicate the suitability of the given mention to be anaphoric or not; when ai = j for some j, the features express aspects of the pairwise linkage, and can examine any relevant attributes of the anaphor i or the antecedent j, since information about each mention is contained in x.",
        "Inference in this model is efficient: because logP (a|x) decomposes linearly over mentions, we can compute ai = argmaxai P (ai|x) separately for each mention and return the set of coreference chains implied by these decisions."
      ]
    },
    {
      "heading": "3.3 Learning",
      "text": [
        "During learning, we optimize for conditional log-likelihood augmented with a parameterized loss function (Durrett et al., 2013).",
        "The main complicating factor in this process is that the supervision in coreference consists of a gold clustering C?",
        "defined over gold mentions.",
        "This is problematic for two reasons: first, because the clustering is defined over gold mentions rather than our system mentions, and second, because a clustering does not specify a full antecedent structure of the sort our model produces.",
        "We can address the first of these problems by imputing singleton clusters for mentions that do not appear in the gold standard; our system will then simply learn to put spurious mentions in their own clusters.",
        "Singletons are always removed before evaluation because the OntoNotes corpus does not annotate them, so in this way we can neatly dispose of spurious mentions.",
        "To address the lack of explicit antecedents in C?, we simply sum over all possible antecedent structures licensed by the gold clusters.",
        "Formally, we will maximize the conditional log-likelihood of the set A(C?)",
        "of antecedent vectors a for a document that are consistent with the gold",
        "annotation.4 Consistency for an antecedent choice ai under gold clusters C?",
        "is defined as follows: 1.",
        "If ai = j, ai is consistent iff mentions i and j are present in C?",
        "and are in the same cluster.",
        "2.",
        "If ai = NEW, ai is consistent off mention i is",
        "not present in C?, or it is present in C?",
        "and has no gold antecedents, or it is present in C?",
        "and none of its gold antecedents are among the set of system predicted mentions.",
        "Given t training examples of the form (xk, C?k), we write the following likelihood function:",
        "l(a,C?)",
        "being a real-valued loss function.",
        "The loss",
        "here plays an analogous role to the loss in structured max-margin objectives; incorporating it into a conditional likelihood objective is a technique called softmax-margin (Gimpel and Smith, 2010).",
        "Our loss function l(a,C?)",
        "is a weighted linear combination of three error types, examples of which are shown in Figure 1.",
        "A false anaphor (FA) error occurs when ai is chosen to be anaphoric when it should start a new cluster.",
        "A false new (FN) error occurs in the opposite case, when ai wrongly indicates a new cluster when it should be anaphoric.",
        "Finally, a wrong link (WL) error occurs when the antecedent chosen for ai is the wrong antecedent (but ai is indeed anaphoric).",
        "Our final parameterized loss function is a weighted sum of the counts of these three error types:",
        "where FA(a,C?)",
        "gives the number of false anaphor errors in prediction a with gold chains C?",
        "(FN and WL are analogous).",
        "By setting ?FA low and ?FN high relative to ?WL, we can counterbalance the high number of singleton mentions and bias the system towards making more coreference linkages.",
        "We set (?FA, ?FN, ?WL) = (0.1, 3.0, 1.0) and ?",
        "= 0.001 and optimize the objective using AdaGrad (Duchi et al., 2011)."
      ]
    },
    {
      "heading": "4 Easy Victories from Surface Features",
      "text": [
        "Our primary goal with this work is to show that a high-performance coreference system is attainable with a small number of feature templates that use only surface-level information sources.",
        "These features will be general-purpose and capture linguistic effects to the point where standard heuristic-driven features are no longer needed in our system."
      ]
    },
    {
      "heading": "4.1 SURFACE Features and Conjunctions",
      "text": [
        "Our SURFACE feature set only considers the following properties of mentions and mention pairs:",
        "?",
        "Mention type (nominal, proper, or pronominal) ?",
        "The complete string of a mention ?",
        "The semantic head of a mention ?",
        "The first word and last word of each mention",
        "small number of surface-level mention properties.",
        "Feature counts for each template are computed over the training set, and include features generated by our conjunction scheme (not explicitly shown in the table; see Figure 2), which yields large numbers of features at varying levels of expressivity.",
        "?",
        "The word immediately preceding and the word immediately following a mention ?",
        "Mention length, in words ?",
        "Two distance measures between mentions (number of sentences and number of mentions) Table 1 shows the SURFACE feature set.",
        "Features that look only at the current mention fire on all decisions (ai = j or ai = NEW), whereas features that look at the antecedent in any way (the latter two groups of features) only fire on pairwise linkages (ai 6= NEW).",
        "Two conjunctions of each feature are also included: first with the ?type?",
        "of the mention being resolved (either NOMINAL, PROPER, or, if it is pronominal, the citation form of the pronoun), and then additionally with the antecedent type (only if the feature is over a pairwise link).",
        "This conjunction process is shown in Figure 2.",
        "Note that features that just examine the antecedent will end up with",
        "use.",
        "Each feature on anaphoricity is conjoined with the type (NOMINAL, PROPER, or the citation form if it is a pronoun) of the mention being resolved.",
        "Each feature on a mention pair is additionally conjoined with the types of the current and antecedent mentions.",
        "conjunctions that examine properties of the current mention as well, as shown with the ANT.",
        "HEAD feature in the figure.",
        "Finally, we found it beneficial for our lexical indicator features to only fire on words occurring at least 20 times in the training set; for rare words, we use the part of speech of the word instead.",
        "The performance of our system is shown in Table 2.",
        "We contrast our performance with that of the Stanford system (Lee et al. (2011), the winner of the CoNLL 2011 shared task) and the IMS system (Bjo?rkelund and Farkas (2012), the best publicly available English coreference system).",
        "Despite its simplicity, our SURFACE system is sufficient to outperform these sophisticated systems: the Stanford system uses a cascade of ten rule-based sieves each of which has customized heuristics, and the IMS system uses a similarly long pipeline consisting of a learned referentiality classifier followed by multiple resolvers, which are run in sequence and rely on the outputs of the previous resolvers as features."
      ]
    },
    {
      "heading": "4.2 Data-Driven versus Heuristic-Driven Features",
      "text": [
        "Why are the SURFACE features sufficient to give high coreference performance, when they do not make apparent reference to important linguistic phenomena?",
        "The main reason is that they actually do capture the same phenomena as standard corefer",
        "FORD system, and the IMS system on the CoNLL 2011 development set.",
        "Complete results are shown in Table 7.",
        "Despite using limited information sources, our system is able to substantially outperform the other two, the two best publicly-available English coreference systems.",
        "Bolded values are significant with p < 0.05 according to a bootstrap resampling test.",
        "ence features, just implicitly.",
        "For example, rather than having rules targeting person, number, gender, or animacy of mentions, we use conjunctions with pronoun identity, which contains this information.",
        "Rather than explicitly writing a feature targeting definiteness, our indicators on the first word of a mention will capture this and other effects.",
        "And finally, rather than targeting centering theory (Grosz et al., 1995) with rule-based features identifying syntactic positions (Stoyanov et al., 2010; Haghighi and Klein, 2010), our features on word context can identify configurational clues like whether a mention is preceded or followed by a verb, and therefore whether it is likely in subject or object position.5 Not only are data-driven features able to capture the same phenomena as heuristic-driven features, but they do so at a finer level of granularity, and can therefore model more patterns in the data.",
        "To contrast these two types of features, we experiment with three ablated versions of our system, where we replace data-driven features with their heuristic-driven counterparts:",
        "1.",
        "Instead of using an indicator on the first word of a mention (1STWORD), we instead fire a feature based on that mention's manually-computed definiteness (DEF).",
        "2.",
        "Instead of conjoining features on pronominal",
        "pronominal linkages with the citation form of 5Heuristic-driven approaches were historically more appropriate, since past coreference corpora such as MUC and ACE were smaller and therefore more prone to overfitting feature-rich models.",
        "However, the OntoNotes dataset contains thousands of documents, so having support for features is less of a concern.",
        "for the three different ablations and replacement features described in Section 4.2.",
        "Feature types are described in the text; + indicates inclusion of that feature class, ?",
        "indicates exclusion.",
        "Each individual shallow indicator appears to do as well at capturing its target phenomenon as the hand-engineered features, while capturing other information as well.",
        "Moreover, the hand-engineered features give no benefit over the SURFACE system.",
        "each pronoun (PRONCONJ), we only conjoin with a PRONOUN indicator and add features targeting the person, number, gender, and animacy of the two pronouns (AGR).",
        "3.",
        "Instead of using our context features on the preceding and following word (CONTEXT), we use manual determinations of when mentions are in subject, direct object, indirect objection, or oblique position (POSN).",
        "All rules for computing person, number, gender, animacy, definiteness, and syntactic position are taken from the system of Lee et al. (2011).",
        "Table 3 shows each of the target ablations, as well as the SURFACE system with the DEF, AGR, and POSN features added.",
        "While the heuristic-driven feature always help over the corresponding ablated system, they cannot do the work of the fine-grained data-driven features.",
        "Most tellingly, though, none of the heuristic-driven features give statistically significant improvements on top of the data-driven features we have already included, indicating that we are at the point of diminishing returns on modeling those specific phenomena.",
        "While this does not preclude further engineering to take better advantage of other syntactic constraints, our simple features represent an ?easy victory?",
        "on this subtask."
      ]
    },
    {
      "heading": "5 Uphill Battles on Semantics",
      "text": [
        "In Section 4, we gave a simple set of features that yielded a high-performance coreference system; this high performance is possible because features targeting only superficial properties in a fine-grained way can actually model complex linguistic constraints.",
        "However, while our existing features capture syntactic and discourse-level phenomena surprisingly well, they are not effective at capturing semantic phenomena like type compatibility.",
        "We will show that due to structural aspects of the coreference resolution problem, even a combination of several shallow semantic features from the literature fails to adequately model semantics."
      ]
    },
    {
      "heading": "5.1 Analysis of the SURFACE System",
      "text": [
        "What can the SURFACE system resolve correctly, and what errors does it still make?",
        "To answer this question, we will split mentions into several categories based on their observable properties and the gold standard coreference information, and examine our system's accuracy on each mention subclass in order to more thoroughly characterize its performance.",
        "These categories represent important distinctions in terms of the difficulty of mention resolution for our system.",
        "We first split mentions into three categories by their status in the gold standard: singleton (unanno-tated in the OntoNotes corpus), starting a new entity with at least two mentions, or anaphoric.",
        "It is important to note that while singletons and mentions starting new entities are outwardly similar in that they have no antecedents, and the prediction should be the same in either case (NEW), we treat them as distinct because the factors that impact the coreference decision differ in the two cases.",
        "Mentions that start new clusters are semantically similar to anaphoric mentions, but may be marked by heaviness or by a tendency to be named entities, whereas singletons may be generic or temporal NPs which might be thought of as coreferent in a loose sense, but are not 6This method of analysis is similar to that undertaken in Stoyanov et al. (2009) and Rahman and Ng (2011b), though we split our mentions along different axes, and can simply evaluate on accuracy because our decisions do not directly imply multiple links, as they do in binary classification-based systems (Stoyanov et al., 2009) or in entity-mention models (Rahman and Ng, 2011b).",
        "velopment set.",
        "We characterize each predicted mention by its status in the gold standard (singleton, starting a new entity, or anaphoric), its type (pronominal or nominal/proper), and by whether its head has appeared as the head of a previous mention.",
        "Each cell shows our system's accuracy on that mention class as well as the size of the class.",
        "The biggest weakness of our system appears to be its inability to resolve anaphoric mentions with new heads (bottom-left cell).",
        "included in the OntoNotes dataset due to choices in the annotation standard.",
        "Second, we divide mentions by their type, pronominal versus nominal/proper; we then further subdivide nominals and propers based on whether or not the head word of the mention has appeared as the head of a previous mention in the document.",
        "Table 4 shows the results of our analysis.",
        "In each cell, we show the fraction of mentions that we correctly resolve (i.e., for which we make an antecedence decision consistent with the gold standard), as well as the total number of mentions falling into that cell.",
        "First, we observe that there are a surprisingly large number of singleton mentions with misleading head matches to previous mentions (often recurring temporal nouns phrases, like July).",
        "The features in our system targeting anaphoricity are useful for exactly this reason: the more bad head matches we can rule out based on other criteria, the more strongly we can rely on head match to make correct linkages.",
        "Our system is most noticeably poor at resolving anaphoric mentions whose heads have not appeared before.",
        "The fact that exact match and head match are our only recall-oriented features on nominals and propers is starkly apparent here: when we cannot rely on head match, as is true for this mention class, we only resolve 7.9% of anaphoric mentions correctly.7 Many of the mentions in this category 7There are an additional 346 anaphoric nominal/proper mentions in the 2nd+ category whose heads only appeared previously as part of a different cluster; we only resolve 1.7% of can only be correctly resolved by exploiting world knowledge, so we will need to include features that capture this knowledge in some fashion."
      ]
    },
    {
      "heading": "5.2 Incorporating Shallow Semantics",
      "text": [
        "As we were able to incorporate syntax with shallow features, so too might we hope to incorporate semantics.",
        "However, the semantic information contained even in a coreference corpus of thousands of documents is insufficient to generalize to unseen data,8 so system designers have turned to external resources such as semantic classes derived from WordNet (Soon et al., 2001), WordNet hypernymy or synonymy (Stoyanov et al., 2010), semantic similarity computed from online resources (Ponzetto and Strube, 2006), named entity type features, gender and number match using the dataset of Bergsma and Lin (2006), and features from unsupervised clus",
        "ters (Hendrickx and Daelemans, 2007; Durrett et al., 2013).",
        "In this section, we consider the following subset of these information sources: ?",
        "WordNet hypernymy and synonymy ?",
        "Number and gender data for nominals and propers from Bergsma and Lin (2006) ?",
        "Named entity types ?",
        "Latent clusters computed from English Giga-word (Graff et al., 2007), where a latent cluster label generates each nominal head (excluding pronouns) and a conjunction of its verbal governor and semantic role, if any (Durrett et al.,",
        "2013).",
        "We use twenty clusters, which include clusters like president and leader (things which announce).",
        "Together, we call these the SEM features.",
        "We show results from this expansion of the feature set in Table 5.",
        "When using system mentions, the improvements are not statistically significant on every metric, and are quite marginal given that these features add information that is intuitively central to coreference and otherwise unavailable to the system.",
        "We explore the reasons behind this in the next section.",
        "these extremely tricky cases correctly.",
        "for our SEM features when added on top of our SURFACE features.",
        "We experiment on both system mentions and gold mentions.",
        "Surprisingly, despite the fact that absolute performance numbers are much higher on gold mentions and there is less room for improvement, the semantic features help much more than they do on system mentions."
      ]
    },
    {
      "heading": "5.3 Analysis of Semantic Features",
      "text": [
        "The main reason that weak semantic cues are not more effective is the small fraction of positive coreference links present in the training data.",
        "From Table 4, the number of annotated coreferent spans in the OntoNotes data is about a factor of five smaller than the number of system mentions.9 This both means that most NPs are not coreferent, and for those that are, choosing the correct links is much more difficult because of the large number of possible antecedents.",
        "Even head match, which is generally considered a high-precision indicator (Lee et al., 2011), would introduce many spurious coreference arcs if applied too liberally (see Table 4).",
        "In light of this fact, a system needs very strong evidence to overcome the default hypothesis that a mention is not coreferent, and a weak indicator will have such a high ?false positive?",
        "rate that it cannot be relied on (given high weight, this feature would do more harm than good, by introducing many false linkages).",
        "To confirm this intuition, we show in the bottom part of Table 5 results when we apply these semantic features on top of our SURFACE system on gold mentions, where there are no singletons.",
        "In the gold mention setting, we see that the semantic features give a consistent improvement on every metric.",
        "Moreover, if we look at a breakdown of errors, the main improvement the semantic features give us is on resolution of anaphoric nominals with no head 9This observation is more general than just our system: the majority of coreference systems, including the winners of the CoNLL shared tasks (Lee et al., 2011; Fernandes et al., 2012), opt for high mention recall and resolve a relatively large number of system mentions.",
        "match: accuracy on the 1601 mentions that fall into this category improves from 28.0% to 37.9%.",
        "On predicted mentions, by contrast, this category only improves from 7.9% to 12.2%, a much smaller absolute improvement and one that comes at the expense of performance on most other resolution class.",
        "The one class that does not get worse, singleton pronouns, actually improves by a similar 4% margin, indicating that roughly half of the gains we observe are not even necessarily a result of our features doing what they were designed to do.",
        "Our weak cues do yield some small gains, so there is hope that better weak indicators of semantic compatibility could prove more useful.",
        "However, while extremely high-precision approaches with carefully engineered features have been shown to be successful (Rahman and Ng, 2011a; Bansal and Klein, 2012; Recasens et al., 2013a), we conclude that capturing semantics in a data-driven, shallow manner remains an uphill battle."
      ]
    },
    {
      "heading": "6 FINAL System and Results",
      "text": [
        "While semantic features ended up giving only marginal benefit, we have demonstrated that nevertheless our SURFACE system is a state-of-the-art English coreference system.",
        "However, there remain a few natural features that we omitted in order to keep the system as simple as possible, since they were orthogonal to the discussion of data-driven versus heuristic-driven features and do not target world knowledge.",
        "Before giving final results, we will present a small set of additional features that consider four additional mention properties beyond those in Section 4.1: ?",
        "Whether two mentions are nested ?",
        "Ancestry of each mention head: the dependency parent and grandparent POS tags and arc directions (shown in Figure 3) ?",
        "The speaker of each mention ?",
        "Number and gender of each mention as determined by Bergsma and Lin (2006) The specific additional features we use are shown in Table 6.",
        "Note that unlike in Section 5, we use the number and gender information only on the antecedent.",
        "Due to our conjunction scheme, both this",
        "cess.",
        "These features capture more sophisticated configu-rational information than our context word features do: in this example, president is in a characteristic indirect object position based on its dependency parents, and Obama is the subject of the main verb of the sentence.",
        "semantic information and the speaker information can apply in a fine-grained way to different pronouns, and can therefore improve pronoun resolution substantially; however, these features generally only improve pronoun resolution.",
        "Full results for our SURFACE and FINAL feature sets are shown in Table 7.",
        "Again, we compare to Lee et al. (2011) and Bjo?rkelund and Farkas (2012).10 Despite our system's emphasis on one-pass resolution with as simple a feature set as possible, we are able to outperform even these sophisticated systems by a wide margin."
      ]
    },
    {
      "heading": "7 Related Work",
      "text": [
        "Many of the individual features we employ in the FINAL feature set have appeared in other coreference systems (Bjo?rkelund and Nugues, 2011; Rahman and Ng, 2011b; Fernandes et al., 2012).",
        "However, other authors have often emphasized bilexical features on head pairs, whereas our features are heavily monolexical.",
        "For feature conjunctions, other authors have exploited three classes (Lee et al., 2011) or automatically learned conjunction schemes (Fernandes et al., 2012; Lassalle and Denis, 2013), but to our knowledge we are the first to do fine-grained modeling of every pronoun.",
        "Inclusion of a hierarchy of 10Discrepancies between scores here and those printed in Pradhan et al. (2012) arise from two sources: improvements to the system of Lee et al. (2011) since the first CoNLL shared task, and a fix to the scoring of B3 in the official scorer since results of the two CoNLL shared tasks were released.",
        "Unfortunately, because of this bug in the scoring program, direct comparison to the printed results of the other highest-scoring English systems, Fernandes et al. (2012) and Martschat et al. (2012), is impossible.",
        "SURFACE feature set.",
        "As with the features of the SURFACE system, two conjoined variants of each feature are included: first with the type of the current mention (NOMINAL, PROPER, or the citation form of the pronoun), then with the types of both mentions in the pair.",
        "These conjunctions allow antecedent features on gender and number to impact pronoun resolution, and they allow speaker match to capture effects like I and you being coreferent when the speakers differ.",
        "features with regularization also means that we organically get distinctions among different mention types without having to choose a level of granularity a priori, unlike the distinct classifiers employed by Denis and Baldridge (2008).",
        "In terms of architecture, many coreference systems operate in a pipelined fashion, making partial decisions about coreference or pruning arcs before full resolution.",
        "Some systems use separate rule-based and learning-based passes (Chen and Ng, 2012; Fernandes et al., 2012), a series of learning-based passes (Bjo?rkelund and Farkas, 2012), or referentiality classifiers that prune the set of mentions before resolution (Rahman and Ng, 2009; Bjo?rkelund and Farkas, 2012; Recasens et al., 2013b).",
        "By contrast, our system resolves all mentions in one pass and does not need pruning: the SURFACE system can train in less than two hours without any subsampling of coreference arcs, and rule-based pruning of coreference arcs actually causes our system to perform less well, since our features can learn valuable information from these negative examples.",
        "of Lee et al. (2011) (STANFORD) and Bjo?rkelund and Farkas (2012) (IMS).",
        "Starred systems are contributions of this work.",
        "Bolded F1 values represent statistically significant improvements over other systems with p < 0.05 using a bootstrap resampling test.",
        "Metric values reflect version 5 of the CoNLL scorer."
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "We have presented a coreference system that uses a simple, homogeneous set of features in a discriminative learning framework to achieve high performance.",
        "Large numbers of lexicalized, data-driven features implicitly model linguistic phenomena such as definiteness and centering, obviating the need for heuristic-driven rules explicitly targeting these same phenomena.",
        "Additional semantic features give only slight benefit beyond head match because they do not provide strong enough signals of coreference to improve performance in the system mention setting; modeling semantic similarity still requires complex outside information and deep heuristics.",
        "Our system, the Berkeley Coreference Resolution System, is publicly available at http://nlp.cs.berkeley.edu."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was partially supported by BBN under DARPA contract HR0011-12-C-0014 and by an NSF fellowship for the first author.",
        "Thanks to Sameer Pradhan for helpful discussions regarding the CoNLL scoring program, and thanks to the anonymous reviewers for their insightful comments."
      ]
    }
  ]
}
