{
  "info": {
    "authors": [
      "Milan Bily",
      "Bengt Sigurd"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2009",
    "title": "Developing the Commentator, A Computer System Simulating Verbal Production",
    "url": "https://aclweb.org/anthology/C82-2009",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "heading": "DEVELOPING THE COMMENTATOR, A COMPUTER SYSTEM SIMULATING VERBAL PRODUCTION",
      "text": [
        "The project \"COMMENTATOR\" at the department of general linguistics at the university of Lund is intended to test ideas about language production.",
        "The system implemented in.",
        "BASIC on the ABC80 microcomputer generates a scene on the monitor where two persons, Adam and Eve, move randomly around a gate.",
        "Not only the present positions of Adam and Eve are shown on the screen but even the positions before the last jump.",
        "This setting is also used for eliciting comments from human subjects.",
        "The moves are generated randomly but the operator can choose the length of the jumps.",
        "The initial placement of Adam and Eve can be determined by the operator, as well as the instructions for the machine concerning the focus of attention (Adam or Eve) and the primary goal of the actors (the gate or the other actor).",
        "On the operator's command the computer produces a set of written comments on the development of the scene.",
        "COMMENTATOR is a research tool, and does not use any ready-made sentences describing forseable situations.",
        "The system works as follows: From the primary information (the coordinates of the gate and the two actors) some more complex values are derived (distances, relations \"to left\",,nto right\" etc.).",
        "The conditions for using abstract predicates equivalent to \"to left\" etc.",
        "in the given situation are tested according to a question menu.",
        "This results in positive or negative abstract sentences.",
        "The abstract sentence constituents -42-are ordered as subjects, predicates , and objects.",
        "Connective elements, such as \"also\", \"either\", \"yet\", are added if possible.",
        "These connect the last proposition to the previous ones.",
        "Proper names, pronouns, or other NPs are chosen on the basis of reference relations to the preceding proposition.",
        "The abstract propositions are substituted by surface phrases and words.",
        "The assembled structure is printed.",
        "(For a more extensive description of the program and one version of the program itself see Sigurd 1980.)",
        "The text produced by COMMENTATOR may look like this: Eva ar till huger om Adam.",
        "(Eve is to the right of Adam.)",
        "Han ar till vanster om henna.",
        "(He is to the left of her.)",
        "Han ar till vanster om porten ooksi.",
        "(He is to the left of the gate, too.)",
        "Han narmar dig den.",
        "(He is approaching it.)",
        "Han nirmar sig Eva ocksA.",
        "(He is approaching Nve, too.)",
        "Hon ar narmast porten dock.",
        "(Lit.",
        "She is closest to the gate, however.)",
        "Hon ar into nara den.",
        "(She is not close to it.)",
        "Adam ar into nara den Keller.",
        "(Adam is not close to it, either.)"
      ]
    },
    {
      "heading": "COMMIE",
      "text": [
        "COMMIE is a semantioally and psycholinguistically more advanced program, which is intended to overcome certain shortcomings experienced with the original COMMENTATOR.",
        "This more complex program generates a more sophisticated and more dynamic stimulus inoluding more objects and persons on the scene and the vocabulary is about ten times larger.",
        "COMMIE is to produce human-like texts.",
        "One important task is to avoid unnecessary redundancies.",
        "The commentaries produced have to be based on relevant changes of the scene and they must avoid repetitions, including information implied by previous utterances.",
        "(E.g., \"Adam is to the left of Eve\" implies \"Eve is to the right of Adam\", etc.)",
        "Not all propositions that are not true in the given, moment deserve to be mentioned, either.",
        "Negated state 43 - ments are meaningful only as answers to expectations evoked by the previous context.",
        "(E.g., \"Bertil is chasing Eve.",
        "He is not very near her yet, however.\" but not w\"Bertil is chasing Eve.",
        "Neither of them is in the upper right corner\".)",
        "All information about the world of the TV screen is stored in a two-dimensional array as mini-thoughts - two-place predications that are either true or false at the given moment.",
        "Forgetting is simulated by gradually letting the contents of the array pass a horizon of forgetting.",
        "In a future version the basic contents may be stored in a long term memory.",
        "The predications of the array serve as inputs for generating complex semantic structures, which are inputs to the production of commentaries proper.",
        "Referring in COMMIE is to be based on the theory of FSP.",
        "By computing \"degrees of giveness\", it should be able to cope with even such problems as the difference between thematic pronominal vs. thematic zero subjects in Slavic languages generally or the enclitic vs. full forms of oblique pronominal oases in West Slavic languages etc.",
        "(Cf. Bily 1981a, Chapter Three.)",
        "The deep structures are to be \"universal\" enough to allow generation of commentaries in several languages.",
        "COMMIE will also have more sophisticated conditions for the use of the two-place predicates.",
        "Instead of, e.g., purely geometrically defined conditions for \"X is to the left of Y\" to be true, a certain limit is put on the allowed vertical distance.",
        "The limit seems to be a inflation of the size of X and Y, the size of the referential frame and the focus of attention.",
        "(Cf. Bily 1981b) Other versions in preparation A version producing spoken comments using VOTRAX speech synthesizer or more advanced technique is being planned.",
        "As the COMMENTATOR has perfect control of the steps in the production of comments, it should be able to produce better prosody than ordinary text-to-speech systems (e.g. Carlson et al.",
        "-441981).",
        "Contrastive accents can be derived as the system knows if a comment is in contrast with a presiding statement.",
        "Accents based on syntactic structure can be derived as the syntactic structure of the comments if prefectly known.",
        "A system which can comment on any arbitrary scene where persons and things appear, actions and events take place, would demand pattern recognition, which is a difficult problem.",
        "Only a small scale system is being planned.",
        "It requires a flexible question menu, where'relevant questions are produced successively.",
        "Beginning comments on such a scene would be something like this: \"There is something at the left upper corner.",
        "It moves.",
        "Now something turns up at the right upper corner .",
        "It looks like a ship.",
        "Both objects move fast towards the centre.\" Such comments suggest applications as the automatic radar commentator, but so far such practical applications have been little considered.",
        "It is, however, envisaged that verbal comments on events produced by computers will be common in the future world of robots.",
        "Bibliography: Bily, B.",
        "(1981a): \"Intrasentential Pronominalization and Functional Sentence Perspective (in Czech, Russian, and - English)\", Lund Slavonic Monographs 1, University of Lund"
      ]
    }
  ]
}
