{
  "info": {
    "authors": [
      "Mary Dalrymple"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-1035",
    "title": "Categorial Semantics for LFG",
    "url": "https://aclweb.org/anthology/C92-1035",
    "year": 1992
  },
  "references": [
    "acl-C88-1060",
    "acl-C90-3052",
    "acl-J90-1001"
  ],
  "sections": [
    {
      "heading": "1 Introduction",
      "text": [
        "A categorial semantics for Lexical-Functional Grammar provides a means for semantic interpretation of sentences of natural language that is appropriately constrained both syntactically and semantically.",
        "The f-structure of LFG provides a cross-linguistically uniform format for representing syntactic information; constraining a derivation with respect to the f-structure rather than a phrase structure tree allows reference to relevant functional syntactic information without requiring construction of a phrase structure tree whose form is (often dubiously) motivated on semantic grounds.",
        "Additionally, a categorial semantics constrains semantic derivations appropriately, obviating the need for an appeal to well-formedness conditions on the resulting semantic representation."
      ]
    },
    {
      "heading": "2 Previous Work",
      "text": [
        "Most semantic analyses appeal to syntactic constraints on semantic derivations.",
        "In particular, many analyses assume that such syntactic constraints are statable in terms of phrase structure tree configurations (Montague, 1974).",
        "However, it is well-known that a variety of phrase structure configurations can express the same syntactic predicate-argument relations within and across languages (Kaplan and Bresnan, 1982); thus, syntactic constraints on semantic derivations are better expressed at a level at which the relevant syntactic information is expressed more uniformly.",
        "Such a level is the f-structure of LFG.",
        "Halvorsen (1983) first provided a theory of semantic interpretation for LFG in which semantic interpretation rules are related to the f-structure.",
        "His system involves an intermediate level of representation, the 'semantic struc-ture', which is represented as a directed graph (like the f-structure).",
        "Translation rules map from f-structures to semantic structures, and these structures are then interpreted (or translated into a formula of intensional logic).",
        "The approach to be presented here also relies on f-structure configurations to provide syntactic constraints on categorial semantic derivations.",
        "However, an intermediate level of semantic representation such as Halvorsen's semantic structure is not introduced.",
        "In the categorial semantic framework developed by Fernando Pereira (Pereira, 1990; Pereira and Pollack, 1991; Pereira, 1991), syntactic structures are directly associated with interpretations (or their types), and syntactic configurations license the combination of these interpretations in a semantic derivation.",
        "On this approach, 'logical forms' are not viewed as manipulable syntactic objects; instead, a logical formula is simply a graphical representation of a meaning that is lexically provided or that is the outcome of a semantically justified derivation.",
        "In this, the approach differs from other recent approaches to semantic interpretation in LFG (Halvorsen and Kaplan, 1988), in which the interpretation of an f-structure is represented as a directed graph, and semantic derivation proceeds principally by unification of semantic representations.",
        "As a consequence, these approaches require constraints on semantic derivations to be stated as well-formedness conditions on semantic representations, contrary to the commonly-held goal of dis-pensability of logical form.",
        "To illustrate a categorial semantic analysis within LFG, I will provide a small fragment of syntactic and semantic rules of English; the fragment contains rules for quantified noun phrases, nominal modification, and clauses headed by transitive and intransitive verbs.",
        "Many of these rules are modifications and extensions of rules originally described in Pereira (1990), though Pereira's system appeals to phrase structure configurations rather than f-structures to con-Acres DE COLD/G-92, NANTES, 23-28 Aoirr 1992 2 1 2 PROC.",
        "OF COLING-92, morrEs, AUG. 23-28, 1992 strain semantic derivations; in particular, the rules Pereira provides for quantifiers and relative clauses have direct counterparts in the set of rules to be described below."
      ]
    },
    {
      "heading": "3 Sentence Interpretation",
      "text": [
        "A sentence such as (1) has the interpretation given in (2):1",
        "(1) John crashed.",
        "(2) crash (1 ohn)",
        "This interpretation is the outcome of a derivation according to a set of rules to be described below.",
        "Some of the rules must be licensed by particular f-structure configurations, while some are unrestricted in their applicability.",
        "Example 1 has the following f-structure: [PRED 'crash (SUBS) '-SUET [PRED `,1011111 - Annotated phrase structure rules like the following are assumed: 2",
        "Notice that these phrase structure rules encode only syntactic information.",
        "No semantic information or constraints are required.",
        "The lexical entries involved in the derivation of sentence (1) are:",
        "The notation f, stands for the interpretation of an f-structure f, often referred to as the semantic projection of f (Kaplan, 1987; Halvorsen and Kaplan, 1988), The interpretation for any f-structure f is a sequent: will ignore tense and aspect in the representation of sentence meanings.",
        "'See Bresnan (1982) for an explication of the relation between c-structure and f-structure and the notation commonly used to represent that relation.",
        "(4) f [a I M]",
        "The sequent `[a H M]' is a pair consisting of a set of assumptions a, somewhat analogous to a 'quantifier store' (Cooper, 1983), and a matrix term M in which free variables introduced by the assumptions in a may occur (Pereira, 1990; Pereira, 1991; Dalrymple et al., 1991).",
        "In the following, I will speak of such expressions as introducing the meaning M under the assumptions in a. I assume a fixed order of application of the meaning of a verb to its semantic arguments, with the order determined by the syntax (though this assumption is not crucial to the analysis).",
        "Arguments are applied in the following order:3",
        "(I) Obliques (2) (ma (3) OBJ (4) Suns",
        "The PEED of the f-structure of an active verb such as own will, then, be associated via the a mapping with the following interpretation:",
        "(5) Ay.Ax.own(x,y)",
        "Notice that the verb is required to combine with the object first, and then the subject, in accordance with the argument ordering given above.",
        "For a passive verb, the ordering will be reversed.",
        "For the passive verb (be) owned, the order will be:",
        "(6) Ar .own (x, y)",
        "Here, the verb combines first with the oblique by-phrase, then with the subject.",
        "The rule for interpreting art f-structure for a clause headed by an intransitive verb is:4",
        "(7) Clause with intransitive verb:",
        "'This order of application was also proposed by Dowty (1982), and is reminiscent of the obliqueness ordering for arguments in HPSG (Pollard and Sag, 1987).",
        "'This rule should apply when f has a PRED and a suet, but no other governable grammatical functions; it should not apply if the verb is transitive and there is a 51313.1 and an OW, although f is unifiable with the f-structure of a transitive verb as well as an intransitive one.",
        "There arc several ways of ensuring the needed result: the valence of the verb can be reflected in its semantic type; f-structures can he typed, with this rule applying only to intransitive f-structures (Zajac and Emele, 1990); or the PRED and its arguments can he separately specified, with the arguments of the PROD specified as a list which can be matched against, as in recent work by John Maxwell, Ron Kaplan, and others.",
        "The derivation of the meaning f,, of an f-structure f with a PRED and SUBJ proceeds by applying the meaning of the PRED to the meaning of the SUBJ.",
        "The associated assumption set is the union of the assumptions from the PRED and the SUBJ.",
        "The f-structure for sentence 1 licenses the following derivation and provides the expected meaning (under a null assumption set):"
      ]
    },
    {
      "heading": "4 Quantification",
      "text": [
        "Sentence 9 contains a quantified noun phrase and has the meaning represented in (10):",
        "(9) Every car crashed.",
        "(10) every (Ay.car (y), Ax.crash (x))",
        "This sentence has the f-structure shown in (11), constructed on the basis of the lexical entries below:",
        "The type of the quantifier every is the familiar generalized quantifier type (e (e t) – ] t: quantifiers are functions from properties to properties, yielding a truth value.",
        "The following schematic rule is necessary to interpret quantified noun phrases: (12) Quantified noun phrase, preliminary version (handles unmodified nominals only):",
        "The notation 'a, A' represents the set a plus the singleton A.",
        "By this rule, a quant assumption is added to the assumption set for the noun phrase.",
        "The quant assumption acts like an element in a Cooper store, keeping together the information associated with the quantified noun phrase.",
        "ms in the quant assumption is the meaning of the specifier (here, every); x is the variable introduced by the quantifier as the meaning of the quantified noun phrase; and mp is the meaning of the PRED, which will form the first argument of the generalized quantifier every when quantifier discharge takes place.",
        "The derivation of the meaning of sentence 9 according to the rules given thus far proceeds as follows:",
        "By rule 7, 'Clause with intransitive verb': (fi), = [{quant (every, x, Ay.car (y))1 I crash (x)] According to these rules, the meaning for (- structure fl is a meaning under an assumption about the variable x.",
        "The meaning of fs without assumptions is obtained by discharging the (sole) quantifier assumption in the assumption set.",
        "The quantifier discharge rule relates a sequent and a syntactic licensing environment to a new sequent:",
        "in the following to apply predicates to their arguments and to permit subsequent assumption discharge.",
        "Given this new definition of apply, interpretation rule 7 for clauses headed by intransitive verbs can he restated: By this discharge rule, the quant assumption is removed from the assumption set, the variable x introduced by the quantifier assumption is abstracted out of the scope SCOPE (required to be of type t), and the quantifier is applied to its scope.",
        "The syntactic licensing environment is the f-structure f. In this rule, f is unconstrained; there are no conditions on f .",
        "This means that the quantifier discharge rule has an unrestricted syntactic licensing condition.",
        "A quantifier may scope over any syntactic constituent, as long as it is of the correct semantic types To interpret sentence 9, disch can now be applied to the sequent (fi)a associated with the f-structure disch(kRquant(every,x, Ay.car(y))).",
        "crash(x)1) = [0 every (Ay.car (y), Ax.crash(x))] The result is the meaning of fi with all assumptions discharged.",
        "I will assume that what is generally referred to as the 'meaning' of an utterance is the meaning obtained when all assumptions have been discharged.",
        "In general, assumptions may be discharged after any application of a functor to an argument, as long as the syntactic environment for assumption discharge has been met.",
        "Thus, a predicate apply can be defined: (15) aPPIY (.f ,[aF F Fun], [aii.",
        "I Amy]) di discharge(f, [rip U a A I Fun (Arg)]) apply operates on sequents in a syntactic licensing environment f. discharge(f, S) is the result of applying any number of discharge (disch) rules licensed by the syntactic configuration f to S. (Note that apply is not a function, since the result of apply depends on the number and the choice of assumptions to be discharged.)",
        "By this function application rule for sequents, then, the meaning of the functor is applied to the meaning of the argument; the union of the functor assumptions and the argument assumptions is taken; and some number of discharge rules may be applied.",
        "This definition of apply will be used 'Here I will not discuss conditions on preferred scopes for quantifiers (such as the tendency for the quantifier each to outscope other quantifiers, or for quantifiers to scope inside the clause in which they appear).",
        "The interpretation for an f-structure f, representing an unmodified clause with an intransitive verb, is obtained by applying the PEED P to the SUBJ S in the syntactic licensing environment f. In general, f, will constitute an assignment of f to a sequent that satisfies the constraints given by the lexical entries and the rules of interpretation.",
        "It should be noted that rule 16 is incomplete in providing interpretations only for sentences not involving adverbial modification; an analysis of adverbials, though straightforward in this framework, will not he provided here."
      ]
    },
    {
      "heading": "5 Nominal modification",
      "text": [
        "Syntactically, a relative clause contains a fronted constituent (a TOPIC; see Bresnan and Mchombo (1987)) which is related to a gapped position in the sentence.",
        "This fronted constituent contains a relative pronoun or that.",
        "The relative pronoun may be deeply embedded in the fronted ADES DE COLING-92, NAMES, 23-28 Aoin 1992 2 1 5 PROC.",
        "01.",
        "COLING-92, NANTES, AUG. 23-28, 1992 constituent, as in the case of pied piping.",
        "Semantically, the interpretation of a relative clause is the property obtained when the position filled by the relative pronoun is abstracted out.",
        "For example, here are some relative clauses with a rough representation of their meanings:",
        "(19) a.",
        "(the man) that I saw: Ax.saw(I , x) b.",
        "(the man) whose brother's car I drove: Ax.drove(I, x's brother's car)",
        "I assume that relative pronouns such as that or whose introduce a variable under a rel assumption which is abstracted out in the course of the derivation.",
        "The interpretation of a relative clause is obtained by a rule allowing the discharge of the rel assumption associated with the relative pronoun (and possibly other assumptions as well):",
        "The relative pronoun must appear in the fronted TOPIC constituent.",
        "This is indicated in the second condition by the regular expression TOPIC GF*; this expression involves functional uncertainty (Kaplan and Maxwell, 1988) and requires that the relative pronoun yelp must appear at the end of a path that is a member of the language described by the regular expression.",
        "Here, the path expression does not constrain where the relative pronoun may be found within the fronted constituent (GF* is a sequence of zero or snore grammatical functions); a snore complete syntactic analysis of relative clauses would constrain the path appropriately.",
        "The result of the application of rule 21 is that the variable introduced by the relative pronoun is abstracted out.",
        "The value of the MODS attribute is a set of f-structures, interpreted according to the following rule: (22) The semantic value of a set of f-structures is the set of corresponding sequents.",
        "If F is a set of f-structures:",
        "The rule for the interpretation of quantified noun phrases with nominal modification is given in Figure 2.",
        "According to this rule, the derivation of the meaning of a quantified noun phrase proceeds by introducing a variable (x in Figure 2) under a quant assumption, consisting of the meaning of the specifier of the noun phrase, the variable, and the quantifier restriction REST.",
        "Recall the definition of apply given in 15:",
        "(23) apply (f, (CIF F F unb[a A F Arg]) discharge( f , [aF U aA F Fun (Arg)))",
        "This definition will now be extended so apply can take a set of sequents as its argument.",
        "The result is a set of sequents:",
        "The function conj is defined as the conjunction of a set of sequents; the matrices of the sequents are conjoined and the union of the assumptions is taken: (25) conj (S) [U ah A M] khmiES H-Afjcs REST, then, is the conjunction of the result of applying the FRED meaning and the meaning of each of the modifiers in MODS to the variable x.",
        "Finally, a rule for the interpretation of a clause containing a transitive verb is also needed:",
        "(26) Clause with transitive verb: FRED P",
        "SUBJBJ 0 S OBJ f „ = apply( f , apply ( Pd, 0, ), So.)",
        "The interpretation of sentence 17 can now be derived; the derivation is sketched in Figure 3.",
        "f3, = {[0 H Ax .own(j, x)]1 By the rule for quantified noun phrases given in Figure 2 and the lexical entries for every and car: f2, = ({quant(every, y, Ax.car(x) A own(j,x))}1- yi By rule 16 for clauses with intransitive verbs: [{quant(every, y, Ax.car(x) A own(j, x)} H crash(y)] By quantifier discharge rule 14: fio= [0 H every (Ax.car(x) A own(j, x), Ay .crash(y))1"
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "The small fragment of English presented above is easily extensible to handle other semantic phenomena, such as sentential modification.",
        "Constraining semantic derivations with respect to f-structures is preferable to the standard approach of using phrase structure trees, since f-structures need not be specifically tailored to solving the interpretation problem, but are motivated on independent grounds.",
        "The categorial semantics rules presented above provide an interpretation for f-structures directly, without the need for constructing an intermediate level of 'logical form'."
      ]
    },
    {
      "heading": "7 Acknowledgements",
      "text": [
        "For invaluable assistance, I am very grateful to Fernando Pereira and Stuart Shieber.",
        "Many thanks are also due to John Lamping and Vijay Saraswat for their help and encouragement, and to Joan Bresnan, Ken Kahn, Ron Kaplan, Lauri Karttunen, Chris Manning, John Maxwell, and Annie Zaenen for helpful comments and discussion."
      ]
    }
  ]
}
