{
  "info": {
    "authors": [
      "Thomas Schoenemann"
    ],
    "book": "ACL",
    "id": "acl-P13-1003",
    "title": "Training Nondeficient Variants of IBM-3 and IBM-4 for Word Alignment",
    "url": "https://aclweb.org/anthology/P13-1003",
    "year": 2013
  },
  "references": [
    "acl-C96-2141",
    "acl-D07-1006",
    "acl-E06-1004",
    "acl-E09-1020",
    "acl-H05-1022",
    "acl-J00-2004",
    "acl-J03-1002",
    "acl-J10-3001",
    "acl-J10-3007",
    "acl-J93-2003",
    "acl-N06-1014",
    "acl-P11-1131",
    "acl-P12-1033",
    "acl-P98-2221",
    "acl-W02-1012",
    "acl-W02-1018",
    "acl-W10-2913"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We derive variants of the fertility based models IBM-3 and IBM-4 that, while maintaining their zero and first order parameters, are nondeficient.",
        "Subsequently, we proceed to derive a method to compute a likely alignment and its neighbors as well as give a solution of EM training.",
        "The arising M-step energies are non-trivial and handled via projected gradient ascent.",
        "Our evaluation on gold alignments shows substantial improvements (in weighted F-measure) for the IBM-3.",
        "For the IBM4 there are no consistent improvements.",
        "Training the nondeficient IBM-5 in the regular way gives surprisingly good results.",
        "Using the resulting alignments for phrase-based translation systems offers no clear insights w.r.t.",
        "BLEU scores."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "While most people think of the translation and word alignment models IBM-3 and IBM-4 as inherently deficient models (i.e. models that assign non-zero probability mass to impossible events), in this paper we derive nondeficient variants maintaining their zero order (IBM-3) and first order (IBM-4) parameters.",
        "This is possible as IBM-3 and IBM-4 are very special cases of general log-linear models: they are properly derived by the chain rule of probabilities.",
        "Deficiency is only introduced by ignoring a part of the history to be conditioned on in the individual factors of the chain rule factorization.",
        "While at first glance this seems necessary to obtain zero and first order de",
        "deficient and nondeficient models (for Europarl German |English, training scheme 15H53545).",
        "1/3/4=IBM-1/3/4, H=HMM, T=Transfer iteration.",
        "The curves are identical up to iteration 11.",
        "Iteration 11 shows that merely 5.14% of the (HMM) probability mass are covered by the Viterbi alignment and its neighbors.",
        "With deficient models (and deficient empty words) the final negative log likelihood is higher than the initial HMM one, with nondeficient models it is lower than for the HMM, as it should be for a better model.",
        "pendencies, we show that with proper renormal-ization all factors can be made nondeficient.",
        "Having introduced the model variants, we proceed to derive a hillclimbing method to compute a likely alignment (ideally the Viterbi alignment) and its neighbors.",
        "As for the deficient models, this plays an important role in the E-step of the subsequently derived expectation maximization (EM) training scheme.",
        "As usual, expectations in EM are approximated, but we now also get non-trivial M-step energies.",
        "We deal with these via projected gradient ascent.",
        "The downside of our method is its resource consumption, but still we present results on corpora with 100.000 sentence pairs.",
        "The source code of this project is available in our word alignment software RegAligner1, version 1.2 and later.",
        "Figure 1 gives a first demonstration of how much the proposed variants differ from the standard models by visualizing the resulting negative log likelihoods2, the quantity to be minimized in EM-training.",
        "The nondeficient IBM-4 derives a lower negative log likelihood than the HMM, the regular deficient variant only a lower one than the IBM-1.",
        "As an aside, the transfer iteration from HMM to IBM3 (iteration 11) reveals that only 5.14% of the probability mass3 are preserved when using the Viterbi alignment and its neighbors instead of all alignments.",
        "Indeed, it is widely recognized that ?",
        "with proper initialization ?",
        "fertility based models outperform sequence based ones.",
        "In particular, sequence based models can simply ignore a part of the sentence to be conditioned on, while fertility based models explicitly factor in a probability of words in this sentence to have no aligned words (or any other number of aligned words, called the fertility).",
        "Hence, it is encouraging to see that the nondeficient IBM-4 indeed derives a higher likelihood than the sequence based HMM.",
        "Related Work Today's most widely used models for word alignment are still the models IBM 1-5 of Brown et al. (1993) and the HMM of Vogel et al. (1996), thoroughly evaluated in (Och and Ney, 2003).",
        "While it is known that fertility-based models outperform sequence-based ones, the large bulk of word alignment literature following these publications has mostly ignored fertility-based models.",
        "This is different in the present paper which deals exclusively with such models.",
        "One reason for the lack of interest is surely that computing expectations and Viterbi alignments for these models is a hard problem (Udupa and Maji, 2006).",
        "Nevertheless, computing Viterbi align",
        "the power of 1/S, i.e. the objective function in maximum likelihood training.",
        "The number is not entirely fair as alignments where more than half the words align to the empty word are assigned a probability of 0.",
        "Still, this is an issue only for short sentences.",
        "ments for the IBM-3 has been shown to often be practicable (Ravi and Knight, 2010; Schoenemann, 2010).",
        "Much work has been spent on HMM-based formulations, focusing on the computationally tractable side (Toutanova et al., 2002; Sumita et al., 2004; Deng and Byrne, 2005).",
        "In addition, some rather complex models have been proposed that usually aim to replace the fertility based models (Wang and Waibel, 1998; Fraser and Marcu, 2007a).",
        "Another line of models (Melamed, 2000; Marcu and Wong, 2002; Cromie`res and Kurohashi, 2009) focuses on joint probabilities to get around the garbage collection effect (i.e. that for conditional models, rare words in the given language align to too many words in the predicted language).",
        "The downside is that these models are computationally harder to handle.",
        "A more recent line of work introduces various forms of regularity terms, often in the form of symmetrization (Liang et al., 2006; Grac?a et al., 2010; Bansal et al., 2011) and recently by using L0 norms (Vaswani et al., 2012)."
      ]
    },
    {
      "heading": "2 The models IBM-3, IBM-4 and IBM-5",
      "text": [
        "We begin with a short review of fertility-based models in general and IBM-3, IBM-4 and IBM5 specifically.",
        "All are due to (Brown et al., 1993) who proposed to use the deficient models IBM-3 and IBM-4 to initialize the nondeficient IBM-5.",
        "For a foreign sentence f = fJ1 = (f1, .",
        ".",
        ".",
        ", fJ) with J words and an English one e = eI1 = (e1, .",
        ".",
        ".",
        ", eI) with I words, the (conditional) probability p(fJ1 |eI1) of getting the foreign sentence as a translation of the English one is modeled by introducing the word alignment a as a hidden variable:",
        "All IBM models restrict the space of alignments to those where a foreign word can align to at most one target word.",
        "The resulting alignment is then written as a vector aJ1 , where each aj takes integral values between 0 and I , with 0 indicating that fj has no English correspondence.",
        "The fertility-based models IBM-3, IBM-4 and IBM-5 factor the (conditional) probability p(fJ1 , aJ1 |eI1) of obtaining an alignment and a translation given an English sentence according to the following generative story:",
        "1.",
        "For i = 1, 2, .",
        ".",
        ".",
        ", I , decide on the number ?i of foreign words aligned to ei.",
        "This number is called the fertility of ei.",
        "Choose with probability p(?i|eI1,?i?11 ) = p(?i|ei).",
        "2.",
        "Choose the number ?0 of unaligned words in the (still unknown) foreign sequence.",
        "i=1 ?i).",
        "Since each foreign word belongs to exactly one English position (including 0), the foreign sequence is now known to be of length J = ?Ii=0 ?i.",
        "3.",
        "For each i = 1, 2, .",
        ".",
        ".",
        ", I , and k = 1, .",
        ".",
        ".",
        ",?i decide on (a) the identity fi,k of the next foreign word aligned to ei.",
        "Choose with probability p(fi,k|eI1,?I0,di?11 , di,1, .",
        ".",
        ".",
        ", di,k?1, fi,k) = p(fi,k|ei), where di comprises all di,k for word i (see point b) below) and fi,k comprises all foreign words known at that point.",
        "(b) the position di,k of the just generated foreign word fi,k, with probability",
        "4.",
        "The remaining ?0 open positions in the foreign sequence align to position 0.",
        "Decide on the corresponding foreign words with p(fd0,k |e0), where e0 is an artificial ?empty word?.",
        "To model the probability for the number of unaligned words in step 2, each of the?Ii=1 ?i properly aligned foreign words generates an unaligned foreign word with probability p0, resulting in",
        "with a base probability p0 and the combinatorial coefficients",
        "k=1 k denotes the factorial of n. The main difference between IBM-3, IBM-4 and IBM-5 is the choice of probability model in step 3 b), called a distortion model.",
        "The choices are now detailed."
      ]
    },
    {
      "heading": "2.1 IBM-3",
      "text": [
        "The IBM-3 implements a zero order distortion model, resulting in p(di,k|i, J) .",
        "Since most of the context to be conditioned on is ignored, this allows invalid configurations to occur with non-zero probability: some foreign positions can be chosen several times, while others remain empty.",
        "One says that the model is deficient.",
        "On the other hand, the model for p(?0|?Ii=1 ?i) is nondeficient, and in training this often results in very high probabilities p0.",
        "To prevent this it is common to make this model deficient as well (Och and Ney, 2003), which improves performance immensely and gives much better results than simply fixing p0 in the original model.",
        "As for each i the di,k can appear in any order (i.e. need not be in ascending order), there are?I i=1 ?i!",
        "ways to generate the same alignment aJ1 (where the ?i are the fertilities induced by aJ1 ).",
        "In total, the IBM-3 has the following probability model:",
        "Reducing the Number of Parameters While using non-parametric models p(j|i, J) is convenient for closed-form M-steps in EM training, these parameters are not very intuitive.",
        "Instead, in this paper we use the parametric model",
        "(2) with the more intuitive parameters p(j|i).",
        "The arising M-step energy is addressed by projected gradient ascent (see below).",
        "These parameters are also used for the nondeficient variants.",
        "Using the original non-parametric ones can be handled in a very similar manner to the methods set forth below."
      ]
    },
    {
      "heading": "2.2 IBM-4",
      "text": [
        "The distortion model of the IBM-4 is a first order one that generates the di,k of each English position i in ascending order (i.e. for 1 < k ?",
        "?i we have di,k > di,k?1).",
        "There is then a one-to-one correspondence between alignments aJ1 and (valid) distortion parameters (di,k)i=1,...,I, k=1,...,?i and therefore no longer a factor of?Ii=1 ?i!",
        ".",
        "The IBM-4 has two sub-distortion models, one for the first aligned word (k = 1) of an English position and one for all following words (k > 1, only",
        "if ?i > 1).",
        "For position i, let [i]=arg max{i?|1?",
        "i?",
        "< i,?i?",
        "> 0} denote4 the closest preceding English word that has aligned foreign words.",
        "The aligned foreign positions of [i] are combined into a center position [i], the rounded average of the positions.",
        "Now, the distortion probability for the first word (k = 1) is p=1(di,1 |[i],A(fi,1),B(e[i]), J) , where A gives the word class of a foreign word and B the word class of an English word (there are typically 50 classes per language, derived by machine learning techniques).",
        "The probability is further reduced to a dependency on the difference of the positions, i.e. p=1(di,1?",
        "[i] |A(fi,1),B(e[i])).",
        "For k > 1 the model is p>1(di,k|di,k?1,A(fi,k), J) , which is likewise reduced to p>1(di,k ?",
        "di,k?1 |A(fi,k)).",
        "Note that in both difference-based formulations the dependence on J has to be dropped to get closed-form solutions of the M-step in EM training, and Brown et al. note themselves that the IBM-4 can place words before the start and after the end of the sentence.",
        "Reducing Deficiency In this paper, we also investigate the effect of reducing the amount of wasted probability mass by enforcing the dependence on J by proper renormalization, i.e. using",
        "for the first aligned word and",
        "for all following words, again handling the M-step in EM training via projected gradient ascent.",
        "With this strategy words can no longer be placed outside the sentence, but a lot of probability mass is still wasted on configurations where at least one foreign (or predicted) position j aligns to two or more positions i, i?",
        "in the English (or given) language (and consequently there are more unaligned 4If the set is empty, instead a sentence start probability is used.",
        "Note that we differ slightly in notation compared to (Brown et al., 1993).",
        "source words than the generated ?0).",
        "Therefore, here, too, the probability for ?0 has to be made deficient to get good performance.",
        "In summary, the base model for the IBM-4 is:",
        "where empty products are understood to be 1."
      ]
    },
    {
      "heading": "2.3 IBM-5",
      "text": [
        "We note in passing that the distortion model of the IBM-5 is nondeficient and has parameters for filling the nth open gap in the foreign sequence given that there are N positions to choose from ?",
        "see the next section for exactly what positions one can choose from.",
        "There is also a dependence on word classes for the foreign language.",
        "This is neither a zero order nor a first order dependence, and in (Och and Ney, 2003) the first order model of the IBM-4, though deficient, outperformed the IBM-5.",
        "The IBM-5 is therefore rarely used in practice.",
        "This motivated us to instead reformulate IBM-3 and IBM-4 as nondeficient models.",
        "In our results, however, the IBM-5 gave surprisingly good results and was often superior to all variants of the IBM-4."
      ]
    },
    {
      "heading": "3 Nondeficient Variants of IBM-3 and",
      "text": [
        "From now on we always enforce that for each position i the indices di,k are generated in ascending order (di,k > di,k?1 for k > 1).",
        "A central concept for the generation of di,k in step 3(b) is the set of positions in the foreign sequence that are still without alignment.",
        "We denote the set of these positions by",
        "where the dependence on the various di?,k?",
        "is not made explicit in the following.",
        "It is tempting to think that in a nondeficient model all members of Ji,k,J can be chosen for",
        "di,k, but this holds only ?i = 1.",
        "Otherwise, the requirement of generating the di,k in ascending order prevents us from choosing the (?i?k) largest entries inJi,k,J .",
        "For k > 1 we also have to remove all positions smaller than di,k?1.",
        "Let J ?ii,k,J denote the set where these positionshave been removed.",
        "With that, we can state the nondeficient variants of IBM-3 and IBM-4."
      ]
    },
    {
      "heading": "3.1 Nondeficient IBM-3",
      "text": [
        "For the IBM-3, we define the auxiliary quantity",
        "where we use the zero order parameters p(j|i) we also use for the standard (deficient) IBM-3, compare (2).",
        "To get a nondeficient variant, it remains to renormalize, resulting in",
        "Further, note that the factors ?i!",
        "now have to be removed from (1) as the di,k are generated in ascending order.",
        "Lastly, here we use the original nondeficient empty word model p(?0|?Ii=1 ?i), resulting in a totally nondeficient model."
      ]
    },
    {
      "heading": "3.2 Nondeficient IBM-4",
      "text": [
        "With the notation set up, it is rather straightforward to derive a nondeficient variant of the IBM4.",
        "Here, there are the two cases k = 1 and k > 1.",
        "We begin with the case k = 1.",
        "Abbreviating",
        "again using the - now first order - parameters of the base model.",
        "The nondeficient distribution p=1(di,1 = j |[i], ?, ?,J ?ii,k,J) is again obtainedby renormalization.",
        "For the case k > 1, we abbreviate ?",
        "= A(fi,k) and introduce the auxiliary quantity",
        "from which the nondeficient distribution p>1(di,k=j|di,k?1, ?,J ?ii,k,J) is again obtained byrenormalization."
      ]
    },
    {
      "heading": "4 Training the New Variants",
      "text": [
        "For the task of word alignment, we infer the parameters of the models using the maximum likeli",
        "on a set of training data (i.e. sentence pairs s = 1, .",
        ".",
        ".",
        ", S).",
        "Here, ?",
        "comprises all base parameters of the respective model (e.g. for the IBM-3 all p(f |e), all p(?, e) and all p(j|i) ) and p?",
        "signifies the dependence of the model on the parameters.",
        "Note that (9) is truly a constrained optimization problem as the parameters ?",
        "have to satisfy a number of probability normalization constraints.",
        "When p?(?)",
        "denotes a fertility based model the resulting problem is a non-concave maximization problem with many local minima and no (known) closed-form solutions.",
        "Hence, it is handled by computational methods, which typically apply the logarithm to the above function.",
        "Our method of choice to attack the maximum likelihood problem is expectation maximization (EM), the standard in the field, which we explain below.",
        "Due to non-concaveness the starting point for EM is of extreme importance.",
        "As is common, we first train an IBM-1 and then an HMM before proceeding to the IBM-3 and finally the IBM-4.",
        "As in the training of the deficient IBM-3 and IBM-4 models, we approximate the expectations in the E-step by a set of likely alignments, ideally centered around the Viterbi alignment, but already for the regular deficient variants computing it is NP-hard (Udupa and Maji, 2006).",
        "A first task is therefore to compute such a set.",
        "This task is also needed for the actual task of word alignment (annotating a given sentence pair with an alignment)."
      ]
    },
    {
      "heading": "4.1 Alignment Computation",
      "text": [
        "For computing alignments, we use the common procedure of hillclimbing where we start with an alignment, then iteratively compute the probabilities of all alignments differing by a move or a swap (Brown et al., 1993) and move to the best of these if it beats the current alignment.",
        "Since we cannot ignore parts of the history and still get a nondeficient model, computing the probabilities of the neighbors cannot be handled incrementally (or rather only partially, for the dictionary and fertility models).",
        "While this does increase running times, in practice the M-steps take longer than the E-steps.",
        "For self-containment, we recall here that for an alignment aJ1 applying the move aJ1 [j?",
        "i] results in the alignment a?J1 defined by a?j = i and a?j?=aj?",
        "for j?",
        "6= j.",
        "Applying the swap aJ1 [j1 ?",
        "j2] results in the alignment a?J1 defined by a?j1 =aj2 , a?j2 =aj1 and a?j?",
        "= aj?",
        "elsewhere.",
        "If aJ1 is the alignment produced by hillclimbing, the move matrix m ?",
        "IRJ?I+1 is defined bymj,i being the probability of aJ1 [j ?",
        "i] as long as aj 6= i, otherwise 0.",
        "Likewise the swap matrix s ?",
        "IRJ?J is defined as sj1,j2 being the probability of aJ1 [j1 ?",
        "j2] for aj1 6=aj2 , 0 otherwise.",
        "The move and swap matrices are used to approximate expectations in EM training (see below)."
      ]
    },
    {
      "heading": "4.2 Parameter Update",
      "text": [
        "Naive Scheme It is tempting to account for the changes in the model in hillclimbing, but to otherwise use the regular M-step procedures (closed form solution when not conditioning on J for the IBM-4 and for the non-parametric IBM-3, otherwise projected gradient ascent) for the deficient models.",
        "However, we verified that this is not a good idea: not only can the likelihood go down in the process (even if we could compute expectations exactly), but these schemes also heavily increase p0 in each iteration, i.e. the same problem Och and Ney (2003) found for the deficient models.",
        "There is therefore the need to execute the M-step properly, and when done the problem is indeed resolved.",
        "Proper EM The expectation maximization (EM) framework (Dempster et al., 1977; Neal and Hinton, 1998) is a class of template procedures (rather than a proper algorithm) that iteratively requires solving the task",
        "by appropriate means.",
        "Here, ?k?1 are the parameters from the previous iteration, while ?k are those derived in the current iteration.",
        "Of course, here and in the following the normalization constraints on ?",
        "apply, as already in (9).",
        "On explicit request of a reviewer we give a detailed account for our setting here.",
        "Readers not interested in the details can safely move on to the next section.",
        "Details on EM For the corpora occurring in practice, the function (10) has many more terms than there are atoms in the universe.",
        "The trick is that p?k(fs,as|es) is a product of factors, where each factor depends on very few components of ?k only.",
        "Taking the logarithm gives a sum of logarithms, and in the end we are left with the problem of computing the weights of each factor, which turn out to be expectations.",
        "To apply this to the (deficient) IBM-3 model with parametric distortion we simplify p?k?1(as|fs, es) = p(as) and define the counts nf,e(as) = ?Jsj=1 ?",
        "(fsj , f) ?",
        "and nj,i(as) = ?",
        "(asj , i).",
        "We also use short hand notations for sets, e.g. {p(f |e)} is meant as the set of all translation probabilities induced by the given corpus.",
        "With this notation, after reordering the terms problem (10) can be written as",
        "Indeed, the weights in each line turn out to be nothing else than expectations of the respective factor under the distribution p?k?1(as|fs, es) and will henceforth be written as wf,e, w?,e and wj,i,J .",
        "Therefore, executing an iteration of EM requires first calculating all expectations (E-step) and then solving the maximization problems (M-step).",
        "For models such as IBM-1 and HMM the expectations can be calculated efficiently, so the enormous sum of terms in (10) is equivalently written as a manageable one.",
        "In this case it can be shown5 that the new ?k must have a higher likelihood (9) than ?k?1 (unless a stationary point is reached).",
        "In fact, any ?",
        "that has a higher value in the auxiliary function (11) than ?k?1 must also have a higher likelihood.",
        "This is an important background for parametric models such as (2) where the M-step cannot be solved exactly.",
        "For IBM-3/4/5 computing exact expectations is intractable (Udupa and Maji, 2006) and approximations have to be used (in fact, even computing the likelihood for a given ?",
        "is intractable).",
        "We",
        "use the common procedure based on hillclimbing and the move/swap matrices.",
        "The likelihood is not guaranteed to increase but it (or rather its approximation) always did in each of the five run iterations.",
        "Nevertheless, the main advantage of EM is preserved: problem (11) decomposes into several smaller problems, one for each probability distribution since the parameters are tied by the normalization constraints.",
        "The result is one problem for each e involving all p(f |e), one for each e involving all p(?|e) and one for each i involving all p(j|i).",
        "The problems for the translation probabilities and the fertility probabilities yield the known standard update rules.",
        "The most interesting case is the problem for the (parametric) distortion models.",
        "In the deficient setting, the problem for each i is",
        "In the nondeficient setting, we now drop the subscripts i, k, J and the superscript ?",
        "from the sets defined in the previous sections, i.e. we write J instead of J ?i,k,J .",
        "The M-step problem is then",
        "where wj,i,J (with j ?",
        "J ) is the expectation for aligning j to iwhen one can choose among the positions inJ , and with p(j|i,J ) as in (6).",
        "In principle there is an exponential number of expectations wj,i,J .",
        "However, since we approximate expectations from the move and swap matrices, and hence by O((I + J) ?",
        "J) alignments per sentence pair, in the end we get a polynomial number of terms.",
        "Currently we only consider alignments with (approximated) p?k?1(as|fs, es) > 10?6.",
        "Importantly, the fact that we get separate M-step problems for different i allows us to reduce memory consumption by using refined data structures when storing the expectations.",
        "For both the deficient and the nondeficient variants, the M-step problems for the distortion parameters p(j|i) are non-trivial, non-concave and have no (known) closed form solutions.",
        "We approach them via the method of projected gradient ascent (PGA), where the gradient for the nondeficient problem is",
        "When running PGA we guarantee that the resulting {p(j|i)} has a higher function value Ei than the input ones (unless a stationary point is input).",
        "We stop when a cutoff criterion indicates a local maximum or 250 iterations are used up.",
        "used in a couple of recent papers, notably (Schoenemann, 2011; Vaswani et al., 2012) and is briefly sketched here for self-containment (see those papers for more details).",
        "To solve a maximization",
        "a step known as projection which we solve with the method of (Michelot, 1986).",
        "The new distribution {q?",
        "(j|i)} is not guaranteed to have a higher Ei(?",
        "), but (since the constraint set is a convex one) a suitable interpolation of {pk(j|i)} and {q?",
        "(j|i)} is guaranteed to have a higher value (unless {pk(j|i)} is a local maximum or minimum of Ei(?)).",
        "Such a point is computed by backtracking line search and defines the next iterate {pk+1(j|i)}.",
        "IBM-4 When moving from the IBM-3 to the IBM-4, only the last line in (11) changes.",
        "In the end one gets two new kinds of problems, for p=1(?)",
        "and p>1(?).",
        "For p=1(?)",
        "we have one problem for each foreign class ?",
        "and each English class ?, of the form",
        "sentence pairs.",
        "Reduced deficiency means renormalization as in (3) and (4), so that words cannot be placed before or after the sentence.",
        "For the IBM-3, the nondeficient variant is clearly best.",
        "For the IBM-4 it is better in roughly half the cases, both with and without word classes.",
        "for the nondeficient variant, with p=1(j|j?, ?, ?,J ) based on (7).",
        "For p>1(?)",
        "we have one problem per foreign class ?, of the form",
        "for reduced deficiency, with p>1(j|j?, ?, J) based on (4), and for the nondeficient variant it has the",
        "with p>1(j|j?, ?,J ) based on (8).",
        "Calculating the gradients is analogous to the IBM-3."
      ]
    },
    {
      "heading": "5 Experiments",
      "text": [
        "We test the proposed methods on subsets of the Europarl corpus for German and English as well as Spanish and English, using lower-cased corpora.",
        "We evaluate alignment accuracies on gold alignments6 in the form of weighted F-measures with ?=0.1, which performed well in (Fraser and Marcu, 2007b).",
        "In addition we evaluate the effect on phrase-based translation on one of the tasks.",
        "We implement the proposed methods in our own framework RegAligner rather than GIZA++,",
        "?tosch/downloads.html.",
        "which is only rudimentally maintained.",
        "Therefore, we compare to the deficient models in our own software as well as to those in GIZA++.",
        "We run 5 iterations of IBM-1, followed by 5 iterations of HMM, 5 of IBM-3 and finally 5 of IBM-4.",
        "The first iteration of the IBM-3 collects counts from the HMM, and likewise the first iteration of the IBM-4 collects counts from the IBM3 (in both cases the move and swap matrices are filled with probabilities of the former model, then theses matrices are used as in a regular model iteration).",
        "A nondeficient IBM-4 is always initialized by a nondeficient IBM-3.",
        "We did not set a fertility limit (except for GIZA++).",
        "Experiments were run on a Core i5 with 2.5 GHz and 8 GB of memory.",
        "The latter was the main reason why we did not use still larger corpora7.",
        "The running times for the entire training were half a day without word classes and a day with word classes.",
        "With 50 instead of 250 PGA iterations in all M-steps we get only half these running times, but the resulting F-measures deteriorate, especially for the IBM-4 with classes.",
        "The running times of our implementation of the IBM-5 are much more favorable: the entire training then runs in little more than an hour."
      ]
    },
    {
      "heading": "5.1 Alignment Accuracy",
      "text": [
        "The alignment accuracies ?",
        "weighted F-measures with ?",
        "= 0.1 ?",
        "for the tested corpora and model variants are given in Table 1.",
        "Clearly, nondefi-ciency greatly improves the accuracy of the IBM3, both compared to our deficient implementation and that of GIZA++.",
        "For the IBM-4 we get improvements for the nondeficient variant in roughly half the cases, both with and without word classes.",
        "We think this is an issue of local minima, inexactly solved M-steps and sensitiveness to initialization.",
        "Interestingly, also the reduced deficient IBM-4 is not always better than the fully deficient variant.",
        "Again, we think this is due to problems with the non-concave nature of the models.",
        "There is also quite some surprise regarding the IBM-5: contrary to the findings of (Och and Ney, 2003) the IBM-5 in GIZA++ performs best in three out of four cases - when competing with both deficient and nondeficient variants of IBM-3 and IBM-4.",
        "Our own implementation gives slightly different results (as we do not use smoothing), but it, too, performs very well."
      ]
    },
    {
      "heading": "5.2 Effect on Translation Performance",
      "text": [
        "We also check the effect of the various alignments (all produced by RegAligner) on translation performance for phrase-based translation, randomly choosing translation from German to English.",
        "We use MOSES with a 5-gram language model (trained on 500.000 sentence pairs) and the standard setup in the MOSES Experiment Management System: training is run in both directions, the alignments are combined using diag-grow-final-and (Och and Ney, 2003) and the parameters of MOSES are optimized on 750 development sentences.",
        "The resulting BLEU-scores are shown in Table 2.",
        "However, the table shows no clear trends and even the IBM-3 is not clearly inferior to the IBM4.",
        "We think that one would need to handle larger corpora (or run multiple instances of Minimum Error Rate Training with different random seeds) to get more meaningful insights.",
        "Hence, at present our paper is primarily of theoretical value."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "We have shown that the word alignment models",
        "from German to English with the obtained alignments (for 100.000 sentence pairs).",
        "Training is run in both directions and the resulting alignments are combined via diag-grow-final-and.",
        "The table shows no clear superiority of any method.",
        "In fact, the IBM-4 is not superior to the IBM-3 and the HMM is about equal to the IBM-3.",
        "We think that one needs to handle larger corpora to get clearer insights.",
        "variants, an important aim of probabilistic model-ing for word alignment.",
        "Here we have exploited that the models are proper applications of the chain rule of probabilities, where deficiency is only introduced by ignoring parts of the history for the distortion factors in the factorization.",
        "By proper renormalization the desired nondeficient variants are obtained.",
        "The arising models are trained via expectation maximization.",
        "In the E-step we use hillclimbing to get a likely alignment (ideally the Viterbi alignment).",
        "While this cannot be handled fully incrementally, it is still fast enough in practice.",
        "The M-step energies are non-concave and have no (known) closed-form solutions.",
        "They are handled via projected gradient ascent.",
        "For the IBM-3 nondeficiency clearly improves alignment accuracy.",
        "For the IBM-4 we get improved accuracies in roughly half the cases, both with and without word classes.",
        "The IBM-5 performs surprisingly well, it is often best and hence much better than its reputation.",
        "An evaluation of phrase based translation showed no clear insights.",
        "Nevertheless, we think that nondeficiency in fertility based models is an important issue, and that at the very least our paper is of theoretical value.",
        "The implementations are publicly available in RegAligner 1.2."
      ]
    }
  ]
}
