{
  "info": {
    "authors": [
      "Jason M. Eisner",
      "Giorgio Satta"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P99-1059",
    "title": "Efficient Parsing for Bilexical Context-Free Grammars and Head Automaton Grammars",
    "url": "https://aclweb.org/anthology/P99-1059",
    "year": 1999
  },
  "references": [
    "acl-C88-2121",
    "acl-C92-2066",
    "acl-P95-1037",
    "acl-P96-1023",
    "acl-P97-1003",
    "acl-P98-1035",
    "acl-W95-0103"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Several recent stochastic parsers use bilexical grammars, where each word type idiosyncratically prefers particular complements with particular head words.",
        "We present 0(n4) parsing algorithms for two bilexical formalisms, improving the prior upper bounds of 0(n5).",
        "For a common special case that was known to allow 0(n3) parsing (Eisner, 1997), we present an 0(n3) algorithm with an improved grammar constant."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Lexicalized grammar formalisms are of both theoretical and practical interest to the computational linguistics community.",
        "Such formalisms specify syntactic facts about each word of the language – in particular, the type of arguments that the word can or must take.",
        "Early mechanisms of this sort included catego-rial grammar (Bar-Hillel, 1953) and subcategorization frames (Chomsky, 1965).",
        "Other lexicalized formalisms include (Schabes et al., 1988; Mel'euk, 1988; Pollard and Sag, 1994).",
        "Besides the possible arguments of a word, a natural-language grammar does well to specify possible head words for those arguments.",
        "\"Convene\" requires an NP object, but some NPs are more semantically or lexically appropriate here than others, and the appropriateness depends largely on the NP's head (e.g., \"meeting\").",
        "We use the general term bilexical for a grammar that records such facts.",
        "A bilexical grammar makes many stipulations about the compatibility of particular pairs of words in particular roles.",
        "The acceptability of \"Nora convened the * The authors were supported respectively under ARPA Grant N6600194-C-6043 \"Human Language Technology\" and Ministero dell'Universita e della Ricerca Scientifica e Tecnologica project \"Methodologies and Tools of High Performance Systems for Multimedia Applications.\" party\" then depends on the grammar writer's assessment of whether parties can be convened.",
        "Several recent real-world parsers have improved state-of-the-art parsing accuracy by relying on probabilistic or weighted versions of bilexical grammars (Alshawi, 1996; Eisner, 1996; Charniak, 1997; Collins, 1997).",
        "The rationale is that soft selectional restrictions play a crucial role in disambiguation.",
        "The chart parsing algorithms used by most of the above authors run in time 0(n5), because bilexical grammars are enormous (the part of the grammar relevant to a length-n input has size 0(n2) in practice).",
        "Heavy probabilistic pruning is therefore needed to get acceptable runtimes.",
        "But in this paper we show that the complexity is not so bad after all:",
        "• For bilexicalized context-free grammars, 0(n4) is possible.",
        "• The 0(n4) result also holds for head automaton grammars.",
        "• For a very common special case of these",
        "grammars where an 0(n3) algorithm was previously known (Eisner, 1997), the grammar constant can be reduced without harming the 0(n3) property.",
        "Our algorithmic technique throughout is to propose new kinds of subderivations that are not constituents.",
        "We use dynamic programming to assemble such subderivations into a full parse."
      ]
    },
    {
      "heading": "2 Notation for context-free grammars",
      "text": [
        "The reader is assumed to be familiar with context-free grammars.",
        "Our notation fol",
        "lows (Harrison, 1978; Hoperoft and Ullman, 1979).",
        "A context-free grammar (CFG) is a tuple G = (VN, VT , P, S), where VN and VT are finite, disjoint sets of nonterminal and terminal symbols, respectively, and S E VN is the start symbol.",
        "Set P is a finite set of productions having the form A – * a, where A E VN , a E (VN U VT)*.",
        "If every production in P has the form A – 4 BC or A a, for A, B,C E VN , a E VT, then the grammar is said to be in Chomsky Normal Form (CNF).2 Every language that can be generated by a CFG can also be generated by a CFG in CNF.",
        "In this paper we adopt the following conventions: a, b, c, d denote symbols in VT, w, X, y denote strings in Vat, and a, 0, denote strings in (VN U VT)*.",
        "The input to the parser will be a CFG G together with a string of terminal symbols to be parsed, w = d1d2 • • • dn.",
        "Also h,i, j,k denote positive integers, which are assumed to be < n when we are treating them as indices into w. We write wzo for the input substring di • • • di (and put wi = e for i > j).",
        "A \"derives\" relation, written is associated with a CFG as usual.",
        "We also use the reflexive and transitive closure of written and define L(G) accordingly.",
        "We write a 8 * a-0 for a derivation in which only /3 is rewritten."
      ]
    },
    {
      "heading": "3 Bilexical context-free grammars",
      "text": [
        "We introduce next a grammar formalism that captures lexical dependencies among pairs of words in VT.",
        "This formalism closely resembles stochastic grammatical formalisms that are used in several existing natural language processing systems (see §1).",
        "We will specify a non-stochastic version, noting that probabilities or other weights may be attached to the rewrite rules exactly as in stochastic CFG (Gonzales and Thomason, 1978; Wetherell, 1980).",
        "(See §4 for brief discussion.)",
        "Suppose G = (VN, VT , P,T[$]) is a CFG in CNF.3 We say that G is bilexical if there exists a set of \"delexicalized nonterminals\" VD such that VN = {A[a] : A E VD, a E VT} and every production in P has one of the following forms:",
        "• A[a] B [b] C [a] (1) • A[a] C[a] B[b] (2) • A[a] – > a (3)",
        "Thus every nonterminal is lexicalized at some terminal a.",
        "A constituent of nonterminal type A[a] is said to have terminal symbol a as its lexical head, \"inherited\" from the constituent's head child in the parse tree (e.g., C[a]).",
        "Notice that the start symbol is necessarily a lexicalized nonterminal, T[$].",
        "Hence $ appears in every string of L(G); it is usually convenient to define G so that the language of interest is actually L' (G) = {x : x$ E L (G)} Such a grammar can encode lexically specific preferences.",
        "For example, P might contain the productions",
        "• VP[solve] V[solve] NP[puzzles] • NP[puzzles] DET[two] N[puzzles] • V[solve] solve • N[puzzles] 4 puzzles • DET[two] 4 two",
        "in order to allow the derivation VP[solve] solve two puzzles, but meanwhile omit the similar productions",
        "• VP[eat] V[eat] NP[puzzles] • VP[solve] 4 V[solve] NP[goat] • VP[sleep] V[sleep] NP[goati • NP[goat] DET[two] N[goat]",
        "since puzzles are not edible, a goat is not solvable, \"sleep\" is intransitive, and \"goat\" cannot take plural determiners.",
        "(A stochastic version of the grammar could implement \"soft prefer-ences\" by allowing the rules in the second group but assigning them various low probabilities.)",
        "The cost of this expressiveness is a very large grammar.",
        "Standard context-free parsing algorithms are inefficient in such a case.",
        "The CKY algorithm (Younger, 1967; Aho and Ullman, 1972) is time 0(n3- IPI), where in the worst case I P1 = IVNI3 (one ignores unary productions).",
        "For a bilexical grammar, the worst case is IPI = VD I 3 ' I VT12, which is large for a large vocabulary VT. We may improve the analysis somewhat by observing that when parsing d1 • • • dn, the CKY algorithm only considers nonterminals of the form A[di]; by restricting to the relevant productions we obtain 0(n3 • IVD13 • min(n, IVTI)2)•",
        "We observe that in practical applications we always have n < IVTI• Let us then restrict our analysis to the (infinite) set of input instances of the parsing problem that satisfy relation n < WTI.",
        "With this assumption, the asymptotic time complexity of the CKY algorithm becomes 0(n5 • IVD13).",
        "In other words, it is a factor of n2 slower than a comparable non-lexicalized CFG."
      ]
    },
    {
      "heading": "4 Bilexical CFG in time 0(n4)",
      "text": [
        "In this section we give a recognition algorithm for bilexical CNF context-free grammars, which runs in time 0(n4 • max(p, IVO)) 0(n4 • I VD ) • Here p is the maximum number of productions sharing the same pair of terminal symbols (e.g., the pair (b, a) in production (1)).",
        "The new algorithm is asymptotically more efficient than the CKY algorithm, when restricted to input instances satisfying the relation n < IVTI.",
        "Where CKY recognizes only constituent sub-strings of the input, the new algorithm can recognize three types of subderivations, shown and described in Figure 1(a).",
        "A declarative specification of the algorithm is given in Figure 1(b).",
        "The derivability conditions of (a) are guaranteed by (b), by induction, and the correctness of the acceptance condition (see caption) follows.",
        "This declarative specification, like CKY, may be implemented by bottom-up dynamic programming.",
        "We sketch one such method.",
        "For each possible item, as shown in (a), we maintain a bit (indexed by the parameters of the item) that records whether the item has been derived yet.",
        "All these bits are initially zero.",
        "The algorithm makes a single pass through the possible items, setting the bit for each if it can be derived using any rule in (b) from items whose bits are already set.",
        "At the end of this pass it is straightforward to test whether to accept w (see caption).",
        "The pass considers the items in increasing order of width, where the width of an item in (a) is defined as max{h, j} – min{h, j}.",
        "Among items of the same width, those of type .L should be considered last.",
        "The algorithm requires space proportional to the number of possible items, which is at most n3IVD12.",
        "Each of the five rule templates can instantiate its free variables in at most n4p or (for COMPLETE rules) n41VD12 different ways, each of which is tested once and in constant time; so the runtime is 0(n4 max(P, IVO)).",
        "By comparison, the CKY algorithm uses only the first type of item, and relies on rules whose inputs are pairs Such rules",
        "can be instantiated in 0(n5) different ways for a fixed grammar, yielding 0(n5) time complexity.",
        "The new algorithm saves a factor of n by combining those two constituents in two steps, one of which is insensitive to k and abstracts over its possible values, the other of which is insensitive to h' and abstracts over its possible values.",
        "It is straightforward to turn the new 0(n4) recognition algorithm into a parser for stochastic bilexical CFCs (or other weighted bilexical CFGs).",
        "In a stochastic CFG, each nonterminal A[a] is accompanied by a probability distribution over productions of the form A[a] – > a.",
        "A lhn and its probability – like that of any derivation we find – is defined as the product of the probabilities of all productions used to condition inference rules in the proof tree.",
        "The highest-probability derivation for any item can be reconstructed recursively at the end of the parse, provided that each item maintains not only a bit indicating whether it can be derived, but also the probability and instantiated root rule of its highest-probability derivation tree."
      ]
    },
    {
      "heading": "5 A more efficient variant",
      "text": [
        "We now give a variant of the algorithm of §4; the variant has the same asymptotic complexity but will often be faster in practice.",
        "Notice that the ATTACH-LEFT rule of Figure 1(b) tries to combine the nonterminal label B[dhd of a previously derived constituent with every possible nonterminal label of the form C[dh].",
        "The improved version, shown in Figure 2, restricts C[dh] to be the label of a previously derived adjacent constituent.",
        "This improves speed if there are not many such constituents and we can enumerate them in 0(1) time apiece (using a sparse parse table to store the derived items).",
        "It is necessary to use an agenda data structure (Kay, 1986) when implementing the declarative algorithm of Figure 2.",
        "Deriving narrower items before wider ones as before will not work here because the rule HALVE derives narrow items from wide ones.",
        "parse is just a derivation (proof tree) of",
        "of is met.",
        "It accepts input w just if item [A, T,1, h, rt] is derived for some h such that dh = $.",
        "(a) (i <h < j, A E VD) is derived if A[dh] wi (i < h, A E VD) is derived if A[dhl wi,j for some j > h (h < j, A E VD) is derived if A[dh] wi,j for some i < h (i <3 < h, A, C E VD) is derived if A[dh] B[dh,]C[dh] wC[dh] Wi,k for some B, h', k Wk,j for (h< < j, A, C E VD) is derived if A[dhl C[dh]B[dh,] C[dhjtvi,i i some B , h!",
        ", k",
        "(b) As in Figure 1(b) above, but add HALVE and change ATTACH-LEFT and ATTACH-RIGHT as shown.",
        "HALVE: ATTACH-LEFT: ATTACH-RIGHT:"
      ]
    },
    {
      "heading": "6 Multiple word senses",
      "text": [
        "Rather than parsing an input string directly, it is often desirable to parse another string related by a (possibly stochastic) transduction.",
        "Let T be a finite-state transducer that maps a morpheme sequence w E Vit to its orthographic realization, a grapheme sequence 'Lb T may realize arbitrary morphological processes, including affixation, local clitic movement, deletion of phonological nulls, forbidden or dispreferred k-grams, typographical errors, and mapping of multiple senses onto the same grapheme.",
        "Given grammar G and an input ti), we ask whether E T(L(G)).",
        "We have extended all the algorithms in this paper to this case: the items simply keep track of the transducer state as well.",
        "Due to space constraints, we sketch only the special case of multiple senses.",
        "Suppose that the input is iD= d1 • • • dn, and each d2 has up to g possible senses.",
        "Each item now needs to track its head's sense along with its head's position in ID.",
        "Wherever an item formerly recorded a head position h (similarly h'), it must now record a pair (h,dh), where dh E VT is a specific sense of dh.",
        "No rule in Figures 1-2 (or Figure 3 below) will mention more than two such pairs.",
        "So the time complexity increases by a factor of 0(g2).",
        "7 Head automaton grammars in time 0(n4) In this section we show that a length-n string generated by a head automaton grammar (Alshawi, 1996) can be parsed in time 0(n4).",
        "We do this by providing a translation from head automaton grammars to bilexical CFGs.4 This result improves on the head-automaton parsing algorithm given by Alshawi, which is analogous to the CKY algorithm on bilexical CFGs and is likewise 0(n5) in practice (see §3).",
        "A head automaton grammar (HAG) is a function H : a 1-4 Ha that defines a head automaton (HA) for each element of its (finite) domain.",
        "Let VT = domain(H) and D =",
        "1.",
        "A special symbol $ E VT plays the role of start symbol.",
        "For each a E VT Ha is a tuple (Qa, VT, Sa, Fa), where • Qa is a finite set of states;",
        "• 'a, Fa C Qa are sets of initial and final states, respectively; • 5a is a transition function mapping Q a, X VT X D to 2Qa the power set of Qa•",
        "A single head automaton is an acceptor for a language of string pairs (zi, zr) E V x V. Informally, if b is the leftmost symbol of Zr and q' E a(q, b, -4), then Ha can move from state q to state q', matching symbol b and removing it from the left end of Zr.",
        "Symmetrically, if b is the rightmost symbol of zi and q' E Sa(q,b,<---) then from q Ha can move to q', matching symbol b and removing it from the right end of z1.5 More formally, we associate with the head automaton Ha a \"derives\" relation ha, defined as a binary relation on Q a X 1 /4 X V. For every q E Q, x,y E V, b E VT, de D, and q' E &(q, b, d), we specify that",
        "The reflexive and transitive closure of ha is written Ha*.",
        "The language generated by Ha is the set",
        "We may now define the language generated by the entire grammar H. To generate, we expand the start word $ E VT into x$y for some (x, y) E L (Hs), and then recursively expand the words in strings x and y.",
        "More formally, given H, we simultaneously define La for all a E VT to be minimal such that if (x, y) E L(H a), x' e Lx, y' E Ly, then x'ayi E La, where stands for the concatenation language Lai • • Lai,.",
        "Then H generates language L. We next present a simple construction that transforms a HAG H into a bilexical CFG G generating the same language.",
        "The construction also preserves derivation ambiguity.",
        "This means that for each string w, there is a linear-time 1-to-1 mapping between (appropriately de5 Alshawi (1996) describes HAs as accepting (or equivalently, generating) zi and z from the outside in.",
        "To make Figure 3 easier to follow, we have defined HAs as accepting symbols in the opposite order, from the inside out.",
        "This amounts to the same thing if transitions are reversed, I. is exchanged with F., and any transition probabilities are replaced by those of the reversed Markov chain.",
        "fined) canonical derivations of w by H and canonical derivations of w by G. We adopt the notation above for H and the components of its head automata.",
        "Let VD be an arbitrary set of size t = max{IQa I : a E VT}, and for each a, define an arbitrary injection fa Q.",
        "-4 VD.",
        "We define G = (VN, P,T[$]), where ( ) VN =- {A[a] : A E VD , a E VT}, in the usual manner for bilexical CFG; (ii) P is the set of all productions having one of the following forms, where a, b E VT:",
        "• A[a] – > B[b] C[a] where",
        "A = fa(q) for some q E Fa (iii) T fs(q), where we assume WLOG that Is is a singleton set {q}.",
        "We omit the formal proof that G and H admit isomorphic derivations and hence generate the same languages, observing only that",
        "a condition used in defining La above – then A[a] [bi] • • • B3[MaB3+1[bi+11 • • • Bk[bk], for any A, B1, ... Bk that map to initial states in Ha, Hbl, Hb, respectively.",
        "In general, G has p = 0(IVD13) = 0(t3).",
        "The construction therefore implies that we can parse a length-n sentence under H in time 0(n4t3).",
        "If the HAs in H happen to be deterministic, then in each binary production given by (ii) above, symbol A is fully determined by a, b, and C. In this case p = 0(t2), so the parser will operate in time 0(n4t2).",
        "We note that this construction can be straightforwardly extended to convert stochastic HAGs as in (Alshawi, 1996) into stochastic CFGs.",
        "Probabilities that Ha assigns to state q's various transition and halt actions are copied onto the corresponding productions A[a] a of G, where A = fa(q).",
        "8 Split head automaton grammars in time 0 (n3 ) For many bilexical CFGs or HAGs of practical significance, just as for the bilexical version of link grammars (Lafferty et al., 1992), it is possible to parse length-n inputs even faster, in time 0(n3) (Eisner, 1997).",
        "In this section we describe and discuss this special case, and give a new 0(n3) algorithm that has a smaller grammar constant than previously reported.",
        "A head automaton Ha is called split if it has no states that can be entered on a ÷- transition and exited on a ---> transition.",
        "Such an automaton can accept (x, y) only by reading all of y – immediately after which it is said to be in a flip state – and then reading all of x.",
        "Formally, a flip state is one that allows entry on a – > transition and that either allows exit on a transition or is a final state.",
        "We are concerned here with head automaton grammars H such that every Ha is split.",
        "These correspond to bilexical CFGs in which any derivation A[a] xay has the form A[a] xB[a] xay.",
        "That is, a word's left dependents are more oblique than its right dependents and c-command them.",
        "Such grammars are broadly applicable.",
        "Even if Ha is not split, there usually exists a split head automaton H\", recognizing the same language.",
        "lila exists if {x#y : (x, y) E L(Ha)} is regular (where # VT).",
        "In particular, lei', must exist unless Ha has a cycle that includes both ÷- and 4 transitions.",
        "Such cycles would be necessary for Ha itself to accept a formal language such as {(bn, cn) : n > 0}, where word a takes 2n dependents, but we know of no natural-language motivation for ever using them in a HAG.",
        "One more definition will help us bound the complexity.",
        "A split head automaton Ha is said to be g-split if its set of flip states, denoted C Qa, has size < g. The languages that can be recognized by g-split HAs are those that can be written as U1 Li x R, where the Li and Ri are regular languages over VT. Eisner (1997) actually defined (g-split) bilexical grammars in terms of the latter property.6",
        "We now present our result: Figure 3 specifies an 0(n3g2t2) recognition algorithm for a head automaton grammar H in which every H, is g-split.",
        "For deterministic automata, the runtime is 0(n3g2t) – a considerable improvement on the 0(n3g3t2) result of (Eisner, 1997), which also assumes deterministic automata.",
        "As in §4, a simple bottom-up implementation will suffice.",
        "For a practical speedup, add h\\j as an antecedent to the MID rule (and fill in the parse table from right to left).",
        "Like our previous algorithms, this one takes two steps (ATTACH, COMPLETE) to attach a child constituent to a parent constituent.",
        "But instead of full constituents – strings xd,y e d, – it uses only half-constituents like xdi and diy.",
        "Where CKY combines z h 3 j + we save two degrees of freedom i, k (so improving 0(n5) to 0(n3)) and combine \\ .",
        "The other halves of these constituents can be attached later, because to find an accepting path for (zi, Zr) in a split head automaton, one can separately find the half-path before the flip state (which accepts zr) and the half-path after the flip state (which accepts zi).",
        "These two half-paths can subsequently be joined into an accepting path if they have the same flip state s, i.e., one path starts where the other ends.",
        "Annotating our left half-constituents with s makes this check possible."
      ]
    },
    {
      "heading": "9 Final remarks",
      "text": [
        "We have formally described, and given faster parsing algorithms for, three practical grammatical rewriting systems that capture dependencies between pairs of words.",
        "All three systems admit naive 0(n5) algorithms.",
        "We give the first 0(n4) results for the natural formalism of bilexical context-free grammar, and for Al-shawi's (1996) head automaton grammars.",
        "For the usual case, split head automaton grammars or equivalent bilexical CFGs, we replace the 0(n3) algorithm of (Eisner, 1997) by one with a smaller grammar constant.",
        "Note that, e.g., all senses would restore the g 2 factor.",
        "Indeed, this approach gives added flexibility: a word's sense, unlike its choice of flip state, is visible to the HA that reads it.",
        "three models in (Collins, 1997) are susceptible to the 0(n3) method (cf. Collins's 0(n5)).",
        "Our dynamic programming techniques for cheaply attaching head information to derivations can also be exploited in parsing formalisms other than rewriting systems.",
        "The authors have developed an 0(n7)-time parsing algorithm for bilexicalized tree adjoining grammars (Schabes, 1992), improving the naive 0(n8) method.",
        "The results mentioned in §6 are related to the closure property of CFGs under generalized sequential machine mapping (Hoperoft and Ullman, 1979).",
        "This property also holds for our class of bilexical CFGs."
      ]
    }
  ]
}
