{
  "info": {
    "authors": [
      "Toyoaki Nishida",
      "Shuji Doshita"
    ],
    "book": "Applied Natural Language Processing Conference",
    "id": "acl-A83-1027",
    "title": "An Application of MONTAGUE Grammar to English-Japanese Machine Translation",
    "url": "https://aclweb.org/anthology/A83-1027",
    "year": 1983
  },
  "references": [
    "acl-C80-1013",
    "acl-C80-1030",
    "acl-C80-1032",
    "acl-C82-1028",
    "acl-P81-1028",
    "acl-P82-1001",
    "acl-P82-1003"
  ],
  "sections": [
    {
      "text": [
        "English-Japanese machine translation requires a large amount of structural transformations in both grammatical and conceptual level.",
        "In order to make its control structure clearer and more understandable, this paper proposes a model based on Montague Gramamr.",
        "Translation process is modeled as a data flow computation process.",
        "Formal description tools are developed and a prototype system is constructed.",
        "Various problems which arise in this modeling and their solutions are described.",
        "Results of experiments are shown and it is discussed how far initial goals are achieved."
      ]
    },
    {
      "heading": "1. GOAL OF INTERMEDIATE REPRESENTATION DESIGN",
      "text": [
        "Differences between English and Japanese exist not only in grammatical level but also in conceptual level.",
        "Examples are illustrated in Fig. 1.",
        "Accordingly, a large amount of transformations in various levels are required in order to obtain high quality translation.",
        "The goal of this research is to provide a good framework for carrying out those operations systematically.",
        "The solution depends on the design of intermediate representation (IR).",
        "Basic requirements to intermediate representation design are listed below.",
        "a) Accuracy: IR should retain logical conclusion of natural language expression.",
        "The following distinctions, for example, should be made in IR level: - partial/total negation - any-exist/exist-any active/passive - restrictive use/ nonrestrictive use, etc.",
        "In other words, scope of operators should be represented precisely.",
        "n KAISHAKU SURU interpre"
      ]
    },
    {
      "heading": "understand RIKAI SURU grasp TSUKAMU hold TAMOTSU keep MAMORU CONCEPTUAL difference",
      "text": [
        "<E, her arrival makes him happy .",
        "paraphrasing is needed <J> KARE WA KANOJO GA TOUCHAKU SHITA NODE oRESNIE.",
        "(he becomes happy because she has arrived) Fig.l.",
        "Examples of Differences between English and Japanese.",
        "<E>: English; KJ>: Japanese.",
        "b) Ability of representing semantic relations: In English-Japanese translation, it is often the case that a given English word must be translated into different Japanese words or phrases if it has more than one word meanings.",
        "But it is not reasonable to capture this problem solely as a problem of word meaning disambiguation in analysis phase; the needed depth of disambiguation depends on target language.",
        "So it is also handled in transfer phase.",
        "In general, meaning of a given word is recognized based on the relation to other constituents in the sentence or text which is semantically related to the given word.",
        "To make this possible in transfer phase, IR must provide a link to semantically related constituents of a given item.",
        "For example, an object of a verb should be accessible in IR level from the verb, even if the relation is implicit in the surface structure (eg., passives, relative clauses, and their combinations, etc.)",
        "c) Prediction of control: given an /12 expression, the model should be able to predict explicitly what operations are to be done in what order.",
        "d) Lexicon driven: some sort of transformation rules are word specific.",
        "The IR interpretation system should be designed to deal with those word specific rules easily.",
        "e) Computability: All processings should be effectively computable.",
        "Any IR is useless if it is not computable.",
        "2.",
        "PRINCIPLE OF TRANSLATION",
        "This section outlines our solution to the requirements posed in the preceding section.",
        "We employ Montague Grammar (Montague 1974, Dowty 1981) as a theoretical basis of translation model.",
        "Intermediate representation is designed based on intensional logic.",
        "Intermediate representation for a given natural language expression is obtained by what we call functional analysis."
      ]
    },
    {
      "heading": "2.1 Functional Analysis",
      "text": [
        "In functional analysis, input sentence is decomposed into groups of constituents and interrelationship among those groups are analyzed in terms of function-argument relationships.",
        "Suppose a sentence: I don't have a book.",
        "(1) The functional analysis makes following two points: a) (1) is decomposed as: \"I have a book\" + \"not\".",
        "(2) b) In the decomposition (2), \"not\" is an operator or function to \"I have a book.\" The result of this analysis can be depicted as follows:",
        "where C> denotes a function and 11111 denotes an argument.",
        "The role of \"not\" as a function is: \"not\" as a semantic operator: it negates a given proposition; \"not\" as a syntactic operator: it inserts an appropriate auxiliary verb and a lexical item \"not\" into appropriate position of its argument.",
        "(4) This kind of analysis goes on further with embedded sentence until it is decomposed into lexical units or even morphemes.",
        "2.2 Montague Grammar as a Basic Theory Montague Grammar (MG) gives a basis of functional analysis.",
        "One of the advantages of MG consists in its interpretation system of function form (or intensional logical form).",
        "In MG, interpretation of an intensional logical formula is a mapping I from intensional logical formulas to set theoretical domain.",
        "Important property is that this mapping I is defined under the constraint of compositionality, that is, I satisfies: ...), (5) without regard to what f, a, b, etc.",
        "are.",
        "This property simplifies control structure and it also specifies what operations are done in what order.",
        "For example, suppose input data has a structure like: For the sake of property (5), the interpretation of (6) is done as a data flow computation process as follows: By this property, we can easily grasp the processing stream.",
        "In particular, we can easily shoot trouble and source of abnormality when debugging a system.",
        "Due to the above property and others, in particular due to its rigorous framework based 0,1 logic, MG has been studied in information science field (Hobbs 1978, Friedman 1978, Yonezaki 1980,",
        "Nishida 1980, Landsbergen 1980, Moran 1982, Moore 1981, Rosenschein 1982, ...).",
        "Application of MG to machine translation was also attempted (Hauenschild 1979, Landsbergen 1982), but those systems have only partially utilized the power of MG. Our approach attempts to utilize the full power of MG."
      ]
    },
    {
      "heading": "2.3 Application of Montague Grammar to Machine Translation",
      "text": [
        "In order to obtain the syntactic structure in Japanese from an intensional logical form, in the same way as interpretation process of MG, we change the semantic domain from set theoretical domain to conceptual domain for Japanese.",
        "Each conceptual unit contains its syntactic expression in Japanese.",
        "Syntactic aspect is stressed for generating syntactic structure in Japanese.",
        "Conceptual information is utilized for semantic based word choice and paraphrasing.",
        "For example, the following function in Japanese syntactic domain is assigned to a logical item \"not\":"
      ]
    },
    {
      "heading": ".TRANSFER TRANSFER,GENERATION",
      "text": []
    },
    {
      "heading": "3.1 Definition of Formal Tools",
      "text": [
        "a) English oriented Formal Representation (EFR) is a version of intensional logic, and gives a rigorous formalism for describing the results of functional analysis.",
        "It is based on Cresswell's lambda deep structure (Cresawell 1973).",
        "Each expression has a uniquely defined type.",
        "Lambda form is employed to denote function itself.",
        "b) Conceptual Phrase Structure (CPS) is a data structure in which syntactic and semantic information of a Japanese lexical unit or phrase structure are packed.",
        "i) example of CPS for a lexical item: EIGO:[NP \"EIGO\" with ISA=LANGUAGE; ...,] (9) category; lexical item; conceptual info.",
        "; \"EIGO\" means English' language.",
        "ii) example of CPS for phrase structure: [NP [ADJ \"AKAI\" with ... ] [NOUN \"RINGO\" with ... ] with ... ] (10) ; \"AKAI\" means red, and \"RINGO\" means apple.",
        "c) CPS Form (CPSF) is a form which denotes operation or function on CPS domain.",
        "It is used to give descriptions to mappings from EFR to CPS.",
        "Constituents of CPSF are: i) Constants: CPS.",
        "ii) Variables: x, y, .",
        "(indicated by lower case strings).",
        "iii) Variables with constraints: e.g., (!",
        "SENTENCE x).",
        "; variable x which must be of category SENTENCE.",
        "iNft,,maftaniummeobi/"
      ]
    },
    {
      "heading": "S AUX WATASHI-WA HON-WO MOTSU NAI MOTANAI 3. FORMAL TOOLS",
      "text": [
        "Formal description tools have been developed to provide a precise description of the idea mentioned in the last section.",
        "iv) Transformations: e.g., (+ TENSE (TENSE=PAST), x).",
        "\\\\,' indicator; operator-name; PARAMs; argument v) CPS construction: e.g., (SENTENCE (x y) with ... ).",
        "new category; descendents vi) Conditionals: [ <condition>1 -> <CPSF>1; ... ].",
        "vii) Lambda form: e.g., (LAMBDA (x) (+ PASSIVE 0 x))",
        "Using those description tools, translation process is modeled as a three staged process: stage 1 (analysis): anlyzes English sentence and extracts EFR form, stage 2 (transfer): substitutes CPSF to each lexical item in the EFR form,",
        "'ASK a bi its < tvcA b 41-c4*ta tia always he comes late it is not the case that Otitis< 41.r31EZ .. CPS .. he comes Late Fig.2.",
        "Example of Translation Process / Prefix notation is used for CPSF, described using Formal Tools.",
        "and syntactic aspect is emphasized.",
        "stage 3 (generation): evaluates the CPSF to get CPS; generation of surface structure from CPS is straightforward.",
        "In order to give readers an overall perspective, we illustrate an example in Fig.2.",
        "Note that the example illustrated includes partial negation.",
        "Thus operator \"not\" is given a wider scope than \"always\".",
        "In the remaining part of this section we will describe how to extract EFR expression from a given sentence.",
        "Then we will discuss the problem which arises in evaluating CPSF, and give its possible solution."
      ]
    },
    {
      "heading": "3.2 Extracting EFR Expression from Input Sentence",
      "text": [
        "Rules for translating English into EFR form is associated with each phrase structure rules.",
        "For example, the rule looks like: NP -> DET+NOUN where <NP>=<DET>(<NOUN>) (11) where, <NP> stands for an EFR form assigned to the NP node, etc.",
        "Rule (11) says that EFR for an NP is a form whose function section is EFR for a DET node and whose argument section is EFR for a NOUN node.",
        "This rule can be incorporated into conventional natural language parser."
      ]
    },
    {
      "heading": "3.3 Evaluation of CPSF",
      "text": [
        "Evaluation process of CPSF is a sequence of lambda conversions and tree transformations.",
        "Evaluation of CPSF is done by a LISP interpreter-like algorithm.",
        "A problem which we call higher order problem arose in designing the evaluation algorithm.",
        "Higher Order Problem By higher order property we mean that there exist functions which take other functions as arguments (Henderson 1980).",
        "CPSF in fact has this property.",
        "For example, an adjective \"large\" is modeled as a function which takes a noun as its argument.",
        "For example, large(database).",
        "\"large database\" (12) On the other hand, adverbs are modeled as functions to adjectives.",
        "For example, very(large), extremely(large), comparatively(large), etc.",
        "(13) The difficulty with higher order functions consists in modifiction to function.",
        "For explanation, let our temporal goal be regeneration of English from EFR.",
        "Suppose we assign to \"large\" a lambda form like:",
        "which takes a noun and returns a complex noun by attaching an adjective \"large\".",
        "If the adjective is modified by an adverb, say \"very\", we have to modify (14); we have to transform (14) into a lambda form like:",
        "which attaches a complex adjective \"very large\" to a given noun.",
        "As is easily expected, it is too tedious or even impossible to do this task in general.",
        "Accordingly, we take an alternative assignment instead of (14), namely: large <= [ADJ \"LARGE\"].",
        "(16) Since this decision cuases a form: [ADJ \"LARGE\"]([NOUN \"DATABASE\"]), (17) to be created in the course of evaluation, we specify what to do in such case.",
        "The rule is defiend as follows:",
        "This rule is called an application rule.",
        "In general, evaluation of lambda form itself results in a function value (function as a value).",
        "This causes difficulty as mentioned above.",
        "Unfortunately, we can't dispense with lambda forms; lambda variables are needed to link gap and its antecedent in relative clause, verb and its dependants (subject, object, etc), preposition and its object, etc.",
        "For example, in our model, an complex noun modified by a PP: \"block on the table\" (19) is assigned a following EFR:",
        "; which may read: is y:[there is a uniquely specified object y referred to by an NP \"the table\", such that y is a block which is restricted to be located on x.)",
        "This lambda form is too complicated for tree transformation procedure to manipulate.",
        "So it should be transformed into equivalent CPS if it exists.",
        "The type of the lambda form is known from the context, namely one-place predicate.",
        "So if we apply the lambda form (20) to \"known\" entity, say \"it\", we can obtain sentence structure like:",
        "The extraction rule can be written as a pattern matching rule like:",
        "Of course, this way of processing is not desirable; it introduces extra complexity.",
        "But this is a trade off of employing formal semantics; the same sort of processing is also done rather opaque procedures in conventional MT system."
      ]
    },
    {
      "heading": "4. MODELING TRANSLATION PROCESS",
      "text": [
        "This section illustrates how English-Japanese translation process is modeled using formal tools.",
        "Firstly, how several basic linguistic constructions are treated is described and then mechanism for word choice is presented."
      ]
    },
    {
      "heading": "4.1 Translating Basic Constructions of English",
      "text": [
        "a) Sentence: sentence consists of an NP and a VP.",
        "VP is analyzed as a one-place predicate, which constructs a proposition out of an individual referred to by the subject.",
        "VP is further decomposed into intransitive verb or transitive verb + object.",
        "Intransitive verbs and transitive verbs are analyzed as one-place predicates and two-place predicate, respectively.",
        "One-place predicate and two-place predicate are assigned a CPSF function which generates a sentence out of an individual and that which generates a sentence out of a pair of individuals, respectively.",
        "Thus, a transitive verb \"constructs\" is assigned a CPSF form:",
        "; given two individuals, this function attaches to each argument a case marker (corresponding to JOSHI or Japanese postfix) and then generates a sentence structure.",
        "The assignment (24) may be extended later to incorporate word choice mechanism.",
        "Treatment of NP in Montague-based semantics is significant in that EFR expression for an NP is given a wider scope than that for a VP.",
        "Thus the EFR form for an NP-VP construction looks like: In English-Japanese machine translation, this treatment gives an elegant solution to the translation of prenominal negation, partial negation, etc.",
        "Since Japanese language does not have a syntactic device for prenominal negation, \"no\" must be translated into mainly two separate constituents: one is a RENTAISHI (Japanese determiner) and another is an auxiliary verb of negation.",
        "One possible assignment of CPSF looks like:",
        "In general, correspondence of NP and individual is indirect in EFR.",
        "The association of an NP with its referent x is indicated as follows: <NP>(Ax( x J).",
        "(31) sentence type one-place predicate type ; <NP> stands for EFR expression for NP.",
        "Most of other NP's correspond to its referent more directly.",
        "The application rule reflecting this fact is:",
        "where, [xJ stands for a CPS for x. b) Internal structure of NP: the below illua-<NP>(<VP>), (25) trates the structure of EFR expression assigned to an NP: where <x> means EFR form for x, x=NP,... .",
        "The reason is to provide an appropriate model for English quantifier which is syntactically local but semantically global.",
        "For example, first order logical form for a sentence: \"this command needs no operand\" (26) looks like:",
        "where operator \"not\", which comes from a determiner \"no\", is given a wider scope than \"needs\".",
        "This translation is straightforward in our model; the following EFR is extracted from (26): (this(command)) Nx[(no(operand))(Xy(needs(x,y)1)1).",
        "(28) If we make appropriate assignment including:",
        "By <MODIFIER> we mean modification to noun by adjectives, prepositional phrases, infinitives, present/past particles, etc.",
        "The translation process is determined by a CPSF assigned to <DET>.",
        "In cases of \"the\" or \"a/an\", translation process is a bit complicated.",
        "It is almost the same as the process described in detail in section 3: firstly the <MODIFIER>s and <NOUN> are applied to an individual like \"the thing\" (the) or \"something\" (a/an) and a sentence will he obtained; then a.noun structure is extracted and appropriate RENTA1SHI or Japanese determiner is attached.",
        "c) Other cases: some other cases are illustrated by examples in Fig.3.",
        "4.2 Word Choice Mechanism",
        ".In order to obtain high quality translation, word choice mechanism must be incorporated at least for handling the cases like:",
        "; function \"en\" transforms a CPSF for a transitive verb into intransitive.",
        "4) interrogative: \"Do you have a car?\"",
        "; indirect question is generated first, then it is transformed into a sentence.",
        "Fig.3.",
        "Examples of Translation of Basic English Construction.",
        "<x>, {x}, [x] and \"x\" stand for EFR for x, CPSF for x, CPS for x, and CPS for Japanese string x, respectively.",
        "verb in accordance with its object or its agent, adjective-noun, adverb-verb, and preposition.",
        "Word choice is partially solved in the analysis phase as a word meaning disambiguation.",
        "So the design problem is to determine to what degree word sense is disambiguated in the analysis phase and what kind of ambiguities is left until transfer-generation phase.",
        "Suppose we are to translate a given preposition.",
        "The occurence of a preposition is classified as: (a) when it is governed by verbs or nouns: (a-1) when government is strong: e.g., study on, belong to, provide for; (a-2) when government is weak: e.g., buy ... at score;",
        "(b) otherwise: (b-1) idiomatic: e.g., in particular, in addition; (b-2) related to its object:",
        "e.g., by bus, with high probability, without+ING.",
        "We treat (a) and (b-1) as an analysis problem and handle them in the analysis phase.",
        "(b-2) is more difficult and is treated in the transfer-generation phase where partial semantic interpretation is done.",
        "Word choice in transfer-generation phase is done by using, conditional expression and attributive information included in CPS.",
        "For example, a transitive verb \"develop\" is translated differently according to its object:",
        "The following assignment of CPSF makes this choice possible: develop",
        "To make this type of processing possible in the cases where the deep object is moved from surface object position by transformations, link information between verb and its (deep) object should",
        "be represented explicitly.",
        "The below shows how it is done in the case of relative clause.",
        "Phrase Structure (for restrictive use): NP",
        "link from head noun to place holder",
        "; In EFR level, lambda variable x is explicitly used as a place holder for the gap.",
        "A functor \"which\" dominates both the EFR for the embedded sentence and that for the head noun.",
        "A CPSF assigned to the functor \"which\" sends conceptual information of the head noun to the gap as follows: firstly it creates a null NP out of the head noun, then the null NP is substituted into the lambda variable for the gap.",
        "In word choice or semantic based translation in general, various kinds of transformations are carried out on target language structure.",
        "For example, her arrival makes him happy, (38) must be paraphrased into: he becomes happy because she has arrived (39) since inanimate agent is unnatural in Japanese.",
        "In order to retrieve appropriate lexical item of target language for transformation, mutual relations among lexical items are organized using network formalism (lexical net).",
        "The node represents a lexical item and a link represents an association with specification of what operation causes that link to be passed through.",
        "It also contains description of case transformation needed in order to map case structure appropriately.",
        "The below illustrate a part of lexical net:"
      ]
    },
    {
      "heading": "5. EXPERIMENTS",
      "text": [
        "We have constructed a prototype system.",
        "It is simplified than practical system in: - it has only limited vocabulary, - interactive disambiguation is done instead of automatic disambiguation, and - word choice mechanism is limited to typical cases since overall definition of rules have not yet been completed.",
        "Sample texts are taken from real computer manuals or abstracts of computer journals.",
        "Initially, four sample texts (40 sentences) are chosen.",
        "Currently it is extended to 10 texts (72 sentences).",
        "Additional features are introduced in order to make the system more practical.",
        "a) Parser: declarative rules are inefficient for dealing with sentences in real texts.",
        "The parser uses production type rules each of which is classified according to its invocation condition.",
        "Declarative rules are manually converted into this rule type.",
        "b) Automatic posteditor: transfer process defined so far concentrates on local processings.",
        "Even if certain kinds of ambiguities are resolved in this phase, there still remains a possibility that new ambiguity is introduced in generation phase.",
        "Instead of incorporating into the transfer-generation phase a sophisticated mechanism for filtering out ambiguities, we attach a postprocessor which will \"reform\" a phrase structure yielding ambiguous output.",
        "Tree-tree transformation rules are utilized here.",
        "Current result of our machine translation system is shown in Appendix."
      ]
    },
    {
      "heading": "6. DISCUSSION",
      "text": [
        "Having completed initial experiments, it is shown that our framework is applicable to real texts under plausible assumption.",
        "The prototype system has a clear architecture.",
        "Central rule interpreter contains no complicated parts.",
        "Although several errors occured in the implementation of translation rules, they were easily detected and eliminated for the sake of data flow property.",
        "The initial requirement for intermediate representation are filled in the following way:"
      ]
    },
    {
      "heading": "REFERENCES",
      "text": [
        "precise representation based on intensional logic, using lambda variables and scope rules, data flow computing model based on compositionality, any CPSF can be assigned to a given lexical item if type is agreed, fact that computer model has been implemented.",
        "you may not eat the banana -> not(may( <you eat banana>)) (43) 2) Logic vs machine translation: The sentence (44) is logically equivalent to (45), but that paraphrasing is bad in machine translation.",
        "he reads and writes English.",
        "(44) he reads English and he writes English.",
        "(45) 7.",
        "CONCLUSION Application of formal semantics to machine translation brings about new phase of machine translation.",
        "It makes the translation process clearer than conventional systems.",
        "The theory has been tested by implementing a prototype, which can translate real texts with plausible human assist.",
        "Nishida, T. and Doshita, S. (1980): Hierarchical Meaning Representation and Analysis of Natural Language Documents, Proc.",
        "COLING 80, 85-92.",
        "Rosenschein, S.J.",
        "and Shieber, S.M.",
        "(1982): Translating English into Logical Form, Proc.",
        "20th Annual Meeting of the.",
        "ACL, 1-8.",
        "Yonezaki, H. and Enomoto, H. (1980): Database System Based on Intensional Logic, Proc.",
        "COLING 80, 220-227.",
        "APPENDIX: Translation of a Sample Text.",
        "INPUT TEXT Ktherne: is a stem for local communication among computing stations Our expenmentai Ethernet u'w ;Annex coaxial cables to carry unable-length digital data packets among.",
        "for example.",
        "persona: minicomputers.",
        "printing facilities.",
        "large file storage devices.",
        "magnetic tape backup stations.",
        "larger central computers.",
        "and longer-haul communication equipment.",
        "The shared communication facility.",
        "a branching Ether.",
        "is passive.",
        "A station's Ethernet Interface connects bit-senall■ through ar.",
        "interface cable to a transceiver which in turn taps into the passing Ether.",
        "A packet is broadcast onto the Ether.",
        "is heard by all stations.",
        "and is copied from the Ether by desunauons which select ii according to the packet's leading address bits.",
        "This is broadcast packe: se itching and should be distinguished from store-and-forward packet switching in which rouung 15 performed h■ intermediate processing elements.",
        "To handle the demands of growth.",
        "an Ethernet can be extended using packet repeaters Car signai regeneration.",
        "packet filters for traffic localization.",
        "and packet gateways for intemetwork address extension.",
        "Control is completely distriouteci among stations with packet transmissions coordinated through statistical arbitration.",
        "Transmissions Initiated by a station defer to any which may already be in progress.",
        "Once started.",
        "if interference with other packets is detected.",
        "a transmission is aborted and rescheduled by its source station.",
        "After a certain period of interference-free transmission, a packet is heard by all stations and will run to completion without interference.",
        "Ethernet controllers in colliding stations each generate random retransmission intervals to avoid repeated collisions.",
        "The mean of a packet's retransmission intervals is adjusted as a function of collision history to keep Ether utilizauon near the optimum with changing network load.",
        "Even when transmitted without source-detected interference, a packet may still not reach its destination without error: thus.",
        "packets are delivered only with high probability.",
        "Stations requinng a residual error rate lower than that provided by the bare Ethernet packet transport mechanism must follow mutually agreed upon packet protocols.",
        "( cited from: Metcalfe, R.M.",
        "and Boggs, D.R.",
        "(1975): Ethernet: Distributed Packet ) Switching for Local Computer Networks, CSL-75-7, Xerox.",
        "ryret % it f115 Rie f;( ; r to."
      ]
    },
    {
      "heading": "OUTPUT TEXT",
      "text": [
        "translation is carried out sentence by sentence; the result is assembled by hand."
      ]
    }
  ]
}
