{
  "info": {
    "authors": [
      "Kun Wang",
      "Chengqing Zong",
      "Keh-Yih Su"
    ],
    "book": "ACL",
    "id": "acl-P13-1002",
    "title": "Integrating Translation Memory into Phrase-Based Machine Translation during Decoding",
    "url": "https://aclweb.org/anthology/P13-1002",
    "year": 2013
  },
  "references": [
    "acl-C08-1144",
    "acl-D10-1091",
    "acl-J03-1002",
    "acl-N03-1017",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P10-1064",
    "acl-P11-1124",
    "acl-W04-3250",
    "acl-W09-0437",
    "acl-W10-3806"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Since statistical machine translation (SMT) and translation memory (TM) complement each other in matched and unmatched regions, integrated models are proposed in this paper to incorporate TM information into phrase-based SMT.",
        "Unlike previous multi-stage pipeline approaches, which directly merge TM result into the final output, the proposed models refer to the corresponding TM information associated with each phrase at SMT decoding.",
        "On a Chinese?English TM database, our experiments show that the proposed integrated Model-III is significantly better than either the SMT or the TM systems when the fuzzy match score is above 0.4.",
        "Furthermore, integrated Model-III achieves overall 3.48 BLEU points improvement and 2.62 TER points reduction in comparison with the pure SMT system.",
        "Besides, the proposed models also outperform previous approaches significantly."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Statistical machine translation (SMT), especially the phrase-based model (Koehn et al., 2003), has developed very fast in the last decade.",
        "For certain language pairs and special applications, SMT output has reached an acceptable level, especially in the domains where abundant parallel corpora are available (He et al., 2010).",
        "However, SMT is rarely applied to professional translation because its output quality is still far from satisfactory.",
        "Especially, there is no guarantee that a SMT system can produce translations in a consistent manner (Ma et al., 2011).",
        "In contrast, translation memory (TM), which uses the most similar translation sentence (usually above a certain fuzzy match threshold) in the database as the reference for post-editing, has been widely adopted in professional translation field for many years (Lagoudaki, 2006).",
        "TM is very useful for repetitive material such as updated product manuals, and can give high quality and consistent translations when the similarity of fuzzy match is high.",
        "Therefore, professional translators trust TM much more than SMT.",
        "However, high-similarity fuzzy matches are available unless the material is very repetitive.",
        "In general, for those matched segments1, TM provides more reliable results than SMT does.",
        "One reason is that the results of TM have been revised by human according to the global context, but SMT only utilizes local context.",
        "However, for those unmatched segments, SMT is more reliable.",
        "Since TM and SMT complement each other in those matched and unmatched segments, the output quality is expected to be raised significantly if they can be combined to supplement each other.",
        "In recent years, some previous works have incorporated TM matched segments into SMT in a pipelined manner (Koehn and Senellart, 2010; Zhechev and van Genabith, 2010; He et al., 2011; Ma et al., 2011).",
        "All these pipeline approaches translate the sentence in two stages.",
        "They first determine whether the extracted TM sentence pair should be adopted or not.",
        "Most of them use fuzzy match score as the threshold, but He et al. (2011) and Ma et al. (2011) use a classifier to make the judgment.",
        "Afterwards, they merge the relevant translations of matched segments into the source sentence, and then force the SMT system to only translate those unmatched segments at decoding.",
        "There are three obvious drawbacks for the above pipeline approaches.",
        "Firstly, all of them determine whether those matched segments",
        "should be adopted or not at sentence level.",
        "That is, they are either all adopted or all abandoned regardless of their individual quality.",
        "Secondly, as several TM target phrases might be available for one given TM source phrase due to insertions, the incorrect selection made in the merging stage cannot be remedied in the following translation stage.",
        "For example, there are six possible corresponding TM target phrases for the given TM source phrase ??",
        "?4 ?5 ??6?",
        "(as shown in Figure 1) such as ?object2 that3 is4 associated5?, and ?an1 object2 that3 is4 associated5 with6?, etc.",
        "And it is hard to tell which one should be adopted in the merging stage.",
        "Thirdly, the pipeline approach does not utilize the SMT probabilistic information in deciding whether a matched TM phrase should be adopted or not, and which target phrase should be selected when we have multiple candidates.",
        "Therefore, the possible improvements resulted from those pipeline approaches are quite limited.",
        "On the other hand, instead of directly merging TM matched phrases into the source sentence, some approaches (Bi?ici and Dymetman, 2008; Simard and Isabelle, 2009) simply add the longest matched pairs into SMT phrase table, and then associate them with a fixed large probability value to favor the corresponding TM target phrase at SMT decoding.",
        "However, since only one aligned target phrase will be added for each matched source phrase, they share most drawbacks with the pipeline approaches mentioned above and merely achieve similar performance.",
        "To avoid the drawbacks of the pipeline approach (mainly due to making a hard decision before decoding), we propose several integrated models to completely make use of TM information during decoding.",
        "For each TM source phrase, we keep all its possible corresponding target phrases (instead of keeping only one of them).",
        "The integrated models then consider all corresponding TM target phrases and SMT preference during decoding.",
        "Therefore, the proposed integrated models combine SMT and TM at a deep level (versus the surface level at which TM result is directly plugged in under previous pipeline approaches).",
        "On a Chinese?English computer technical documents TM database, our experiments have shown that the proposed Model-III improves the translation quality significantly over either the pure phrase-based SMT or the TM systems when the fuzzy match score is above 0.4.",
        "Compared with the pure SMT system, the proposed integrated Model-III achieves 3.48 BLEU points improvement and 2.62 TER points reduction overall.",
        "Furthermore, the proposed models significantly outperform previous pipeline approaches."
      ]
    },
    {
      "heading": "2 Problem Formulation",
      "text": [
        "Compared with the standard phrase-based machine translation model, the translation problem is reformulated as follows (only based on the best TM, however, it is similar for multiple TM sentences):",
        "Where is the given source sentence to be translated, is the corresponding target sentence and is the final translation; are the associated information of the best TM sentence-pair; and denote the corresponding TM sentence pair; denotes its associated fuzzy match score (from 0.0 to 1.0); is the editing operations between and ; and denotes the word alignment between and .",
        "Let and denote the k-th associated source phrase and target phrase, respectively.",
        "Also, and denote the associated source phrase sequence and the target phrase sequence, respectively (total phrases without insertion).",
        "Then the above formula (1) can be decomposed as below: (2) Afterwards, for any given source phrase , we can find its corresponding TM source phrase and all possible TM target phrases (each of them is denoted by ) with the help of corresponding editing operations and word alignment .",
        "As mentioned above, we can have six different possible TM target phrases for the TM source phrase ???",
        "4 ?",
        "5 ??",
        "6?.",
        "This",
        "is because there are insertions around the directly aligned TM target phrase.",
        "In the above Equation (2), we first segment the given source sentence into various phrases, and then translate the sentence based on those source phrases.",
        "Also, is replaced by , as they are actually the same segmentation sequence.",
        "Assume that the segmentation probability is a uniform distribution, with the corresponding TM source and target phrases obtained above, this problem can be further simplified as follows:",
        "Where is the corresponding TM phrase matching status for , which is a vector consisting of various indicators (e.g., Target Phrase Content Matching Status, etc., to be defined later), and reflects the quality of the given candidate; is the linking status vector of (the aligned source phrase of within ), and indicates the matching and linking status in the source side (which is closely related to the status in the target side); also, indicates the corresponding TM fuzzy match interval specified later.",
        "In the second line of Equation (3), we convert the fuzzy match score into its corresponding interval , and incorporate all possible combinations of TM target phrases.",
        "Afterwards, we select the best one in the third line.",
        "Last, in the fourth line, we introduce the source matching status and the target linking status (detailed features would be defined later).",
        "Since we might have several possible TM target phrases , the one with the maximum score will be adopted during decoding.",
        "The first factor in the above formula (3) is just the typical phrase-based SMT model, and the second factor (to be specified in the Section 3) is the information derived from the TM sentence pair.",
        "Therefore, we can still keep the original phrase-based SMT model and only pay attention to how to extract useful information from the best TM sentence pair to guide SMT decoding."
      ]
    },
    {
      "heading": "3 Proposed Models",
      "text": [
        "Three integrated models are proposed to incorporate different features as follows:"
      ]
    },
    {
      "heading": "3.1 Model-I",
      "text": [
        "In this simplest model, we only consider Target"
      ]
    },
    {
      "heading": "Phrase Content Matching Status (TCM) for .",
      "text": [
        "For , we consider four different features at the same time: Source Phrase Content Matching Status (SCM), Number of Linking Neighbors (NLN), Source Phrase Length (SPL), and Sentence End Punctuation Indicator (SEP).",
        "Those features will be defined below.",
        "is then specified as: All features incorporated in this model are specified as follows: TM Fuzzy Match Interval (z): The fuzzy match score (FMS) between source sentence and TM source sentence indicates the reliability of the given TM sentence, and is defined as (Sikes, 2007): Where is the word-based Levenshtein Distance (Levenshtein, 1966) between and .",
        "We equally divide FMS into ten fuzzy match intervals such as: [0.9, 1.0), [0.8, 0.9) etc., and the index specifies the corresponding interval.",
        "For example, since the fuzzy match score between and in Figure 1 is",
        "0.667, then .",
        "Target Phrase Content Matching Status (TCM): It indicates the content matching status between and , and reflects the quality of .",
        "Because is nearly perfect when FMS is high, if the similarity between and is high, it implies that the given is possibly a good candidate.",
        "It is a member of {Same, High, Low, NA (Not-Applicable)}, and is specified as: (1) If is not null: (a) if , ; (b) else if , ; (c) else, ; (2) If is null, ;",
        "Here is null means that either there is no corresponding TM source phrase or there is no corresponding TM target phrase",
        "aligned with .",
        "In the example of Figure 1, assume that the given is ???",
        "5 ?",
        "6 ??",
        "7?",
        "and is ?object that is associated?.",
        "Source Phrase Content Matching Status (SCM): Which indicates the content matching status between and , and it affects the matching status of and greatly.",
        "The more similar is to , the more",
        "similar is to .",
        "It is a member of {Same, High, Low, NA} and is defined as: (1) If is not null: (a) if , ; (b) else if , ; (c) else, ; (2) If is null, ;",
        "Here is null means that there is no corresponding TM source phrase for the given source phrase .",
        "Take the source phrase ???",
        "5 ?",
        "6 ??",
        "7?",
        "in Figure 1 for an example, since its corresponding is ???",
        "4 ?",
        "5 ??",
        "6?, then .",
        "Number of Linking Neighbors (NLN): Usually, the context of a source phrase would affect its target translation.",
        "The more similar the context are, the more likely that the translations are the same.",
        "Therefore, this NLN feature reflects the number of matched neighbors (words) and it is a vector of <x, y>.",
        "Where ?x?",
        "denotes the number of matched source neighbors; and ?y?",
        "denotes how many those neighbors are also linked to target words (not null), which also affects the TM target phrase selection.",
        "This feature is a member of {<x, y>: <2, 2>, <2, 1>, <2, 0>, <1, 1>, <1, 0>, <0, 0>}.",
        "For the source phrase ???",
        "5 ?",
        "6 ??",
        "7?",
        "in Figure 1, the corresponding TM source phrase is ???",
        "4 ?",
        "5 ??",
        "6?",
        ".",
        "As only their right neighbors ??8?",
        "and ??7?",
        "are matched, and ??7?",
        "is aligned with ?.10?, NLN will be <1, 1>.",
        "Source Phrase Length (SPL): Usually the longer the source phrase is, the more reliable the TM target phrase is.",
        "For example, the corresponding for the source phrase with 5 words would be more reliable than that with only one word.",
        "This feature denotes the number of words included in , and is a member of {1, 2, 3, 4, ?5}.",
        "For the case ???",
        "5 ?",
        "6 ??",
        "7?, SPL will be 3.",
        "Sentence End Punctuation Indicator (SEP): Which indicates whether the current phrase is a punctuation at the end of the sentence, and is a member of {Yes, No}.",
        "For example, the SEP for ???",
        "5 ?",
        "6 ??",
        "7?",
        "will be ?No?.",
        "It is introduced because the SCM and TCM for a sentence-end-punctuation are always ?Same?",
        "regardless of other features.",
        "Therefore, it is used to distinguish this special case from other cases."
      ]
    },
    {
      "heading": "3.2 Model-II",
      "text": [
        "As Model-I ignores the relationship among various possible TM target phrases, we add two features TM Candidate Set Status (CSS) and Longest TM Candidate Indicator (LTC) to incorporate this relationship among them.",
        "Since CSS is redundant after LTC is known, we thus ignore it for evaluating TCM probability in the following derivation: The two new features CSS and LTC adopted in Model-II are defined as follows: TM Candidate Set Status (CSS): Which restricts the possible status of , and is a member of {Single, Left-Ext, Right-Ext, Both-Ext, NA}.",
        "Where ?Single?",
        "means that there is only one candidate for the given source phrase ; ?Left-Ext?",
        "means that there are multiple candidates, and all the candidates are generated by extending only the left boundary; ?Right-Ext?",
        "means that there are multiple candidates, and all the candidates are generated by only extending to the right; ?Both-Ext?",
        "means that there are multiple candidates, and the candidates are generated by extending to both sides; ?NA?",
        "means that is null.",
        "For ???",
        "4 ?",
        "5 ??",
        "6?",
        "in Figure 1, the linked TM target phrase is ?object2 that3 is4 associated5?, and there are 5 other candidates by extending to both sides.",
        "Therefore, .",
        "Longest TM Candidate Indicator (LTC): Which indicates whether the given is the longest candidate or not, and is a member of {Original, Left-Longest, Right-Longest, Both-Longest, Medium, NA}.",
        "Where ?Original?",
        "means that the given is the one without extension; ?Left-Longest?",
        "means that the given",
        "is only extended to the left and is the longest one; ?Right-Longest?",
        "means that the given is only extended to the right and is the longest one; ?Both-Longest?",
        "means that the given is extended to both sides and is the longest one; ?Medium?",
        "means that the given has been extended but not the longest one; ?NA?",
        "means that is null."
      ]
    },
    {
      "heading": "3.3 Model-III",
      "text": [
        "The abovementioned integrated models ignore the reordering information implied by TM.",
        "Therefore, we add a new feature Target Phrase"
      ]
    },
    {
      "heading": "Adjacent Candidate Relative Position",
      "text": [
        "Matching Status (CPM) into Model-II and Model-III is given as: We assume that CPM is independent with SPL and SEP, because the length of source phrase would not affect reordering too much and SEP is used to distinguish the sentence end punctuation with other phrases.",
        "The new feature CPM adopted in Model-III is defined as:",
        "and the relative position of .",
        "It checks if are positioned in the same order with , and reflects the quality of ordering the given target candidate .",
        "It is a member of {Adjacent-Same, Adjacent-Substitute, Linked-Interleaved, Linked-Cross, Linked-Reversed, Skip-Forward, Skip-Cross, Skip-Reversed, NA}.",
        "Recall that is always right adjacent to , then various cases are defined as follows: (1) If both and are not null: (a) If is on the right of and they are also adjacent to each other: i.",
        "If the right boundary words of and are the same, and the left boundary words of and are the same, ; ii.",
        "Otherwise, ; (b) If is on the right of but they are not adjacent to each other, ; (c) If is not on the right of : i.",
        "If there are cross parts between and , ; ii.",
        "Otherwise, ; (2) If is null but is not null, then find the first which is not null ( starts from 2)2: (a) If is on the right of , ; (b) If is not on the right of : i.",
        "If there are cross parts between and , ; ii.",
        "Otherwise, .",
        "(3) If is null, .",
        "In Figure 1, assume that , and are ?gets an?, ?object that is associated with?",
        "and ?gets0 an1?, respectively.",
        "For ?object2 that3 is4 associated5?, because is on the right of and they are adjacent pair, and both boundary words (?an?",
        "and ?an1?",
        "; ?object?",
        "and ?object2?)",
        "are matched, ; for ?an1 object2 that3 is4 associated5?, because there are cross parts ?an1?",
        "between and , .",
        "On the other hand, assume that , and are ?gets?, ?object that is associated with?",
        "and ?gets0?, respectively.",
        "For ?an1 object2 that3 is4 associated5?, because and are adjacent pair, but the left boundary words of and (?object?",
        "and ?an1?)",
        "are not matched, ; for ?object2 that3 is4 associated5?, because is on the right of but they are not adjacent pair, therefore, .",
        "One more example, assume that , and are ?the annotation label?, ?object that is associated with?",
        "and ?the7 annotation8 label9?, respectively.",
        "For ?an1 object2 that3 is4 associated5?, because is on the left of , and there are no cross parts, .",
        "2 It can be identified by simply memorizing the index of nearest non-null during search."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": []
    },
    {
      "heading": "4.1 Experimental Setup",
      "text": [
        "Our TM database consists of computer domain Chinese-English translation sentence-pairs, which contains about 267k sentence-pairs.",
        "The average length of Chinese sentences is 13.85 words and that of English sentences is 13.86 words.",
        "We randomly selected a development set and a test set, and then the remaining sentence pairs are for training set.",
        "The detailed corpus statistics are shown in Table 1.",
        "Furthermore, development set and test set are divided into various intervals according to their best fuzzy match scores.",
        "Corpus statistics for each interval in the test set are shown in Table 2.",
        "For the phrase-based SMT system, we adopted the Moses toolkit (Koehn et al., 2007).",
        "The system configurations are as follows: GIZA++ (Och and Ney, 2003) is used to obtain the bidirectional word alignments.",
        "Afterwards, ?intersection?",
        "3 refinement (Koehn et al., 2003) is adopted to extract phrase-pairs.",
        "We use the SRI Language Model toolkit (Stolcke, 2002) to train a 5-gram model with modified Kneser-Ney smoothing (Kneser and Ney, 1995; Chen and Goodman, 1998) on the target-side (English) training corpus.",
        "All the feature weights and the weight for each probability factor (3 factors for Model-III) are tuned on the development set with minimum-error-rate training (MERT) (Och, 2003).",
        "The maximum phrase length is set to 7 in our experiments.",
        "In this work, the translation performance is measured with case-insensitive BLEU-4 score (Papineni et al., 2002) and TER score (Snover et al., 2006).",
        "Statistical significance test is conducted with re-sampling (1,000 times) approach (Koehn, 2004) in 95% confidence level."
      ]
    },
    {
      "heading": "4.2 Cross-Fold Translation",
      "text": [
        "To estimate the probabilities of proposed models, the corresponding phrase segmentations for bilingual sentences are required.",
        "As we want to check what actually happened during decoding in the real situation, cross-fold translation is used to obtain the corresponding phrase segmentations.",
        "We first extract 95% of the bilingual sentences as a new training corpus to train a SMT system.",
        "Afterwards, we generate the corresponding phrase segmentations for the remaining 5% bi3 ?grow-diag-final?",
        "and ?grow-diag-final-and?",
        "are also tested.",
        "However, ?intersection?",
        "is the best option in our experiments, especially for those high fuzzy match intervals.",
        "lingual sentences with Forced Decoding (Li et al., 2000; Zollmann et al., 2008; Auli et al., 2009; Wisniewski et al., 2010), which searches the best phrase segmentation for the specified output.",
        "Having repeated the above steps 20 times4, we obtain the corresponding phrase segmentations for the SMT training data (which will then be used to train the integrated models).",
        "Due to OOV words and insertion words, not all given source sentences can generate the desired results through forced decoding.",
        "Fortunately, in our work, 71.7% of the training bilingual sentences can generate the corresponding target results.",
        "The remaining 28.3% of the sentence pairs are thus not adopted for generating training samples.",
        "Furthermore, more than 90% obtained source phrases are observed to be less than 5 words, which explains why five different quantization levels are adopted for Source Phrase Length (SPL) in section 3.1."
      ]
    },
    {
      "heading": "4.3 Translation Results",
      "text": [
        "After obtaining all the training samples via cross-fold translation, we use Factored Language Model toolkit (Kirchhoff et al., 2007) to estimate the probabilities of integrated models with Wit-ten-Bell smoothing (Bell et al., 1990; Witten et al., 1991) and Back-off method.",
        "Afterwards, we incorporate the TM information for each phrase at decoding.",
        "All experiments are",
        "SMT systems, and those marked by ?#?",
        "are significantly better (p < 0.05) than Koehn-10.",
        "conducted using the Moses phrase-based decoder (Koehn et al., 2007).",
        "Table 3 and 4 give the translation results of TM, SMT, and three integrated models in the test set.",
        "In the tables, the best translation results (either in BLEU or TER) at each interval have been marked in bold.",
        "Scores marked by ?*?",
        "are significantly better (p < 0.05) than both the TM and the SMT systems.",
        "It can be seen that TM significantly exceeds SMT at the interval [0.9, 1.0) in TER score, which illustrates why professional translators prefer TM rather than SMT as their assistant tool.",
        "Compared with TM and SMT, Model-I is significantly better than the SMT system in either BLEU or TER when the fuzzy match score is above 0.7; Model-II significantly outperforms both the TM and the SMT systems in either BLEU or TER when the fuzzy match score is above 0.5; Model-III significantly exceeds both the TM and the SMT systems in either BLEU or TER when the fuzzy match score is above 0.4.",
        "All these improvements show that our integrated models have combined the strength of both TM and SMT.",
        "However, the improvements from integrated models get less when the fuzzy match score decreases.",
        "For example, Model-III outperforms SMT 8.03 BLEU points at interval [0.9, 1.0), while the advantage is only 2.97 BLEU points at interval [0.6, 0.7).",
        "This is because lower fuzzy match score means that there are more unmatched parts between and ; the output of TM is thus less reliable.",
        "Across all intervals (the last row in the table), Model-III not only achieves the best BLEU score (56.51), but also gets the best TER score (33.26).",
        "If intervals are evaluated separately, when the fuzzy match score is above 0.4, Model-III outperforms both Model-II and Model-I in either BLEU or TER.",
        "Model-II also exceeds Model-I in either BLEU or TER.",
        "The only exception is at interval [0.5, 0.6), in which Model-I achieves the best TER score.",
        "This might be due to that the optimization criterion for MERT is BLEU rather than TER in our work."
      ]
    },
    {
      "heading": "4.4 Comparison with Previous Work",
      "text": [
        "In order to compare our proposed models with previous work, we reimplement two XML-Markup approaches: (Koehn and Senellart, 2010) and (Ma et al. 2011), which are denoted as Koehn-10 and Ma-11, respectively.",
        "They are selected because they report superior performances in the literature.",
        "A brief description of them is as follows:"
      ]
    },
    {
      "heading": "SMT",
      "text": [
        "if you disable this policy setting , internet explorer does not prompt users to install internet for new versions of the browser .",
        "[Miss 7 target words: 9~12, 20~21, 28; Has one wrong permuta",
        "if you do you disable this policy setting , internet explorer does not check the internet for new versions of the browser , so does not prompt users to install them .",
        "[Insert two spurious target words] Ma-11 if you disable this policy setting , internet explorer does not prompt users to install internet for new versions of the browser .",
        "[Miss 7 target words: 9~12, 20~21, 28; Has one wrong permutation] Model-I if you disable this policy setting , internet explorer does not prompt users to install new versions of the browser , so does not check the internet .",
        "[Miss 2 target words: 14, 28; Has one wrong permutation] Model-II if you disable this policy setting , internet explorer does not prompt users to install new versions of the browser , so does not check the internet .",
        "[Miss 2 target words: 14, 28; Has one wrong permutation] Model-III if you disable this policy setting , internet explorer does not check the internet for new versions of the browser , so does not prompt users to install them .",
        "[Exactly the same as the reference]",
        "Koehn et al. (2010) first find out the unmatched parts between the given source sentence and TM source sentence.",
        "Afterwards, for each unmatched phrase in the TM source sentence, they replace its corresponding translation in the TM target sentence by the corresponding source phrase in the input sentence, and then mark the substitution part.",
        "After replacing the corresponding translations of all unmatched source phrases in the TM target sentence, an XML input sentence (with mixed TM target phrases and marked input source phrases) is thus obtained.",
        "The SMT decoder then only translates the unmatched/marked source phrases and gets the desired results.",
        "Therefore, the inserted parts in the TM target sentence are automatically included.",
        "They use fuzzy match score to determine whether the current sentence should be marked or not; and their experiments show that this method is only effective when the fuzzy match score is above 0.8.",
        "Ma et al. (2011) think fuzzy match score is not reliable and use a discriminative learning method to decide whether the current sentence should be marked or not.",
        "Another difference between Ma11 and Koehn-10 is how the XML input is constructed.",
        "In constructing the XML input sentence, Ma-11 replaces each matched source phrase in the given source sentence with the corresponding TM target phrase.",
        "Therefore, the inserted parts in the TM target sentence are not included.",
        "In Ma's another paper (He et al., 2011), more linguistic features for discriminative learning are also added.",
        "In our work, we only reimplement the XML-Markup method used in (He et al., 2011; Ma et al. 2011), but do not implement the discriminative learning method.",
        "This is because the features adopted in their discriminative learning are complicated and difficult to re-implement.",
        "However, the proposed Model-III even outperforms the upper bound of their methods, which will be discussed later.",
        "Table 3 and 4 give the translation results of Koehn-10 and Ma-11 (without the discriminator).",
        "Scores marked by ?#?",
        "are significantly better (p < 0.05) than Koehn-10.",
        "Besides, the upper bound of (Ma et al. 2011) is also given in the tables, which is denoted as Ma-11-U.",
        "We calculate this",
        "upper bound according to the method described in (Ma et al., 2011).",
        "Since He et al., (2011) only add more linguistic features to the discriminative learning method, the upper bound of (He et al., 2011) is still the same with (Ma et al., 2011); therefore, Ma-11-U applies for both cases.",
        "It is observed that Model-III significantly exceeds Koehn-10 at all intervals.",
        "More importantly, the proposed models achieve much better TER score than the TM system does at interval [0.9, 1.0), but Koehn-10 does not even exceed the TM system at this interval.",
        "Furthermore, Model-III is much better than Ma-11-U at most intervals.",
        "Therefore, it can be concluded that the proposed models outperform the pipeline approaches significantly.",
        "Figure 2 gives an example at interval [0.9, 1.0), which shows the difference among different system outputs.",
        "It can be seen that ?you do?",
        "is redundant for Koehn-10, because they are insertions and thus are kept in the XML input.",
        "However, SMT system still inserts another ?you?, regardless of ?you do?",
        "has already existed.",
        "This problem does not occur at Ma-11, but it misses some words and adopts one wrong permutation.",
        "Besides, Model-I selects more right words than SMT does but still puts them in wrong positions due to ignoring TM reordering information.",
        "In this example, Model-II obtains the same results with Model-I because it also lacks reordering information.",
        "Last, since Model-III considers both TM content and TM position information, it gives a perfect translation."
      ]
    },
    {
      "heading": "5 Conclusion and Future Work",
      "text": [
        "Unlike the previous pipeline approaches, which directly merge TM phrases into the final translation result, we integrate TM information of each source phrase into the phrase-based SMT at decoding.",
        "In addition, all possible TM target phrases are kept and the proposed models select the best one during decoding via referring SMT information.",
        "Besides, the integrated model considers the probability information of both SMT and TM factors.",
        "The experiments show that the proposed Model-III outperforms both the TM and the SMT systems significantly (p < 0.05) in either BLEU or TER when fuzzy match score is above 0.4.",
        "Compared with the pure SMT system, Model-III achieves overall 3.48 BLEU points improvement and 2.62 TER points reduction on a Chinese?",
        "English TM database.",
        "Furthermore, Model-III significantly exceeds all previous pipeline approaches.",
        "Similar improvements are also observed on the Hansards parts of LDC2004T08 (not shown in this paper due to space limitation).",
        "Since no language-dependent feature is adopted, the proposed approaches can be easily adapted for other language pairs.",
        "Moreover, following the approaches of Koehn-10 and Ma-11 (to give a fair comparison), training data for SMT and TM are the same in the current experiments.",
        "However, the TM is expected to play an even more important role when the SMT training-set differs from the TM database, as additional phrase-pairs that are unseen in the SMT phrase table can be extracted from TM (which can then be dynamically added into the SMT phrase table at decoding time).",
        "Our another study has shown that the integrated model would be even more effective when the TM database and the SMT training dataset are from different corpora in the same domain (not shown in this paper).",
        "In addition, more source phrases can be matched if a set of high-FMS sentences, instead of only the sentence with the highest FMS, can be extracted and referred at the same time.",
        "And it could further raise the performance.",
        "Last, some related approaches (Smith and Clark, 2009; Phillips, 2011) combine SMT and example-based machine translation (EBMT) (Nagao, 1984).",
        "It would be also interesting to compare our integrated approach with that of theirs."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The research work has been funded by the Hi",
        "The authors would like to thank the anonymous reviewers for their insightful comments and suggestions.",
        "Our sincere thanks are also extended to Dr. Yanjun Ma and Dr. Yifan He for their valuable discussions during this study."
      ]
    }
  ]
}
