{
  "info": {
    "authors": [
      "Igor Labutov",
      "Hod Lipson"
    ],
    "book": "ACL",
    "id": "acl-P13-2087",
    "title": "Re-embedding words",
    "url": "https://aclweb.org/anthology/P13-2087",
    "year": 2013
  },
  "references": [
    "acl-D11-1016",
    "acl-D12-1050",
    "acl-P04-1035",
    "acl-P10-1040",
    "acl-P11-1015",
    "acl-P12-1092"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present a fast method for re-purposing existing semantic word vectors to improve performance in a supervised task.",
        "Recently, with an increase in computing resources, it became possible to learn rich word embeddings from massive amounts of unlabeled data.",
        "However, some methods take days or weeks to learn good embeddings, and some are notoriously difficult to train.",
        "We propose a method that takes as input an existing embedding, some labeled data, and produces an embedding in the same space, but with a better predictive performance in the supervised task.",
        "We show improvement on the task of sentiment classification with respect to several baselines, and observe that the approach is most useful when the training set is sufficiently small."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Incorporating the vector representation of a word as a feature, has recently been shown to benefit performance in several standard NLP tasks such as language modeling (Bengio et al., 2003; Mnih and Hinton, 2009), POS-tagging and NER (Col-lobert et al., 2011), parsing (Socher et al., 2010), as well as in sentiment and subjectivity analysis tasks (Maas et al., 2011; Yessenalina and Cardie, 2011).",
        "Real-valued word vectors mitigate sparsity by ?smoothing?",
        "relevant semantic insight gained during the unsupervised training over the rare and unseen terms in the training data.",
        "To be effective, these word-representations ?",
        "and the process by which they are assigned to the words (i.e. embedding) ?",
        "should capture the semantics relevant to the task.",
        "We might, for example, consider dramatic (term X) and pleasant (term Y) to correlate with a review of a good movie (task A), while finding them of opposite polarity in the context of a dating profile (task B).",
        "Consequently, good vectors for X and Y should yield an inner product close to 1 in the context of task A, and ?1 in the context of task B.",
        "Moreover, we may already have on our hands embeddings for X and Y obtained from yet another (possibly unsupervised) task (C), in which X and Y are, for example, orthogonal.",
        "If the embeddings for task C happen to be learned from a much larger dataset, it would make sense to reuse task C embeddings, but adapt them for task A and/or task B.",
        "We will refer to task C and its embeddings as the source task and the source embeddings, and task A/B, and its embeddings as the target task and the target embeddings.",
        "Traditionally, we would learn the embeddings for the target task jointly with whatever unlabeled data we may have, in an instance of semi-supervised learning, and/or we may leverage labels from multiple other related tasks in a multi-task approach.",
        "Both methods have been applied successfully (Collobert and Weston, 2008) to learn task-specific embeddings.",
        "But while joint training is highly effective, a downside is that a large amount of data (and processing time) is required a-priori.",
        "In the case of deep neural embeddings, for example, training time can number in days.",
        "On the other hand, learned embeddings are becoming more abundant, as much research and computing effort is being invested in learning word representations using large-scale deep architectures trained on web-scale corpora.",
        "Many of said embeddings are published and can be harnessed in their raw form as additional features in a number of supervised tasks (Turian et al., 2010).",
        "It would, thus, be advantageous to learn a task-specific embedding directly from another (source) embedding.",
        "In this paper we propose a fast method for re-embedding words from a source embedding S to a target embedding T by performing unconstrained optimization of a convex objective.",
        "Our objective is a linear combination of the dataset's log",
        "likelihood under the target embedding and the Frobenius norm of the distortion matrix ?",
        "a matrix of component-wise differences between the target and the source embeddings.",
        "The latter acts as a regularizer that penalizes the Euclidean distance between the source and target embeddings.",
        "The method is much faster than joint training and yields competitive results with several baselines."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "The most relevant to our contribution is the work by Maas et.al (2011), where word vectors are learned specifically for sentiment classification.",
        "Embeddings are learned in a semi-supervised fashion, and the components of the embedding are given an explicit probabilistic interpretation.",
        "Their method produces state-of-the-art results, however, optimization is non-convex and takes approximately 10 hours on 10 machines1.",
        "Naturally, our method is significantly faster because it operates in the space of an existing embedding, and does not require a large amount of training data a-priori.",
        "Collobert and Weston (2008), in their seminal paper on deep architectures for NLP, propose a multilayer neural network for learning word embeddings.",
        "Training of the model, depending on the task, is reported to be between an hour and three days.",
        "While the obtained embeddings can be ?fine-tuned?",
        "using backpropogation for a supervised task, like all multilayer neural network training, optimization is non-convex, and is sensitive to the dimensionality of the hidden layers.",
        "In machine learning literature, joint semi-supervised embedding takes form in methods such as the LaplacianSVM (LapSVM) (Belkin et al., 2006) and Label Propogation (Zhu and Ghahra-mani, 2002), to which our approach is related.",
        "These methods combine a discriminative learner with a non-linear manifold learning technique in a joint objective, and apply it to a combined set of labeled and unlabeled examples to improve performance in a supervised task.",
        "(Weston et al., 2012) take it further by applying this idea to deep-learning architectures.",
        "Our method is different in that the (potentially) massive amount of unlabeled data is not required a-priori, but only the resultant embedding.",
        "1as reported by author in private correspondence.",
        "The runtime can be improved using recently introduced techniques, see (Collobert et al., 2011)"
      ]
    },
    {
      "heading": "3 Approach",
      "text": [
        "Let ?S ,?T ?",
        "R|V |?K be the source and target embedding matrices respectively, where K is the dimension of the word vector space, identical in the source and target embeddings, and V is the set of embedded words, given by VS ?",
        "VT .",
        "Following this notation, ?i ?",
        "the ith row in ?",
        "?",
        "is the respective vector representation of wordwi ?",
        "V .",
        "In what follows, we first introduce our supervised objective, then combine it with the proposed regularizer and learn the target embedding ?T by optimizing the resulting joint convex objective."
      ]
    },
    {
      "heading": "3.1 Supervised model",
      "text": [
        "We model each document dj ?",
        "D (a movie review, for example) as a collection of words wij (i.i.d samples).",
        "We assign a sentiment label sj ?",
        "{0, 1} to each document (converting the star rating to a binary label), and seek to optimize the conditional likelihood of the labels (sj)j?",
        "{1,...,|D|}, given the embeddings and the documents:",
        "where p(sj = 1|wi,?T ) is the probability of assigning a positive label to document j, given that wi ?",
        "dj .",
        "As in (Maas et al., 2011), we use logistic regression to model the conditional likelihood:",
        "where ?",
        "?",
        "RK+1 is a regression parameter vector with an included bias component.",
        "Maximizing the log-likelihood directly (for ?",
        "and ?T ), especially on small datasets, will result in severe overfitting, as learning will tend to commit neutral words to either polarity.",
        "Classical regularization will mitigate this effect, but can be improved further by introducing an external embedding in the regularizer.",
        "In what follows, we describe re-embedding regularization?",
        "employing existing (source) embeddings to bias word vector learning."
      ]
    },
    {
      "heading": "3.2 Re-embedding regularization",
      "text": [
        "To leverage rich semantic word representations, we employ an external source embedding and incorporate it in the regularizer on the supervised objective.",
        "We use Euclidean distance between the source and the target embeddings as the regular",
        "ization loss.",
        "Combined with the supervised objective, the resulting log-likelihood becomes:",
        "where ??",
        "= ?T?",
        "?S , ||?||F is a Frobenius norm, and ?",
        "is a trade-off parameter.",
        "There are almost no restrictions on ?S , except that it must match the desired target vector space dimension K. The objective is convex in ?",
        "and ?T , thus, yielding a unique target re-embedding.",
        "We employ L-BFGS algorithm (Liu and Nocedal, 1989) to find the optimal target embedding."
      ]
    },
    {
      "heading": "3.3 Classification with word vectors",
      "text": [
        "To classify documents, re-embedded word vectors can now be used to construct a document-level feature vector for a supervised learning algorithm of choice.",
        "Perhaps the most direct approach is to compute a weighted linear combination of the embeddings for words that appear in the document to be classified, as done in (Maas et al., 2011) and (Blacoe and Lapata, 2012).",
        "We use the document's binary bag-of-words vector vj , and compute the document's vector space representation through the matrix-vector product ?T vj .",
        "The resulting K + 1-dimensional vector is then cosine-normalized and used as a feature vector to represent the document dj ."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "Data: For our experiments, we employ a large, recently introduced IMDB movie review dataset (Maas et al., 2011), in place of the smaller dataset introduced in (Pang and Lee, 2004) more commonly used for sentiment analysis.",
        "The dataset (50,000 reviews) is split evenly between training and testing sets, each containing a balanced set of highly polar (?",
        "7 and?",
        "4 stars out of 10) reviews.",
        "Source embeddings: We employ three external embeddings (obtained from (Turian et al., 2010)) induced using the following models: 1) hierarchical log-bilinear model (HLBL) (Mnih and Hinton, 2009) and two neural network-based models ?",
        "2) Collobert and Weston's (C&W) deep-learning architecture, and 3) Huang et.al's polysemous neural language model (HUANG) (Huang et al., 2012).",
        "C&W and HLBL were induced using a 37M-word newswire text (Reuters Corpus 1).",
        "We also induce a Latent Semantic Analysis (LSA) based embedding from the subset of the English project Gutenberg collection of approximately 100M words.",
        "No preprocessing (stemming or stopword removal), beyond case-normalization is performed in either the external or LSA-based embedding.",
        "For HLBL, C&W and LSA embeddings, we use two variants of different dimensionality: 50 and 200.",
        "In total, we obtain seven source embeddings: HLBL-50, HLBL-200, C&W-50, C&W-200, HUANG50, LSA-50, LSA-200.",
        "Baselines: We generate two baseline embeddings ?",
        "NULL and RANDOM.",
        "NULL is a set of zero vectors, and RANDOM is a set of uniformly distributed random vectors with a unit L2-norm.",
        "NULL and RANDOM are treated as source vectors and re-embedded in the same way.",
        "The NULL baseline is equivalent to regularizing on the target embedding without the source embedding.",
        "As additional baselines, we use each of the 7 source embeddings directly as a target without re-embedding.",
        "Training: For each source embedding matrix ?S , we compute the optimal target embedding matrix ?T by maximizing Equation 1 using the L-BFGS algorithm.",
        "20 % of the training set (5,000 documents) is withheld for parameter (?)",
        "tuning.",
        "We use LIBLINEAR (Fan et al., 2008) logistic regression module to classify document-level embeddings (computed from the ?T vj matrix-vector product).",
        "Training (re-embedding and document classification) on 20,000 documents and a 16,000 word vocabulary takes approximately 5 seconds on a 3.0 GHz quad-core machine."
      ]
    },
    {
      "heading": "5 Results and Discussion",
      "text": [
        "The main observation from the results is that our method improves performance for smaller training sets (?",
        "5000 examples).",
        "The reason for the performance boost is expected ?",
        "classical regularization of the supervised objective reduces overfitting.",
        "However, comparing to the NULL and RANDOM baseline embeddings, the performance is improved noticeably (note that a percent difference of 0.1 corresponds to 20 correctly classified reviews) for word vectors that incorporate the source embedding in the regularizer, than those that do not (NULL), and those that are based on the random source embedding (RANDOM).",
        "We hypothesize that the external embeddings, generated from a significantly larger dataset help ?smooth?",
        "the word-vectors learned from a small labeled dataset alne.",
        "Further observations include:",
        "movie review dataset (Maas et al., 2011)).",
        "Subtable A compares performance of the re-embedded vocabulary, induced from a given source embedding.",
        "Subtable B contains a set of baselines: X-w/o re-embedding indicates using a source embedding X directly without re-embedding."
      ]
    },
    {
      "heading": "BORING",
      "text": [
        "source: lethal, lifestyles, masterpiece .",
        ".",
        ".",
        "target: idiotic, soft-core, gimmicky BAD source: past, developing, lesser, .",
        ".",
        ".",
        "target: ill, madonna, low, .",
        ".",
        "."
      ]
    },
    {
      "heading": "DEPRESSING",
      "text": [
        "source: versa, redemption, townsfolk .",
        ".",
        ".",
        "target: hate, pressured, unanswered ,"
      ]
    },
    {
      "heading": "BRILLIANT",
      "text": [
        "source: high-quality, obsession, hate .",
        ".",
        ".",
        "target: all-out, bold, smiling .",
        ".",
        ".",
        "ranked (cosine-distance) words to (boring, bad, depressing, brilliant) extracted from the source and target (C&W-200) embeddings.",
        "Source embeddings give higher rank to words that are related, but not necessarily indicative of sentiment, e.g. brilliant and obsession.",
        "Target words tend to be tuned and ranked higher based on movie-sentiment-based relations.",
        "Training set size: We note that with a sufficient number of training instances for each word in the test set, additional knowledge from an external embedding does little to improve performance.",
        "Source embeddings: We find C&W embeddings to perform best for the task of sentiment classification.",
        "These embeddings were found to perform well in other NLP tasks as well (Turian et al., 2010).",
        "Embedding dimensionality: We observe that for HLBL, C&W and LSA source embeddings (for all training set sizes), 200 dimensions outperform 50.",
        "While a smaller number of dimensions has been shown to work better in other tasks (Turian et al., 2010), re-embedding words may benefit from a larger initial dimension of the word vector space.",
        "We leave the testing of this hypothesis for future work.",
        "Additional features: Across all embeddings, appending the document's binary bag-of-words representation increases classification accuracy."
      ]
    },
    {
      "heading": "6 Future Work",
      "text": [
        "While ?semantic smoothing?",
        "obtained from introducing an external embedding helps to improve performance in the sentiment classification task, the method does not help to re-embed words that do not appear in the training set to begin with.",
        "Returning to our example, if we found dramatic and pleasant to be ?far?",
        "in the original (source) embedding space, but re-embed them such that they are ?near?",
        "(for the task of movie review sentiment classification, for example), then we might expect words such as melodramatic, powerful, striking, enjoyable to be re-embedded nearby as well, even if they did not appear in the training set.",
        "The objective for this optimization problem can be posed by requiring that the distance between every pair of words in the source and target embeddings is preserved as much as possible, i.e. min (??i?",
        "?j ?",
        "?i?j)2 ?i, j (where, with some abuse of notation, ?",
        "and ??",
        "are the source and target embeddings respectively).",
        "However, this objective is no longer convex in the embeddings.",
        "Global re-embedding constitutes our ongoing work and may pose an interesting challenge to the community."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "We presented a novel approach to adapting existing word vectors for improving performance in a text classification task.",
        "While we have shown promising results in a single task, we believe that the method is general enough to be applied to a range of supervised tasks and source embeddings.",
        "As sophistication of unsupervised methods grows, scaling to evermore massive datasets, so will the representational power and coverage of induced word vectors.",
        "Techniques for leveraging the large amount of unsupervised data, but indirectly through word vectors, can be instrumental in cases where the data is not directly available, training time is valuable and a set of easy low-dimensional ?plug-and-play?",
        "features is desired."
      ]
    },
    {
      "heading": "8 Acknowledgements",
      "text": [
        "This work was supported in part by the NSF CDI Grant ECCS 0941561 and the NSF Graduate fellowship.",
        "The content of this paper is solely the responsibility of the authors and does not necessarily represent the official views of the sponsoring organizations.",
        "The authors would like to thank Thorsten Joachims and Bishan Yang for helpful and insightful discussions."
      ]
    }
  ]
}
