{
  "info": {
    "authors": [
      "Matt Hohensee",
      "Emily M. Bender"
    ],
    "book": "NAACL",
    "id": "acl-N12-1032",
    "title": "Getting More from Morphology in Multilingual Dependency Parsing",
    "url": "https://aclweb.org/anthology/N12-1032",
    "year": 2012
  },
  "references": [
    "acl-C08-1081",
    "acl-D07-1096",
    "acl-D07-1099",
    "acl-D07-1100",
    "acl-D07-1119",
    "acl-D07-1127",
    "acl-J08-3003",
    "acl-J93-2004",
    "acl-W06-2920",
    "acl-W06-2923",
    "acl-W06-2925",
    "acl-W06-2926",
    "acl-W06-2932",
    "acl-W06-2933",
    "acl-W09-3036",
    "acl-W09-3819",
    "acl-W10-1402",
    "acl-W10-1404",
    "acl-W10-1412"
  ],
  "sections": [
    {
      "text": [
        "2012 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, pages 315?326, Montre?al, Canada, June 3-8, 2012. c?2012 Association for Computational Linguistics Getting More from Morphology in Multilingual Dependency Parsing"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "We propose a linguistically motivated set of features to capture morphological agreement and add them to the MSTParser dependency parser.",
        "Compared to the built-in morphological feature set, ours is both much smaller and more accurate across a sample of 20 morphologically annotated treebanks.",
        "We find increases in accuracy of up to 5.3% absolute.",
        "While some of this results from the feature set capturing information unrelated to morphology, there is still significant improvement, up to 4.6% absolute, due to the agreement model."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Most data-driven dependency parsers are meant to be language-independent.",
        "They do not use any information that is specific to the language being parsed, and they often rely heavily on n-grams, or sequences of words and POS tags, to make parsing decisions.",
        "However, designing a parser without incorporating any specific linguistic details does not guarantee its language-independence; even linguistically na?",
        "?ve systems can involve design decisions which in fact bias the system towards languages with certain properties (Bender, 2011).",
        "It is often taken for granted that using linguistic information necessarily makes a system language-dependent.",
        "But it is possible to design a linguistically intelligent parser without tuning it to a specific language, by modeling at a high level phenomena which appear cross-linguistically.",
        "Such a system is still language-independent; it does not require any knowledge or modeling of specific languages, but it does use linguistic knowledge to make the most of the available data.",
        "We present modifications to an existing system, MSTParser (McDonald et al., 2006), to incorporate a very simple model of morphological agreement.",
        "These modifications improve parsing performance across a variety of languages by making better use of morphological annotations."
      ]
    },
    {
      "heading": "2 Background and related work",
      "text": []
    },
    {
      "heading": "2.1 Morphological marking of agreement",
      "text": [
        "Most languages show some morphological agreement via inflected noun, adjective, verb, and determiner forms, although the degree to which this happens varies.",
        "At one end of the spectrum are analytic, or ?morphologically impoverished?, languages.",
        "An extreme example is Chinese, which shows no inflection at all; words do not take different forms depending on features such as person or gender.",
        "English has some inflection, but is relatively morphologically poor.",
        "At the other end are synthetic or ?morphologically rich?",
        "languages such as Czech, which has, inter alia, four genders and seven cases.",
        "In synthetic languages, words which are syntactically related in certain ways must agree: e.g., subject-verb agreement for gender or determiner-noun agreement for case (Corbett, 2006).",
        "Words participating in agreement may be marked explicitly for the property in question (via affixing or other morphological changes), or may possess it inherently (with no specific affix encoding the property).",
        "Treebanks are often annotated to reflect some or all of these properties; the level of detail depends on the annotation guidelines.",
        "A sample sentence in English and Czech (Table 1) demonstrates this contrast.",
        "In Czech, the adjective and noun agree for gender, number, and case, and the noun and verb agree for person and number.",
        "In the English version, only the noun and verb agree.",
        "Agreement can be very useful for data-driven dependency parsing.",
        "A statistical parser can learn from training data that, for example, a third-person singular noun is a likely dependent of a verb marked as third-person singular.",
        "Similarly, it can learn that a determiner showing genitive case and a noun showing dative case are often not syntactically related.",
        "It is often assumed that morphological complexity correlates with degree of variation in word order.",
        "This is because synthetic languages use inflection to mark the roles of constituents, while analytic languages generally assign these roles to specific phrase structural locations.",
        "Siewierska (1998) investigated this empirically and found that it holds to a certain extent: the absence of agreement and/or case marking predicts rigid word order, though their presence is not particularly predictive of flexible word order.",
        "Many parsers rely on word order to establish dependencies, so they often perform best on languages with more rigid word order.",
        "Making use of morphological agreement could compensate for greater variation in word order and help to bring parsing performance on flexible-word-order languages up to par with that on rigid-word-order languages."
      ]
    },
    {
      "heading": "2.2 MSTParser",
      "text": [
        "The CoNLL-X (Buchholz and Marsi, 2006) and CoNLL 2007 (Nivre et al., 2007) shared tasks focused on multilingual dependency parsing.",
        "Each system was trained on treebanks in a variety of languages and predicted dependency arcs and labels for POS-tagged data.",
        "The best performers in 2006 were MSTParser (McDonald et al., 2006), which we use here, and MaltParser (Nivre et al., 2006a).",
        "MSTParser is a data-driven, graph-based parser which creates a model from training data by learning weights for arc-level features.",
        "The feature set includes combinations of the word and POS tag of the parent and child of each dependency arc; POS tags of words between the parent and child; and POS tags of the parent and child along with those of the preceding and following words.",
        "A similar feature set is conjoined with arc labels in order to perform label-ing, and an optional set of ?second-order?",
        "features includes analogous information about siblings.",
        "Morphological features for an arc are generated by iterating over each pair in the cross product of the parent and child tokens?",
        "lists of attributes.",
        "For every such pair, thirteen groups of four features each are generated.",
        "The thirteen groups represent combinations of the head and child word forms/lemmas and attributes.",
        "Each group contains subgroups distinguished by whether they use word forms or lemmas and by whether or not they encode the direction and distance of the dependency.",
        "These features are summarized in Table 2.",
        "At run time, MSTParser finds the highest-scoring parse for each sentence according to the learned feature weights.",
        "Decoding can be performed in projective or non-projective mode, depending on the type of trees desired.",
        "Projective trees are those in which every constituent (head plus all dependents) forms a complete subtree; non-projective parsing lacks this limitation."
      ]
    },
    {
      "heading": "2.3 Related work",
      "text": [
        "The organizers of the CoNLL 2007 shared task noted that languages with free word order and high morphological complexity are the most difficult for dependency parsing (Nivre et al., 2007).",
        "Most of the participants took language-independent approaches toward leveraging this complexity into better performance: generating machine learning features based on each item in a token's list of morphological attributes (Nivre et al., 2006b; Carreras et al., 2006); using the entire list as an atomic feature (Chang et al., 2006; Titov and Henderson, 2007); or generating features based on each pair of attributes in the crossproduct of the lists of a potential head and dependent (McDonald et al., 2006; Nakagawa, 2007).",
        "Language-specific uses of morphological information have included using it to disambiguate function words (Bick, 2006) or to pick out finite verbs",
        "hdLemma and dpLemma are the lemmas.",
        "hdAtt and dpAtt are the morphological attributes; hdIdx and dpIdx are their indices.",
        "dir+dist is a string encoding the direction and length of the arc.",
        "Each line represents one feature.",
        "(Carreras et al., 2006).",
        "Schiehlen and Spranger (2007) used language-specific rules to add detail to other features, such as fine-grained POS tags or lemmas.",
        "Attardi et al. (2007) modeled agreement explicitly, generating a morphological agreement feature whenever two tokens possess the same value for the same linguistic attribute.",
        "The authors note accuracy improvements of up to 0.5% for Italian and 0.8% for Catalan using a transition-based parser.",
        "A similar approach was used by Goldberg and El-hadad (2010), who improved the accuracy of their transition-based Hebrew parser by adding features for gender and number agreement in noun phrases.",
        "The potential of morphological information to improve parsing performance has been documented in numerous experiments using MaltParser and with various morphological attributes as machine learning features, on several morphologically rich languages, including: Russian (Nivre et al., 2008); Swedish (?vrelid and Nivre, 2007); Bangla, Telugu, and Hindi (Nivre, 2009); Turkish (Eryig?it et al., 2008); and Basque (Bengoetxea and Gojenola, 2010).",
        "These experiments, however, did not include any higher-level features such as agreement.",
        "Goldberg and Elhadad (2009) found that using morphological features increased the accuracy of MSTParser on Hebrew only when the morphological annotations were gold-standard; automatic annotations decreased accuracy, although MaltParser showed improvement with both gold and automatic annotations.",
        "The accuracy of MaltParser on Arabic was improved by different types of morphological features depending on whether gold or automatic annotations were used (Marton et al., 2010).",
        "As far as we can tell, no language-independent approaches to utilizing morphological data thus far have taken advantage of agreement specifically.",
        "We take a linguistically informed approach, maintaining language-independence, by explicitly modeling agreement between head and dependent morphology."
      ]
    },
    {
      "heading": "3 Methodology",
      "text": []
    },
    {
      "heading": "3.1 Modifications to parser",
      "text": [
        "Our approach builds on the observation that there are two kinds of information marked in morphology: symmetric, recorded on both head and depen"
      ]
    },
    {
      "heading": "ID TOKEN CPOS MORPH HEAD REL Gloss",
      "text": [
        "dent, and asymmetric, marked on only one or the other.",
        "Symmetric information provides a natural, effectively non-lossy type of back-off that parsers can take advantage of; all that matters is whether the information on the head and dependent match.1 Furthermore, we don't need to know ahead of time which types of morphological information are symmetric.",
        "This is extracted from the annotations.",
        "In order to take advantage of this property of natural language, we devised a set of features which model agreement.",
        "These allow the learner to operate at a higher level, using agreement itself as a feature rather than having to discover agreement and forming generalizations about whether tokens which agree (or disagree) in various ways are related.",
        "Since agreement appears cross-linguistically, such features are applicable to a diverse set of languages.",
        "Since MSTParser breaks down every parse into a set of arcs, our features are defined at the arc level.",
        "Each arc is a head and dependent pair, and each of those tokens has a list of morphological features in the normalized form attribute=value.",
        "We compare these lists and add, for every attribute which is present in both, either an agreement or a disagreement feature, depending on whether the head and dependent have the same value for that attribute.",
        "This feature encapsulates the attribute, but not the value, as well as the coarse POS tags of the head and the dependent.",
        "If an attribute is present in only one of 1If an attribute is marked on both head and dependent and the value matches, the specific value should not affect the probability or possibility of the dependency relationship.",
        "If the same attribute is marked on both elements but is independent (not a matter of agreement) we risk losing information, but we hypothesize that such information is unlikely to be very predictive.",
        "the lists, we add a feature encapsulating whether the token is the head or the dependent, the single morphological feature (attribute and value), and the two coarse POS tags.",
        "We also generate both types of features conjoined with the arc label.",
        "Like the original feature set, we include only first-order morphological features.",
        "See Table 3 for a summary.",
        "A sample sentence in a simplified CoNLL format and the features it would trigger are shown in Table 4.2 We hypothesize that these agreement features will function as a type of back-off, allowing the parser to extract more information from the morphological marking.",
        "For instance, they can capture case agreement between a determiner and noun.",
        "We expect that this would lead to higher parsing accuracy, especially when training on smaller datasets, where morphological data might be sparse.",
        "We made a slight modification to the parser so that underscores used in the treebanks to indicate the absence of morphological annotation for a token were not themselves treated as morphological information.",
        "This was necessary to ensure that all feature configurations performed identically on treebanks with no morphological information.",
        "Depending on the treebank, this increased or decreased the performance of the system slightly (by less than 0.5%)."
      ]
    },
    {
      "heading": "3.2 Data collection and preparation",
      "text": [
        "We gathered a range of dependency treebanks, representing as many language families as possible (Table 5).",
        "Many of these used the CoNLL shared task treebank format, so we adopted it as well, and con-2A more complete description of the system, as well as source code, can be found in (Hohensee, 2012).",
        "morphological attributes per token, and reference for each treebank used, ordered by average number of attributes.",
        "verted the other treebanks to the same.",
        "It includes for each token: position in the sentence; the token itself; a lemma (not present in all datasets); a coarse POS tag; a fine POS tag; a list of morphological features; the token's head; and the label for the dependency relation to that head.3 We retained all punctuation and other tokens in the treebanks.",
        "The POS tagsets used in the treebanks varied widely.",
        "We normalized the coarse tags to the universal twelve-tag set suggested by Petrov et al. (2011), in order to ensure that every treebank had coarse tags for use in the agreement features, and to make the features easier to interpret.",
        "It is unlikely that information was lost in this process: for treebanks with one set of tags, information was added, and for those with two, the universal tags aligned closely with the coarse tags already in the data.",
        "Two of the treebanks we used included no morphological information.",
        "We included the Penn Chinese Treebank as a representative of analytic lan",
        "Treebank, converted to dependency trees.",
        "For this data we generated morphological annotations based on fine POS tags, consisting of person and number information for nouns and verbs, and person, number, and case information for pronouns.",
        "The German NEGRA corpus includes detailed morphological annotations for about 3,400 sentences (of 20,600), and we used only that portion.",
        "Note that the amount of morphological information present in any given treebank is a function of the morphological properties of the language as well as the annotation guidelines: annotations do not necessarily encode all of the morphological information which is actually marked in a language.",
        "Furthermore, the presence of a morphological feature does not imply that it participates in an agreement relationship; it merely encodes some piece of morphological information about the token.",
        "Finally, annotation guidelines vary as to whether they provide for the explicit marking of morphological properties which are inherent to a lemma (e.g., gender on nouns) and not marked by separate affixes.",
        "Treebank using the Penn2Malt converter: http://w3.msi.",
        "vxu.se/?nivre/research/Penn2Malt.html.",
        "We normalized all morphological annotations to the form attribute=value (e.g., case=NOM).",
        "For treebanks that provided values only, this involved adding attribute names, obtained from the annotation guidelines.",
        "The attributes person, number, gender, and case appeared often; also included in some data were verb tense, adjective degree, and pronoun type (e.g., personal, possessive, or reflexive).",
        "We normalized all features in the data, regardless of whether they participate in any agreement relations.",
        "Many of the treebanks include data from multiple domains; to minimize the effects of this, we randomized the order of sentences in each treebank."
      ]
    },
    {
      "heading": "3.3 Experimental setup",
      "text": [
        "All experiments were performed using 5-fold cross-validation.",
        "Reported accuracies, run times, and feature counts are averages over all five folds.",
        "We ran experiments on multiple cross-validation dataset sizes in order to assess the performance of our model when trained on different amounts of data.",
        "For each treebank, we report results on a ?reference size?",
        ": 9,000 sentences or the largest size available (for treebanks of less than 9,000 sentences).",
        "For evaluation, we used the module built into MSTParser.",
        "We focused on the unlabeled accuracy score (percentage of tokens with correctly assigned heads, ignoring labels).",
        "We also looked at labeled accuracies, but found they displayed trends very similar, if not identical, to the unlabeled scores."
      ]
    },
    {
      "heading": "4 Results",
      "text": [
        "We ran the system on each treebank at all dataset sizes in projective and non-projective modes, using no morphological features.",
        "For each language, subsequent tests used the algorithm which performed better (or non-projective in the case of a tie)."
      ]
    },
    {
      "heading": "4.1 Overall results",
      "text": [
        "We ran the parser on each treebank with each of four feature configurations: one with no morphological features (no-morph); one with the original morphological features (orig; Table 2); one using the agreement features (agr; Table 3); and one using both feature sets (agr+orig).",
        "Table 6 displays the unlabeled accuracy, run time, and feature counts when parsing each treebank using each feature configuration at the reference size, with the highest accuracy highlighted.",
        "Excluding Chinese, agr generated the best performance in all but two cases, outperforming orig by margins ranging from 0.8% (Arabic) to 5.3% (Latin) absolute.",
        "In the other cases, agr+orig outperformed agr slightly.",
        "In all cases, the total number of machine learning features was approximately the same for no-morph and agr, and for orig and agr+orig, because the number of morphological features generated by orig is very large compared to the number generated by agr.",
        "Performance was noticeably faster for the two smaller feature configurations.",
        "Figure 1 shows the error reduction of orig, agr, and agr+orig relative to no-morph, at the reference size.",
        "Despite its relative lack of morphological inflection, English shows a fairly high error reduction, because parsing performance on English was already high.",
        "Similarly, error reduction on some of the morphologically rich languages is lower because baseline performance was low.",
        "Calculating the correlation coefficient (Pearson's r) between average morphological attributes per token and error reduction gives r = 0.608 for orig, r = 0.560 for agr, and r = 0.428 for agr+orig, with p < 0.01 for the first two and p < 0.10 for the last, indicating moderate correlations for all feature sets.",
        "The strength of these correlations depends on several factors.",
        "Languages differ in what information is marked morphologically, and in number of agreement relationships.",
        "Annotation schemes vary in what morphological information they encode, and in how relevant that information is to agreement.",
        "Some morphologically complex languages have rigid word order, leading to better performance with no morphological features at all, and limiting the amount of improvement that is possible.",
        "Finally, it is possible that a stronger correlation is obscured by other effects due to feature set design, as we will find later."
      ]
    },
    {
      "heading": "4.2 Performance vs. dataset size",
      "text": [
        "Figures 2 presents unlabeled accuracy when parsing Czech with the orig and agr configurations.",
        "Improvement with agr is roughly uniform across all dataset sizes; this was the general trend for all treebanks.",
        "This is somewhat unexpected; we had predicted that the agreement features would be more helpful at smaller dataset sizes."
      ]
    },
    {
      "heading": "4.3 Gold vs. automatic tags",
      "text": [
        "The Hebrew treebank includes both automatically generated and gold standard POS and morphological annotations.",
        "In order to test how sensitive the agreement features are to automatically predicted morphological information, tests were run on both versions at the reference size.",
        "These results are not directly comparable to those of Goldberg and Elhadad (2009), because of the parser modifications, POS tag normalization, and cross-validation described earlier.",
        "Comparing results qualitatively, we find less sensitivity to the automatic tags overall, and that the orig features improve accuracy even when using automatic tags.",
        "Results appear in Table 7.",
        "Using the automatic data affects all feature sets negatively by 2.1% to 2.9%.",
        "Since the no-morph parser was affected the most, it appears that this decrease is due largely to errors in the POS tags, rather than the morphological annotations.",
        "The orig features compensate for this slightly (0.2%), and the agr features more (0.8%); this indicates that including even automatic morphological information can compensate for incorrect POS tags, and that the agr feature configuration is the most robust when given predicted tags."
      ]
    },
    {
      "heading": "4.4 PPL feature",
      "text": [
        "Examining the feature weights from the first cross-validation fold when running the agr feature configuration on the Czech dataset indicated that 323 of the 1,000 highest-weighted features are agreement features.",
        "Of these, 79 are symmetric (?agrees?",
        "or ?disagrees?)",
        "agr features, and 244 asymmetric.",
        "This was unexpected, as the symmetric features would seem to be more useful, and it suggested that the labeled asymmetric agr features might be important for reasons other than their modeling of morphological information.",
        "Careful analysis of the MSTParser feature set revealed that it does not include a feature which incorporates head POS, dependent POS, and dependency label.",
        "We hypothesized that the labeled asymmetric agr features were highly ranked",
        "because they capture these three arc features, not because they include with morphological information.",
        "To test this, we added a single feature template to MSTParser which encapsulates head POS, dependent POS, and dependency label (the POS-POSlabel, or PPL, feature).",
        "Running a subsequent experiment on the Czech data and looking at feature weights from the same cross-validation fold, 278 of the 1,000 highest-weighted features were PPL features, and 187 were asymmetric agr features.",
        "This indicated that the improvement seen with agr features was indeed due partly to their inclusion of features combining label and head and dependent POS.",
        "All feature configurations were run on all treebanks with the PPL feature included; results appear in Table 8.",
        "Performance increases from orig to agr are generally smaller, with a maximum of 4.6% absolute.",
        "This is seen especially on languages with less morphological information, such as English and Hebrew; this indicates that for those languages, most of the previous improvement was due not to agreement modeling, but to the PPL effect.",
        "Calculating Pearson's r between morphological features per token and the new error reduction data gives a stronger correlation coefficient of 0.748 for agr, with p < 0.01, demonstrating that improvement due solely to agreement modeling correlates strongly with quantity of morphological information.",
        "The earlier error reduction data were likely polluted by improvement due to capturing the PPL information.",
        "Correlation for the other feature configurations is still moderate (0.506 with p < 0.02 for orig and 0.621 with p < 0.01 for agr+orig)."
      ]
    },
    {
      "heading": "5 Future work",
      "text": [
        "In future work, we plan to experiment with more careful normalization of treebanks.",
        "For instance, if an adjective can agree with either a masculine or a feminine noun, annotating it with both gen=M",
        "number of features for orig, agr, and agr+orig are given as percent change relative to no-morph.",
        "and gen=F (rather than gen=X) would ensure that agreement with a noun of either gender would be captured by our features.",
        "Furthermore, we may experiment with filtering morphological information based on part-of-speech, on attribute, or on whether the attribute participates in any agreement relationships.",
        "We also intend to perform feature selection on the original feature set, and investigate the importance of labeled morphological features, which are included in agr but not in orig.",
        "Finally, we plan to develop metrics to measure the degree of word order flexibility in a treebank, in order to explore the extent to which it correlates with the degree of improvement achieved by our system."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "We developed a simple, language-independent model of agreement to better leverage morphological data in dependency parsing.",
        "Testing on treebanks containing varying amounts of morphological information resulted in substantial improvements in parsing accuracy while reducing feature counts and run times significantly.",
        "Although originally intended to compensate for lower accuracy on morphologically rich languages, the model improved performance on all treebanks with any morphological information.",
        "We acknowledge that because our model was tested on treebanks which differ widely in annotation guidelines, variables such as the amount of morphological information included and the treatment of non-projective parses and coordination could affect parsing performance.",
        "We did not delve into these factors.",
        "However, we believe this is part of the strength of the approach: we were able to achieve performance gains without any detailed knowledge of the languages and treebanks used.",
        "We hope these results will encourage similarly linguistically motivated design in future systems.",
        "This case study provides strong evidence that incorporating linguistic knowledge into NLP systems does not preclude language independence, and indeed may enhance it, by leveling performance across typologically differing languages."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We would like to thank everyone who assisted us in gathering treebanks, particularly Maite Oronoz and her colleagues at the University of the Basque Country and Yoav Goldberg, as well as three anonymous reviewers for their comments."
      ]
    }
  ]
}
