{
  "info": {
    "authors": [
      "Hermann Moisl"
    ],
    "book": "Ninth Meeting of the ACL Special Interest Group in Computational Morphology and Phonology",
    "id": "acl-W07-1312",
    "title": "Data Nonlinearity in Exploratory Multivariate Analysis of Language Corpora",
    "url": "https://aclweb.org/anthology/W07-1312",
    "year": 2007
  },
  "references": [
    "acl-W95-0110"
  ],
  "sections": [
    {
      "heading": null,
      "text": [
        "Linear distance",
        "Nonlinear distance",
        "a",
        "Montreal",
        "\\ /Hong Kong",
        "b",
        "Montreal/^~^\\\\",
        "V /Hong Kong",
        " – ",
        "V2",
        "o",
        "Linear",
        "300 00-",
        "o",
        "ssR",
        "26682.00",
        "ü",
        "Standard Error",
        "20.74",
        "150.00-",
        "c",
        "Q",
        "Quadratic",
        "8&",
        "ssR",
        "26622.40",
        "1 co .oc-",
        "0",
        "Standard Error",
        "20.89",
        "se .00-",
        "Cubic",
        "- Qu«tatic",
        " – CüÜC",
        "ssR",
        "26598.20",
        "ÜO0-",
        "Standard error",
        "21.05",
        "I 1",
        "MM 15000",
        "1",
        "KO 00",
        "1 1",
        "300,00 150 AO",
        "100.00-",
        "Linear",
        "80.00-",
        "o",
        "SSR 53703.43",
        "o",
        "a",
        "Standard Error",
        "29.67",
        "eo.oo-",
        "o o o c",
        "S",
        "Quadratic",
        "Q s",
        "SSR 53496.58",
        "40.00-",
        ":%",
        "Standard Error",
        "29.86",
        "X / r.",
        "Cubic",
        "20.00-",
        "' A °",
        "<■* o o",
        "QQ",
        "--Quadratic",
        "SSR 38880.40",
        "0.00-",
        "- – Cubic",
        "Standard error",
        "25.67",
        "I 1",
        "100.00 isoon",
        ";,:„:,,:,",
        "1",
        "2SÛ.00",
        "V1",
        "1 1",
        "3ÜÜ.ÜÜ 250 on"
      ]
    },
    {
      "heading": "3.3 Linear and nonlinear analysis of the NECTE data",
      "text": [
        "Moisi et al.",
        "(2006) analyzed the NECTE data with what is probably the most widely used of the linear exploratory methods: hierarchical cluster analysis (Everitt et al., 2001).",
        "This is actually a class of methods each of which defines clusters differently, but all of which represent cluster structure as nested constituency trees.",
        "Infamously and unsurprisingly, given that each uses a different definition of what constitutes a cluster-the variant methods can and often do assign different tree structures to the same data, and it is not usually clear which is to be preferred (Everitt et al., 2001, ch.",
        "4).",
        "In the NECTE case, however, a range of variants (single link, complete link, average link, Ward's Method) converged on a stable structure of four main clusters exemplified by the Ward tree shown in figure 6.",
        "When interpreted in terms of the social data that NECTE provides for the speakers, a clear correlation between phonetic usage and social factors emerged.",
        "The main distinction is between middle class, well educated speakers from",
        "Newcastle on the north side of the river Tyne, labelled N, and working class, less well educated speakers from Gateshead on the south side of the Tyne, labelled G. The Gateshead speakers are categorized into G2 (exclusively male), and Gl (mainly through not exclusively female); Gl is subcategorized into Gla (working class males and females) and Gib (males and females with relatively higher socioeconomic status).",
        "Moisl and Maguire (2007) subsequently used the centroids of these clusters to identify the phonetic features most characteristic of each.",
        "Three sets of vowels were found to be of particular importance.",
        "Although all of these had been commented on before, their relative (and cumulative) sociolinguistic importance had hitherto escaped attention.",
        "They are:",
        "• various types of [a].",
        "• [o:] and [a:], which correspond to RP [au], and are found in words of the GOAT lexical set as defined by Wells (1982:1467).",
        "[ai], and are found in words belonging to the PRICE lexical set as defined by Wells (1982:149-50).",
        "For nonlinear analysis the self-organizing map, or SOM, was selected from among the various available nonlinear exploratory methods because it has been successfully used in a very wide range of applications (Kaski et al., 1998; Oja et al., 2001).",
        "The standard SOM (Kohonen, 2001) projects the topology of a data manifold in a space of arbitrary dimensionality n onto a two-dimensional lattice, where the structure of the manifold can be visually inspected.",
        "It does this by partitioning the vectors on the manifold surface into a Voronoi tesselation (Aurenhammer and Klein, 2000), thereby assigning all the data vectors within a defined topological neighborhood to the same cell of the tesselation, as shown in figure 7."
      ]
    },
    {
      "heading": "Discussion",
      "text": [
        "Associated with each speakei"
      ]
    },
    {
      "heading": "InKnl ii iln /ill nV> a11711 tlint fm^inlr^t *'i",
      "text": [
        "Natural La"
      ]
    }
  ]
}
