{
  "info": {
    "authors": [
      "Michael Poprat",
      "Elena Beisswanger",
      "Udo Hahn"
    ],
    "book": "Software Engineering, Testing, and Quality Assurance for Natural Language Processing",
    "id": "acl-W08-0507",
    "title": "Building a BioWordNet Using WordNet Data Structures and WordNet’s Software Infrastructure–A Failure Story",
    "url": "https://aclweb.org/anthology/W08-0507",
    "year": 2008
  },
  "references": [
    "acl-N01-1008",
    "acl-P07-1086",
    "acl-W07-1028"
  ],
  "sections": [
    {
      "text": [
        "Building a BioWordNet by Using WordNet's Data Formats and WordNet's Software Infrastructure – A Failure Story",
        "Michael Poprat Elena Beisswanger Udo Hahn",
        "Jena University Language & Information Engineering (Julie) Lab Friedrich-Schiller-Universität Jena D-07743 Jena, Germany",
        "{poprat,beisswanger,hahn}@coling-uni-jena.de",
        "In this paper, we describe our efforts to build on WordNet resources, using WordNet lexical data, the data format that it comes with and WordNet's software infrastructure in order to generate a biomedical extension of WordNet, the BioWordNet.",
        "We began our efforts on the assumption that the software resources were stable and reliable.",
        "In the course of our work, it turned out that this belief was far too optimistic.",
        "We discuss the stumbling blocks that we encountered, point out an error in the WordNet software with implications for research based on it, and conclude that building on the legacy of Word-Net data structures and its associated software might preclude sustainable extensions that go beyond the domain of general English."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "WordNet (Fellbaum, 1998) is one of the most authoritative lexical resources for the general English language.",
        "Due to its coverage - currently more than 150,000 lexical items - and its lexicological richness in terms of definitions (glosses) and semantic relations, synonymy via synsets in particular, it has become a de facto standard for all sorts of research that rely on lexical content for the English language.",
        "Besides this perspective on rich lexicological data, over the years a software infrastructure has emerged around WordNet that was equally approved by the NLP community.",
        "This included, e.g., a lexicographic file generator, various editors and visualization tools but also meta tools relying on properly formated WordNet data such as a library of similarity measures (Pedersen et al., 2004).",
        "In numerous articles the usefulness of this data and software ensemble has been demonstrated (e.g., for word sense disambiguation (Patwardhan et al., 2003), the analysis of noun phrase conjuncts (Hogan, 2007), or the resolution of coreferences (Harabagiuetal.,2001)).",
        "In our research on information extraction and text mining within the field of biomedical NLP, we similarly recognized an urgent need for a lexical resource comparable to WordNet, both in scope and size.",
        "However, the direct usability of the original WordNet for biomedical NLP is severely hampered by a (not so surprising) lack of coverage of the life sciences domain in the general-language English WordNet as was clearly demonstrated by Burgun and Bodenreider (2001).",
        "Rather than building a BioWordNet by hand, as was done for the general-language English WordNet, our idea to set up a WoRDNET-style lexical resource for the life sciences was different.",
        "We wanted to link the original WordNet with various biomedical terminological resources vastly available in the life sciences domain.",
        "As an obvious candidate for this merger, we chose one of the major high-coverage umbrella systems for biomedical ontologies, the Open Biomedical Ontologies (OBO).",
        "These (currently) over 60 OBO ontologies provide domain-specific knowledge in terms of hierarchies of classes that often come with synonyms and textual definitions for lots of biomedical sub-domains (such as genes, proteins, cells, sequences, etc.).",
        "Given these resources and their software infrastructure, our plan was to create a biomedically focused lexicological resource, the BioWordNet, whose coverage would exceed that of any of its component resources in a so far unprecedented manner.",
        "Only then, given such a huge combined resource advanced NLP tasks such as anaphora resolution seem likely to be tackled in a feasible way (Hahn et al., 1999; Castano et al., 2002; Poprat and Hahn, 2007).",
        "In particular, we wanted to make direct use of available software infrastructure such as the library of similarity metrics without the need for reprogramming and hence foster the reuse of existing software as is.",
        "We began our efforts on the assumption that the WordNet software resources were stable and reliable.",
        "In the course of our work, it turned out that this belief was far too optimistic.",
        "We discuss the stumbling blocks that we encountered, point out an error in the WordNet software with implications for research based on it, and conclude that building on the legacy of WordNet data structures and its associated software might preclude sustainable extensions that go beyond the domain of general English.",
        "Hence, our report contains one of the rare failure stories (not only) in our field."
      ]
    },
    {
      "heading": "2. Software Around WordNet Data",
      "text": [
        "While the stock of lexical data assembled in the WordNet lexicon was continuously growing over time, its data format and storage structures, the so-called lexicographic file, by and large, remained unaltered (see Section 2.1).",
        "In Section 2.2, we will deal with two important software components with which the lexicographic file can be created and browsed.",
        "over the years, together with the continuous extension of the WordNet lexicon, a lot of software tools have been developed in various programming languages allowing browsing and accessing Word-Net as well as calculating semantic similarities on it.",
        "We will discuss the most relevant of these tools in Section 2.3.",
        "2.1 Lexicon Organization of WordNet and Storage in Lexicographic Files",
        "At the top level, WordNet is organized according to four parts of speech, viz. noun, verb, adjective and adverb.",
        "The most recent version 3.0 covers more than 117,000 nouns, 11,500 verbs, 21,400 adjectives and 4,400 adverbs, interlinked by lexical relations, mostly derivations.",
        "The basic semantic unit for all parts of speech are sets of synonymous words, so-called synsets.",
        "These are connected by different semantic relations, imposing a thesauruslike structure on WordNet.",
        "In this paper, we discuss the organization of noun synsets in WordNet only, because this is the relevant part of Word-Net for our work.",
        "There are two important semantic relation types linking noun synsets.",
        "The hyper-nym / hyponym relation on which the whole Word-Net noun sense hierarchy is built links more specific to more general synsets, while the meronym / holonym relation describes partonomic relations between synsets, such as part of the whole, member of the whole or substance of the whole.",
        "From its very beg inning, \"WordNet was built and curated manually.",
        "Lexicon developing experts introduced new lexical entries into WordNet, grouped them into synsets and defined appropriate semantic and lexical relations.",
        "Since WordNet was intended to be an electronic lexicon, a data representation format had to be defined as well.",
        "When the WordNet project started more than two decades ago, markup languages such as SGML or XML were unknown.",
        "Because of this reason, a rather idiosyncratic, fully text-based data structure for these lexicographic files was defined in a way to be readable and editable by humans – and survived until to-day.",
        "This can really be considered as an outdated legacy given the fact that the WordNet community has been so active in the last years in terms of data collection, but has refrained from adapting its data formats in a comparable way to today's specification standards.",
        "Very basically,each line in the lexicographic file holds one synset that is enclosed by curly brackets.",
        "Take as an example the synset for \"monkey\":",
        "{ monkey, primate,® (any of various long-tailed primates (excluding the prosimians)) }",
        "Within the brackets at the first position synonyms are listed, separated by commas.",
        "In the example, there is only one synonym, namely \"monkey\".",
        "The synonyms are followed by semantic relations to other synsets, if available.",
        "In the example, there is only one hypernym relation (denoted by \"@\") pointing to the synset \"primate\".",
        "The final position is reserved for the gloss of the synset encapsulated in round brackets.",
        "It is important to notice that there are no identifiers for synsets in the lexicographic file.",
        "Rather, the string expressions themselves serve as identifiers.",
        "Given the fundamental idea of synsets all words within a synset mean exactly the same in a certain context - it is sufficient to relate one word in the synset in order to refer to the whole synset.",
        "Still, there must be a way to deal with homonyms, i.e., lexical items which share the same string, but have different meanings.",
        "WordNet's approach to distinguish different senses of a word is to add numbers from 0 to 15, called lexical identifiers.",
        "Hence, in WordNet, a word cannot be more than 16-fold ambiguous.",
        "This must be kept in mind when one wants to build a WordNet for highly ambiguous sublanguages such as the biomedical one.",
        "To guarantee fast access to the entries and their relations, an optimized index file must be created.",
        "This is achieved through the easy-to-use Grind software which comes with WordNet.",
        "It simply consumes the lexicographic file(s) as input and creates two plain-text index files, namely data and index.",
        "Furthermore, there is a command line tool, WN, and a graphical browser, WNB, for data visualization that require the specific index created by Grind (as all the other tools that query the WordNet data do as well).",
        "These tools are the most important (and only) means of software support for WordNet creation by checking the syntax as well as allowing the (manual) inspection of the newly created index.",
        "Due to the tremendous value of WordNet for the NLP and IR community and its usefulness as a resource for coping with problems requiring massive amounts of lexico-semantic knowledge, the software-developing community was and continues to be quite active.",
        "Hence, in support of WordNet several APIs and software tools were released that allow accessing, browsing and visualizing Word-Net data and measuring semantic similarity on the base of the WordNet's lexical data structures.",
        "The majority of these APIs are maintained well and kept up to date, such as JAWS and JWNL,and enable connecting to the most recent version of WordNet.",
        "For the calculation of various similarity measures, the Perl library Word-Net:: Similarity initiated and maintained by Ted Pedersen can be considered as a de facto standard and has been used in various experimental settings and applications.",
        "This availability of well-documented and well-maintained software is definitely a strong argument to rely on WordNet as a powerful lexico-semantic knowledge resource."
      ]
    },
    {
      "heading": "3. The BioWordNet Initiative",
      "text": [
        "In this section, we describe our approach to extend WordNet towards the biomedical domain by incorporating terminological resources from the oBo collection.",
        "The most obvious problems we faced were to define a common data format and to map non-compliant data formats to the chosen one.",
        "oBo is a collection of publicly accessible biomedical ontologies.",
        "They cover terms from many biomedical subdomains and offer structured, domain-specific knowledge in terms of classes (which often come with synonyms and textual definitions) and class hierarchies.",
        "Besides the hierarchy-defining relation is-a, some OBO ontologies provide",
        "WordNet Index",
        "i WordNet Browser 1 j Similarity Measuring additional semantic relation types such as sequence-ofor develops-from to express even more complex and finer-grained domain-specific knowledge.",
        "The ontologies vary significantly in size (up to 60,000 classes with more than 150,000 synonyms), the number of synonyms per term and the nature of terms.",
        "The oBo ontologies are available in various formats including the OBO flat file format, XML and OWL.",
        "We chose to work with the OWL version for our purpose, since for the OWL language also appropriate tools are available facilitating the extraction of particular information from the ontologies, such as taxonomic links, labels, synonyms and textual definitions of classes.",
        "Our plan was to construct a BioWordNet by converting, in the first step, the OBO ontologies into a WordNet hierarchy of synsets, while keeping to the WordNet lexicographic file format, and building a WordNet index.",
        "As a preparatory step, we defined a mapping from the ontology to WordNet items as shown in Table 1.",
        "The three-stage conversion approach is depicted in Figure 1.",
        "First, domain specific terms and tax-",
        "Table 1: Mapping between items from OBO and from BioWordNet (C and Cj denote ontology classes, Sj and Sj the corresponding BioWordNet synsets)",
        "onomic links between terms were extracted separately from each of the oBo ontologies.",
        "Then the extracted data was converted according to the syntax specifications of WordNet's lexicographic file.",
        "Finally for each of the converted ontologies the WoRDNET-specific index was built using Grind.",
        "Following this approach we ran into several problems, both regarding the WordNet data structure and the WoRDNET-related software that we used for the construction of the BioWordNet.",
        "Converting the oBo ontologies turned out to be cumbersome, especially the conversion of the ChEBI ontology (long class names holding many special characters) and the NCI thesaurus (large number of classes and some classes that also have a large number of subclasses).",
        "These and additional problems will be addressed in more detail in Section 4.",
        "OBO ontology",
        "BioWordNet",
        "ontology class",
        "synset",
        "class definition",
        "synset gloss",
        "class name",
        "word in synset",
        "synonym of class name",
        "word in synset",
        "Ci is-ci Cj",
        "Cj has-subclass Ci",
        "Si hyponym of Sj Sj hypernym of <Sj",
        "4 Problems with WordNet's Data Format and Software Infrastructure",
        "We here discuss two types of problems we found for the data format underlying the WordNet lexicon and the software that helps building a Word-Net file and creating an index for this file.",
        "First, WordNet's data structure puts several restrictions on what can be expressed in a WordNet lexicon.",
        "For example, it constrains lexical information to a fixed number of homonyms and a fixed set of relations.",
        "Second, the data structure imposes a number of restrictions on the string format level.",
        "If these restrictions are violated the WordNet processing software throws error messages which differ considerably in terms of informativeness for error tracing and detection or even do not surface at all at the lexicon builder's administration level.",
        "The syntax on which the current WordNet lexicographic file is based imposes severe limitations on what can be expressed in WordNet.",
        "Although these limitations might be irrelevant for representing general-language terms, they do affect the construction of a WoRDNET-like resource for biomedicine.",
        "To give some examples, the WordNet format allows a 16-fold lexical ambiguity only (lexical IDs that are assigned to ambiguous words are restricted to the numbers 0-15, see Section 2).",
        "This forced us to neglect some of the OBO ontology class names and synonyms that were highly ambiguous.",
        "Furthermore, the OBO ontologies excel in a richer set of semantic relations than WordNet can offer.",
        "Thus, a general problem with the conversion of the OBO ontologies into WordNet format was that except from the taxonomic is-a relation (which corresponds to the WordNet hyponym relation) and the part-of relation (which corresponds to the WordNet meronym relation) all remaining OBO-specific relations (such as develops-from, sequence-of, variant-of and position-of) could not be represented in the BioWordNet.",
        "The structure of WordNet neither contains such relations nor is it flexible enough to include them so that we face a systematic loss of information in BioWordNet compared to the original OBO ontologies.",
        "Although these restrictions are well-known, their removal would require extending the current Word-Net data structure fundamentally.",
        "This, in turn, would probably necessitate a full reprogramming of all of WoRDNET-related software.",
        "When we tried to convert data extracted from the OBO ontologies into WordNet's lexicographic file format (preserving its syntactic idiosyncrasies for the sake of quick and straightforward reusability of software add-ons), we encountered several intricacies that took a lot of time prior to building a valid lexicographic file.",
        "First, we had to replace 31 different characters with unique strings such as \"(\" with \"-LRB-\" and \"+\" with \"-PLU-\" before Grind was able to process the lexicographic file.",
        "The reason is that many of such special characters occurring in domain specific terms, especially in designators of chemical compounds such as \"methyl ester 2,10-dichloro-12H-dibenzo(d,g)(1,3)dioxocin-6-carboxylic acid\" (also known as \"treloxinate \" with the CAS registry number 30910-27-1), are reserved symbols in the WordNet data formatting syntax.",
        "If these characters are not properly replaced Grind throws an exact and useful error message (see Table 2, first row).",
        "Second, we had to find out that we have to replace all empty glosses by at least one whitespace character.",
        "Otherwise, Grind informs the user in terms of a rather cryptic error message that mentions the position of the error though not its reason (see Table 2, second row).",
        "Third, numbers at the end of a lexical item need to be escaped.",
        "In WordNet, the string representation of an item is used as its unique identifier.",
        "To distinguish homonyms (words with the same spelling but different meaning, such as \"cell\" as the functional unit of all organisms, on the one hand, and as small compartment, on the other hand) according to the WordNet format different numbers from 0 to 15 (so-called lexical IDs) have to be appended",
        "Table 2: Overview of the different kinds of problems that we encountered when creating a BioWordNet keeping to the WordNet data structure and the corresponding software.",
        "Each problem description is followed by a sample error message that Grind had thrown, a statement about how useful the error message was to detect the source of the error and a possible solution for the problems, if available.",
        "The last row documents a special experience with data viewers for data from the NCI thesaurus.",
        "to the end of each homonym.",
        "If in a lexicographic file two identical strings occur that have not been assigned different lexical identifiers (it does not matter whether this happens within or across synsets) Grind emits an error message that mentions both, the position and the lexical entry which caused this error (cf. Table 2, third row).",
        "Numbers that appear at the end of a lexical item as an integral part of it (such as \"2 \" in \"IL2 \", a special type of cytokine (protein)) have to be escaped in order to avoid their misinterpretation as lexical identifiers.",
        "This, again, is a well-documented shortcoming of WordNet's data specification rules.",
        "In case such numbers are not escaped prior to presenting the lexicographic file to Grind the word closing numbers are always interpreted as lexical identifiers.",
        "Closing numbers that exceed the number 15 cause Grind to throw an informative error message (see Table 2, fourth row).",
        "In addition to the more or less documented restrictions of the WordNet data format mentioned above we found additional restrictions that lack documentation up until now, to the best of our knowledge.",
        "First, it seems that the length of a word is restricted to 425 characters.",
        "If a word in the lexicographic file exceeds this length, Grind is not able to create an index and throws an empty error message, namely the memory error \"segmentation fault\" (cf. Table 2, fifth row).",
        "As a consequence of this restriction, some very long ChEBI class names could not have been included in the BioWordNet.",
        "Second, it seems that synsets are only allowed to group up to 988 direct hyponymous synsets.",
        "Again, Grind is not able to create an index, if this restriction is not obeyed and throws the null memory error message \"segmentation fault\" (cf. Table 2, sixth row).",
        "An NCI thesaurus class that had more than 998 direct subclasses thus could not have been included in the BioWordNet.",
        "Problem Description",
        "Sample Error Message",
        "Usefulness of Error Message",
        "Problem Solution",
        "illegal use of key characters",
        "noun.cell, line 7: Illegal character %",
        "high",
        "replace illegal characters",
        "empty gloss",
        "sanity error - actual pos 2145 != assigned pos 2143!",
        "moderate",
        "add gloss consisting of at least one whitespace character",
        "homonyms (different words",
        "noun.rex, line 5: Syn-",
        "high",
        "distinguish word senses by",
        "with identical strings)",
        "onym \"electrochemical reaction \" is not unique in file",
        "adding lexical identifiers (use the numbers 1-15)",
        "lexical ID larger than 15",
        "noun.rex, line 4: ID must be less than 16: cd25",
        "high",
        "quote trailing numbers of words, only assign lexical identifiers between 1-15, omit additional word senses",
        "word with more than 425",
        "Segmentation fault (core",
        "low",
        "omit words that exceed the max-",
        "characters",
        "dumped)",
        "imal length of 425 characters",
        "synset with more than 998",
        "Segmentation fault (core",
        "low",
        "omit some hyponymous synsets",
        "direct hyponymous synsets",
        "dumped)",
        "or introduce intermediate synsets with a limited number of hyponymous synsets",
        "no query result though the",
        "none",
        "-",
        "not known",
        "synset is in the index, access",
        "software crashes",
        "Due to insufficient documentation and utterly general error messages the only way to locate the problem causing the \"segmentation fault\" errors was to examine the lexicographic files manually.",
        "We had to reduce the number of synset entries in the lexicographic file, step by step, in a kind of trial and error approach until we could resolve the problem.",
        "This is, no doubt, a highly inefficient and time consuming procedure.",
        "More informative error messages of Grind would have helped us a lot.",
        "Software and Third-Party Components",
        "After getting rid of all previously mentioned errors, valid index files were compiled.",
        "It was possible to access these index files using the WordNet querying tools wn and wnb, indicating the index files were 'valid'.",
        "However, when we tried to query the index file that was generated by Grind for the NCI thesaurus we got strange results.",
        "While wn did not return any query results, the browser WNB crashed without any error message (cf. Table 2, seventh row).",
        "The same holds for the Java APIs JAWS and JWNL.",
        "Since a manual examination of the index file revealed that the entries that we were searching for, in fact, were included in the file, some other, up to this step unknown error must have prevented the software tools from finding the targeted entries.",
        "Hence, we want to point out that although we have examined this error for the NCI thesaurus only, the risk is high that this \"no show\" error is likely to bias any other application as well which makes use of the the same software that we grounded our experiments on.",
        "Since the NCI thesaurus is a very large resource, even worse, further manual error search is nearly impossible.",
        "At this point, we stopped our attempt building a WordNet resource for biomedicine based on the WordNet formatting and software framework."
      ]
    },
    {
      "heading": "5. Related Work",
      "text": [
        "In the literature dealing with WordNet and its structures from a resource perspective (rather than dealing with its applications), two directions can be distinguished.",
        "on the one hand, besides the original English WordNet and the various variant WordNets for other languages (Vossen, 1998), extensions to particular domains have already been proposed (for the medical domain by Buitelaar and Sacaleanu (2002) and Fellbaum et al.",
        "(2006); for the architectural domain Bentivogli et al.",
        "(2004); and for the technical report domain by Vossen (2001)).",
        "However, none of these authors neither mentions implementation details of the WordNets or performance pitfalls we have encountered, nor is supplementary software pointed out that might be useful for our work.",
        "on the other hand, there are suggestions concerning novel representation formats of next-generation WordNets.",
        "For instance in the BalkaNet project (Tufis, et al., 2004), an XML schema plus a DTD was proposed (Smrz, 2004) and an editor called CisDic with basic maintenance functionalities and consistency check was released (Horak and Smrz, 2004).",
        "The availability of APIs or software to measure similarity though remains an open issue.",
        "So, our approach to reuse the structure and the software for building a BioWordNet was motivated by the fact that we could not find any alternatives coming with a software ensemble as described in Section 2.",
        "Against all expectations, we did not manage to reuse the WordNet data structure.",
        "However, there are no publications that report on such difficulties and pitfalls we were confronted with."
      ]
    },
    {
      "heading": "6. Discussion and Conclusion",
      "text": [
        "We learnt from our conversion attempt that the current WordNet representation format of Word-Net suffers from several limitations and idiosyncrasies that cannot be bypassed by a simple, yet ad hoc work-around.",
        "Many of the limitations and pitfalls we found limiting (in the sense what can be expressed in WordNet) are due to the fact that its data format is out-of-date and not really suitable for the biomedical sublanguage.",
        "In addition, though we do not take into doubt that the WordNet software works fine for the official WordNet release, our experiences taught us that it fails or gives limited support in case of building and debugging a new WordNet resource.",
        "Even worse, we have evidence from one large terminological resource (NCI) that WordNet's software infrastructure (Grind) renders deceptive results.",
        "Although WordNet might no longerbe the one and only lexical resource for NLP each year a continuously strong stream of publications on the use of WordNet illustrates its importance for the community.",
        "On this account we find it remarkable that although improvements in content and structure of WordNet have been proposed (e.g., Boyd-Graber et al.",
        "(2006) propose to add (weighted) connections between synsets, Oltramari et al.",
        "(2002) suggest to restructure WordNet's taxonomical structure, and Mihalcea and Moldovan (2001) recommend to merge synsets that are too fine-grained) to the best of our knowledge, no explicit proposals have been made to improve the representation format of WordNet in combination with the adaption of the WoRDNET-related software.",
        "According to our experiences the existing Word-Net software is hardly (re)usable due to insufficient error messages that the software throws and limited documentation.",
        "From our point of view it would be highly preferable if the software would be improved and made more user-supportive (more meaningful error messages would already improve the usefulness of the software).",
        "In terms of the actual representation format of WordNet we found that using the current format is not only cumbersome and error-prone, but also limits what can be expressed in a WordNet resource.",
        "From our perspective this indicates the need for a major redesign of WordNet's data structure foundations to keep up with the standards of today's meta data specification languages (e.g., based on RFD (Graves and Gutierrez, 2006), XML or OWL (Lungen et al., 2007)).",
        "We encourage the reimplementation of WordNet resources based on such a state-of-the-art markup language (for OWL in particular a representation of WordNet is already available, cf. van Assem et al.",
        "(2006)).",
        "Of course, if a new representation format is used for a WordNet resource also the software accessing the resource has to be adapted to the new format.",
        "This may require substantial implementation efforts that we think are worth to be spent, if the new format overcomes the major problems that are due to the original Word-Net format."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was funded by the German Ministry of Education and Research within the StemNet project (01DS001A-C) and by the EC within the BOOTStrep project (FP6-028099)."
      ]
    }
  ]
}
