{
  "info": {
    "authors": [
      "B. Roudaud"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-4208",
    "title": "Typology Study of French Technical Texts, With a View to Developing a Machine Translation System",
    "url": "https://aclweb.org/anthology/C92-4208",
    "year": 1992
  },
  "references": [],
  "sections": [
    {
      "heading": "TYPOLOGY STUDY OF FRENCH TECHNICAL TEXTS, WITH A VIEW TO DEVELOPING A MACHINE TRANSLATION SYSTEM",
      "text": [
        "B.ROUDAUD Ii'VITAL (SITE group) 35 rue J. Chanrion - 38000 Grenoble - FRANCE tel : +33 76 51 04 96 email : B_Roudaud@site-maisons-alfortfr"
      ]
    },
    {
      "heading": "ABSTRACT",
      "text": [
        "Within the industrial context of the information society, technical translation represents a considerable commercial stake.",
        "In the light of this, machine translation is considered as being an application of paramount importance.",
        "It is for this reason that the activities of WVITAL have always centered around the processing of technical texts.",
        "The following article gives an account of the various tasks carried out over the last few years on corpus analysis.",
        "We have drawn conclusions as to the validity of the notion of text typologies, applied in particular to technical matter, with a view to developing a machine translation system.",
        "The study was conducted using a fair amount of French documents and has led us to observe in particular, that a same typology may be identified in texts originating from varying fields."
      ]
    },
    {
      "heading": "INTRODUCTION",
      "text": [
        "The technical literature of a nuclear plant represents about 150 000 pages (figure quoted by EDF, France, in 1990).",
        "About 20 000 pages make up the maintenance literature of a an aircraft, of which 5 000 are subject to revision every three months on average.",
        "In France, the cost per page for a translation varies from 250 to 400 francs for a translation from French to one of the other European languages (according to Bossard Consultants), which amounts to 6 million francs for the maintenance literature of an aircraft.",
        "If a machine translation system is able to reduce considerably the time spent per page by translators, even if the result is not perfect, it will signify a gain with respect to delivery times and costs.",
        "To avoid problems concerning non standardised terminology, we have endeavoured to stick to the terms familiar to traditional grammar, even though they may not always be appropriate.",
        "I wish to thank my colleagues, D. Bachut, 0.",
        "Gannet and M.C.",
        "Puerta, for their help."
      ]
    },
    {
      "heading": "1 - DEFINITION OF THE CORPUS STUDY",
      "text": [
        "According to our method, based on GETA's works (Grenoble), if the MT system comes across a non handled phenomenon, the sentence is not rejected and translation is carried through using those parts of the sentence which have been successfully analysed (Cf. [1] & [21).",
        "Within the framework of an industrial application in which the ratio of development costs to gain in quality is preponderant, rare phenomena may thus be handled in a very simplified way, or even not handled at all.",
        "Midway between controlled syntax systems and systems 'which translate everything', our approach to MT favours the development of systems adapted, a posteriori, to the texts to be translated.",
        "This theory goes by the assumption that it is possible to define and then recognise the typology of texts, specifying in particular their form, the linguistic phenomena present or absent and the general vocabulary used (excluding terminology).",
        "The study, which was strongly influenced by the MT application, began in 1984, during the French Projet National de Traduction Automatique (PNTAO), with an intensive research phase.",
        "It is still currently in progress although only sporadically, with the study of new texts.",
        "The first study aimed at proving that it was possible to define a typology for the given corpus.",
        "Its result was the definition of an initial typology (less restrictive than the METE() typology for instance, see [6]), which was further refined (though not radically changed) during the years which followed.",
        "The definition of the typology retained consisted of a list of the phenomena handled, in other words, a list of the static grammar charts (Cf. [2] & [3]) which are part of the linguistic specifications of the system.",
        "We will not give a full formal explanation of the defined typology, however, we will view it from a more informal point of view.",
        "The whole corpus was made up of documents in French provided by different firms (Sonovision, SITE, Adrospatiale, EDF, RhOne Poulenc, Syseca...).",
        "It consists mainly of aeronautical documents (maintenance documents, job cards...), data processing texts (extracts from reference documents or from user guides, or software error messages), minutes of meetings, extracts from work schedules or from technico-commercial documents.",
        "The aeronautical documents which make up the greater part of the corpus (about 50%), maintenance manuals and job cards, were initially chosen as the basic corpus for the PP/ TA0 for several reasons : - they were available in machine readable form, at Sonovision (which later became the SITE group), - they corresponded to a considerable commercial need, - they concerned a sector of strong export activity, - they were representative of a large number of technologies (mechanics, data processing, fluid mechanics, strength of materials, etc.).",
        "It is for these reasons that they constitute even today, an important source of enrichment for the corpus.",
        "The initial corpus was made up of about 400 pages taken from maintenance and service guides of Marcel Dassault aircraft.",
        "Part of the texts, provided with the English translation, were made up of job cards.",
        "Each job card indicates how to go about a specific servicing operation.",
        "They contain general recommendations and precise instructions : NOTA : L'avion dolt etre amarre lorsque la v I lcsse du vent risque de ddpasser 50 noeuds.",
        "Pour les vents tres violents, it est preferable de mettre l'av ion sous abr.",
        "A - Preparation du travail a. Proceder au campernent de l'avion (voir 02.11).",
        "t3 - Execution de ('operation 01 Deposer les porter 1905, 1907, 4106 02 V isser une attache d'amarrage sur chaotic f errure The other texts were service notes describing an apparatus or a mechanism, how it functions and the servicing procedures to be followed.",
        "The following is an illustration of this second type of text :",
        "Le raccord auto-obtUrable d'un equipement rnecanique a pour but d'assurer le raccorclernent rapide dune generation hydraullque a un bane de test et permet la m Ise en f onct ion des d I f féren ts organes de cette generation hydraullque sans perte de I iquide et sans entree d'air.",
        "Le raccord auto-obturable sert egalement au rempl Issage et au degazage des circuits.",
        "The study enabled us to pinpoint the characteristic of these two types of texts.",
        "It turned out that their typology was identical.",
        "The main difference is at form level : the first type of text contains enumerated instructions, generally described using short phrases without full stops and which do not exist in the second type of text.",
        "The purpose for extending the study was to investigate the possible existing differences amongst various types of documents in various fields.",
        "It turned out that most of the literature intended for technicians corresponds to the original typology.",
        "Amongst the other corpora studied (about 800 pages form various fields, e.g. electrical installation manuals, computer manuals and advertising, software manuals and advertising, aeronautical texts, description of composite materials, maintenance documentation for mechanical installations, etc.",
        "), we have classified the texts into two groups : - texts pertinent to the initial corpus, in other words those texts whose typology was identical or closely ressembled that of the first corpus, non-pertinent texts containing new phenomena.",
        "This second type of text will probably require a sub-categorisation into other typologies (a task not as yet carried out).",
        "Typology is field independent.",
        "We have received extracts from aeronautical documents, provided by Aerospatiale.",
        "Some of these texts fall into the non-pertinent category, while others fall into the pertinent category.",
        "Furthermore, it was found that texts originating from different fields (data processing or electrical engineering, for example) fell into the typology.",
        "Amongst the non-pertinent texts we found mainly texts which require rewriting rattler than translation, tor instance user manuals (at least those intended for non specialists), scientific articles, advertising and legal texts.",
        "Such texts are obviously less adapted to MT.",
        "We also found minutes of meetings and client service reports, whose syntax is often very fanciful.",
        "As far as quantity goes, the volume of technical matter is much greater than that of advertising and legal matter (Cf. Van Dijk consultancy figures).",
        "Maintenance and service guides, intended for specialists, and reference guides represent a much greater volume than that of user guides, intended for non-specialists (which are less homogenous typologically speaking)."
      ]
    },
    {
      "heading": "2 - RESULT OF THE CORPUS STUDY",
      "text": [
        "The study laid the emphasis on the problems directly related to translation, in particular with respect to accuracy.",
        "The subsections which follow illustrate the defined typology and instance the linguistic phenomena not encountered in the so-called pertinent texts studied.",
        "Several points must be underlined : Acts DE COLING-92, NANIES, 23-28 Aoirr 1992 12 8 5 PROC.",
        "or cOLING-92, NAN-rrs, AUG. 23-28, 1992",
        "1- any phenomenon classed as being absent may nevertheless be marginally present in a text ; 2 the corpus study showed that few of the phenomena absent from the initial study were later added."
      ]
    },
    {
      "heading": "2.1. FREQUENT PHENOMENA",
      "text": [
        "It is not possible to list fully all the phenomena encountered.",
        "We will however endeavour to give the main features of the typology of the texts studied, giving the most unusual or significant examples (from the pertinent corpus).",
        "The following hence plays more of an illustrative role than a descriptive role.",
        "Generally speaking, puntuation is used somewhat irregularly.",
        "There are few commas, and they do not always appear where they would normally be expected.",
        "Consequently, it appears pointless to use them for linguistic purposes, for example, in the determining of the limit of a coordination."
      ]
    },
    {
      "heading": "2 - Full stops",
      "text": [
        "As previously mentioned, the job cards come in the form of enumerated operations.",
        "Each operation is described by one or more small paragraphs containing sentences.",
        "As a rule, there are no full stops indicating the end of a paragraph :",
        "L'InspectIon exterieure de l'avion s'ef fectue par le pllote accompagne du mecaniclen.",
        "Elle est executee dans le sens des alguilles dune montre, en partant de la gauche du poste avant"
      ]
    },
    {
      "heading": "02 Contreler que...",
      "text": []
    },
    {
      "heading": "Enumerations",
      "text": [
        "Every possible type of enumeration can be found.",
        "In each case, processing is delicate : S'assurer que : - l'assiette de l'avion reste voisine de la ligne de vol - la manoeuvre ne presente pas de danger NOTA : ...le mecanlcien dolt : s'assurer de l'absence de fultes d'hul le... - inspecter le revetement : sur les elements en strati fie I istes cl-aprés, s'assurer de l'etat de la peinture et de l'absence d'entaille ou blessure - karmans vollure-fuselage intrados et arrlere - saumons vol lure"
      ]
    },
    {
      "heading": "Infinitive clauses",
      "text": [
        "They are very frequent in the texts, especially as operations to be carried out are described using the infinitive form (and not using the imperative form : fades ceci, or personal form : vous fades ceci ).",
        "They appear as the main clause of a sentence, as an object or as an adverbial : Apres avoir soigneusement asseche les part ie externes du raccord, soumettre celul-cl a une pression interne de 0,6 bar pendant 5 minutes... ...II est preferable de mettre l'avion sous abris.",
        "Ne pas tendre exagerement les cordes.",
        "Agir sur la valve pour la faire reculer.",
        "Infinitive clauses introduced by the preposition , with a passive adjectival value are frequently encountered.",
        "They bear a certain modality : fixer un obturateur sur la buse dentree du circuit d'air refroldIr (to be cooled) l'ef f et a ohtenir (to be obtained) Les coupures de frettes no sont pas prendre en consIderatiou Finally, the various infinitive clauses can be inter-coordinated or coordinated with different types of clauses (object or adverbial clauses).",
        "Coordinations (apart from enumerations) are generally limited to two or three clauses."
      ]
    },
    {
      "heading": "Conjugated verbal clauses",
      "text": [
        "We class a conjugated verbal clause as being any clause governed by a conjugated verb.",
        "The clauses encountered may appear either as a main (or independent) clause or a subordinate clause (object or adverbial).",
        "All the common types of clauses can be found (personal, impersonal, active, passive...).",
        "Coordinations (enumerations aside) are generally limited to two or three clauses.",
        "Examples of characteristic sentences : Pour les vents tres violents, it est preferable de mettre l'avion sous abri.",
        "Si le liquide polluant s'infiltre dans la zone sltuee entre la Jante de la roue et le talon, 11 Taut imperativement demonter le pneu pour le nettoyer.",
        "Amongst the remarkable clauses, we encountered several examples of inverted subjects (which could pass as a stylistic turn unlikely to be found in a technical text).",
        "For example : Au cadre 19 se trouve un boitier etanche..."
      ]
    },
    {
      "heading": "Relative clauses",
      "text": [
        "Very few are encountered in the texts (on average 1 relative clause every 2 pages), most of them are introduced by the relative pronoun qui (for more than 95% of the texts studied).",
        "Here are a few examples : 11 est base sur la conductibilite therm lque... et sur le mode de circulation adopte qui permettent un echange... entre les deux circuits d'air qui la traverse.",
        "el les possedent chacune un anneau travels lequel passe la sangle de rappel.."
      ]
    },
    {
      "heading": "Noun phrases",
      "text": [
        "We class noun phrases as being all groups with a nominal value whether or not they are introduced by a preposition.",
        "It is likely that all the possible types of noun phrases exist in the corpus.",
        "We observed with interest that in some cases, the groups were quite often barely grammatically acceptable.",
        "The principle of juxtaposing nouns in French is a rare phenomena.",
        "All the same, juxtaposition is quite a generalised pratice in the texts studied (this is probably the case for a lot of technical texts).",
        "The following juxtapositions are normally accepted : l'antenne TACAN l'ensemble raccord-bouchon un systeme de type baIonnette Whereas the following are less acceptable grammatically speaking : l'ensemble de hissage avion longueur part le I isse l'axe avion The following complex examples illustrate the degree of complexity noun phrases may attain (the part of the sentence which is not the noun phrase is bracketed) : (11 procéde) de la technique des refroidisseurs a surfaces secondaires, appeles refroidisseurs a lames et a i nterca I a Ires ou refroidisseurs compacts qui cor/lent part icul lerement blen au gaz ayant un mauvais coefficient d'echange thermique.",
        "Verb nolninalisation (verb-action noun derivation) is also frequently used : effectuer une verification du tarage... (rather than verifier le tarage) proceder a la depose des panneaux... Faire une verification du reglage...",
        "These structures are built using a small number of French verbs (faire, effectuer,...), and they are used with all nominalisations of verbs of action."
      ]
    },
    {
      "heading": "Idiomatic expressions",
      "text": [
        "We class idiomatic expressions as being variable or non-variable expressions, which require identification within a text in order to ensure correct translation.",
        "Idiomatic expressions exist in all the syntactic categories.",
        "Nominal idiomatic expressions are probably the most frequent, particularly in specialised terminology (more than 80 cro of the terms are nominal idiomatic expressions, in aeronautical terminology).",
        "Without going into further detail, it can be said that they are all present in the corpus.",
        "However, only a relatively small number of verbal expressions can be found (in comparison with the potential wealth of the French language) and there has been no example of a transformation of these expressions (for example les mesures qui doivent etre prises) in the corpus.",
        "They are generally made up using a limited number of verbs (prendre, tenir, mettre...): Maintenlr en place l'embase... Cette pression de remplissage tient compte dune perte de charge... mettre les commandes du regulateur oxygene sur ON... We must bear in mind that expressions of the effectuer-plus-a-nominalised-verb type do not belong to the specific idiomatic expression class, and are considered as being a commonly accepted transformation.",
        "2.2.",
        "RARE OR NONEXISTENT PHENOMENA The following is a list of significant examples of linguistic phenomena rarely or never encountered.",
        "It is not an exhaustive list.",
        "No direct nor indirect interrogatives were encountered in any of the texts.",
        "No imperatives (imperative mood) were encountered in the pertinent corpus, they are replaced by infinitive clauses (such is the case for most service or maintenance notes in French) : proceder au campement de ravion ne pas tendre exagerement les corder Amongst the non-pertinent texts, messages for users of a data processing system, user guides or training guides may contain imperatives or (sometimes) interrogatives."
      ]
    },
    {
      "heading": "Direct speech",
      "text": [
        "No examples of direct speech were encountered.",
        "Comparative phrases with a comparative reference Comparative phrases containing a comparative reference were extremely rare in the corpus studied.",
        "Only one example was encountered : La bache a eau est.",
        "plus volumineuse que la cuve d'evaporalion, composee d'element en al nage leper, soudes.",
        "No concessive clauses were encountered."
      ]
    },
    {
      "heading": "Clausal subjects",
      "text": [
        "No examples of personal clauses with a syntactic role of subject were encountered.",
        "It is hence possible to find : ...1 1 est recommande de ne pas inverser la palette... but not : Inverser la palette nest pas recommande..",
        "Although not totally absent, personal pronouns are rare in technical texts (one per page on average).",
        "None of the personal pronouns encountered referred to a human (in fact, humans are rarely referred to in the texts) in the pertinent corpus.",
        "This information meant that for the French-English system, personal pronouns would always be \"it\" (or \"they\") as it is not necessary to search for the reference.",
        "Rhetorical figures are rare and correspond to established usages.",
        "Only one metaphor was encountered in the texts : .. les commandes chemlnent sur le cot droit sous le plancher passager The problem is solved at dictionary level, given that a cable can cheminer (make its way).",
        "The metonyms encountered appear to be accepted metonyms which are transposable into the target language.",
        "Thus, in the above example, the term commandes which represents the cable or cables which propagate the controls, is literally translated into English, without shocking the technicians of the field.",
        "Anaphora are rare, and as with personal pronouns, if encountered could be handled in a simplified way.",
        "Finally, with regard to the aspectual phenomena, in French, syntactically speaking, there is very little aspectual indication.",
        "English, which was our target language very often uses the progressive form.",
        "We therefore paid particular attention to the reconstitution of the progressive form.",
        "After having carried out a comparative study of the texts, we were able to draw the conclusion that the progressive form was virtually nonexisent in the translated texts."
      ]
    },
    {
      "heading": "5 - CONCLUSION",
      "text": [
        "The corpus study has enabled us to draw several conclusions.",
        "Firstly, it has enabled the definition of a text typology which is pertinent to a considerable volume of texts of different origins and different technical fields (although this excludes in particular computer user guides and documents for the general public).",
        "The definition of this typology has enabled us to draw up accurate linguistic specifications, simplifying and sometimes ignoring the handling of certain linguistic phenomena.",
        "The specifications were then used to develop an MT system (based on GETA's system, ARIANE), whose grammars are less complex, and hence easier to maintain.",
        "The quality of translation, tested on a important number of aeronautical texts (maintenance guides) and on several specimens of pertinent texts, have proved the validity of this approach : revision times varied from 20 to 30 minutes per page (average translation times in SITE is about 1 page per hour).",
        "The study of texts of different typologies has enabled us to pinpoint the limits of a minimal language, used in all types of texts, and hence the indispensable kernel of any new typology.",
        "From an economic point of view, the texts targeted by the typology described here represent a considerable amount of the documents to be translated."
      ]
    },
    {
      "heading": "BIBLIOGRAPHY",
      "text": []
    }
  ]
}
