{
  "info": {
    "authors": [
      "William C. Mann",
      "Madeleine Bates",
      "Barbara J. Grosz",
      "David D. McDonald",
      "Kathleen R. McKeown",
      "William Swartout"
    ],
    "book": "American Journal of Computational Linguistics",
    "id": "acl-J82-2003",
    "title": "Text Generation",
    "url": "https://aclweb.org/anthology/J82-2003",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "heading": "Panelists",
      "text": []
    },
    {
      "heading": "2.1 Introduction",
      "text": [
        "This report consists of two documents describing the state of the art of computer generation of natural language text.",
        "Both were prepared by a panel of individuals who are active in research on text generation.",
        "The first document assesses the state of the art, identifying four kinds of technical developments which will shape the art in the coming decade: linguistically justified grammars, knowledge representation methods, models of the reader, and models of discourse.",
        "The second document is a comprehensive bibliography on text generation, the first of its kind.",
        "In addition to citations of documents, it includes descriptions of ongoing research efforts."
      ]
    },
    {
      "heading": "2.2 Assessing Text Generation Technology",
      "text": [
        "Our goal here is to assess the state of the art of text generation for two purposes: to help people who intend to apply that art in the near future and to aid in the design or selection of appropriate research.",
        "This assessment covers all of the technical methods by which computer programs create and present English text in their outputs.",
        "(For simplicity we always call the output language English.)",
        "Because text generation has not always been taken seriously from a technical point of view, it has been actively pursued only recently as a topic in artificial intelligence.",
        "As a result of this late start, much of the technology available for application today is still rather superficial.",
        "However, text generation is now such an active research topic that this superficial technology will soon be surpassed.",
        "(The last part of this report contains an extensive bibliography on the subject.)"
      ]
    },
    {
      "heading": "2.3 What Techniques Are Now Available for Use in System Designs?",
      "text": [
        "Two kinds of practical text generation techniques are already in general use and fairly well understood.",
        "The first is displaying previously prepared text (or canned text), and the second is producing text by direct translation of knowledge structures.",
        "The simplest and most commonly used way to have a computer system produce text is for the implementers of the system to figure out in advance what sorts of English output will be required and then store it as text strings.",
        "The computer merely displays the text that has been stored.",
        "(For example, almost all error messages are produced in this way.)",
        "It is relatively easy to have a program produce English in this way, and the text can be complex and elegantly written if desired.",
        "Unfortunately, because the text strings can be changed independently of any knowledge structures the program might use, there is no guarantee of consistency between what the program does and what it says it does.",
        "Another problem with canned text is that all questions and answers must be anticipated in advance; for large systems, that may prove to be impossible.",
        "Finally, since one text string looks like any other as far as the computer is concerned, the computer program cannot easily have a conceptual model of what it is saying.",
        "This means that one should not expect to see much closure: satisfying 100 needs for text will not make the second 100 much easier.",
        "Another approach to providing English output produces text by translating knowledge structures of the program directly to English.",
        "This method overcomes many of the problems with canned text, while introducing some of its own.",
        "Since the structures being transformed (or translated) are the same ones used in the program's reasoning process, consistency can be assured.",
        "Closure can be realized because transformations are written to handle large classes of knowledge structures.",
        "However, since the transformations performed are usually relatively simple, the quality of the text depends to a great degree on how the knowledge is structured.",
        "If the text is to be understandable, the knowledge used by the program must be structured so",
        "that it is readily understood.",
        "Finally, systems employing this technique typically have had very little linguistic knowledge, so they have produced text that is verbose, stilted, and redundant, although readable.",
        "Practical, near-term applications of text generation will share certain characteristics:",
        "1.",
        "They require short texts: one to three sentences.",
        "2.",
        "They have well-elaborated program data structures corresponding in fairly simple ways to the desired texts.",
        "3.",
        "The important knowledge can be represented well with present techniques; it does not involve the difficulties listed in section 2.6.",
        "4.",
        "Limited fluency of output is acceptable.",
        "Some so-called \"expert systems\" that explain their reasoning in English have these characteristics.",
        "We believe that text-producing systems of the future will continue to include processes that produce text by translating knowledge structures.",
        "However, they will be integrated with other processes that use extensive linguistic knowledge, a discourse model, a model of the reader, and enhanced knowledge representations.",
        "Because of the limited capabilities of present techniques, a new project aiming to produce a benchmark application program in the text generation area would currently be counterproductive, since it would produce little or no transferable technology and would detract from the community's ability to make progress on the general problem."
      ]
    },
    {
      "heading": "2.4 Basic Components for a Text Generation Facility",
      "text": [
        "How can the very limited capabilities now available be developed into fluent, powerful text generation methods that are easily applied to new tasks?",
        "The next few sections describe the kinds of methods that are needed and are being developed.",
        "The underlying model presumed here, which present research is moving toward, has the following characteristics:",
        "1.",
        "Responsibility for text generation is in a text generation module rather than being scattered at the points of use.",
        "2.",
        "A major portion of the text generation module is portable and is developed cumulatively through many systems.",
        "The portable components include a grammar that encodes general knowledge of English and processes that handle linguistic, task-independent information.",
        "We feel strongly that a competent text generation facility must have the following four identifiable components, and that limitations on these will be limitations on the overall state of the art for the foreseeable future:",
        "1.",
        "A comprehensive, linguistically justified grammar.",
        "2.",
        "A knowledge-representation formalism that can encode diverse kinds of information.",
        "3.",
        "A model of the intended reader of the text.",
        "4.",
        "A model of discourse structure and control.",
        "Each of these draws on existing noncomputational precedents, and each requires some special adaptation to the text generation task.",
        "Below we describe each of these basic components in a form that it might achieve in five to ten years of research.",
        "(These descriptions are followed by a projection of the practical alternatives available to system designers five years hence.)"
      ]
    },
    {
      "heading": "2.5 Lingustically Justified Grammars for Text Generation",
      "text": [
        "Grammars are ordinarily developed by linguists over periods of ten to twenty or more years, in departments of linguistics.",
        "The best ones may be written by a single individual, but they reflect the ideas of dozens or hundreds of people who have contributed to refining particular forms.",
        "Present practice in linguistics emphasizes carefully reasoned development of small fragments of grammars.",
        "Hence comprehensive, linguistically justified grammars, the sort we need, are very rare.",
        "Several linguistic traditions (some associated with computation and some not) are particularly likely to produce suitably refined, comprehensive grammars for text generators.",
        "They are:",
        "1.",
        "The systemic tradition, founded by Michael A. K. Halliday around 1961.",
        "2.",
        "The transformational tradition, decisively articulated by Noam Chomsky starting in 1957.",
        "3.",
        "The Generalized Phrase Structure Grammar tradition, currently associated with Gerald Gazdar.",
        "4.",
        "The ATN tradition, begun by Bill Woods and now being developed by him and many others.",
        "5.",
        "The LSP tradition, developed so far mainly under the direction of Naomi Sager.",
        "6.",
        "The Diamond (or Diagram) grammar by Jane Robinson.",
        "Grammars do not appear in computers without extensive effort.",
        "Most linguists are not interested in providing or seeing the level of detail and precise definition needed for effective computational use.",
        "There are enormous social barriers between the source of these grammars (linguists) and their potential users.",
        "It will be necessary to sponsor text generation research projects with linguists on the staff; projects staffed entirely by computer people can be expected to yield only short-term results.",
        "American Journal of Computational Linguistics, Volume 8, Number 2, April-June 1982 63"
      ]
    },
    {
      "heading": "William Mann Text Generation 2.6 Knowledge Representation Formalisms 4. The effects of various discourse structures on the",
      "text": [
        "Text generation programs cannot improve much on the knowledge they are given.",
        "The notation for knowledge must already contain appropriate abstractions in an easily accessible form.",
        "Today's notations are relatively good at representing logical formulas and deductive necessities, and also hierarchies of objects.",
        "Coverage is particularly weak for these other kinds of knowledge:",
        "1.",
        "Time 2.",
        "Space 3.",
        "Events and actions 4.",
        "Cause 5.",
        "Collectives 6.",
        "Likelihood 7.",
        "Obligation 8.",
        "Possibility 9.",
        "Negation 10.",
        "Quantification 11.",
        "Continuity and discreteness"
      ]
    },
    {
      "heading": "2.7 Models of the Reader",
      "text": [
        "Text prepared without considering the reader is uniformly awful.",
        "Programs must have explicit models of the reader that encode (or make available) at least the following four kinds of information:",
        "1.",
        "What is obvious – including common factual knowledge and certain \"obvious\" inferable information.",
        "Obviousness does not agree with logical validity.",
        "2.",
        "What has already been told, and what is obvious from that.",
        "3.",
        "What others believe – including mutual beliefs and beliefs about the writer's belief.",
        "4.",
        "What is currently in the reader's attention.",
        "Beyond these, the program should be able to reason about belief and intent."
      ]
    },
    {
      "heading": "2.8 Models of Discourse",
      "text": [
        "This is another linguistic matter, distinct from grammar.",
        "Running text has subtle interactions between its parts.",
        "When we generate multisentential text, we need a set of principles for organizing it.",
        "A few linguists and philosophers are making important contributions, but far more work is needed.",
        "Again, to develop effective models of discourse, research projects will need to have linguists on the staff.",
        "An adequate discourse model will include some representation of at least the following:",
        "1.",
        "The structures that can be built out of sentences and larger units.",
        "2.",
        "The needs of the writer that each discourse structure meets.",
        "3.",
        "The principal effects that the use of each structure produces.",
        "reader's attention."
      ]
    },
    {
      "heading": "2.9 Relating the Basic Components to Text Generation",
      "text": [
        "How are these basic components related to the whole task?",
        "Why are they necessary, and how does their quality affect what can be done?",
        "In order to generate text that is not awkward or misleading, one must be able to control a wide variety of language effects at the sentence level.",
        "Effects will be present in the mind of the reader in any case, and so the program must either control them or take serious risks of misunderstanding and error.",
        "The effects are produced by the arrangements of words used, and so a theory of the arrangements of words is needed in order to achieve control.",
        "Theories of the arrangements of words are (or include) grammars.",
        "The ability of a text generation system to express many different ideas well will be limited to the different effects controllable through its grammar.",
        "Use of an ad hoc grammar limits the generator to expressing a narrow range of ideas.",
        "It may do well in a short, carefully planned demonstration, but it will be too narrow for many practical purposes.",
        "We can think of the grammar as a bottleneck or filter at the output of the text generator.",
        "Only those expressive techniques that the system can control through its grammar will be used."
      ]
    },
    {
      "heading": "2.9.2 The Knowledge Representation",
      "text": [
        "The knowledge representation frameworks in a program limit the range of things that the program can usefully operate upon.",
        "Since a text generator must create text out of some knowledge representation, it is likewise limited.",
        "Limitations on knowledge representations include two important kinds:",
        "1.",
        "Presence of abstractions--are the concepts that must be conveyed in text actually symbolized?",
        "2.. Ease of access--is there a fast, uniform method for finding the symbols that represent particular concepts?",
        "We can think of these limits as a bottleneck or filter at the input of the text generator.",
        "Only those concepts that pass through the filter will appear in the text."
      ]
    },
    {
      "heading": "2.9.3 Models of the Reader or System User",
      "text": [
        "Generating acceptable text requires that the generator take into account the knowledge of the reader.",
        "If this is not done, text quality is so bad that the results",
        "may be useless.",
        "(With canned text, this problem is usually avoided because the writer knows a great deal about the reader's knowledge.)",
        "To take the reader's knowledge into account requires an explicit model of that knowledge.",
        "Of the four kinds of knowledge previously identified in section 2.7, the most critical for basic text quality are the knowledge of what is obvious and the knowledge of what has already been conveyed."
      ]
    },
    {
      "heading": "2.9.4 Models of Discourse",
      "text": [
        "We know that single sentences are too limited to express some things.",
        "Moving to multisentential text necessarily creates discourse, which involves many kinds of effects that programs cannot yet control.",
        "For example, putting one sentence after another can be used to express time sequence, deductive necessity, cause, exemplification or other relationships, without any words being used to express the relation.",
        "Creating these effects when they are desired, and avoiding them when they are not, requires explicit models of discourse phenomena.",
        "At a higher level, sequences of sentences and paragraphs of a text must be organized in a principled way.",
        "This also requires explicit discourse models.",
        "Until such models are developed, texts will be awkward and misunderstanding will be common."
      ]
    },
    {
      "heading": "2.10 Designing in 1986 for Practical Text Generation",
      "text": [
        "What sort of practical application of text generation will be possible in five years?",
        "We expect the designer to be in the following situation: ► There will be several examinable systems with developed methods for creating the four basic components.",
        "For each kind of component, there will be some attractive precedents for future work.",
        "No one system will have a thoroughly elaborated approach to all four.",
        "► System design based on adaptation of these precedents will be possible.",
        "The design work will involve creating \"handcrafted\" systems that embody and reconcile the good techniques.",
        "It will require the personal attention of computer scientists, linguists, and programmers who have been involved in the prior research.",
        "► The resulting system can be expected to create acceptable, effective texts, limited by quality considerations to be about one page in length.",
        "For the message-system problem used as a focal problem for the workshop, there were two tasks identified for text generation: a task of reporting system status and a task of reporting how and to whom particular messages would be relevant for an identified collection of people.",
        "For both of these tasks it seems feasible for design of a practical text generation module to begin in five years.",
        "However, it is questionable whether adequate techniques would be available to determine what message relevance to report."
      ]
    },
    {
      "heading": "2.11 Present Research Status",
      "text": [
        "The most influential research in the next few years will be focused on the four basic components: linguistically justified grammars, knowledge representation formalisms, models of readers, and models of discourse structure and control.",
        "Part of the effort will go into developing these components individually, part into learning how to combine them.",
        "Appropriately, most of the current effort is going into either developing single components or combining two of them.",
        "Although there are several institutions and individuals working on all four of these components, no one has yet demonstrated a system in which all four approach the scopes of action indicated for them above.",
        "Many important topics are being neglected for lack of research support.",
        "(There is no lack of interested people; natural language processing continually generates high interest in the AI community.",
        "We are not sure whether there is a shortage of interested qualified people.)",
        "More information on the state of the art and current activity can be found in the bibliography on text generation, the last part of this report, which includes a section on research in progress."
      ]
    },
    {
      "heading": "2.12 Text Generation Bibliography",
      "text": [
        "This bibliography was prepared in connection with the authors' report on the state of the art in text generation.",
        "It includes published works on generation of natural language text by computer programs as well as some prior noncomputational work that has been used as a basis for such computer programs.",
        "It is not exhaustive in any sense, and no evaluation is implied by the presence or absence of a citation of any particular publication.",
        "for the nature of stored knowledge.",
        "In Freedle, R.O., Ed.,",
        "Clippinger, J.H.",
        "1974 A Discourse Speaking Program as a Preliminary Theory of Discourse Behavior and a Limited Theory of Psychoanalytic Discourse.",
        "Ph.D. thesis, University of Pennsylvania.",
        "Clippinger, J.H.",
        "1975 Speaking with many tongues: Some problems in modelling speakers of actual discourse.",
        "In Proceedings of Theoretical Issues in Natural Language Processing – I (TINLAP).",
        "Cambridge, MA (June) 68-73.",
        "Mann, W.C. 1981b Two discourse generators.",
        "In The Nineteenth Annual Meeting of the Association for Computational Linguistics.",
        "Sperry Univac.",
        "Matthiessen, C.M.I.M.",
        "1981 A grammar and a lexicon for a text-production system.",
        "In The Nineteenth Annual Meeting of the Association for Computational Linguistics.",
        "Sperry Univac.",
        "McCoy, K.F.",
        "1981 Automatic Enhancement of a Database Knowledge Representation for Natural Language Generation.",
        "McDonald, D.D.",
        "1975a A preliminary report on a program for generating natural language.",
        "In Proceedings of the Third International Joint Conference on Artificial Intelligence.",
        "Tibilisi, USSR (August).",
        "McDonald, D.D.",
        "19756 A framework for writing generation grammars for interactive computer programs.",
        "American Journal of Computational Linguistics Fiche 33.",
        "McDonald, D.D.",
        "1977 Language generation: The linguistics component (short note).",
        "In Proceedings of the Fifth International Joint Conference on Artificial Intelligence.",
        "Cambridge, MA (August).",
        "McDonald, D.D.",
        "1978 Subsequent references: Syntactic and rhetorical constraints.",
        "In Theoretical Issues in Natural Language Processing – 2 (TINLAP).",
        "ACM, New York.",
        "McDonald, D.D.",
        "1980a Natural Language Production as a Process of Decision-Making Under Constraints.",
        "Ph.D. thesis, Massachusetts Institute of Technology, Dept.",
        "of Electricial Engineering and Computer Science.",
        "To appear as an MIT Artificial Intelligence Laboratory technical report.",
        "McDonald, D.D.",
        "1980b The role of discourse structure in language production.",
        "In The Proceedings of the Third Biannual Meeting of the SCSIO/SCEIO."
      ]
    },
    {
      "heading": "2.13 Research in Progress",
      "text": [
        "This section describes research in text generation either currently in progress or recently completed but not yet described comprehensively in any publication.",
        "Like the set of references, it is not exhaustive."
      ]
    },
    {
      "heading": "(SRI International)",
      "text": [
        "Barbara Grosz and Doug Appelt are developing a problem-solving approach to the design of text, extending from prior work by Allen, Cohen, and Perrault.",
        "A hierarchical planning system called KAMP (Knowledge and Modalities Planner) is being developed, capable of planning actions that affect another agent's knowledge and wants.",
        "It includes critic processes that examine the plan globally for interactions between the effects of actions and propose modifications to the plan that will enable the utterance being planned to realize multiple illocutionary acts.",
        "KAMP's knowledge representation is based on Moore's possible worlds semantics approach to reasoning about knowledge and action."
      ]
    },
    {
      "heading": "David McDonald",
      "text": [
        "(University of Massachusetts, Amherst) David McDonald is the author of MUMBLE, a system that performs utterance construction, grammatical smoothing, and maintenance of linguistic constraints for natural language generation by expert programs.",
        "MUMBLE is available to interested researchers in the common dialect of LISP machine LISP and NIL.",
        "The author is currently extending Mumble's grammatical power so that it plans word selection in describing visual scenes and also plans the use of certain connectives such as \"but,\" \"also,\" and \"thus.\""
      ]
    },
    {
      "heading": "William Mann and Christian Matthiessen (Information Sciences Institute)",
      "text": [
        "William Mann, Christian Matthiessen, and others are developing the Penman system to explore the problems of creating a portable text generation facility useful in multiple knowledge domains.",
        "Penman will seek to deliver knowledge (in English) from inside a system that was not designed to have a text generation component.",
        "The linguistic components of Penman are based on Halliday's Systemic Grammar.",
        "A large systemic gram",
        "mar of English has been implemented and is being fitted with semantic parts.",
        "The knowledge representation, which resembles Brachman's early KL-ONE, is being used for both the subject matter of Penman's generation and the text plans by which Penman generates text.",
        "The emphasis of the research is on providing fluent English output from an easily controlled source."
      ]
    },
    {
      "heading": "Kathleen McKeown (University of Pennsylvania)",
      "text": [
        "Research is being completed on a text generation system that embodies computational solutions to the questions of what to say next and how to organize it effectively.",
        "Two mechanisms are used to handle these problems: (1) rhetorical techniques for communication, encoded as schemas, guide the generation process, and (2) a focusing mechanism helps maintain discourse coherence.",
        "Schemas define aspects of discourse structure and are associated with explicit discourse purposes.",
        "The focusing mechanism aids in the organization of the message by constraining the selection of what to talk about next to that which ties in with the previous discourse in an appropriate way.",
        "This work is being done within the framework of a natural language interface to a database system; the completed system will generate responses to questions about database structure.",
        "Steven Bossie, Kathleen McCoy (University of Pennsylvania) Two systems are being developed at the University of Pennsylvania in conjunction with McKeown's text generation system.",
        "One, developed by Kathleen McCoy, automatically enhances a metalevel description of a database for use by McKeown's text generation system.",
        "This system generates subclasses of classes in a given generalization hierarchy.",
        "It uses information in the database and a set of axioms to create the subclasses and select salient information describing the subclass divisions.",
        "Steven Bossie is developing a system that will take the ordered message created by McKeown's text generation system and translate it into English.",
        "Bossie's system uses a functional grammar, based on a formalism defined by Kay 1979, which will allow for the direct encoding of focus constraints in the grammar.",
        "Thus, eventually, the system will use the focusing information provided by McKeown's system to select syntactic constructions.",
        "Rod McGuire (Yale) Working toward his Ph.D. dissertation, Rod McGuire is developing a model of knowledge representation in human memory to account for observed constraints on the content of oral text.",
        "In this model, sentences are generated without building syntactic structures.",
        "In multisentential text, coherence arises directly from the form of representation in memory and from memory representation traversal algorithms, using a homogeneous representation to cover syntactic structure, rhetorical structure, and text plans.",
        "The ILIAD system is an intelligent CAI system being developed by Madeline Bates, Robert Ingria, Kirk Wilson (of Learning Tools, Inc., Brookline, Mass.)",
        "and others to give instruction and practice in English.",
        "The emphasis is not on teaching grammar, but the system needs to have a deep understanding of the syntactic relationships in the sentences used in examples and exercises.",
        "For this reason, the heart of the ILIAD system is a sentence generator that is based on the paradigm of transformational grammar.",
        "ILIAD's grammar blends some aspects of standard transformational theory with the extended standard theory.",
        "Rules have been developed to generate not only most of the common English structures but also ungrammatical sentences typical of those produced by people with language-delaying handicaps such as deafness.",
        "To control the operation of the generator, several layers of control structures have been developed.",
        "Constraints and syntactic specifications allow the user and the system to determine the syntactic form of the sentences at a very high level.",
        "Although semantic information is currently used only in lexical insertion, a KL-ONE INTERFACE is being designed."
      ]
    }
  ]
}
