{
  "info": {
    "authors": [
      "John Tinsley",
      "Yanjun Ma",
      "Sylwia Ozdowska",
      "Andy Way"
    ],
    "book": "Proceedings of the Third Workshop on Statistical Machine Translation",
    "id": "acl-W08-0326",
    "title": "MaTrEx: The DCU MT System for WMT 2008",
    "url": "https://aclweb.org/anthology/W08-0326",
    "year": 2008
  },
  "references": [
    "acl-J03-1002",
    "acl-J93-2003",
    "acl-N03-1017",
    "acl-P03-1021",
    "acl-P07-1037",
    "acl-P07-1039",
    "acl-P07-2045",
    "acl-P96-1041"
  ],
  "sections": [
    {
      "text": [
        "MaTrEx: the DCU MT System for WMT 2OO8",
        "John Tinsley, Yanjun Ma, Sylwia Ozdowska, Andy Way",
        "National Centre for Language Technology Dublin City University Dublin 9, Ireland",
        "{jtinsley, yma, sozdowska, away}@computing.dcu.ie",
        "In this paper, we give a description of the machine translation system developed at DCU that was used for our participation in the evaluation campaign of the Third Workshop on Statistical Machine Translation at ACL 2008.",
        "We describe the modular design of our data-driven MT system with particular focus on the components used in this participation.",
        "We also describe some of the significant modules which were unused in this task.",
        "We participated in the EuroParl task for the following translation directions: Spanish-English and French-English, in which we employed our hybrid EBMT-SMT architecture to translate.",
        "We also participated in the Czech-English News and News Commentary tasks which represented a previously untested language pair for our system.",
        "We report results on the provided development and test sets."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In this paper, we present the Data-Driven MT systems developed at DCU, MaTrEx (Machine Translation using Examples).",
        "This system is a hybrid system which exploits EBMT and SMT techniques to build a combined translation model.",
        "We participated in both the French-English and Spanish-English EuroParl tasks.",
        "In these two tasks, we monolingually chunk both source and target sides of the dataset using a marker-based chunker (Gough and Way, 2004).",
        "We then align these chunks using a dynamic programming, edit-distance-style algorithm and combine them with phrase-based SMT-style chunks into a single translation model.",
        "We also participated in the Czech-English News Commentary and News tasks.",
        "This language pair represents a new challenge for our system and provides a good test of its flexibility.",
        "The remainder of this paper is organised as follows: Section 2 details the various components of our system, in particular the chunking and chunk alignment strategies used for the shared task.",
        "In Section 3, we outline the complete system setup for the shared task, and in Section 4 we give some results and discussion thereof."
      ]
    },
    {
      "heading": "2. The MaTrEx System",
      "text": [
        "The MaTrEx system is a modular hybrid data-driven MT system, built following established Design Patterns, which exploits aspects of both the EBMT and SMT paradigms.",
        "It consists of a number ofextendible and re-implementable modules, the most significant of which are:",
        "• Word Alignment Module: outputs a set of word alignments given a parallel corpus,",
        "• Chunking Module: outputs a set of chunks given an input corpus,",
        "• Chunk Alignment Module: outputs aligned chunk pairs given source and target chunks extracted from comparable corpora,",
        "• Decoder: returns optimal translation given a set of aligned sentence, chunk/phrase and word pairs.",
        "In some cases, these modules may comprise wrappers around pre-existing software.",
        "For example, our system configuration for the shared task incorporates a wrapper around Giza++ (Och and Ney, 2003) for word alignment and a wrapper around Moses (Koehn et al., 2007) for decoding.",
        "It should be noted, however, that the complete system is not limited to using only these specific module choices.",
        "The following subsections describe those modules unique to our system.",
        "The chunking module used for the shared task is based on the Marker Hypothesis, a psycholinguistic constraint which posits that all languages are marked for surface syntax by a specific closed set of lexemes or morphemes which signify context.",
        "Using a set of closed-class (or \"marker\") words for a particular language, such as determiners, prepositions, conjunctions and pronouns, sentences are segmented into chunks.",
        "A chunk is created at each new occurrence of a marker word with the restriction that each chunk must contain at least one content (or non-marker) word.",
        "An example ofthis chunking strategy for English and Spanish is given in Figure 1.",
        "In order to align the chunks obtained by the chunking procedures described in Section 2.1, we make use of an \"edit-distance-style\" dynamic programming alignment algorithm.",
        "In the following, a denotes an alignment between a target sequence e consisting of / chunks and a source sequence f consisting of J chunks.",
        "Given these sequences of chunks, we are looking for the most likely alignment a:",
        "a = argmaxP(a|e, f) = argmaxP(a, e|f).",
        "We first consider alignments such as those obtained by an edit-distance algorithm, i.e.",
        "where tk = 0 (resp.",
        "sk = 0) denotes a non-aligned target (resp.",
        "source) chunk.",
        "We then assume the following model:",
        "where P(e0|fj) (resp.",
        "P(ej|f0)) denotes an \"insertion\" (resp.",
        "\"deletion\") probability.",
        "Assuming that the parameters P(etk |fSk) are known, the most likely alignment is computed by a simple dynamic-programming algorithm.",
        "Instead of using an Expectation-Maximization algorithm to estimate these parameters, as commonly done when performing word alignment (Brown et al., 1993; Och and Ney, 2003), we directly compute these parameters by relying on the information contained within the chunks.",
        "The conditional probability P(etk |fSk) can be computed in several ways.",
        "In our experiments, we have considered three main sources of knowledge: (i) word-to-word translation probabilities, (ii) word-to-word cognates, and (iii) chunk labels.",
        "These sources of knowledge are combined in a log-linear framework.",
        "The weights of the log-linear model are not optimised; we experimented with different sets of parameters and did not find any significant difference as long as the weights stay in the interval [0.5 – 1.5].",
        "Outside this interval, the quality of the model decreases.",
        "More details about the combination of knowledge sources can be found in (Stroppa and Way, 2006).",
        "There are numerous other features available in our system which, due to time constraints, were not exploited for the purposes of the shared task.",
        "They include:",
        "• Word packing (Ma et al., 2007): a bilingually motivated packing of words that changes the basic unit of the alignment process in order to simplify word alignment.",
        "• Supertagging (Hassan et al., 2007b): incorporating lexical syntactic descriptions, in the form of supertags, to the language model and target side of the translation model in order to better inform decoding.",
        "• Source-context features (Stroppa et al., 2007): use memory-based classification to incorporate context-informed features on the source side of the translation model.",
        "• Treebank-based phrase extraction (Tinsley et al., 2007): extract word and phrase alignments based on linguistically informed sub-sentential alignment of the parallel data.",
        "English: [I voted] [in favour] [of the strategy presented] [by the council] [concerning relations] [with Mediterranean countries] Spanish: [He votado] [a favor] [de la estrategia presentada] [por el consejo] [relativa las relaciones] [con los paises mediterraneos]"
      ]
    },
    {
      "heading": "3. Shared Task Setup",
      "text": [
        "The following section describes the system setup using the Spanish-English and French-English Eu-roParl, and Czech-English CzEng training data.",
        "For all tasks we initially tokenised the data (Czech data was already tokenised) and removed blank lines.",
        "We then filtered out sentence pairs based on length (>100 words) and fertility (9:1 word ratio).",
        "Finally we lowercased the data.",
        "Details of this preprocessing are given in Table 1.",
        "As mentioned in Section 2, our word alignment module employs a wrapper around Giza++.",
        "We built a 5-gram language model based the target side of the training data.",
        "This was done using the SRI Language Modelling toolkit (Stolcke, 2002) employing linear interpolation and modified Kneser-Ney discounting (Chen and Goodman, 1996).",
        "Our phrase-table comprised a combination of marker-based chunk pairs, extracted as described in Sections 2.1 and 2.2, and word-alignment-based phrase pairs extracted using the \"grow-diag-final\" method of Koehn et al.",
        "(2003), with a maximum phrase length of 7 words.",
        "Phrase translation probabilities were estimated by relative frequency over all phrase pairs and were combined with other features,",
        "Table 2: Summary of results on developments sets de-vtest2006 for EuroParl tasks and nc-test2007 for cz-en tasks.",
        "such as a reordering model, in a log-linear combination of functions.",
        "We tuned our system on the development set de-vtest2006 for the EuroParl tasks and on nc-test2007 for Czech-English, using minimum error-rate training (Och, 2003) to optimise BLEU score.",
        "Finally, we carried out decoding using a wrapper around the Moses decoder.",
        "Case restoration was carried out by training the system outlined above - without the EBMT chunk extraction - to translate from the lowercased version of the applicable target language training data to the truecased version.",
        "We have previously shown this approach to be very effective for both case and punctuation restoration (Hassan et al., 2007a).",
        "The translations were then detokenised."
      ]
    },
    {
      "heading": "4. Results",
      "text": [
        "The system output is evaluated with respect to BLEU score.",
        "Results on the development sets and test sets for each task are given in Tables 2 and 3 respectively, where \"-EBMT\" indicates that EBMT chunk modules were not used, and \"+EBMT\" indicates that they were used.",
        "Filter criteria",
        "es-en",
        "fr-en",
        "cz-en",
        "Initial Total",
        "1258778",
        "1288074",
        "1096941",
        "Blank Lines",
        "5632",
        "4200",
        "2",
        "Length",
        "6794",
        "8361",
        "2922",
        "Fertility",
        "120",
        "82",
        "1672",
        "Final Total",
        "1246234",
        "1275432",
        "1092345",
        "System",
        "Bleu (-EBMT)",
        "Bleu (+EBMT)",
        "es-en",
        "0.3283",
        "0.3287",
        "fr-en",
        "0.2768",
        "0.2770",
        "cz-en",
        "0.2235",
        "-",
        "System",
        "Bleu (-EBMT)",
        "Bleu (+EBMT)",
        "es-en",
        "0.3274",
        "0.3285",
        "fr-en",
        "0.3163",
        "0.3174",
        "cz-en (news)",
        "0.1458",
        "-",
        "cz-en (nc)",
        "0.2217",
        "-",
        "Those configurations which incorporated the EBMT chunks improved slightly over those which did not.",
        "Groves (2007) has shown previously that combining EBMT and SMT translation models can lead to considerable improvement over the baseline systems from which they are derived.",
        "The results achieved here lead us to believe that on such a large scale there may be a more effective way to incorporate the",
        "EBMT chunks.",
        "Previous work has shown the EBMT chunks to have higher precision than their SMT counterparts, but they lack sufficient recall when used in isolation (Groves, 2007).",
        "We believe that increasing their influence in the translation model may lead to improved translation accuracy.",
        "One experiment to this effect would be to add the EBMT chunks as a separate phrase table in the log-linear model and allow the decoder to chose when to use them.",
        "Finally, we intend to exploit the unused modules of the system in future experiments to investigate their effects on the tasks presented here."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work is supported by Science Foundation Ireland (grant nos.",
        "05/RF/CMS064 and OS/IN/1732).",
        "Thanks also to the reviewers for their insightful comments and suggestions."
      ]
    }
  ]
}
