{
  "info": {
    "authors": [
      "Silviu Cucerzan",
      "David Yarowsky"
    ],
    "book": "Human Language Technology Conference and Meeting of the North American Association for Computational Linguistics",
    "id": "acl-N03-1006",
    "title": "Minimally Supervised Induction of Grammatical Gender",
    "url": "https://aclweb.org/anthology/N03-1006",
    "year": 2003
  },
  "references": [
    "acl-P98-1080",
    "acl-W02-1030",
    "acl-W02-2006"
  ],
  "sections": [
    {
      "text": [
        "shown in Table 1.",
        "When a bilingual dictionary with English is available electronically (as was the case for Romanian, French, and Spanish), the projection of natural gender labels is done automatically.",
        "When such a dictionary is not available in an electronic format, an English-to-target-language hard-copy dictionary can be used (this was done for Slovene, with 35 minutes necessary to extract all the translations of the English seeds).",
        "This first approach is limited to the languages in which grammatical gender is related to natural gender.",
        "Also, the results may vary according to the usage of the selected natural gender nouns in the corpus (for example, words like niece or rooster may not be very frequent in newswire corpora).",
        "A second, more general approach is to extract from the corpus a list of nouns selected on the basis of frequency, number of contexts with which they co-occur, and suffix patterns, and to label them with gender information by dictionary lookup.",
        "This approach guarantees that the seeds used are representative for the given corpus, so that the bootstrapping has a better chance to succeed.",
        "On the other hand, it presumes the existence of a gender annotated mono or bilingual dictionary (which might be more difficult to find than an unannotated bilingual dictionary).",
        "Our goal was to select a small set (50 or fewer2) of such words in order to minimize the human supervision required.",
        "The system was initially developed for Romanian.",
        "A list of 17,053 nouns were extracted from the MULTEXT-East Romanian lexicon (Erjavec et al., 1997).",
        "Unfortunately, all neuter nouns are listed as masculine in this lexicon, probably because morphologically, neuters and masculine are alike in the singular – for example, conac (tree) is masculine while conac (mansion) is neuter.",
        "Syntactically, neuter singular nouns occur in the same context as masculine singular nouns, so the gender agreement cannot be used to choose between the two class labels.",
        "Only 2,132 of the 17,053 known nouns appear in the corpus and we focus our attention on these nouns, as a relevant sample of nouns in the language.",
        "Starting from the English natural-gender words, seed nouns were obtained by projection using a scanned and OCRed bilingual Romanian-English dictionary.",
        "One major class of seed candidates were automatically and systematically eliminated, namely the multi-gender case where a male and female pair share the same translation (e.g. the masculine noun",
        "copil is a translation of both girl and boy, as well as daughter and son).",
        "All other seeds were retained (including poor ones) in order to avoid use of language-specific knowledge.",
        "For example, one of the Romanian seeds, fiu (son) is also a very frequent form of the verb a fi (to be), and therefore many verbal contexts are considered by the system from the beginning.",
        "One possible approach to correct this problem is to verify that the seeds extracted from the bilingual dictionary have only nominal meanings by checking them individually in a library dictionary.",
        "We did not take this approach, trying to keep the amount of supervision minimal."
      ]
    },
    {
      "heading": "2.2 Evidence Modeling",
      "text": [
        "Absolute rather than relative (normalized) frequencies are used to capture both the distributional infor",
        "not be made and the accuracy obtained for these nouns by predicting the most likely class (M.L.)",
        "and the class with most endings (M.V.)",
        "in the language"
      ]
    },
    {
      "heading": "2.5 Treatment of \"Unknown\" Words",
      "text": [
        "We expect that there will still exist some nouns that are rare and unusual (in terms of morphology) for which grammatical gender cannot be predicted by using both the contextual and morphological clues.",
        "In the Romanian test set, there were four such nouns: the single letters A, B, C, and the word fah, with 35, 15, 5, and 11 occurrences in the corpus respectively.",
        "One solution is to predict for these nouns the most common gender in the language.",
        "This is not necessarily optimal, because the words corresponding to the most common gender might have very regular morphology.",
        "A better solution, which we employ, may be to assign for the uncommon words in terms of morphology the gender with greater suffix variability (masculine in Romanian), as in Table 4."
      ]
    },
    {
      "heading": "2.6 Evaluation Methods",
      "text": [
        "We compute the coverage and accuracy of the system considering two estimation methods: type-based (all nouns are considered equally important and get a weight of one) and token-based (each prediction is weighted by the number of occurrences of the target noun in the corpus).",
        "For most languages, we had at least a main-POS annotated corpus, so that we could consider only the nominal instances of the words when computing the token coverage and accuracy.",
        "When such information is not available, one can approximate the token coverage and accuracy by considering all instances of the word forms from the noun list in the corpus, regardless their true POS.",
        "This estimation may provide inaccurate results.",
        "For example, if true POS were ignored when computing token accuracy in Romanian, the accuracy would be 96.75 instead of 98.25 at 100% coverage, mainly because of two very frequent words, bine (meaning good) and cdt (meaning quotient, how, and as), never used with their nominal senses in the corpus."
      ]
    },
    {
      "heading": "2.7 Further Considerations",
      "text": [
        "The main problem encountered is the initial coverage given by the context bootstrapping phase.",
        "The coverage can be increased by lowering the thresholds for context reliability, but this has the negative effect of lowering accuracy.",
        "The problem occurs primarily because of the size of the corpora used.",
        "Thus we ran the following experiment using Google-based searches of the largest corpus publicly available: the Web.",
        "Keller et al.",
        "(2002) show that the Web can be used as a reliable general source of lexical and syntactical information using search engines.",
        "When using natural gender seeds, the system finds two reliable left contexts, un and o, which are the indefinite articles in Romanian.",
        "When using system extracted seeds, six left contexts are found: un, nici un, acest, unui for masculine, o, and nici o for feminine .",
        "We randomly selected 50 nouns from Romanian imposing only the restriction that they are longer than 5 characters (to reduce the chance of getting results from documents in other languages that also have those lexical items) and formed queries of type \"masculine-context noun\" and \"feminine-context noun\" using the reliable contexts found by the system.",
        "By hypothesizing the gender as the one corresponding to the query with more hits, we obtained"
      ]
    },
    {
      "heading": "3 Evaluation on Multiple Languages",
      "text": [
        "We chose the following languages both because of the ground-truth resources available to us and because they represent three different language families (Romance, Slavic, and Germanic).",
        "Most languages have characteristic gender systems, so various adjustments of the general system described in this paper might be necessary.",
        "Our purpose has not been to do such adjustments: all results were obtained by the same system, with identical methodology of computing the parameters (considering corpus size, noun list size, number of occurrences of the known noun word forms in the corpus), as established for Romanian."
      ]
    },
    {
      "heading": "3.1 French",
      "text": [
        "French is a Romance language that has two grammatical genders, masculine and feminine.",
        "The results presented were obtained using 100,000 sentences from the French side of the Hansards, containing 2,767,775 words.",
        "We only had a list of 1,488 gender-annotated French nouns.",
        "The left contexts extracted as reliable by the system when starting with system-extracted seeds are the following: masculine: dernier, bon, ce, quel, nouveau, avant, excellent, Le, present, grand, le, aucun, meilleur, seul, 1 er, premier, certain, un; feminine: nouvelle, au-cune, quelle, telle, toute, grande, bonne, sa, and cette."
      ]
    },
    {
      "heading": "3.2 Spanish",
      "text": [
        "Like French, Spanish has two genders, which normally respect the natural gender for animate beings, but are semantically arbitrary for inanimate nouns.",
        "The neuter was eliminated historically, usually in favor of masculine.",
        "Most nouns in Spanish (73.5% in our test data) end in what can be considered a gender marker: a for feminine and o for masculine (Table 2).",
        "However, there are exceptions to these conventions, and words with other endings than o and a can correspond to either gender.",
        "The performance of the system in Spanish is presented in Table 7.",
        "We used a newswire corpus of",
        "12,258 sentences accounting for a total of 369,136 words, and a list of 16,302 nouns extracted from an on-line Spanish-English dictionary.",
        "We were surprised that system performance on Spanish was worse than for French and Romanian.",
        "The left contexts extracted by the system-seeded algorithm in the first step were quite reliable (iil-tima, iiltimo, misma, buen, una, alguna, nuevo, esa, ese, Esta, Este, algiin, citado, otra, otro, todo, cuyo, El, esta, este, primer, el, ningiin, ninguna, un) and would have been expected to yield higher accuracy.",
        "However, Spanish has the rather particular characteristic that masculine determiners are used with feminine nouns starting with stressed a or ha.",
        "13 of the 20 errors by type were made for such nouns and they further propagated in the morphology step.",
        "This suggests again that there can be language-specific idiosyncrasies limiting performance."
      ]
    },
    {
      "heading": "3.3 Slovene",
      "text": [
        "We chose Slovene as a representative for the Slavic languages (more precisely, South Slavonic) because of the availability of gender data and corpora from MULTEXT-East (where, as in Romanian, masculine and neuter are collapsed) and the IJS-ELAN Slovene Corpus (Erjavec, 2002).",
        "Four main groups of stems account for three gender classes: i and a stems are largely feminine, o stems are masculine when followed by a final consonant or neuter when correspond to nouns ending in o or -e, consonant stems are mostly neuter.",
        "The absence of definite and indefinite articles in Slovene poses an additional challenge for the bootstrapping algorithm, the language missing some of the most reliable grammatical gender clues.",
        "Therefore, we were not surprised to see that the coverage obtained when first running the system using natural gender nouns was very low, as shown in Table 8-a.",
        "Starting with system-extracted seeds, the initial coverage given by contextual clues is better and the performance is comparable to those for Romance",
        "languages, as shown in Table 8-b."
      ]
    },
    {
      "heading": "3.4 Swedish",
      "text": [
        "Swedish is part of the Northern Germanic (Scandinavian) group of languages.",
        "We extracted a gender-annotated noun list from the fine-grained-POS annotated (SUC-1).",
        "150 of the nouns were marked both as neuter and common in the corpus, so they were eliminated from the list of nouns.",
        "Because Swedish gender does not follow a standard masculine/feminine distinction, the projection of the English natural gender nouns (obtained from www.freedict.com) gives results close to random (Table 9-a).",
        "This is not necessarily a negative result.",
        "Rather, it shows that the system can not only predict gender for languages with masculine/feminine genders but can also identify languages in which the grammatical gender classes do not follow the natural gender distinction.",
        "When starting with system-extracted seeds (la-beled correctly as common or neuter), the results become good, especially for the context-bootstrapping step.",
        "Although Table 2 shows that a word's last letter alone is not a reliable gender indicator in Swedish, the variable-length suffix approach seems to handle the correlation between morphology and gender well."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "This paper has presented a set of algorithms for the high-accuracy, minimally supervised induction of grammatical gender.",
        "One approach is based on the translingual projection of natural gender, using only the translations of 60 words for which natural gender is marked in English.",
        "The second approach uses only a 50 word seed-exemplar set entered from a library dictionary.",
        "Using no other language-specific knowledge, the presented bootstrapping algorithm robustly combines both morphological and contextual models to achieve full gender annotation of the nouns in 5 diverse test languages."
      ]
    }
  ]
}
