{
  "info": {
    "authors": [
      "Nicoletta Calzolari",
      "Eugenio Picchi"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-1019",
    "title": "Acquisition of Semantic Information from an On-Line Dictionary",
    "url": "https://aclweb.org/anthology/C88-1019",
    "year": 1988
  },
  "references": [
    "acl-C82-2013",
    "acl-J87-3001",
    "acl-J87-3003",
    "acl-P81-1030",
    "acl-P84-1036",
    "acl-P85-1037",
    "acl-P86-1018"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "After the first work on machine-readable dictionaries (M RDs) in the seventies, and with the recent development of the concept of a lexical database (LDB) in which interaction, flexibility and multidimensionality can be achieved, but everything must be explicitly stated in advance, a new possibility which is now emerging is that of a procedural exploitation of the full range of semantic information implicitly contained in MRDs.",
        "The dictionary is considered in this framework as a primary source of basic general knowledge.",
        "In the paper we describe a project to develop a system which has word-sense acquisition from information contained in computerized dictionaries and knowledge organization as its main objectives.",
        "The approach consists in a discovery procedure technique operating on natural language definitions, which is recursively applied and refined.",
        "We start from free-text definitions, in natural language linear form, analyzing and converting them into informationally equivalent structured forms.",
        "This new approach, which aims at reorganizing free text into elaborately structured information, could he called the Lexical Knowledge Base (LK B) approach."
      ]
    },
    {
      "heading": "1. Background",
      "text": [
        "For a considerable period in theoretical and computational linguistics, there was a predominant lack of interest in lexical problems, which were regarded as being of minor importance with respect to \"core\" issues concerning linguistic phenomena, mainly of a syntactic nature.",
        "During the last few years, however, this trend has been almost reversed.",
        "The role of the lexicon in both linguistic theories and computational applications is now being greatly revalued and one aspect on which a number of research groups arc now focussing their attention is the possibility of reusing the large quantity of data contained in already existing machine-readable lexical sources, mainly dictionaries prepared for photocomposition, as a short cut in the construction of extensive NLP-oriented lexicons.",
        "This position was formulated very clearly in a number of papers presented at a recent workshop organized in Grosseto (Italy) and sponsored by the European Community (see Walker, Zampolli, Calzolari, forthcoming), and can be found in the set of recommendations which was one of the results of this workshop (lampolli 1987, pp.332-335).",
        "After the first work on machine-readable dictionaries (MRDs) in the seventies (see Olney 1972, Sherman 1974), and with the recent development of the concept of a lexical database (MB) in which interaction, flexibility and multidimensionality can be achieved, but everything must be explicitly stated in advance (see e.g. Amster 1980, Byrd 1983, Calzolari 1982, Michiels 1980), a new possibility which is now emerging is that of a procedural exploitation of the full range of semantic information implicitly contained in MRDs (see Wilks 1987, I3inot 1987, Alshawi forthcoming, Calzolari forthcoming).",
        "'the dictionary is now considered as a primary source not only of lexical knowledge but also of basic general knowledge (ranging over the entire \"world\"), and some of the dictionary systems which are being developed have knowledge acquisition and knowledge organization as their principal objectives (see also Lenat and Feigenbaum 1987).",
        "In this paper we describe a project which we arc now conducting on the acquisition of semantic information from computerized dictionaries.",
        "2.",
        "Data and established methods for hierarchical semantic classifying The data we use in our research include the lexical information contained in the Italian Machine Dictionary (DMI), which is already structured as a TDB and is mainly based on the Zingarelli Italian dictionary (1970); the DMI-DB has different types of linguistic information already accessible on-line.",
        "A morphological module generates and analyzes the inflected word-forms: approximately I million from 120,000 lemmas.",
        "Lemmas, word-forms, derivatives; suffixes, POS, usage codes, and specialized terminology codes, can be used as direct access search keys through which the user can query the database dictionary.",
        "On the semantic side, synonyms, hyponyms, and hypernyms constitute already implemented access paths covering all of the approximately 200,000 definitions contained in the dictionary.",
        "Examples of possible queries arc the following: give me all the nouns defined as names of vehicles, of sounds, of games, all the verbs defined by a particular genus term, for example 'MUOVERE' (to move), 'TAGLIARE' (to cut), etc.",
        "The procedures used to find",
        "hypernyms in definitions and to create taxonomies are similar to those used by other groups (see Chodorow 1985, Calzolari 1983, Amsler 1981).",
        "We have now begun work on restructuring another dictionary available in MRF, the Garzanti Italian dictionary (1984).",
        "A parser has been implemented which, on the basis of the typesetting codes for photocomposition, identifies the rough structure of each lexical entry.",
        "Fig.",
        "1 displays the output of a parsed entry of the Garzanti dictionary.",
        "Fig.",
        "2 represents the provisional model for a monolingual lexical entry as we have defined it so far.",
        "Fig.",
        "3 gives the projection of the first interpretation of the typesetting codes into this model; other kinds of information will be added afterwards (for example, that obtained by the inductive procedures described in the paper).",
        "abito, vestimento; maniera di vestire (anche (fig.))",
        "/ (essere bene), (male in), -, trovarsi in buone, cat-tive condizioni fisiche o economiche.",
        "The merging of part of the data of the DM I and the Garzanti dictionary into a single L,D13 has already been completed, e.g. for lemmas, POSs, usage codes, etc.",
        "We now have to tackle the problem of reorganizing the semantic data (definitions and examples).",
        "Here our strategy is to design a new procedural system which is able to gradually \"learn\" and acquire semantic information from dictionary definitions, going well beyond the IS-A hierarchies constructed so far, in order to attempt to also capture what is present in the \"differentia\" part of the definition.",
        "This can be achieved with some success given the particular nature of lexicographic definitions, with: a) a generic (and perhaps over simplistic) description of the \"world\"; b) a rather lexically and syntactically constrained arid a somewhat regular natural language text (Calzolari 1984, Wilks 1987).",
        "After having mapped the codes for photocomposition into linguistically relevant codes, all the preliminarily parsed data of the Garzanti have been organized on a PC in the form of a Textual Database (DBT), a full-text Information Retrieval (IR) system in which all occurrences of any word-form or lemma can be directly accessed (Picchi 1983).",
        "The DBT has been found to he a very powerful tool in evidencing lexical units and particular syntagms which can then be exploited in our \"patternmatching\" procedure.",
        "With the text in DBT form it is possible to search occurrences of single word-forms in definitions and examples, lemmas, codes of various types (POS, specialized languages, usage labels, etc.",
        "), and also cooccurrences of any of these items throughout the entire dictionary.",
        "In addition, structures composed of combinations of the above elements connected by the logical operators \"and\" and \"or to any degree of complexity can also be searched.",
        "The results of such queries arc returned together with the pertinent dictionary entries.",
        "Obviously frequencies can also be obtained.",
        "All this information can he retrieved with fast interactive access.",
        "We have therefore already implemented two types of organization for dictionary data:",
        "1) DB-type organization with the DMI (we have not used a standard DBMS, but an ad hoc designed relational DB system); 2) a full-text IR system for the Garzanti dictionary.",
        "Although both types of organization have proved to be very powerful tools for different scopes, at the same time each presents certain drawbacks and difficulties, clue to the particular nature of dictionary data which in neither case has it been possible to fully exploit.",
        "Dictionary data is in fact of a very particular nature, consisting of a combination of free text in a highly organized structure.",
        "The DB approach copes well with the second characteristic, while the IR approach is successful in handling free text.",
        "However neither is capable of fully exploiting the two features in combination.",
        "A new method must be envisaged, capable of reorganizing free text into elaborately structured information: this could be called the Lexical Knowledge Base (LK B) approach, and is the aim of the project described here."
      ]
    },
    {
      "heading": "3. Techniques for word-sense acquisition",
      "text": [
        "Discovery procedure techniques prove to be useful in extracting semantic information from definition texts.",
        "In general, our approach consists in starting from free-text definitions, in natural language linear form, analyzing and converting them into informationally equivalent structured forms.",
        "The preliminary step of the work consisted in applying the morphological analyzer to the definitions; the result of this process for one definition appears in Fig. 4.",
        "A program designed for homograph disambiguation was then run on the otput produced by this morphological processor.",
        "'the disambiguator consists partly in rules generally valid for Italian, based on the immediate right and left context, and partly in ad hoc rules written for the particular syntax used in lexicographic definitions.",
        "Fig.",
        "5 shows the result of applying this disambiguation procedure to all the homographs shown in the preceding example.",
        "We then had to implement a set of discovery procedures acting on dictionary definitions.",
        "The first analysis of the definitional data was performed manually for single definitions, and quantitatively for the most frequently occurring words and syntagms.",
        "From this analysis we have established a number of broadly defined and simplified Categories of knowledge and Relations, which on the one hand intuitively reflect basic \"conceptual categories\" and on the other represent attested lexicographic definitional categories.",
        "They also rely on past experience of similar work (both on Italian and on English), or of Al research.",
        "In order to allow the inductive",
        "pattern-matching rules to perform the successive phases correctly and so that more coherent retrieval operations are possible, a \"basic vocabulary\" has been established (both for the \"Categories\" and for the \"Relations\") mainly on the basis of quantitative and intuitive considerations, and is constituted by words acting as Labels.",
        "As an example, the following lemmas.",
        ": 'arnese, attrezzo, dispositivo, strumento, congegno', which altogether appear in dictionary definitions 761 times, have been grouped under the Label 'INSTRUMENT'.",
        "Other examples of Labels belonging to the basic vocabulary which have been established for hypernyms arc the following: SET, PART, SCIENCE, IIEMAN, ANIMAL, PLACE, ACT, 1,ITICT, LIQUID, PLANT, INI 1ABITANT, SOUND, GAME, 'FIAT I MOVE, 1111COM F., LOSE, etc.",
        "'this is, therefore, our approach.",
        "We begin with a system which has simple and general purpose pattern-matching capabilities, designing it as an incremental system.",
        "To cope with the fact that there are variations in the way the same conceptual category or the same relation is linguistically (lexically and'or syntactically) rendered in natural language definitions, earls such category or relation is associated with a list of specified lexical units and.",
        "or syntactic features which give the variant forms.",
        "The search is then driven by these lists of patterns to handle the grammatical and lexical variations.",
        "The \"pattern-matching\" strategy has been obviously integrated with the Italian morphological analyzer to handle inflectional variation.",
        "The patterns may contain either Labels, or Lemmas, or Word-forms.",
        "For the Labels, the system searches for all the associated lemmas and all their word-forms (unless otherwise specified); in the same way Lemmas are automatically expanded to cover their inflected word-forms.",
        "Generally, we look for recurring patterns us the definitions and attempt to associate them with corresponding relations or conceptual categories.",
        "Fig.",
        "6 lists some of the entries and definitions obtained when querying the dictionary in DBT form for cooccurrences of items such as 'science, discipline, branch,...' together with 'studies, concerns, ...'.",
        "Analyzing the",
        "results of similar queries to the dictionary we arc able to better identify a number of patterns to be used in the semantic scanning of the definitions.",
        "i farmaci a la lord azione terapeutica sull'organismo.",
        "21) TOSSICOLOGIA : PoS s.f.",
        "branca della medicina che studia la natura e gli effetti delle sostanze velenose e dei lord antidoti.",
        "searching for ... SPECIALITA' & STUDIA 1) CARDIOLOGIA : PoS s.f.",
        "((med.))",
        "la specialith che studia le funzioni e le malattie del cuore.",
        "searching for ... RAMO & STUDIA 3) ONOMASTICA : PoS s.f.",
        "race della linguistica che studia i nomi propri di persona o di luogo.",
        "searching for ... SCIENZA & OCCUPA 4) PAPIROLOGIA : PoS s.f.",
        "scienza che si occupa dello studio e dell'interpretazione degli antichi papiri.",
        "searching for ... DISCIPLINA & OCCUPA 1) AUXOLOGIA : PoS s.f.",
        "discipline delle scienze biologiche",
        "che si occupa dell'accrescimento degli organismi, in particolare di quello umano.",
        "2) NEUROPSICHIATRIA : P05 s.f.",
        "discipline medica che si occupa delle malattie nervose e mentali.",
        "searching for ... DISCIPLINA & STUDIA 1) ALGOLOGIA : PoS s.f.",
        "discipline medica che studia le cause a le terapie del dolore.",
        "13) IMMUNOLOGIA : PoS s.f.",
        "discipline biologica che studia i fenomeni immunitari.",
        "Fig.",
        "6 - Same examples of queries to the dictionary in OBT form.",
        "This is an example of a pattern where the Labels SCIENCE and STUDY appear: iDct/AdjJ SCIENCE rdi NP/*Adj/e NE] 'che' (mediante NP)",
        "where the following are the lemmas associated to the Labels: SCIENCE = (scienza, disciplina, specialita', branca, ramo, parte) STUDY = (studia, si occupa di).",
        "NP-011.I is the subject matter of the science, The results of a first run through the whole dictionary using an initial set of patterns can afterwards be recursively revised when new data are acquired.",
        "Our practical global research strategy is to develop a system which at the beginning has only a generalized expertise.",
        "This system obviously breaks down at many points on its first run; we can then evaluate all these points, and consider when and where measures must be taken to overcome specific difficulties.",
        "In this way, new capabilities can be added incrementally to the system so that gradually it is able to cope with increasingly difficult data.",
        "Thus we systematically add new \"knowledge\" to the system, prompted each time by a failure to cope with the given data.",
        "It seems to us that this is a practical research strategy for eliciting and modelling vague and fuzzy knowledge.",
        "Even though the methodological approach has been deliberately simplified at the beginning (in order to introduce problems gradually, a few at a time), the dimensions of the data have not been limited in any way.",
        "4.",
        "The knowledge organization.",
        "Although the body of knowledge with which we are dealing is at least partly based on intuition, on vague and not even coherent data (as lexicographic definitions often are), and on inductive empirical strategies, we must attempt to model the knowledge as the system acquires it.",
        "The formalism for the representation of word-senses is as follows.",
        "Each element is defined as a Function characterized by a Type and Arguments.",
        "The Type qualifies the function.",
        "The main types include: Ilypernym, Relation, Qualifier, etc.",
        "Examples of the Type.Relation arc: USED, PRODUCED, IN-THE-FORM, STUDY, LACK, etc.",
        "The type I lypernym can he instantiated by: I lyperriym proper, PART, SET, etc.",
        "Arguments may be either Terms, or Terms plus Function, or Functions.",
        "A Term can he a Label, a Word, or a combination of these with the logical operators 'and/or'.",
        "A Word can be either a Word-form, or a Lemma plus Grammatical Information (e.g. INpI means plural Noun).",
        "The following definitions: Batterio, s.m., microrganismo vegetate unicellulare privo di clorofilla.",
        "13atteriolo0a, s.f., parte della microbiologia else studia i hatters.",
        "are now represented as: Batterio --def-- > f(T.ITYP,INIoncrorganismo, fCLQUALfAlvegetale , lAlunicellulareL f(f.REL,-LACK,INIclorofilla)) Battetiologia --def-- > f(T.HYP-PART, f(T.REL-SPEC,INImicrobiologia), f(T.RE1.-STUD,]Nplbancrio)).",
        "As the metalanguage and the rules arc declared separately from the pattern-matching parser, the system is incremental, flexible, portable (it can be used with other languages or other dictionaries), and testable.",
        "In fact, the system has been designed so that it is easy to test alternative strategies or sets of rules or constraints.",
        "This kind of organization will allow us to draw inferences, using part of the formal structure associated to an entry and inserting it in other structures in which that entry appears as",
        "an Argument.",
        "For example, 'inicrobiologia' present in the second definition above is defined in its turn as 'parte della biologic cite studia i microrganismi...', translated as (T.11YP-PARTAT.R111,-SPIX1,INIbiologia)), and 'biologic' which is 'scitinza che studia i fenomeni della vita...' is finally defined as T.11YP-SCIENCE.",
        "This last Label SCIENCE is obviously also inherited by 'Batteriologia' and by.. 'Microbiologia'."
      ]
    },
    {
      "heading": "5. Some experimental results",
      "text": [
        "Already after just one run, by looking at cooccurrences of hypernyms and particular relations, we can identify those environments in which certain relations are most likely to appear, or in which certain ambiguous lexical and/or syntactic cues (e.g. the prepositions PER 'for', DI 'of, A 'to', etc.)",
        "can be disambiguated as referring to only one relation, or in which certain relations are never found, and so on.",
        "A set of constraining rules can be associated to certain conceptual units (Ilypernyans or Relations, expanded automatically to all die pertinent lexical realizations) in order to disambiguate their immediate context.",
        "Sonic units therefore activate particular subroutines for an ad-hoc interpretation of what follows.",
        "These rules explicitly look for items to which a determined meaning is associated.",
        "hi the following pattern, we have a rule which,.",
        "after an USED relation, links the word -in\" to a 'place' relation, the words -per: a (for/to) to the purpose, \"cla- (by) to the agent, and \"conic\" (as) to the way of usage.",
        "Other kinds of relations arc not activated by a particular rule, but have a meaning in themselves, e.g. CONSTII BY, SIMILAR To, etc.",
        "builds up, as completely as possible with this methodology, a formal description of the structure of the lexical definitions.",
        "At the end, from a comparison of the different formalized stuctures generated, we will be able to associate structures which differ for only one element (a conceptual category or relation).",
        "In this way, we can construct something like \"minimal pairs\" of sense-definitions, which only differ in one conceptual or relational feature.",
        "It can be reasonably supposed that this feature is related or realizes one of the differences between these words.",
        "It will also be possible to build hierarchies not only for hypernyms, but also, and more interestingly, for complex conceptual structures considered as a whole."
      ]
    }
  ]
}
