{
  "info": {
    "authors": [
      "T. P. Kehler",
      "R. C. Woods"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P80-1031",
    "title": "ATN Grammar Modeling in Applied Linguistics",
    "url": "https://aclweb.org/anthology/P80-1031",
    "year": 1980
  },
  "references": [
    "acl-J79-1055c"
  ],
  "sections": [
    {
      "text": [
        "ABSTRACT: AugmentedlransitiOn Network grammars have significant areas of unexplored application as a simulation tool for grammar designers.",
        "The intent of this paper is to discuss some current efforts in developing a grammar testing tool for the specialist in linguistics.",
        "The scope of the system under discussion is to display structures based on the modeled grammar.",
        "Full language definition with facilitation of semantic interpretation is not within the scope of the systems described in this Paper.",
        "Application of grannar testing to an applied linguistics research enviiimment is emphasized.",
        "Extensions to the teaching of linguistics principles and to refinement of the primitive AIN functions are also considered."
      ]
    },
    {
      "heading": "1. Using Network Mbdels in Experimental Grammar Design",
      "text": [
        "Application of the ATN to general grammar modeling for simulation and comparative purposes was first suggested by Woods(1).",
        "notivating factors for using the network model as an applied grammar design tool are:",
        "1.",
        "The model provides a means of organizing structural descriptions at any level, fron surface syntax to deep propositional interpretations.",
        "2.",
        "A network model may be used to represent different theoretical approaches to grammar definition.",
        "3.",
        "The graphical representation of a grammar permitted by the network model is a relatively clear and precise way to express notions about structure.",
        "4.",
        "Computational simulation of the grammar enables systematic tracing of subcceponents and testing against text data.",
        "Grimes (2), in a series of linguistics workshops, demonstrated the utility of the network model even in enviimuftmts where computational testing of grammars was not possible.",
        "Grimes, along with other contributors to the referenced work, illustrated the flexibility of the AlN in tagmemic analysis of grammatical structures.",
        "AIN implementations have mostly focused on effective natural language understanding systems, assuming a computationally sophisticated research envi uLuent.",
        "Implementations are often in an environment which requires some in-depth understanding and support of LISP systems.",
        "Recently much of the information on the AIN formalism, applications and techniques for implementation was summarized by Bates (3).",
        "Though many system have been developed, little attention has been given to creating an interactive grammar modeling system for an individual with highly developed linguistics skills but poorly developed computational skills.",
        "The individual involved in field linguistics is concerned with developing concise workable descriptions of some corpus of data in a given language.",
        "Particular problems in developing rules for interpreting surface structures are proposed and discussed in relation to the data.",
        "In field Linguistics applications, this involves developing a taxonomy of structural types followed by hypothesizing underlying rule systems which provide the highest level of data integration at a syntactic as well as semantic Level of analysis.",
        "The AIN is proposed as a tool for assisting the linguist to develop systematic descriptions of language data.",
        "It is assumed that the typical user will interface with the system at a point where an ATN and lexicon have been developed.",
        "The AIN is developed from the theoretical model chosen by the linguist.",
        "Once the AIN is implemented as a computational procedure, the user enters test data, displays structures, examines the lexicon, and edits the grammar to produce a refined AIN grammar description.",
        "The displayed structures provide a labeled structural interpretation of the input string based on the linguistic model used.",
        "Trac-ing'of the parse may be used to follow the process of building the structural interpretation.",
        "Computational implementation requires giving attention to the details of the interrelationships of grammatical rules and the interaction between the grammar rule system and the lexical representation.",
        "Testing the grammar against data forces a level of systemization that is significantly more rigorous than discussion oriented evaluation of gramar sys tens."
      ]
    },
    {
      "heading": "2. Design Considerations",
      "text": [
        "The general design goal for the grammar testing system described here is to provide a tool for develop:ing experimentally driven, systematic representation models of language data.",
        "Engineering of a full Language understanding system is not the primary focus of the efforts described in this paper.",
        "Ideally, one would like to provide a tool which would attract applied linguists to use such a system as a simulation environment for model development.",
        "The design goals for the systems described are:",
        "1.",
        "Ease of use for both novice and expert modes of operation, 2.",
        "Perspicuity of grammar representation, 3.",
        "Support for a variety of linguistic theories, 4.",
        "Transportability to a variety of systems.",
        "The prototype grammar design system consists of a grammar generator, an editor, and a monitor.",
        "The function of the grammar editor is to provide a means of defining and manipulating grammar descriptions without requiring the user to work in a specific programming language environment.",
        "The editor is also used to edit lexicons.",
        "The editor krows about the AIN environment and can provide assistance to the user as needed.",
        "The monitor's function is to handle input and output of grammar and lexicon files, manage displays and =art..; of parsings, provide consultation on the systen use as needed, and enable the user to cycle fron editor to parsing with minima effort.",
        "The monitor can also be used to provide facilities for studying grammar efficiency.",
        "Transportability of the grammar modeling system is established by a program generator which enables implementation in different programming languages."
      ]
    },
    {
      "heading": "3. Two Implementations of Grammar Testing Systems",
      "text": [
        "To develop some understanding on the design and implementation requirements for a system as specified in the previous section, two experimental grammar testing systems have been developed.",
        "A partial AIN implementation was done by Kehler(4) in a system (SNOPAR) which provided some interactive grammar and development facilities.",
        "SNOPAR incorporated several of the basic features of a grammar generator and monitor, with a limited editor, a grammar generator and a number of other features.",
        "Both SNOPAR and ADEPT are implemented in SNOBOL and both have been transported across operating systems (i.e. TOPS-20 to IBM's CMS).",
        "For implementation of text editing and program grammar generation, the SNOBOL4 language is reasonable.",
        "However, the lack of comprehensive list storage management is a limitation on the extension of this implementation to a full natural language understanding system.",
        "Originally, SNOBOL was used because a suitable I.TCP was not available to the implementor."
      ]
    },
    {
      "heading": "3.1 SNOPAR",
      "text": [
        "SNOPAR provides the following functions: grammar creation and editing, lexicon creation and editing, execution (with scae error trapping), traring/debugging and file handling.",
        "The grannar creation portion has as an option use of an interactive gramar to create an ATN.",
        "One of the goals in the design of SAOPAILums to introduce a notation which was easier to read than the LISP representation most frequently used.",
        "Two basic formats have been used for writing grammars in SAMUL One separates the context-free syntax type operations fran the tests and actions of the grammar.",
        "This action block format is of the following general form: arc type-block state arc-type :S(DO(test-action-block))",
        "where arc-type is a CAT, PARSE or FINDWRD etc., and the test-action-block appears as follows: test-action-block state arc-test !",
        "action :S(TD(arc-type-block)) arc-test I action :S('DO(arc-type-block)) where an arc-test is a COMPAR or other test and an action is a SETR or BUILDS type action.",
        "Note that an additional intermediate state is introduced for the test and actions of the A.",
        "The more sts dard format used is given as: state-4 arc-type --;pcondition-test-and-action-block --ipnew-state An exaaple noun phrase is given as:",
        "NP CAT('DET) SETR('NP','DET',Q) :S(IO('ALW)) CAT('NPR') sbut(We','NPR',Q) : S ('ID( ' POP1P ' ) )F (FREIURN) ADJ CAT('ADJ') SEIX('RP','ADJ',Q) :S(TO('ADJ\")) CAT('N') SaR('NP','N',Q) :SCIOCNMF(FREIURN) NP?",
        "PARSE(PP()) SEIR('NP','NFP',Q):S(TO('UPP')) POPNP NP = BUILDS (NP) :(REILTO)",
        "The Parse function calls subnetworks which consist of Parse, Cat or other arc-types.",
        "Structures are initially built through use of the Stilt function which uses the top level constituent name (e.g. NP) to form a list of the constituents referenced by the register name in SEM.",
        "All registers are treated as stacks.",
        "The BUILDS function may use the implicit register name sequence as a default to build the named structure.",
        "The top level constituent naae (i.e. NP) contains a list of the registers set during the parse which beccaes the default list for structure building.",
        "There are gldbal stacks for history taking and back up functions.",
        "Typically, for other than the initial creation of a"
      ]
    },
    {
      "heading": "3.2 ADEPT",
      "text": [
        "In an effort to make an easy-to-use simulation tool for linguists, the basic concepts of SNOPAR were extended by Wbods(5) to a full MN implementation in a system called ADEPT.",
        "ADEPT is a system for generating AMIN pro4 grans through the use of a network editor, lexicon editor, error correction and detection component, and a monitor for execution of the grammar.",
        "Figure 1 shows the system organization of ADEPT.",
        "State, network, and arc editing are distinguished by context and the arguments of the E, D, or I commands.",
        "For a previously undefined E net causes definition of the network.",
        "The user must specify all states in the network before starting.",
        "The editor processes the state list requesting arc relations and air information such as the tests or arc actions.",
        "The states are used to help diagnose errors caused by misspelling If a state or omission of a state.",
        "Once the network is defined, arcs may by edited by specifying the origin and destination of the arc.",
        "The arc information is presented in the following order: arc destination, arc type, arc test and arc actions.",
        "Each of",
        "these it is displayed, permitting the user to change values on the arc list by typing in the needed information.",
        "MUltiple arcs between states are differentiated by specifying the order number of the arc or by displaying all arcs to the user and requesting selection of the desired arc.",
        "New arcs are inserted in the network by the I ccm-mend.",
        "Nhenever an arc insert is performed all arcs from the state are mcbered and displayed.",
        "After the user specifies the number of the arc that the new arc is to follow, the arc information is entered.",
        "Arcs may be reordered by specifying the starting state for the arcs of interest using the 0 command.",
        "The user is then requested to specify the new ordering of the arcs.",
        "Insertion and deletion of a state requires that the editor determine the states which may be reached from the new state as well as finding which arcs terminate on the new state.",
        "Once this information has been established, the arc information may be entered.",
        "Nhen a state is deleted, all arcs which immediately leave the state or which enter the state fras other states are removed.",
        "Error conditions existing in the network as a result of the deletion are then reported.",
        "The user then either verifies the requested deletion and corrects any errors or cancels the request.",
        "Grammar files are stored in a list format.",
        "The PUT command causes all networks currently defined to be written out to a file.",
        "GET will read in and define a grammar.",
        "If the network is already defined, the network is not read in.",
        "By placing a series of checking functions in an AlN editor, it is possible to filter out many potential errors before a grammar is tested.",
        "The user is Able to focus an the grammar model and not on the specific pro-gnawing requirements.",
        "A monitor program provides a top level interface to the user once a grammar is defined for parsing sentences.",
        "In addition, the monitor program manages the stacks as well as the SEM, LIFT and HOLD lists for the network grammar.",
        "Switches may be set to control the tracing of the parse.",
        "An additional feature of the Udods ADEPT system is the use of easy to read displays for the lexicon and grammar.",
        "An example arc is shown:",
        "ADEPT has been used to develop a small grammar of English.",
        "Future experiments are planned for using ADEPT in an linguistics applications oriented environ-rent."
      ]
    },
    {
      "heading": "4. Experiments in Grammar Modeling",
      "text": [
        "Utilization of the ATN as a grammar definition system in Linguistics and language education is still at an early stage of development.",
        "Ueischedel et.al.",
        "(6) have developed an AIN-based system as an intelligent CAI too for teaching foreign language.",
        "ithin the SNOPAR system, experiments in modeling English transformational grammar exercises and modeling field linguistics exercises have been carried out.",
        "In field linguistics research some grammar development has been done.",
        "Of interest here is the systematic formulation of rule systems associated with the syntax and semantics of natural Language subsystems.",
        "Proposed model grammars can be evaluated for efficiency of representation and extendibility to a larger corpus of data.",
        "Essential to this approach is the existence of a self-contained easy-to-use transportable AIN modeling systems.",
        "In the following sections some example applications of grammar testing to field linguistics exercises and application to modeling a Language indigenous to the Philippines are given."
      ]
    },
    {
      "heading": "4.1 An Exercise Computationally Assisted Taxonomy",
      "text": [
        "Typical exercises in a first course in field linguistics give the student a series of phrases or sentences in a language not known to the student.",
        "Taxonomic analysis of the data is to be done producing a set of formulas for constituent types and the hierarchical relationship of constituents.",
        "In this particular case a tagmemic analysis is done.",
        "Consider the following three sentences selected from Apinaye exercise (Problem 100)(7): kukren kokoi the monkey eats kukren kokoi rack the big Monkey eats ape rack mih mach the good man works well First a simple lexicon is contructed, from this and other data.",
        "Secondly, immediate constituent analysis is carried out to yield the following tagmemic formulae:",
        "The AIN is then defined as a simple syntactic organization of constituent types.",
        "The SROPAR representation of this grammar would be:",
        "Thus permitting the parse of the first sentence (Kukren kokoi) as:",
        "corrections to the grammar as needed.",
        "Once the basic notions of syntax and hierarchy are established, the model may then be extended to incorporate context-sensitive and semantic features.",
        "Frequently, in proposing a taxonomy for a series of sentences, one is tempted to propose raverous structural types in order to handle all of the data.",
        "The orientation of grammar testing encourages the user to look for more concise representations.",
        "Tracing the sentence parse can yield information about the efficiency of the representation.",
        "Tracing is also illustrative to the student, permitting many parsings to be Observed."
      ]
    },
    {
      "heading": "4.2 Cotabato Manobo",
      "text": [
        "An A2N representation of a graamar for Cotabato Mancbo was done by Errington(3) using the manual proposed by Grimes (2).",
        "Recently, the gramma:class implemented and tested using SNOPAR.",
        "The implementation took place over a three month period with initial implementation at the word level and eventual extension to the clause level with conjunctions and eabedding.",
        "Comments were used throughout the grammar OD explain the rational for particular arc types, tests or actions.",
        "A.wide variety of clause types are handled by the grammar A specific requirement in the Mambo grammar is the ability to handle a significant amount of testing on the arcs.",
        "For example, it is not uncaumon to have three or for arcs of the same type differentiated by checks on registers from previous points in the parse.",
        "With nine network types, this leads to a considerable amount of time being spent in context checking.",
        "A straight forward approach to the grammar design leads to a considerable amount of backing up in the parse.",
        "tile a high speed parse was not an objective of the design, it did point out the difficulty in designing gramrs of significant size without getting in to provamming practice and applying more efficient parsing routines.",
        "Since an objective of the project is to provide a system which emphasizes the linguistics and not prograaming practice, it was necessary to maintain descriptive clarity at the sacrifice of performance.",
        "An example parse for a clause is given:"
      ]
    },
    {
      "heading": "E.G kAEN SA STAN SA BEGAS -- The person is eating rice GLOSS: EAT THE PERSON.PEOPLE THE RICE",
      "text": []
    },
    {
      "heading": "(DET SA) (NUC (MCC",
      "text": []
    },
    {
      "heading": "(HP",
      "text": [
        "Development of a relatively easy to use, transportable graamar design system can make pcssible the use of grammar modeling in the applied linguistics environment, in education and in linguistics research.",
        "A first step in this effort has been carried out by implementing, tao experimental systems,SNOPAR and ADE°T, which emphasize notational clarity and an editor/monitor interface to the user.",
        "The network editor is designed to provide error handling, correction and interactionwith the user in establishing a network model of the grammar Some applications of SNOPAR have been made to testing taxonomically based grammars.",
        "Future use of ADEPT in the linguistics education/research is planned.",
        "Developing a user-oriented Am modeling system for linguists provides certain insights to the AT N model itself.",
        "Such things as the perspicuity of the A1 representation of a grammar and the ATN model applicability to a variety of language types can be evaluated.",
        "In addition, a core widespread application of AINs can lead to same standardization in grammar modeling.",
        "The related issue of developing interfaces for user extension of gramars in natural language processing systeas can be investigated fran increased use of the ATN model by the person who is not a sperialist in artificial intelligence.",
        "The systems general design does not Limit itself to application to the AZA model."
      ]
    },
    {
      "heading": "6. References",
      "text": []
    }
  ]
}
