{
  "info": {
    "authors": [
      "Wan-Yu Lin",
      "Nanyun Peng",
      "Chun-Chao Yen",
      "Shou-de Lin"
    ],
    "book": "ACL",
    "id": "acl-P12-3025",
    "title": "Online Plagiarized Detection Through Exploiting Lexical, Syntax, and Semantic Information",
    "url": "https://aclweb.org/anthology/P12-3025",
    "year": 2012
  },
  "references": [
    "acl-C10-2115"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we introduce a framework that identifies online plagiarism by exploiting lexical, syntactic and semantic features that includes duplication-gram, reordering and alignment of words, POS and phrase tags, and semantic similarity of sentences.",
        "We establish an ensemble framework to combine the predictions of each model.",
        "Results demonstrate that our system can not only find considerable amount of real-world online plagiarism cases but also outperforms several state-of-the-art algorithms and commercial software."
      ]
    },
    {
      "heading": "Keywords",
      "text": []
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Online plagiarism, the action of trying to create a new piece of writing by copying, reorganizing or rewriting others?",
        "work identified through search engines, is one of the most commonly seen misusage of the highly matured web technologies.",
        "As implied by the experiment conducted by (Braumoeller and Gaines, 2001), a powerful plagiarism detection system can effectively discourage people from plagiarizing others?",
        "work.",
        "A common strategy people adopt for online-plagiarism detection is as follows.",
        "First they identify several suspicious sentences from the write-up and feed them one by one as a query to a search engine to obtain a set of documents.",
        "Then human reviewers can manually examine whether these documents are truly the sources of the suspicious sentences.",
        "While it is quite straightforward and effective, the limitation of this strategy is obvious.",
        "First, since the length of search query is limited, suspicious sentences are usually queried and examined independently.",
        "Therefore, it is harder to identify document level plagiarism than sentence level plagiarism.",
        "Second, manually checking whether a query sentence plagiarizes certain websites requires specific domain and language knowledge as well as considerable amount of energy and time.",
        "To overcome the above shortcomings, we introduce an online plagiarism detection system using natural language processing techniques to simulate the above reverse-engineering approach.",
        "We develop an ensemble framework that integrates lexical, syntactic and semantic features to achieve this goal.",
        "Our system is language independent and we have implemented both Chinese and English versions for evaluation."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "Plagiarism detection has been widely discussed in the past decades (Zou et al., 2010).",
        "Table 1. summarizes some of them:"
      ]
    },
    {
      "heading": "Matching percentage of",
      "text": [
        "words with given thresholds on both ratio and absolute number of words in passage.",
        "Table 1.",
        "Summary of related works Comparing to those systems, our system exploits more sophisticated syntactic and semantic information to simulate what plagiarists are trying to do.",
        "There are several online or charged/free downloadable plagiarism detection systems such as Turnitin, EVE2, Docol?",
        "c, and CATPPDS which detect mainly verbatim copy.",
        "Others such as Microsoft Plagiarism Detector (MPD), Safeassign, Copyscape and VeriGuide, claim to be capable of detecting obfuscations.",
        "Unfortunately those commercial systems do not reveal the detail strategies used, therefore it is hard to judge and reproduce their results for comparison."
      ]
    },
    {
      "heading": "3. Methodology",
      "text": [
        "The data flow is shown above in Figure 1."
      ]
    },
    {
      "heading": "3.1 Query a Search Engine",
      "text": [
        "We first break down each article into a series of queries to query a search engine.",
        "Several systems such as (Liu at al., 2007) have proposed a similar idea.",
        "The main difference between our method and theirs is that we send unquoted queries rather than quoted ones.",
        "We do not require the search results to completely match to the query sentence.",
        "This strategy allows us to not only identify the copy/paste type of plagiarism but also re-write/edit type of plagiarism."
      ]
    },
    {
      "heading": "3.2 Sentence-based Plagiarism Detection",
      "text": [
        "Since not all outputs of a search engine contain an exact copy of the query, we need a model to quantify how likely each of them is the source of plagiarism.",
        "For better efficiency, our experiment exploits the snippet of a search output to represent the whole document.",
        "That is, we want to measure how likely a snippet is the plagiarized source of the query.",
        "We designed several models which utilized rich lexical, syntactic and semantic features to pursue this goal, and the details are discussed below.",
        "One straightforward measure is to exploit the n-gram similarity between source and target texts.",
        "We first enumerate all n-grams in source, and then calculate the overlap percentage with the n-grams in the target.",
        "The larger n is, the harder for this feature to detect plagiarism with insertion, replacement, and deletion.",
        "In the experiment, we choose n=2.",
        "Plagiarism can come from the reordering of words.",
        "We argue that the permutation distance between S1 and S2 is an important indicator for reordered plagiarism.",
        "The permutation distance is defined as the minimum number of pairwise exchanging of matched words needed to transform a sentence, S2, to contain the same order of matched words as another sentence, S1.",
        "As mentioned in (S?rensena and Sevaux, 2005), the permutation distance can be calculated by the following expression",
        "word in sentences S1 and S2 respectively and n is the number of matched words between the sentences S1 and S2.",
        "Let ?",
        "= n2?",
        "n",
        "be the normalized term, which is the maximum possible distance between S1 and S2, then the reordering",
        "score of the two sentences, expressed as s(S1, S2),",
        "Besides reordering, plagiarists often insert or delete words in a sentence.",
        "We try to model such behavior by finding the alignment of two word sequences.",
        "We perform the alignment using a dynamic programming method as mentioned in (Wagner and Fischer, 1975).",
        "However, such alignment score does not reflect the continuity of the matched words, which can be an important cue to identify plagiarism.",
        "To overcome such drawback, we modify the score as below.",
        "matched word in M. This implies we prefer fewer unmatched words in between two matched ones.",
        "3.2.4 POS and Phrase Tags of Words (PT, PP) Exploiting only lexical features can sometimes result in some false positive cases because two sets of matched words can play different roles in the sentences.",
        "See S1 and S2 in Table 2. as a possible false positive case.",
        "S1: The man likes the woman S2: The woman is like the man",
        "Therefore, we further explore syntactic features for plagiarism detection.",
        "To achieve this goal, we utilize a parser to obtain POS and phrase tags of the words.",
        "Then we design an equation to measure the tag/phrase similarity.",
        "We paid special attention to the case that transforms a sentence from an active form to a passive-form or vice versa.",
        "A subject originally in a Noun Phrase can become a Preposition Phrase, i.e. ?by ?",
        "?, in the passive form while the object in a Verb Phrase can become a new subject in a Noun Phrase.",
        "Here we utilize the Stanford Dependency provided by Stanford Parser to match the tag/phrase between active and passive sentences.",
        "Plagiarists, sometimes, change words or phrases to those with similar meanings.",
        "While previous works (Y. Lin et al., 2006) often explore semantic similarity using lexical databases such as WordNet to find synonyms, we exploit a topic model, specifically latent Dirichlet alocation (LDA, D. M. Blei et al., 2003), to extract the semantic features of sentences.",
        "Given a set of documents represented by their word sequences, and a topic number n, LDA learns the word distribution for each topic and the topic distribution for each document which maximize the likelihood of the word co-occurrence in a document.",
        "The topic distribution is often taken as semantics of a document.",
        "We use LDA to obtain the topic distribution of a query and a candidate snippet, and compare the cosine similarity of them as a measure of their semantic similarity."
      ]
    },
    {
      "heading": "3.3 Ensemble Similarity Scores",
      "text": [
        "Up to this point, for each snippet the system generates six similarity scores to measure the degree of plagiarism in different aspects.",
        "In this stage, we propose two strategies to linearly combine the scores to make better prediction.",
        "The first strategy utilizes each model's predictability (e.g. accuracy) as the weight to linearly combine the scores.",
        "In other words, the models that perform better individually will obtain higher weights.",
        "In the second strategy we exploit a learning model (in the experiment section we use Liblinear) to learn the weights directly."
      ]
    },
    {
      "heading": "3.4 Document Level Plagiarism Detection",
      "text": [
        "For each query from the input article, our system assigns a degree-of-plagiarism score to some plausible source URLs.",
        "Then, for each URL, the system sums up all the scores it obtains as the final score for document-level degree-of-plagiarism.",
        "We set up a cutoff threshold to obtain the most plausible URLs.",
        "At the end, our system highlights the suspicious areas of plagiarism for display."
      ]
    },
    {
      "heading": "4. Evaluation",
      "text": [
        "We evaluate our system from two different angles.",
        "We first evalaute the sentence level plagirism detection using the PAN corpus in English.",
        "We then evaluate the capability of the full system to detect on-line plagiarism cases using annotated results in Chinese."
      ]
    },
    {
      "heading": "4.1 Sentence-based Evaluations",
      "text": [
        "We want to compare our model with the state-of-the-art methods, in particular the winning entries in plagiarism detection competition in PAN 1 .",
        "However, the competition in PAN is designed for off-line plagiarism detection; the entries did not exploit an IR system to search the Web like we do.",
        "Nevertheless, we can still compare the core component of our system, the sentence-based measuring model with that of other systems.",
        "To achieve such goal, we first randomly sampled 370 documents from PAN-2011 external plagiarism corpus (M. Potthast et al., 2010) containing 2882 labeled plagiarism cases.",
        "To obtain high-quality negative examples for evaluation, we built a full-text index on the corpus using Lucene package.",
        "Then we use the suspicious passages as queries to search the whole dataset using Lucene.",
        "Since there is length limitation in Lucene (as well as in the real search engines), we further break the 2882 plagiarism cases into 6477 queries.",
        "We then extract the top 30 snippets returned by the search engine as the potential negative candidates for each plagiarism case.",
        "Note that for each suspicious passage, there is only one target passage (given by the ground truth) that is considered as a positive plagiarism case in this data, and it can be either among these 30 cases or not.",
        "However, we union these 30 cases with the ground truth as a set, and use our (as well as the competitors?)",
        "models to rank the degree-of-plagiarism for all the candidates.",
        "We then evaluate the rank by the area-under-PR-curve (AUC) score.",
        "We compared our system with the winning entry of PAN 2011 (Grman and Ravas, 2011) and the stopword ngram model that claims to perform better than this winning entry by Stamatatos (2011).",
        "The results of each individual model and ensemble using 5-fold cross validation are listed in Table 3.",
        "It shows that NM is the best individual model, and"
      ]
    },
    {
      "heading": "1 The website of PAN-2011 is http://pan.webis.de/",
      "text": [
        "an ensemble of three features outperforms the state-of-the-art by 26%."
      ]
    },
    {
      "heading": "4.2 Evaluating the Full System",
      "text": [
        "To evaluate the overall system, we manually collect 60 real-world review articles from the Internet for books (20), movies (20), and music albums (20).",
        "Unfortunately for an online system like ours, there is no ground truth available for recall measure.",
        "We conduct two differement evalautions.",
        "First we use the 60 articles as inputs to our system, ask 5 human annotators to check whether the articles returned by our system can be considered as plagiarism.",
        "Among all 60 review articles, our system identifies a considerablely high number of copy/paste articles, 231 in total.",
        "However, identifying this type of plagiarism is trivial, and has been done by many similar tools.",
        "Instead we focus on the so-called smart-plagiarism which cannot be found through quoting a query in a search engine.",
        "Table 4. shows the precision of the smart-plagiarism articles returned by our system.",
        "The precision is very high and outperforms a commertial tool Microsoft Plagiarism Detector.",
        "In the second evaluation, we first choose 30 reviews randomly.",
        "Then we use each of them as queries into Google and retrieve a total of 5636 pieces of snippet candidates.",
        "We then ask 63 human beings to annotate whether those snippets represent plagiarism cases of the original review article.",
        "Eventually we have obtained an annotated",
        "dataset and found a total of 502 plagiarized candidates with 4966 innocent ones for evalaution.",
        "Table 5. shows the average AUC of 5-fold cross validation.",
        "The results show that our method outperforms the Pan-11 winner slightly, and much better than the Stopword Ngram."
      ]
    },
    {
      "heading": "4.3 Discussion",
      "text": [
        "There is some inconsistency of the performance of single features in these two experiments.",
        "The main reason we believe is that the plagiarism cases were created in very different manners.",
        "Plagiarism cases in PAN external source are created artificially through word insertions, deletions, reordering and synonym substitutions.",
        "As a result, features such as word alignment and reordering do not perform well because they did not consider the existence of synonym word replacement.",
        "On the other hand, real-world plagiarism cases returned by Google are those with matching-words, and we can find better performance for AW.",
        "The performances of syntactic and semantic features, namely PT, PP and LDA, are consistently inferior than other features.",
        "It is because they often introduce false-positives as there are some non-plagiarism cases that might have highly overlapped syntactic or semantic tags.",
        "Nevertheless, experiments also show that these features can improve the overall accuracy in ensemble.",
        "We also found that the stopword Ngram model is not applicable universally.",
        "For one thing, it is less suitable for on-line plagiarism detection, as the length limitation for queries diminishes the usability of stopword n-grams.",
        "For another, Chinese seems to be a language that does not rely as much on stopwords as the latin languages do to maintain its syntax structure.",
        "Samples of our system's finding can be found here, http://tinyurl.com/6pnhurz"
      ]
    },
    {
      "heading": "5. Online Demo System",
      "text": [
        "We developed an online demos system using JAVA (JDK 1.7).",
        "The system currently supports the detection of documents in both English and Chinese.",
        "Users can either upload the plain text file of a suspicious document, or copy/paste the content onto the text area, as shown below in"
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "Comparing with other online plagiarism detection systems, ours exploit more sophisticated features by modeling how human beings plagiarize online sources.",
        "We have exploited sentence-level plagiarism detection on lexical, syntactic and semantic levels.",
        "Another noticeable fact is that our approach is almost language independent.",
        "Given a parser and a POS tagger of a language, our framework can be extended to support plagiarism detection for that language."
      ]
    },
    {
      "heading": "7. References",
      "text": []
    }
  ]
}
