{
  "info": {
    "authors": [
      "Sebastian Padó",
      "Jan Šnajder",
      "Britta Zeller"
    ],
    "book": "ACL",
    "id": "acl-P13-2128",
    "title": "Derivational Smoothing for Syntactic Distributional Semantics",
    "url": "https://aclweb.org/anthology/P13-2128",
    "year": 2013
  },
  "references": [
    "acl-C10-1011",
    "acl-D07-1060",
    "acl-D08-1007",
    "acl-J10-4006",
    "acl-J10-4007",
    "acl-N07-2052",
    "acl-P05-1045",
    "acl-P13-1118",
    "acl-W05-1516",
    "acl-W98-0705"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Syntax-based vector spaces are used widely in lexical semantics and are more versatile than word-based spaces (Baroni and Lenci, 2010).",
        "However, they are also sparse, with resulting reliability and coverage problems.",
        "We address this problem by derivational smoothing, which uses knowledge about derivationally related words (oldish?",
        "old) to improve semantic similarity estimates.",
        "We develop a set of derivational smoothing methods and evaluate them on two lexical semantics tasks in German.",
        "Even for models built from very large corpora, simple derivational smoothing can improve coverage considerably."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Distributional semantics (Turney and Pantel, 2010) builds on the assumption that the semantic similarity of words is strongly correlated to the overlap between their linguistic contexts.",
        "This hypothesis can be used to construct context vectors for words directly from large text corpora in an unsupervised manner.",
        "Such vector spaces have been applied successfully to many problems in NLP (see Turney and Pantel (2010) or Erk (2012) for current overviews).",
        "Most distributional models in computational lexical semantics are either (a) bag-of-words models, where the context features are words within a surface window around the target word, or (b) syntactic models, where context features are typically pairs of dependency relations and context words.",
        "The advantage of syntactic models is that they incorporate a richer, structured notion of context.",
        "This makes them more versatile; the Distributional Memory framework by Baroni and Lenci (2010) is applicable to a wide range of tasks.",
        "It is also able ?",
        "at least in principle ?",
        "to capture more fine-grained types of semantic similarity such as predicate-argument plausibility (Erk et al., 2010).",
        "At the same time, syntactic spaces are much more prone to sparsity problems, as their contexts are sparser.",
        "This leads to reliability and coverage problems.",
        "In this paper, we propose a novel strategy for combating sparsity in syntactic vector spaces, derivational smoothing.",
        "It follows the intuition that derivationally related words (feed ?",
        "feeder, blocked ?",
        "blockage) are, as a rule, semantically highly similar.",
        "Consequently, knowledge about derivationally related words can be used as a ?back off?",
        "for sparse vectors in syntactic spaces.",
        "For example, the pair oldish ?",
        "ancient should receive a high semantic similarity, but in practice, the vector for oldish will be very sparse, which makes this result uncertain.",
        "Knowing that oldish is derivationally related to old allows us to use the much less sparse vector for old as a proxy for oldish.",
        "We present a set of general methods for smoothing vector similarity computations given a resource that groups words into derivational families (equivalence classes) and evaluate these methods on German for two distributional tasks (similarity prediction and synonym choice).",
        "We find that even for syntactic models built from very large corpora, a simple derivational resource that groups words on morphological grounds can improve the results."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Smoothing techniques ?",
        "either statistical, distributional, or knowledge-based ?",
        "are widely applied in all areas of NLP.",
        "Many of the methods were first applied in Language Modeling to deal with unseen n-grams (Chen and Goodman, 1999; Dagan et al., 1999).",
        "Query expansion methods in Information Retrieval are also prominent cases of smoothing that addresses the lexical mismatch between query and document (Voorhees, 1994; Gonzalo et al., 1998; Navigli and Velardi, 2003).",
        "In lexical semantics, smoothing is often achieved by backing",
        "off from words to semantic classes, either adopted from a resource such as WordNet (Resnik, 1996) or induced from data (Pantel and Lin, 2002; Wang et al., 2005; Erk et al., 2010).",
        "Similarly, distributional features support generalization in Named Entity Recognition (Finkel et al., 2005).",
        "Although distributional information is often used for smoothing, to our knowledge there is little work on smoothing distributional models themselves.",
        "We see two main precursor studies for our work.",
        "Bergsma et al. (2008) build models of selectional preferences that include morphological features such as capitalization and the presence of digits.",
        "However, their approach is task-specific and requires a (semi-)supervised setting.",
        "Allan and Ku-maran (2003) make use of morphology by building language models for stemming-based equivalence classes.",
        "Our approach also uses morphological processing, albeit more precise than stemming."
      ]
    },
    {
      "heading": "3 A Resource for German Derivation",
      "text": [
        "Derivational morphology describes the process of building new (derived) words from other (basis) words.",
        "Derived words can, but do not have to, share the part-of-speech (POS) with their basis (oldA?",
        "oldishA vs. warmA?",
        "warmV , warmthN ).",
        "Words can be grouped into derivational families by forming the transitive closure over individual derivation relations.",
        "The words in these families are typically semantically similar, although the exact degree depends on the type of relation and idiosyncratic factors (bookN ?",
        "bookishA, Lieber (2009)).",
        "For German, there are several resources with derivational information.",
        "We use version 1.3 of DERIVBASE (Zeller et al., 2013),1 a freely available resource that groups over 280,000 verbs, nouns, and adjectives into more than 17,000 non-singleton derivational families.",
        "It has a precision of 84% and a recall of 71%.",
        "Its higher coverage compared to CELEX (Baayen et al., 1996) and IMSLEX (Fitschen, 2004) makes it particularly suitable for the use in smoothing, where the resource should include low-frequency lemmas.",
        "The following example illustrates a family that covers three POSes as well as a word with a predominant metaphorical reading (to kneel?",
        "to beg):",
        "Using derivational knowledge for smoothing raises the question of how semantically similar the lemmas within a family really are.",
        "Fortunately, DERIVBASE provides information that can be used in this manner.",
        "It was constructed with handwritten derivation rules, employing string transformation functions that map basis lemmas onto derived lemmas.",
        "For example, a suffixation rule using the affix ?heit?",
        "generates the derivation dunkel ?",
        "Dunkel-heit (darkA ?",
        "darknessN ).",
        "Since derivational families are defined as transitive closures, each pair of words in a family is connected by a derivation path.",
        "Because the rules do not have a perfect precision, our confidence in pairs of words decreases the longer the derivation path between them.",
        "To reflect this, we assign each pair a confidence of 1/n, where n is the length of the shortest path between the lemmas.",
        "For example, bekleiden (enrobeV ) is connected to Verkleidung (disguiseN ) through three steps via the lemmas kleiden (dressV ) and verklei-den (disguiseV ) and is assigned the confidence 1/3."
      ]
    },
    {
      "heading": "4 Models for Derivational Smoothing",
      "text": [
        "Derivational smoothing exploits the fact that derivationally related words are also semantically related, by combining and/or comparing distributional representations of derivationally related words.",
        "The definition of a derivational smoothing algorithm consists of two parts: a trigger and a scheme.",
        "Notation.",
        "Given a word w, we use w to denote its distributional vector and D(w) to denote the set of vectors for the derivational family of w. We assume that w ?",
        "D(w).",
        "For words that have no derivations in DERIVBASE, D(w) is a singleton set, D(w) = {w}.",
        "Let ?(w,w?)",
        "denote the confidence of the pair (w,w?",
        "), as explained in Section 3.",
        "Smoothing trigger.",
        "As discussed above, there is no guarantee for high semantic similarity within a derivational family.",
        "For this reason, smoothing may also drown out information.",
        "In this paper, we report on two triggers: smooth always always performs smoothing; smooth if sim=0 smooths only when the unsmoothed similarity sim(w1,w2) is zero or unknown (due to w1 or w2 not being in the model).",
        "Smoothing scheme.",
        "We present three smoothing schemes, all of which apply to the level of complete families.",
        "The first two schemes are exemplar-based schemes, which define the smoothed similarity for a word pair as a function of the pairwise similarities between all words of the two derivational families.",
        "The first one, maxSim, checks for particularly similar words in the families:",
        "The second one, avgSim, computes the average pairwise similarity (N is the number of pairs):",
        "The third scheme, centSim, is prototype-based.",
        "It computes a centroid vector for each derivational family, which can be thought of as a representation for the concept(s) that it expresses:",
        "confidence-weighted centroid vector.",
        "centSim is similar to avgSim.",
        "It is more efficient to calculate and effectively introduces a kind or regularization, where outliers in either family have less impact on the overall result.",
        "These models only represents a sample of possible derivational smoothing methods.",
        "We performed a number of additional experiments (POS-restricted smoothing, word-based, and pair-based smoothing triggers), but they did not yield any improvements over the simpler models we present here."
      ]
    },
    {
      "heading": "5 Experimental Evaluation",
      "text": [
        "Syntactic Distributional Model.",
        "The syntactic distributional model that we use represents target words by pairs of dependency relations and context words.",
        "More specifically, we use the W ?",
        "LW matricization of DM.DE, the German version (Pado?",
        "and Utt, 2012) of Distributional Memory (Baroni and Lenci, 2010).",
        "DM.DE was created on the basis of the 884M-token SDEWAC web corpus (Faa?",
        "et al., 2010), lemmatized, tagged, and parsed with the German MATE toolkit (Bohnet, 2010).",
        "Experiments.",
        "We evaluate the impact of smoothing on two standard tasks from lexical semantics.",
        "The first task is predicting semantic similarity.",
        "We lemmatized and POS-tagged the German GUR350 dataset (Zesch et al., 2007), a set of 350 word pairs with human similarity judgments, created analogously to the well-known Rubenstein and Good-enough (1965) dataset for English.2 We predict",
        "semantic similarity as cosine similarity.",
        "We make a prediction for a word pair if both words are represented in the semantic space and their vectors have a non-zero similarity.",
        "The second task is synonym choice on the German version of the Reader's Digest WordPower dataset (Wallace and Wallace, 2005).2 This dataset, which we also lemmatized and POS-tagged, consists of 984 target words with four synonym candidates each (including phrases), one of which is correct.",
        "Again, we compute semantic similarity as the cosine between target and a candidate vector and pick the highest-similarity candidate as synonym.",
        "For phrases, we compute the maximum pairwise word similarity.",
        "We make a prediction for an item if the target as well as at least one candidate are represented in the semantic space and their vectors have a non-zero similarity.",
        "We expect differences between the two tasks with regard to derivational smoothing, since the words within derivational families are generally related but often not synonymous (cf. the example in Section 3).",
        "Thus, semantic similarity judgments should profit more easily from derivational smoothing than synonym choice.",
        "Baseline.",
        "Our baseline is a standard bag-of-words vector space (BOW), which represents target words by the words occurring in their context.",
        "We use standard parameters (?10 word window, 8.000 most frequent verb, noun, and adjective lemmas).",
        "The model was created from the same corpus as DM.DE.",
        "We also applied derivational smoothing to this model, but did not obtain improvements.",
        "Evaluation.",
        "To analyze the impact of smoothing, we evaluate the coverage of models and the quality of their predictions separately.",
        "In both tasks, coverage is the percentage of items for which we make a prediction.",
        "We measure quality of the semantic similarity task as the Pearson correlation between the model predictions and the human judgments for covered items (Zesch et al., 2007).",
        "For synonym choice, we follow the method established by Mohammad et al. (2007), measuring accuracy over covered items, with partial credit for ties.",
        "Results for Semantic Similarity.",
        "Table 1 shows the results for the first task.",
        "The unsmoothed DM.DE model attains a correlation of r = 0.44 and a coverage of 58.9%.",
        "Smoothing increases the coverage substantially to 88%.",
        "Additionally, conservative, prototype-based smoothing (if sim = 0)",
        "(r: Pearson correlation, Cov: Coverage) increases correlation somewhat to r = 0.47.",
        "The difference to the unsmoothed model is not significant at p = 0.05 according to Fisher's (1925) method of comparing correlation coefficients.",
        "The bag-of-words baseline (BOW) has a greater coverage than DM.DE models, but at the cost of lower correlation across the board.",
        "The only DM.DE model that performs worse than the BOW baseline is the non-conservative avgSim (average similarity) scheme.",
        "We attribute this weak performance to the presence of many pairwise zero similarities in the data, which makes the avgSim predictions unreliable.",
        "To our knowledge, there are no previous published papers on distributional approaches to mod-eling this dataset.",
        "The best previous result is a GermaNet/Wikipedia-based model by Zesch et al. (2007).",
        "It reports a higher correlation (r = 0.59) but a very low coverage at 33.1%.",
        "Results for Synonym Choice.",
        "The results for the second task are shown in Table 2.",
        "The unsmoothed model achieves an accuracy of 53.7% and a coverage of 80.8%, as reported by Pado?",
        "and Utt (2012).",
        "Smoothing increases the coverage by almost 6% to 86.6% (for example, a question item for inferior becomes covered after backing off from the target to Inferiorita?t (inferiority)).",
        "All smoothed models show a loss in accuracy, albeit small.",
        "The best model is again a conservative smoothing model (sim = 0) with a loss of 1.1% accuracy.",
        "Using bootstrap resampling (Efron and Tibshirani, 1993), we established that the difference to the unsmoothed DM.DE model is not significant at p < 0.05.",
        "This time, the avgSim (average similarity) smoothing scheme performs best, with the prototype-based scheme in second place.",
        "Thus, the results for synonym choice are less clear-cut: derivational smoothing can trade accuracy against",
        "(Acc: Accuracy, Cov: Coverage) coverage but does not lead to a clear improvement.",
        "What is more, the BOW ?baseline?",
        "significantly outperforms all syntactic models, smoothed and unsmoothed, with an almost perfect coverage combined with a higher accuracy."
      ]
    },
    {
      "heading": "6 Conclusions and Outlook",
      "text": [
        "In this paper, we have introduced derivational smoothing, a novel strategy to combating sparsity in syntactic vector spaces by comparing and combining the vectors of morphologically related lemmas.",
        "The only information strictly necessary for the methods we propose is a grouping of lemmas into derivationally related classes.",
        "We have demonstrated that derivational smoothing improves two tasks, increasing coverage substantially and also leading to a numerically higher correlation in the semantic similarity task, even for vectors created from a very large corpus.",
        "We obtained the best results for a conservative approach, smoothing only zero similarities.",
        "This also explains our failure to improve less sparse word-based models, where very few pairs are assigned a similarity of zero.",
        "A comparison of prototype-and exemplar-based schemes did not yield a clear winner.",
        "The estimation of generic semantic similarity can profit more from derivational smoothing than the induction of specific lexical relations.",
        "In future work, we plan to work on other evaluation tasks, application to other languages, and more sophisticated smoothing schemes.",
        "Acknowledgments.",
        "Authors 1 and 3 were supported by the EC project EXCITEMENT (FP7 ICT287923).",
        "Author 2 was supported by the Croatian Science Foundation (project 02.03/162: ?Derivational Semantic Models for Information Retrieval?).",
        "We thank Jason Utt for his support and expertise."
      ]
    }
  ]
}
