{
  "info": {
    "authors": [
      "Bing Zhao",
      "Stephan Vogel"
    ],
    "book": "Workshop on Building and Using Parallel Texts: Data Driven Machine Translation and Beyond",
    "id": "acl-W03-0303",
    "title": "Word Alignment Based on Bilingual Bracketing",
    "url": "https://aclweb.org/anthology/W03-0303",
    "year": 2003
  },
  "references": [
    "acl-J93-2003",
    "acl-J97-3002",
    "acl-P00-1056",
    "acl-W95-0107"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, an improved word alignment based on bilingual bracketing is described.",
        "The explored approaches include using Model-1 conditional probability, a boosting strategy for lexicon probabilities based on importance sampling, applying Parts of Speech to discriminate English words and incorporating information of English base noun phrase.",
        "The results of the shared task on French-English, Romanian-English and Chinese-English word alignments are presented and discussed."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Bilingual parsing based word alignment is promising but still difficult.",
        "The goal is to extract structure information from parallel sentences, and thereby improve word/phrase alignment via bilingual constraint transfer.",
        "This approach can be generalized to the automatic acquisition of a translation lexicon and phrase translations esp.",
        "for languages for which resources are relatively scarce compared with English.",
        "The parallel sentences in building Statistical Machine Translation (SMT) systems are mostly unrestricted text where full parsing often fails, and robustness with respect to the inherent noise of the parallel data is important.",
        "Bilingual Bracketing [Wu 1997] is one of the bilingual shallow parsing approaches studied for Chinese-English word alignment.",
        "It uses a translation lexicon within a probabilistic context free grammar (PCFG) as a generative model to analyze the parallel sentences with weak order constraints.",
        "This provides a framework to incorporate knowledge from the English side such as POS, phrase structure and potentially more detailed parsing results.",
        "In this paper, we use a simplified bilingual bracketing grammar together with a statistical translation lexicon such as the Model-1 lexicon [Brown 1993] to do the bilingual bracketing.",
        "A boosting strategy is studied and applied to the statistical lexicon training.",
        "English POS and Base Noun Phrase (NP) detection are used to further improve the alignment performance.",
        "Word alignments and phrase alignments are extracted from the parsing results as post processing.",
        "The settings of different translation lexicons within the bilingual bracketing framework are studied and experiments on word-alignment are carried out on Chinese-English, French-English, and Romanian-English language pairs.",
        "The paper is structured as follows: in section 2, the simplified bilingual bracketing used in our system is described; in section 3, the boosting strategy based on importance sampling for IBM Model-1 lexicon is introduced; in section 4, English POS and English Base Noun Phrase are used to constrain the alignments ; in section 5, the experimental results are shown; summary and conclusions are given in section 6."
      ]
    },
    {
      "heading": "2 Bilingual Bracketing",
      "text": [
        "In [Wu 1997], the Bilingual Bracketing PCFG was introduced, which can be simplified as the following production rules:",
        "Where f and e are words in the target vocabulary Vf and source vocabulary Ve respectively.",
        "A is the alignment of texts.",
        "There are two operators for bracketing: direct bracketing denoted by [ ], and inverse bracketing, denoted by <>.",
        "The A-productions are divided into two classes: syntactic {(1),(2)}and lexical rules {(3),(4),(5)}.",
        "Each A-production rule has a probability.",
        "In our algorithm, we use the same PCFG.",
        "However, instead of estimating the probabilities for the production rules via EM as described in [Wu 1997], we assign the probabilities to the rules using the Model-1 statistical translation lexicon [Brown et al.",
        "1993].",
        "Because the syntactic A-production rules do not compete with the lexical rules, we can set them some default values.",
        "Also we make no assumptions which bracketing direction is more likely to occur, thus the probabilities for [ ] and <> are set to be equal.",
        "As for the lexical rules, we experimented with the conditional probabilities p(elf), p(f le) and the interpolation of p(f le, epos) and p(f le) (described in section 4.1).",
        "As for these probabilities of aligning a word to the null word or to unknown words, they are set to be 1 e-7, which is the default small value used in training Model-1.",
        "The word alignment can then be done via maximizing the likelihood of matched words subject to the bracketing grammar using dynamic programming.",
        "The result of the parsing gives bracketing for both input sentences as well as bracket alignments indicating the corresponding brackets between the sentence pairs.",
        "The bracket alignment includes a word alignment as a by-product.",
        "One example for French-English (the test set sentence pair #18) is shown as below:"
      ]
    },
    {
      "heading": "3 Boosting Strategy of Model-1 Lexicon",
      "text": [
        "The probabilities for the lexical rules are Model-1 conditional probabilities p(f le), which can be estimated using available toolkits such as [Franz 2000].",
        "This strategy is a three-pass training of Model-1, which was shown to be effective in our Chinese-English alignment experiments.",
        "The first two passes are carried out to get Viterbi word alignments based on Model-1’s parameters in both directions: from source to target and then vice versa.",
        "An intersection of the two Viterbi word alignments is then calculated.",
        "The highly frequent word-pairs in the intersection set are considered to be important samples supporting the alignment of that word-pair.",
        "This approach, which is similar to importance sampling, can be summarized as follows: Denote a sample as a co-occurred word-pair as x = (ei, fj) with its observed frequency: C(x) = f req(ei, fj ); Denote I (x) = f req(ei, fj) as the frequency of that word-pair x observed in the intersection of the two Viterbi alignments.",
        "• Build I (x) = f req(ei, fj) from the intersection of alignments in two directions.",
        "• Generate x = (ei, fj) and its C(x) = freq(ei, fj) observed from a given parallel corpus; • Generate random variable u from uniform [0,1] distribution independent of x; • If",
        "• Re-weight sample x: Cb (x) = C(x) ∗ (1+ε), ε > 0)",
        "The modified counts (weighted samples) are renormalized to get a proper probability distribution, which is used in the next iteration of EM training.",
        "The constant M is a threshold to remove the potential noise from the intersection set.",
        "M’s value is related to the size of the training corpus, the larger its size, the larger M should be.",
        "ε is chosen as a small positive value.",
        "The overall idea is to collect those word-pairs which are reliable and give an additional pseudo count to them."
      ]
    },
    {
      "heading": "4 Incorporating English Grammatical Constraints",
      "text": [
        "There are several POS taggers, base noun phrase detectors and parsers available for English.",
        "Both the shallow and full parsing information of English sentences can be used as constraints in Bilingual Bracketing.",
        "Here, we explored utilizing English POS and English base noun phrase boundaries."
      ]
    },
    {
      "heading": "4.1 Incorporating English POS",
      "text": [
        "The correctly aligned words from two languages are very likely to have the same POS.",
        "For example, a Chinese noun is very likely to be aligned with a English noun.",
        "While the English POS tagging is often reliable and accurate, the POS tagging for other languages is usually not easily acquired nor accurate enough.",
        "Modelling only the English POS in word alignment is usually a practical way.",
        "Given POS information for only the English side, we can discriminate English words and thus disambiguate the translation lexicon.",
        "We tagged each English word in the parallel corpus, so that each English word is associated with its POS denoted as epos.",
        "The English word and its POS were concatenated into one pseudo word.",
        "For example: beginning/NN and beginning/VBG are two pseudo words which occurred in our training corpus.",
        "Then the Model-1 training was carried out on this concatenated parallel corpus to get estimations of p(f le, epos).",
        "One potential problem is the estimation of p(f le, epos).",
        "When we concatenated the word with its POS, we implicitly increased the vocabulary size.",
        "For example, for French-English training set, the English vocabulary increased from 57703 to 65549.",
        "This may not cause a problem when the training data’s size is large.",
        "But for small parallel corpora, some correct word-pair’s p(f l e, epos) will be underestimated due to the sparse data, and some word-pairs become unknown in p(f le, epos).",
        "So in our system, we actually interpolated p(f le, epos) with p(f le) as a mixture model for robustness:",
        "Where λ can be estimated by EM for this two-mixture model on the training data, or a grid search via cross-validation."
      ]
    },
    {
      "heading": "4.2 Incorporating English Base Noun Boundaries",
      "text": [
        "The English sentence is bracketed according to the syntactic A-production rules.",
        "This bracketing can break an English noun phrase into separated pieces, which are not in accordance with results from standard base noun phrase detectors.",
        "Though the word-alignments may still be correct, but for the phrase level alignment, it is not desired.",
        "One solution is to constrain the syntactic A-production rules to penalize bracketing English noun phrases into separated pieces.",
        "The phrase boundaries can be obtained by using a base noun phrase detection toolkit [Ramshaw 1995], and the boundaries are loaded into the bracketing program.",
        "During the dynamic programming, before applying a syntactic A-production rule, the program checks if the brackets defined by the syntactic rule violate the noun phrase boundaries.",
        "If so, an additional penalty is attached to this rule."
      ]
    },
    {
      "heading": "5 Experiments",
      "text": [
        "All the settings described so far are based on our previous experiments on Chinese-English (CE) alignment.",
        "These settings are then used directly without any adjustment of the parameters for the French-English (FE) and Romanian-English (RE) word alignment tasks.",
        "In this section, we will first describe our experiments on Chinese-English alignment, and then the results for the shared task on French-English and Romanian-English.",
        "For Chinese-English alignment, 365 sentence-pairs are randomly sampled from the Chinese Treebank provided by the Linguistic Data Consortium.",
        "Three persons manually aligned the word-pairs independently, and the consistent alignments from all of them were used as the reference alignments.",
        "There are totally 4094 word-pairs in the reference set.",
        "Our way of alignment is very similar to the ”SURE” (S) alignment defined in the shared task.",
        "The training data we used is 16K parallel sentence-pairs from Hong-Kong news data.",
        "The English POS tagger we used is Brill’s POS tagger [Brill 1994].",
        "The base noun detector is [Ramshaw 1995].",
        "The alignment is evaluated in terms of precision, recall, F-measure and alignment error rate (AER) defined in the shared task.",
        "The results are shown in Table-1:",
        "Table-1 shows the effectiveness of using each setting on this small size training data.",
        "Here the boosted model gives a noticeable improvement over the baseline.",
        "However, our observations on the trial/test data showed very similar results for boosted and non-boosted models, so we present only the non-boosted results(standard Model1) for the shared task of EF and RE word alignment.",
        "Adding POS further improved the performance significantly.",
        "The AER drops from 44.04 to 41.29.",
        "Adding additional base noun phrase boundaries did not give as much improvement as we hoped.",
        "There is only slight improvement in terms of AER and F-measure.",
        "One reason is that noun phrase boundaries is more directly related to phrase alignment than word-alignment.",
        "A close examination showed that with wrong phrase-alignment, word-alignment can still be correct.",
        "Another reason is that using the noun phrase boundaries this way may not be powerful enough to leverage the English structure information in Bilingual Bracketing.",
        "More suitable ways could be bilingual chunk parsing, and refining the bracketing grammar as described in [Wu 1997].",
        "In the shared task experiments, we restricted the training data to sentences upto 60 words.",
        "The statistics for the training sets are shown in Table-2.",
        "(French/Romanian are source and English is target language).",
        "There are 447 test sentence pairs for English-French and 248 test sentence pairs for Romanian-English.",
        "After the bilingual bracketing, we extracted only the explicit word alignment from lexical rules: A – > e/f, where neither e nor f is the null(empty) word.",
        "These explicit word alignments are more directly related to the translation quality in our SMT system than the null-word alignments.",
        "Also the explicit word alignments is in accordance with the ”SURE” (S) alignment defined in the shared tasks.",
        "However the Bilingual Bracketing system is not adapted to the ”PROBABLE” (P) alignment because of the inherent one-to-one mapping.",
        "All the AERs in the following tables are calculated based solely on S alignment without any null alignments collected from the bracketing results.",
        "For the limited resource task, we trained Model-1 lexicons in both directions: from source to target denoted as p(f le) and from target to source denoted as p(elf).",
        "These two lexicons are then plugged into the Bilingual Bracketing algorithm separately to get two sets of bilingual bracketing word alignments.",
        "The intersection of these two sets of word alignments is then collected.",
        "The resulting AERs are shown in Table-3 and Table-5 respectively.",
        "For the unlimited resource task, we again tagged the English sentences and base noun phrase boundaries as mentioned before.",
        "Then corresponding Model-1 lexicon was trained and Bilingual Bracketing carried out.",
        "Using the same strategies as in the limited resource task, we got the results shown in Table-4 and Table-6.",
        "The table above show that adding English POS and base noun detection gave a consistent improvement for all conditions in the French-to-English alignment.",
        "The intersection of the two alignments greatly improves the precision, paired with a reduction in recall, still resulting in an overall improvement in F-measure and AER.",
        "For the Romanian-English alignment the POS tagging and noun phrase boundaries did not help.",
        "On the small corpus the increase in vocabulary resulted in addition unknown words in the test sentences which introduces additional alignment errors.",
        "Comparing the results of the French-English and Romanian-English alignment tasks we see a striking difference in precision and recall.",
        "Whereas the French-English alignment has a low precision and a high recall its the opposite for the Romanian-English alignment.",
        "The cause lays in different styles for the manual alignments.",
        "The French-English reference set contains both S and P alignments, whereas the Romanian-English reference set was annotated with only S alignments.",
        "As a result, there are on average only 0.5 S alignments per word in the FE reference set, but 1.5 S alignments per word in the RE test set."
      ]
    },
    {
      "heading": "6 Summary",
      "text": [
        "In this paper we presented our word alignment system based on bilingual bracketing.",
        "We introduced a technique to boost lexical probabilities for more reliable word pairs in the statistical lexicon.",
        "In addition, we investigated the effects of using POS and noun phrase detection on the English side of the bilingual corpus as constraints for the alignment.",
        "We applied these techniques to the French-English and Romanian-English alignment tasks, and in addition to Chinese-English alignment.",
        "For Chinese-English and French-English alignments these additional knowledge sources resulted in improvements in alignment quality.",
        "Best results were obtained by using the intersection of the source to target and target to source bilingual bracketing alignments.",
        "The results show very different behavior of the alignment system on the French-English and Romanian-English tasks which is due to different characteristics of the manually aligned test data.",
        "This indicates that establishing a good golden standard for word alignment evaluation is still an open issue."
      ]
    }
  ]
}
