{
  "info": {
    "authors": [
      "Martine Grice",
      "Michelina Savinot"
    ],
    "book": "Workshop on Concept to Speech Generation Systems",
    "id": "acl-W97-1205",
    "title": "Can Pitch Accent Type Convey Information Status in Yes-No Questions?",
    "url": "https://aclweb.org/anthology/W97-1205",
    "year": 1997
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper analyses the intonation of polar questions extracted from a corpus of task-oriented dialogues in the Bari variety of Italian.",
        "They are classified using a system developed for similar dialogues in English where each question is regarded as an initiating move in a conversational game (Carletta et al. 1995).",
        "It was found that there was no one-to-one correspondence between move-type and intonation pattern.",
        "An alternative classification was carried out taking into account information status, that is, whether or not the information requested by the speaker is recoverable from the previous dialogue context.",
        "It is found that the degree of confidence with which the speaker believes the information to be shared with the interlocutor is reflected in the choice of pitch accent and postfocal accentual pattern.",
        "Low confidence polar questions contain a L+H* focal pitch accent and allow for accents to follow it, whereas high confidence ones contain a H*+L focal pitch accent, followed by deaccenting or suppression of accents."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In this paper we examine the intonation of polar questions.",
        "Such questions may elicit an affirmative or negative reply concerning information which is totally new, i.e. where the speaker believes the information is not recoverable from the dialogue context.",
        "These are often referred to as information-seeking questions.",
        "They may also, however, refer to old information, i.e. that which the speaker believes has already been conveyed.",
        "These are often referred to as confirmation-seeking questions.",
        "Using a corpus of task-oriented dialogues, we investigate how far it is possible in such questions to make a clear-cut binary distinction between old and new information and whether this distinction is reflected in the choice of intonation pattern used.",
        "A distinction has been made in the analysis of a dialogue corpus in English (Carletta et al., 1995) where information-seeking questions are referred to as QUERIES and confirmation-seeking questions as CHECKS.",
        "In the canonical examples given in English, QUERIES and CHECKS are syntactically distinct (Kowtico et al., 1992; Carletta et al., 1995); \"Do you have a rockfall?\" and \"So you want me to go down two inches?\", respectively.",
        "The former uses interrogative and the latter declarative syntax.",
        "In Italian, on the other hand, where all yes-no question types have the same syntactic form as declaratives, the intonation pattern plays a greater role.",
        "\"Vado a destra\" can be translated as \"I go to the right\" (statement), \"Do I go to the right?\" (QUERY) or \"(So) I go to the right?\" (CHECK).",
        "We therefore investigate dialogues in Italian where it is possible to isolate the role of intonation patterns.",
        "Intonation contours can be analysed as having two types of tonal specification: tones which have a prominence-lending function, referred to here as pitch accents, and those which delimit intonational phrases, referred to here as boundary tones (Pierrehumbert,1980; Beckman and Ayers 1994).",
        "In Standard Italian (SI), it is argued that the boundary tone or a combination of pitch accent and boundary tone play a role in distinguishing questions from statements (Avesani, 1990; Chapallaz, 1979; D'Eugenio, 1982; Canepari, 1980; Agard and di Pietro, 1965).",
        "In all cited cases of SI yes-no questions have a final rising contour or high boundary tone.",
        "In a number of other varieties of Italian, those spoken in Bari (Grice and Savino, 1995) and Palermo (Grice",
        "1995) for instance, it is solely the pitch accent which has the distinguishing function.",
        "Our analysis here is based on a corpus of Bari Italian dialogues, allowing us to concentrate on the relation between pitch accent type and question type."
      ]
    },
    {
      "heading": "2 Dialogue Corpus",
      "text": [
        "The corpus analysed consists of task-oriented dialogues between six pairs of Ban Italian speakers.",
        "The task, based on the HCRC Map Task (Anderson et al., 1991), involves verbal cooperation (via auditory channel only) between two participants, each having a map, with the aim of transferring as accurately as possible a given route from one map to the other.",
        "There are a number of discrepancies in placement and positioning of the landmarks on the maps.",
        "Since our aim was to examine intonation contours, the landmark names contained mainly sonorants and were controlled for word stress pattern."
      ]
    },
    {
      "heading": "3 Intonation analysis",
      "text": [
        "The intonation analysis employs a modified version of the ToBI transcription system (Beckman and Ayers 1994) using two tones, H (high) and L (low).",
        "When they occur in pitch accents, one tone is starred, indicating association with a metrically strong syllable (Pierrehumbert 1980).",
        "They may also function as boundary markers for one of two phrase types: intermediate (or minor), indicated by \"-\" after H or L, and intonation (or major) phrase, marked with \"%\".",
        "The pitch accents referred to in this paper are L+H*, which involves a low pitch target just before a high accented syllable, H+L*, which involves a high pitch target immediately preceding a low accented syllable, and H*+L, a high target early in the accented syllable followed by a rapid fall (see Grice and Savino 1995 for a discussion of peak placement).",
        "In addition, H* and L* involve a high or low target, respectively, on the accented syllable, with no specification as to the pitch contour flanking it.",
        "The boundary tones referred to are L and the combination L-L%, both of which give a low pitch value at the end of the phrase, and the combination L-H% which gives a slight rise up to the end of the phrase, with a low starting point at some distance before the endpoint."
      ]
    },
    {
      "heading": "4 Question types",
      "text": [
        "The questions occurring in our corpus are described with the coding scheme for conversational games used to.",
        "describe the English HCRC Map Task corpus (Kowtko et al. 1992, Carletta et al. 1995).",
        "Conversational games are sequences of acts, referred to as moves, such as the possible sequence of QUERY-REPLY-ACKNOWLEDGE moves within a QUERY game.",
        "Since each move within a given game may have a distinct intonation pattern, we confine our analysis to individual moves.",
        "The analysis here concentrates on QUERIES and CHECKS as described in 1 above, both of which are initiating moves within games of the same name.",
        "The Map Task coding scheme has another question-type where the speaker is attempting to get evidence that the transfer was successful, so that s/he can move onto the next game.",
        "This is called an ALIGN.",
        "Examples of ALIGNS might be \"Have you drawn it?\" or \"OK?\".",
        "They may seek information about new or old material within the discourse and may thus pattern with either of the above-mentioned question moves.",
        "Another move-type found in our corpus is not categorised in the current Map Task coding scheme, but may be fitted into the framework as a responding move which indicates that the communication has been unsuccessful.",
        "We refer to this move as OBJECT.",
        "It is used to point out that there has been a breakdown in communication, such that the game cannot continue until common ground is re-established.",
        "OBJECT moves contrast with ACKNOWLEDGE moves.",
        "These latter indicate that communication has been successful, and encourage the interlocutor to proceed with the game.",
        "Examples of OBJECT moves discussed below are of the type that are categorised elsewhere as 'echo questions' (inter alia Cruttenden 1986), because they echo, or repeat, all or part of what has just been said by the interlocutor.",
        "Because these types of OBJECT move are considered to be a category of question in the intonation literature, they are analysed here alongside moves of questioning force.",
        "However, since they could be responding within",
        "one game as well as initiating another (sub)-game, they cannot be classified as simple questions, which have only an initiating function (Carletta et al., 1995)."
      ]
    },
    {
      "heading": "5 Intonation and moves",
      "text": [
        "The intonation contours used for each type of move will be discussed and exemplified below, along with the dialogue context from which the example has been excised (where G is the route giver and F the follower).",
        "A number of examples are accompanied by FO traces.",
        "The basenames of the associated speech and FO files are given in angled brackets.",
        "QUERY Moves - QUERIES have a rising-falling intonation pattern, rising up to the accented syllable and down from it, transcribed as L+H* L-L%.",
        "The final boundary tone may be H% instead of L%.",
        "An initial H* pitch accent (PA) is optional; it is not present in all examples of QUERY move.",
        "1.",
        "Hai aGNELlo?",
        "H* L+H* L-L% context:",
        "G: hai agnello?",
        "(do you have lamb?)",
        "F: no If the accented syllable is final in the phrase, the fall on that syllable is curtailed substantially, as illustrated in Grice et al. (1995).",
        "If the focus (see e.g. Gussenhoven 1983 for a definition of focus) is not on the final lexical item in the phrase (henceforth referred to as non-final), the PA on the focussed item is followed by an intermediate phrase (ip) boundary.",
        "The rest of the question constitutes another ip which has a reduced range and has an identical PA and boundary tone.",
        "That second ip is similar to what has been described by Crystal (1969) as a subordinate tone group.",
        "For a theoretical account see Grice (1995) which refers to analogous cases in Palermo Italia&",
        "2.",
        "<un-giro> faun Giro (foc) intorno all'alBERgo?",
        "L+H* L L+H* L-L%",
        "I The interrogative PA in Palermo Italian is L*+H, not L+H* as in Bari Italian.",
        "context: F: ... no, aspetta, scusa, la la strada passa da sotto, hai detto (...no, wait a minute, sorry, the the path goes underneath, you said) G: si', da sotto l'albergo Malaga (yes, under hotel Malaga) [pause] F: ecco, e poi la la il devo questa strada devo farla ehm tocc... devo devo ehm dove dove la faccio terminare?"
      ]
    },
    {
      "heading": "Fa un GIRO intorno all'albergo?",
      "text": [
        "(right, and then the the I have to this - path - I have to erm touch...",
        "I have to erm where where do I make it finish?",
        "Does it go ROUND the hotel?)",
        "The above case involves what appears to be reaccenting, as discussed by Cruttenden (1993), on the word albergo (hotel), which is given in the dialogue context.",
        "In cases where the subject occupies sentence-final position, it also constitutes a subordinate intermediate phrase with its own accent, the focal PA being in the first ip, as in 3.",
        "CHECK Moves - The intonation of CHECKS is influenced by the degree of speaker confidence as to the correctness of the inferred material it contains, that is, the degree of speaker confidence that the material is old.",
        "CHECKS which are tentative may have an intonation contour which is indistinguishable from that of QUERIES; in terms of information structure, neither contain information which is confidently deemed by the current speaker to be old.",
        "An example of a tentative CHECK is in 4 below.",
        "Confident CHECKS have a different pitch accent: H*+L.",
        "Moreover, there is no reaccenting of post-focal material.",
        "Where the focus is non-final, the focussed pitch accent is followed by a word receiving a strong prominence without a pitch excursion (in British School terms, the appropriate syllable in the word is stressed but not accented; Crystal 1969).",
        "We refer to such a prominence as a suppressed accent.",
        "In example 5 below, there is an accent on \"devo\" and a suppressed accent on \"scritta\".",
        "An equivalent syntactic structure to that in example 3, where the subject is sentence-final, is in 6 below.",
        "In both examples 5 and 6, the choice of H*+L pitch accent is motivated by the perceptual impression of a sharp fall on the accented syllable.",
        "In fact, the FO peak occurs very early in the accented syllable in contrast to the FO peak on L+H* pitch accents which generally occurs in the second half of the syllable.",
        "It is unclear whether the analysis should include a L boundary after \"devo\", with the implication that what follows is an ip with no pitch accent, a combination so far only postulated for tags.",
        "Since without further analysis, for example of duration data, there is no obvious way of distinguishing between the two transcriptions, we opt provisionally for the analysis without an ip boundary.",
        "ALIGN Moves - ALIGNS of the type \"Va bene?\" or \"Ci sei?\" (Are you with me?)",
        "are realised with the same intonation pattern as for QUERIES.",
        "Although example 7 below has a L% boundary tone, they may have either L% or H%.",
        "These constitute the majority of ALIGNS.",
        "However, they may also involve seeking confirmation of inferred material.",
        "The intonation pattern used in these cases depends on the speaker's degree of confidence as to the correctness of his/her inferral, as in the CHECK category above.",
        "OBJECT moves - In Bari Italian, the OBJECT moves we have examined have the same tonal analysis as QUERIES of the yes-no kind.",
        "It is not the tonal analysis but rather other parameters which appear to distinguish OBJECTS from QUERIES, viz. \"breathy\" voice quality and/or expanded range, both of which can signal incredulity.",
        "An example from the corpus is in 8.",
        "It might be argued that although the actual lexical material in OBJECT moves is old, the degree of speaker confidence that the information is shared is low.",
        "In example 8, the speaker is, amongst other things, conveying the fact that the interlocutor's assumption that the information is shared is incorrect.",
        "A summary of the moves and their pitch accents is in table 1.",
        "It is clear that in two types of move either L+H* or H*+L can be used, thus precluding a one-to-one correspondence between move-type and pitch accent.",
        "For completeness, example 9 is given below of a command, referred to as an INSTRUCT move, which is non-final in a list of commands.",
        "This pattern is similar to that given for 'questions' in Standard Italian, but is distinct from any of the patterns found for the questions examined here for Bari Italian.",
        "Another non-final pattern (H* H-H%) is discussed in Grice et al. (1995)."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "In this dialogue corpus study, we have observed that conversational game move types do not necessarily have a specific intonation contour; CHECKS and ALIGNS may have either of two distinct types of pitch accent.",
        "QUERIES and OBJECTS have the same pitch accent, but differ in other parameters.",
        "However, we have found that pitch accent type reflects the degree to which the speaker believes whether the current question contains shared material.",
        "Where the speaker is lacking in confidence as to whether the material is old or not, the same pitch accent, L+H*, accompanied by reaccenting of post-focal material, is used as when it is totally new.",
        "The fact that OBJECTS contain repeated lexical material, although they pattern with utterances referring to new information, is explained by the fact that this repeated material is considered to be erroneously regarded as shared with the interlocutor.",
        "It therefore appears that speakers do not use pitch accent type to distinguish between totally new and possibly new material, but that they do distinguish between those cases and ones where they are reasonably confident that material is old.",
        "Further research using perceptual testing is planned to confirm this hypohesis.",
        "References Agard, F.B.",
        "and R.J. di Pietro.",
        "1965.",
        "The sounds of English and Italian.",
        "Anderson, A.H., M. Bader, E.G. Bard, E. Boyle, G Doherty, S Garrod, S. Isard, J. Kowtko, J. McAllister, J. Miller, C. Sottillo, H Thompson, and R. Weinert.",
        "1991.",
        "The HCRC Map Task Corpus, Language and Speech, 34, 4, pp.",
        "351-366.",
        "Avesani, C. 1990.",
        "A contribution to the synthesis of Italian intonation.",
        "Proc.",
        "ICSPL 90, vol 1, pp.",
        "833-836.",
        "Beckman M. and G. Ayers.",
        "1994.",
        "Guidelines for ToBI transcription, version 2.",
        "Ohio State University."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We would like to thank Steve Isard and Jean Carletta for generously making time for discussion of the categories of move treated in this paper.",
        "Thank you also to Ralf Benzmiiller for his input to the discussion of moves in a multilingual context and to Elisabeth Maier for comments on the manuscript.",
        "• i ••.. ."
      ]
    }
  ]
}
