{
  "info": {
    "authors": [
      "Kornel Laskowski",
      "Mari Ostendorf",
      "Tanja Schultz"
    ],
    "book": "Proceedings of the 9th SIGdial Workshop on Discourse and Dialogue",
    "id": "acl-W08-0124",
    "title": "Modeling Vocal Interaction for Text-Independent Participant Characterization in Multi-Party Conversation",
    "url": "https://aclweb.org/anthology/W08-0124",
    "year": 2008
  },
  "references": [
    "acl-W04-2319"
  ],
  "sections": [
    {
      "text": [
        "Kornel Laskowski Cognitive Systems Labs Universität Karlsruhe Karlsruhe, Germany kornel@ira.uka.de",
        "of Electrical Engineering University of Washington",
        "Seattle WA, USA",
        "Cognitive Systems Labs Universitat Karlsruhe Karlsruhe, Germany",
        "tanj a@ira.uka.de",
        "An important task in automatic conversation understanding is the inference of social structure governing participant behavior.",
        "We explore the dependence between several social dimensions, including assigned role, gender, and seniority, and a set of low-level features descriptive of talkspurt deployment in a mul-tiparticipant context.",
        "Experiments conducted on two large, publicly available meeting corpora suggest that our features are quite useful in predicting these dimensions, excepting gender.",
        "The classification experiments we present exhibit a relative error rate reduction of 37% to 67% compared to choosing the majority class."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "An important task in automatic conversation understanding is the inference of social structure governing participant behavior; in many conversations, the maintenance or expression of that structure is an implicit goal, and may be more important than the propositional content of what is said.",
        "There are many social dimensions along which participants may differ (Berger, Rosenholtz and Zelditch, 1980).",
        "Research in social psychology has shown that such differences among participants entail systematic differences in observed turn-taking and floor-control patterns (e.g. (Bales, 1950), (Tannen, 1996), (Carletta, Garrod and Fraser-Krauss, 1998)), and that participant types are not independent of the types and sizes of conversations in which they appear.",
        "In the present work, we consider the dimensions of assigned role, gender, and seniority level.",
        "We explore the predictability of these dimensions from a set of low-level speech activity features, namely the probabilities of initiating and continuing talkspurts in specific multipartici-pant contexts, estimated from entire conversations.",
        "For our purposes, talkspurts (Norwine and Murphy, 1938) are contiguous intervals of speech, with internal pauses no longer than 0.3 seconds.",
        "Features derived from talkspurts are not only easier to compute than higher-level lexical, prosodic, or dialogue act features, they are also applicable to scenarios in which only privacy-sensitive data (Wyatt et al., 2007) is available.",
        "At the current time, relatively little is known about the predictive power of talkspurt timing in the context of large multi-party corpora.",
        "As stated, our primary goal is to quantify the dependence between specific types of speech activity features and specific social dimensions; however, doing so offers several additional benefits.",
        "Most importantly, the existence of significant dependence would suggest that multiparticipant speech activity detectors (Laskowski, Fugen and Schultz, 2007) relying on models conditioned on such attributes may outperform those relying on general models.",
        "Furthermore, conversational dialogue systems deployed in multi-party scenarios may be perceived as more human-like, by humans, if their talkspurt deployment strategies are tailored to the personalities they are designed to embody.",
        "Computational work which is most similar to that presented here includes the inference of static dominance (Rienks and Heylen, 2005) and influence (Rienks et al., 2006) rankings.",
        "In that work, the authors employed several speech activity features differing from ours in temporal scale and normalization.",
        "Notably, their features are not probabilities which are directly employable in a speech activity detection system.",
        "In addition, several higher-level features were included, such as topic changes, participant roles, and rates of phenomena such as turns and interruptions, and these were shown to yield the most robust performance.",
        "Our aim is also similar to that in (Vinciarelli, 2007) on radio shows, where the proposed approach relies on the relatively fixed temporal structure of production broadcasts, a property which is absent in spontaneous conversation.",
        "Although (Vinciarelli, 2007) also performs singlechannel speaker diarization, he does not explore behavior during vocalization overlap.",
        "Aside from the above, the focus of the majority of existing research characterizing participants is the detection of dynamic rather than static roles (i.e. (Banerjee and Rudnicky, 2004), (Zancanaro et al., 2006), (Rienks et al., 2006)).",
        "From a mathematical perspective, the research presented here is a continuation of our earlier work on meeting types (Laskowski, Ostendorf and Schultz, 2007), and we rely on much of that material in the presentation which follows."
      ]
    },
    {
      "heading": "2. Characterizing Participants",
      "text": [
        "Importantly, we characterize participants in entire groups, rather than characterizing each participant independently.",
        "Doing so allows us to apply constraints on the group as a whole, eliminating the need for hypothesis recombination (in the event that more than one participant is assigned a role which was meant to be unique).",
        "Additionally, treating groups holistically allows for modeling the interactions between specific pairs of participant types.",
        "For each conversation or meeting of K participants, we compute a feature vector F, in which all one-participant and two-participant speech activity features are found in a particular order, typically imposed by microphone channel or seating assignment (the specific features are described in Section 4).",
        "The goal is to find the most likely group assignment of participant labels that account for the observed F. In (Laskowski, Ostendorf and Schultz, 2007), it was shown that meeting types in a large meeting corpus can be successfully inferred from F using this approach; here, we employ the same framework to classify participant types in the K-length vector g, for the group as a whole:",
        "where MM and BM are the membership and behavior models, respectively, and G is the set of all possible assignments of g.",
        "In the remainder of this section, we define the participant characteristics we explore, which include assigned role, gender, and seniority.",
        "We treat these as separate tasks, applying the same classification framework.",
        "We also show how our definitions provide search space constraints on Equation 1.",
        "Given a meeting of K participants, we consider a set of roles R = {R1; R2, • • •, RK} and assign to each participant k, l<k<K, exactly one role in R. An example group assignment is the vector ri of length K, where r1 [k] = Rk.",
        "The set R of group assignment alternatives r G R is given by permutations a : R – R, where a G Sk, the symmetric group on K symbols.",
        "The number of elements in R is identically the number of unique permutations in SK, a quantity known as its order |SK | = K!.",
        "To identify the most likely group assignment r* = a* (r1) given the set F of observables, we iterate over the K!",
        "elements of S K using where we have elided the prior P ( a ) assuming that it is uniform.",
        "Following the application of Equation 2, the most likely role of participant k is given by a* (ri)[k].",
        "Alternately, we may be interested in identifying only a subset of the roles in R, namely a leader, or a manager.",
        "In this case, participant roles are drawn from L = {L, – L}, under the constraint that exactly one participant is assigned the role L. The set L of alternative group assignments has K indicator vector members lj, l<j<K, where lj [k] is L for k = j and – L otherwise.",
        "We iterate over the indicator vectors to obtain assuming uniform priors P ( lj ).",
        "Following the application of Equation 3, j* is the index of the most likely L participant.",
        "We note that this framework for unique role classification is applicable to classifying unique ranks, without first having to collapse them into non-unique rank classes as was necessary in (Rienks et al., 2006).",
        "The second type of inference we consider is for dimensions in which roles are not unique, i.e. where participants are in principle drawn independently from a set of alternatives.",
        "This naturally includes dimensions such as gender, seniority, age, etc.",
        "As an example, we treat the case of gender.",
        "Participant genders are drawn independently from H = { ~, I}.",
        "The set of group assignment alternatives h is given by the Cartesian product HK, of 2K unique elements.",
        "We search for the most likely group assignment h*, given the observables F, by iterating over these elements using",
        "Once h* is found, the gender of each participant k is available in h* [k].",
        "A similar scenario is found for seniority, when it is not uniquely ranked.",
        "We assume a set of NS mutually exclusive seniority levels Si G S = {S1, S2, • • •, SNs}, l<i<NS.",
        "During search, each participant's seniority level is drawn independently from S, leading to group assignments s G SK, of which there are NK.",
        "As for gender, we iterate over these to find",
        "The seniority ofparticipant k, following the application of Equation 5, is s* [k].",
        "In the current work, we use two different corpora of multi-party meetings.",
        "The first, the scenario subset of the AMI Meeting Corpus (Carletta, 2007), consists of meetings involving K = 4 participants who play different specialist roles in a product design team.",
        "We have observed the recommended division of this data into: amiTrainSet of 98 meetings; amiDevSet of 20 meetings; and amiEvalSet, also of 20 meetings.",
        "Although each participant takes part in approximately 4 meetings, the 3 sets are disjoint in participants.",
        "We use only the provided word alignments of these meetings.",
        "The corpus is accompanied by metadata which specifies the gender and assigned role of each participant.",
        "The second corpus consists of the Bed, Bmr, and Bro meeting types in the ICSI Meeting Corpus (Janin et al., 2003).",
        "Each meeting is identified by one of { Bed, Bmr, Bro}, as well as a numerical identifier d. We have divided these meetings into: icsiTrainSet, consisting of the 33 meetings for which d mod 4 G {1,2}; icsiDevSet, consisting of the 18 meetings for which d mod 4 = 3; and icsiEvalSet, consisting of the 16 meetings for which d mod 4 = 0.",
        "These three sets are not disjoint in participants, and the number ofinstrumented participants K varies from meeting to meeting, between 3 and 9.",
        "The corpus is accompanied by metadata specifying the gender, age, and education level of each participant.",
        "We use only the forced alignments of these meetings, available in the accompanying MRDA Corpus (Shriberg et al., 2004)."
      ]
    },
    {
      "heading": "4. Features",
      "text": [
        "Our observation space is the complete K-participant vocal interaction on-off pattern description for a meeting C, a discretized version of which we denote as qt G {0,1}K for 1<t<T, where T is the duration of C in terms of the number of 100 ms frames.",
        "Details regarding the discretization (and subsequent feature computation) can be found in (Laskowski, Ostendorf and Schultz, 2007).",
        "We compute from qt the following featureswhich are the elements of F: fjf, the probability that participant k initiates vocalization at time t when no-one else was speaking at t – 1; f^, the probability that participant k continues vocalization at time t when no-one else was speaking at t – 1; ticipant is type g [k].",
        "This model is used for gender (P(h)) and seniority (P(s)).",
        "The probabilities of specific types are maximum likelihood estimates from the training data.",
        ", the probability that participant k initiates vocalization at time t when participant j was speaking 6 Assigned Role Classification at t – 1; and f?° the probability that participant k continues vocalization at time t when participant j was speaking at t – 1.",
        "Values of the features, which are time-independent probabilities, are estimated using a variant of the Ising model (cf. (Laskowski, Ostendorf and Schultz, 2007)).",
        "Additionally, we compute a feature , the probability that participant k vocalizes at time t, and single-participant averages of the two-participant features: , (/jkf,",
        "i/kjf')j, and (/jf'k )j.",
        "The complete feature vector for a conversation of K participants then consists of 7K one-participant features, and 2(K – K) two-participant features.",
        "We note that multiple phenomena contribute to the overlap features.",
        "The features /kj are based on counts from interruptions, backchannels, and precise floor handoffs.",
        "The features /kjC are based on counts from interruptions, attempts to hold the floor, and backchannels.",
        "Both feature types also contain counts incurred during schism, when the conversation splits into two sub-conversations."
      ]
    },
    {
      "heading": "5. Models",
      "text": [
        "Since K may change from meeting to meeting, the size of the feature vector F must be considered variable.",
        "We therefore factor the behavior model, assuming that all features are mutually independent and that each is described by its own univariate Gaussian model N(/x,<t).",
        "These parameters are maximum likelihood estimates from the /k and /k j values in a training set of conversations.",
        "In most of these experiments, where the number of classes is small, no parameter smoothing is needed.",
        "For the cases where the group prior is not uniform and participant types are not unique, the membership model assumes independent participant types and has the general form where P ( g [k] ) is the probability that the k-th par-",
        "For unique role classification, we use the AMI Meeting Corpus.",
        "All meetings consist of K = 4 participants, and each participant is assigned one of four roles: project manager (PM), marketing expert (ME), user interface designer (UI), or industrial designer (ID).",
        "As mentioned in Section 2.1, classifying the unique role of all participants, jointly, involves enumerating over the possible permutations of {PM, ME, UI, ID}.",
        "We use amiTrainSet to train the behavior model, and then classify amiDevSet using Equation 2, one feature type at a time, to identify the best 3 feature types for this task; development experiments suggest that classification rates level off after a small handful of the best performing feature types is included.",
        "Those feature types were found to be fjf, (f°j)j, and ff?j, capturing the probability of initiating a talkspurt in silence, of initiating a talkspurt when someone else is speaking, and of initiating a talkspurt when a participant in a specific other role is speaking, respectively.",
        "On amiEvalSet, these feature types lead to single-feature-type 4-way classification rates of 41%, 29%, and 53%, respectively.",
        "When all three types are used together (3K + K features in total), the rate is 53%.",
        "Accuracy when all feature types are used is 46%, indicating that some feature types are detrimental to this task.",
        "The confusion matrix for classification using the three best feature types is shown in Table 1.",
        "The matrix shows that association between the reference assignment of PM, as well as of UI, and the hypothesized assignment based on the three feature types mentioned is statistically significant.",
        "On the other hand, assignment of ID and ME does not deviate significantly from chance.",
        "Using the same data as above, we explore the simplified task of finding a specific participant type.",
        "We",
        "Table 1: Confusion matrix for role classification on amiEvalSet; reference assignment is found in the rows, hypothesized assignment in columns.",
        "Correctly classified roles, along the diagonal, are highlighted in bold.",
        "Statistical significance of association at the p < 0.005 level per class, using a 2x2 x-test, is shown using \"++\" and \" – \", for above chance and below chance values, respectively; the same is true of \"+\" and for significance at the 0.005 < p < 0.05 level.",
        "equate the project manager role with L, and the remaining roles with -L. This is justified by the AMI meeting scenario, in which participant groups take a product design from start to prototype, and in which the project manager is expected to make the group run smoothly.",
        "The behavior model, trained on amiTrainSet, is applied using Equation 3 to determine the most likely index j * of the leader L, given the observed F, from among the K = 4 alternatives.",
        "To select the best 3 feature types, we once again use amiDe-vSet; these turn out to be the same as those for role classification, namely ff, {f° j, and f°.",
        "Using these three feature types individually, we are able to identify the leader PM in 12 of the 20 meetings in amiEvalSet.",
        "When all three are used together, the identification rate is 60%.",
        "However, when all feature types are used, the identification rate climbs to 75%.",
        "Since all participants are equally likely to be the leader, the baseline for comparison is random guessing (25% accuracy).",
        "Figure 1 shows the distribution of two of the selected features, fff and ff?, for the data in amiTrainSet; we also show the first standard deviation of the single-Gaussian diagonal-covariance models induced.",
        "We first note that fff and fare correlated, i.e. that the probability of beginning a talkspurt in silence is correlated with the probability of beginning a talkspurt when someone else is speaking.",
        "L consistently begins more talkspurts, both in silence and during other people's speech.",
        "It",
        "Figure 1: Distribution of (f, f°°f) pairs for each of (-L, -L), (-L, L), and (L, -L).",
        "Ellipses are centered on amiTrainSet means and encompass one standard deviation.",
        "is also interesting that L is slightly less likely to initiate a talkspurt when L is already speaking than when another - L is.",
        "This suggests that - L participants consistently observe the L-status of the already speaking party when contemplating talkspurt production.",
        "Finally, we note that neither the probability of continuing a talkspurt f ff' (related to talk-spurt duration) nor fff (related to overall amount of talk) are by themselves good L/-L discriminators."
      ]
    },
    {
      "heading": "7. Gender Classification",
      "text": [
        "Gender classification is an example of a task with a Cartesian search space.",
        "For these experiments, we use the AMI Meeting Corpus and the ICSI Meeting Corpus.",
        "in both corpora, gender is encoded in the first letter of each participant's unique identifier.",
        "The ratio of male to female occurrences is 2:1 in amiTrainSet, and 4:1 in icsiTrainSet.",
        "Choosing the majority class leads to gender classification rates of 65% and 81% on amiEvalSet and icsiEvalSet, respectively.",
        "We enumerate alternative group assignments using Equation 4.",
        "Somewhat surprisingly, no single feature type leads to amiEvalSet or icsiEvalSet classification rates higher than those obtained by hypothesizing all participants to be male.",
        "On amiDe-vSet, one feature type (ff) yields negligibly better accuracy, but does not generalize to the corresponding evaluation data.",
        "Furthermore, the association between reference gender labels and hypothesized gender labels, on both evaluation sets, does not appear to be statistically significant at the p < 0.05 level.",
        "This finding that males and females do not differ significantly in their deployment of talkspurts is likely a consequence of the social structure of the particular groups studied.",
        "The fact that AMI roles are acted may also have an effect.",
        "Ref",
        "Hyp",
        "ID",
        "ME",
        "PM",
        "UI",
        "ID",
        "8",
        "6",
        "4",
        "2",
        "ME",
        "5",
        "8",
        "4",
        "3",
        "PM",
        "3",
        "4",
        "++12",
        "- 1",
        "UI",
        "4",
        "2",
        "--0",
        "++14",
        "+ (-* (-",
        "□ (L",
        "L,-L)",
        "L,L)",
        "-L)",
        "+",
        "+",
        "□ c",
        "Hf □",
        "□",
        "□",
        "□",
        "+",
        "+",
        "□ □",
        "+",
        "+ *",
        "+",
        "+",
        "□",
        "+ □",
        "0 □",
        "+S^KPd",
        "ttc ■ ?",
        "□",
        "+",
        "(-L,-L) – f",
        "5b J (L,-L) I",
        "LJ □",
        "w",
        "□",
        ".x.n.D.",
        "+ □",
        "□",
        "(-L,L)",
        "□"
      ]
    },
    {
      "heading": "8. Seniority Classification",
      "text": [
        "As a second example of non-unique roles, we attempt to classify participant seniority.",
        "For these experiments, we use the ICSI Meeting corpus, in which each participant's education level appears as an optional, self-reported attribute.",
        "We have manually clustered these attributes into NS = 3 mutually exclusive seniority categories.",
        "Each participant's seniority is drawn independently from S = {grad, phd, prof}; a breakdown for icsiTrain-Set is shown in Table 2.",
        "Choosing the majority class (P (phd) = 0.444 on icsiTrainSet) yields a classification accuracy of 45% on icsiEvalSet.",
        "We note that in this data, education level is closely correlated with age group.",
        "Table 2: Breakdown by seniority S in icsiTrainSet by the number of unique participants (spkrs), the number of occurrences (occur), and the number of meetings (meets) in which each seniority occurs.",
        "Independently of Conversation Types",
        "We first treat the problem of classifying participant seniority levels independently of the type of conversation being studied.",
        "We identify the most likely seniority assignment for all participants using Equation 5.",
        "The best three feature types, determined using icsiDevSet, are ff, ffj, and ff°° (representing the probability of speaking, of beginning a talkspurt when a specific seniority participant is already speaking, and of continuing a talkspurt when a specific seniority participant is speaking), yielding single-feature-type classification rates of 52%, 59%, and 59%, respectively.",
        "When used together, these three feature types produce the confusion matrix shown in Table 3 and a rate of 61%, better than when all feature types are used (58%).",
        "This represents a 28% relative error reduction over chance.",
        "As can be seen in the table, association between the reference and hypothesized seniority assignments is statistically significant on unseen data.",
        "It is also evident that confusion between grad and prof is lower than between more proximate seniority levels.",
        "Table 3: Confusion matrix for seniority classification on icsiEvalSet; reference assignment is found in the rows, hypothesized assignment in columns.",
        "Highlighting and use of \"++\", \"+\", and \" – \" as in Table 1.",
        "Figure 2 shows the distribution of (ff, ff°C) pairs in icsiTrainSet, together with the first standard deviation, for each combination of the already speaking seniority participant and the seniority participant initiating a new talkspurt (except for (prof, prof), since there is at most one prof in each icsiTrainSet meeting).",
        "As is clear from the figure, prof participants in this data talk more than either of the two other seniority types.",
        "The figure also demonstrates a difference of behavior during speech overlap.",
        "The four ellipses describing grad behavior when overlapping with any of the other three classes, as well as phd behavior when overlapping with grad participants, are relatively broad and indicate the absence of strong tendency or preference.",
        "However, phd participants are more likely to continue vocalizing in overlap with other phd participants, and even more likely to continue through overlap with prof partic-",
        "Ref",
        "Hyp",
        "grad phd prof",
        "grad",
        "phd",
        "prof",
        "++11 26 3 - 2 ++41 - 3 0--6 ++10",
        "Seniority",
        "Number of",
        "spkrs",
        "occur",
        "meets",
        "grad",
        "15",
        "81",
        "33",
        "phd",
        "13",
        "87",
        "29",
        "prof",
        "3",
        "28",
        "28",
        "all",
        "31",
        "196",
        "33",
        "Figure 2: Distribution of (ffcV, fjfj ) feature value pairs for each of the (k, j) participant pairs (grad, grad), (grad, phd), (grad, prof), (phd, grad), (phd, phd), (phd, prof), (prof, grad), and (prof, phd).",
        "Ellipses are centered on icsiTrainSet means and encompass one standard deviation.",
        "ipants.",
        "A similar trend is apparent for prof participants: the mean likelihood that they continue vocalizing in overlap with grad participants lies below /t – a (bottom 17%) of their model with phd participants.",
        "We believe that the senior researchers in this data are consciously minimizing their overlap with students, who talk less, to make it easier for the latter to speak up.",
        "We now repeat the experiments in the previous section, but condition the behavior and membership models on meeting type t:",
        "where t eT = {Bed, Bmr, Bro}.",
        "performance using maximum likelihood estimates for the behavior model P (F | s, t) results in a seniority classification rate on icsiEvalSet of 61%, i.e. no improvement over conversation-type-independent classification.",
        "We suspect this is due to the smaller amounts of training material.",
        "To verify this assumption, we smooth the maximum likelihood estimates, <t|.",
        "t, towards the maximum likelihood conversation-type-independent estimates,",
        "At Si ,aSi, using where the value of a = 0.7 was selected using icsiDevSet.",
        "This leads to a rate of 63% on icsiEvalSet.",
        "Furthermore, if instead of estimating the prior on conversation type P (t) from the training data, we use our meeting type estimates from (Laskowski, Ostendorf and Schultz, 2007), the classification rate increases to 67%.",
        "A control experiment in which the true type ttest of each test meeting is known, i.e. P (t) = 1 if ttest = t and 0 otherwise, shows that the maximum accuracy achievable under optimal P (t) estimation is 73%."
      ]
    },
    {
      "heading": "9. Conclusions",
      "text": [
        "We have explored several socially meaningful partitions of participant populations in two large multiparty meeting corpora.",
        "These include assigned role, leadership (embodied by a manager position), gender, and seniority.",
        "Our proposed classifier, which can represent participants in groups rather than independently, is able to leverage the observed differences between specific pairs of participant classes.",
        "Using only low-level features capturing when participants choose to vocalize relative to one another, it attains relative error rate reductions on unseen data of 37%, 67%, and 40% over chance on classifying role, leadership, and seniority, respectively.",
        "We have also shown that the same classifier, using the same features, cannot discriminate between genders in either corpus.",
        "A comparison of the proposed feature types and their performance on the tasks we have explored is shown in Table 4.",
        "Consistently, the most useful feature types appear to be the probability of initiating a talkspurt in silence, and the probability of initiating a talkspurt when a participant of a specific type is already speaking.",
        "Additionally, on the ICSI Meeting Corpus, the probability of speaking appears to be dependent on seniority, and the probability of continuing to vocalize in overlap with another participant appears to depend on the seniority of the latter.",
        "Finally, we note that, for seniority classification on the unseen icsiEvalSet, the top 3 feature types outperform the best single feature type, indicating a degree of feature type complementarity; this is also true for L-detection on amiEvalSet when all feature types, as opposed to the single best feature type, are used.",
        "Im",
        "(GRAD,*)",
        "□ (GRAD,GRAD) 0 (GRAD,PHD)",
        "<",
        "' V",
        "(PHD,GRAD)",
        "+",
        "O (GRAD,PROF) □ (PHD,GRAD) 0 (PHD,PHD)",
        "[",
        "<",
        "• □",
        "□",
        "O (PHD,PROF) \" + (PROF,GRAD) x (PROF,PHD)",
        "Table 4: Comparative classification performance for 3 experiments on amiEvalSet and 3 experiments on icsiEvalSet, per feature type; R, L, H, and S as defined in Section 2.",
        "Also shown is performance on the best three feature types (selected using development data) and all feature types, as well as that when choosing the majority class (\"prior\"), informed by training data priors; for R and L classification, \"priof performance is equal to random guessing.",
        "\" – \" indicates that a feature type, by itself, did not perform above the corresponding \"prior\" rate; top-3 feature type selection indicated by \"*\".",
        "Our results not only suggest new, easy-to-compute, low-level features for the automatic classification of participants into socially meaningful types, but also offer scope for informing turn-taking or talkspurt-deployment policies in conversational agents deployed in multi-party settings.",
        "Additionally, they suggest that implicit models of certain equivalence classes may lead to improved performance on other tasks, such as multi-participant vocal activity detection."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We would like to thank Jean Carletta for helpful comments during the inal preparation of this manuscript, and Liz Shriberg for access to the ICSI MRDA Corpus.",
        "Feature",
        "AMI",
        "ICSI",
        "Type",
        "R",
        "C",
        "n",
        "n",
        "S",
        "S\\t*",
        "Jk",
        "44",
        " – ",
        " – ",
        " – ",
        "*52",
        "*57",
        "fVI",
        "Jk",
        "fVC",
        "Jk",
        "*41 34",
        "*60",
        " – ",
        " – ",
        "52",
        "56 62",
        "(fjg)j (fk,j )j",
        "44",
        "*29",
        "*60",
        "47 49",
        "56 59",
        "fOI JkJ",
        "*53",
        "*60",
        "64",
        " – ",
        "*59",
        "*59",
        "^jâcj",
        "(fk,j )j",
        "fOC",
        "Jk,j",
        "24",
        " – ",
        " – ",
        " – ",
        "54",
        "*59",
        "57 59 *63",
        "top 3*",
        "53",
        "60",
        " – ",
        " – ",
        "61",
        "67",
        "all",
        "46",
        "75",
        "43",
        "47",
        "58",
        "57",
        "priors",
        "25",
        "25",
        "65",
        "81",
        "45",
        "45"
      ]
    }
  ]
}
