{
  "info": {
    "authors": [
      "Jon Barwise"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P81-1026",
    "title": "Some Computational Aspects of Situation Semantics",
    "url": "https://aclweb.org/anthology/P81-1026",
    "year": 1981
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Can a realist model theory of natural language be computationally plausible?",
        "Or, to put it another way, is the view of linguistic meaning as a relation between expressions of a natural language and things (objects, properties, etc.)",
        "in the world, as opposed to a relation between expressions and procedures in the head, consistent with a computational approach to understanding natural language?",
        "The model theorist must either claim that the answer is yes, or be willing to admit that humans transcend the computationally feasible in their use of language?",
        "Until recently the only model theory of natural language that was at all well developed was Montague Grammar.",
        "Unfortunately, it was based on the primitive notion of \"possible world\" and so was not a realist theory, unless you are prepared to grant that all possible worlds are real.",
        "Montague Grammar is also computationally intractable, for reasons to be discussed below.",
        "John Perry and I have developed a somewhat different approach to the model theory of natural language, a theory we call \"Situation Semantics\".",
        "Since one of my own motivations in the early days of this project was to use the insights of generalized recursion theory to find a computationally plausible alternative to Montague Grammar, it seems fitting to give a progress report here."
      ]
    },
    {
      "heading": "1. MODEL – THEORETIC SEMANTICS \"VERSUS\" PROCEDURAL SEMANTICS",
      "text": [
        "First, however, I can't resist putting my two cents worth into this continuing discussion.",
        "Procedural semantics starts from the observation that there is something computational about our understanding of natural language.",
        "This is obviously correct.",
        "Where some go astray, though, is in trying to identify the meaning of an expression with some sort of program run in the head.",
        "But programs are the sorts of things to HAVE meanings, not to BE meanings.",
        "A meaningful program sets up some sort of relationship between things – perhaps a function from numbers to numbers, perhaps something much more sophisticated.",
        "But it is that relation which is its meaning, not some other program.",
        "The situation is analogous in the case of natural language.",
        "It is the relationships between things in the world that a language allows us to express that make a language meaningful.",
        "It is these relationships that are identified with the meanings of the expressions in model theory.",
        "The meaningful expressions are procedures that define these relations that are their meanings.",
        "At least this is the view that Perry and I take in situation semantics.",
        "With its emphasis on situations and events, situation semantics shares some perspectives with work in artificial intelligence on representing knowledge and action (e.g., McCarthy and Hayes, 1969), but it differs in some crucial respects.",
        "It is a mathematical theory of linguistic meaning, one that replaces the view of the connection between language and the world at the heart of Tarski – style model theory with one much more like that found in J.L.",
        "Austin's \"Truth\".",
        "For another, it takes seriously the syntactic structures of natural language, directly interpreting them without assuming an intermediary level of \"logical form\"."
      ]
    },
    {
      "heading": "2. A COMPUTATION OBSTRUCTION AT THE CORE OF FIRST – ORDER LOGIC",
      "text": [
        "The standard model – theory for first – order logic, and with it the derivative model – theory of indices (\"possible worlds\") used in Montague Grammar is based on Frege's supposition that the reference of a sentence could only be taken as a truth value; that all else specific to the sentence is lost at the level of reference.",
        "As Quine has seen most clearly, the resulting view of semantics is one where to speak of a part of the world, as in (1), is to speak of the whole world and of all things in the world.",
        "(1) The dog with the red collar belongs to my son.",
        "There is a philosophical position that grows out of this view of logic, but it is not a practical one for those who would implement the resulting model – theory as a theory of natural language.",
        "Any treatment of (1) that involves a universal quantification over all objects in the domain of discourse is doomed by facts of ordinary discourse, e.g., the fact that I can make a statement like (1) in a situation to describe another situation without making any statement at all about other dogs that come up later in a conversation, let alone about the dogs of Tibet.",
        "Logicians have been all too ready to dismiss such philosophical scruples as irrelevant to our task-especially shortsighted since the same problem is well known to have been an obstacle in developing recursion theory, both ordinary recursion theory and the generalizations to other domains like the functions of finite type.",
        "We forget that only in 1938, several years after his initial work in recursion theory, did Kleene introduce the class of PARTIAL recursive functions in order to prove the famous Recursion Theorem.",
        "We tend to overlook the significance of this move, from total to partial functions, until its importance is brought into focus in other contexts.",
        "This is just what happened when Kleene developed his recursion theory for functions of finite type.",
        "His initial formulation restricted attention to total functions, total functions of total functions, etc.",
        "Two very important principles fail in the resulting theory – the Substitution Theorem and the First Recursion Theorem.",
        "This theory has been reworked by Platek (1963), Moschovakis (1975), and by Kleene (1978, 1980) using",
        "partial functions, partial functions of partial functions, etc., as the objects over which computations take place, imposing (in one way or another) the following constraint on all objects F of the theory: Persistence of Computations: If s is a partial function and F(s) is defined then F(s') ■ F(s) for every extension s' of s. In other words, it should not be possible to invalidate a computation that F(s) • a by simply adding further information to s. To put it yet another way, computations involving partial functions s should only be able to use positive information about s, not information of the form that s is undefined at this or that argument.",
        "To put it yet another way, F should be continuous in the topology of partial information.",
        "Computationally, we are always dealing with partial information and must insure persistence (continuity) of computations from it.",
        "But this is just what blocks a straightforward implementation of the standard model-theory--the wholistic view of the world which it is committed to, based on Frege's initial supposition.",
        "When one shifts from first – order model – theory to the index or \"possible world\" semantics used in Montague's semantics for natural language, the wholistic view must be carried to heroic lengths.",
        "For index semantics must embrace (as David Lewis does) the claim that talk about a particular actual situation talks indirectly not just about everything which actually exists, but about all possible objects and all possible worlds.",
        "And it is just this point that raises serious difficulties for .",
        "Joyce Friedman and her co – workers in their attempt to implement Montague Grammar in a working system (Friedman and Warren, 1978).",
        "The problem is that the basic formalization of possible world semantics is incompatible with the limitations imposed on us by partial information.",
        "Let me illustrate the problem that arises in a very simple instance.",
        "In possible world semantics, the meaning of a word like 'talk' is a total function from the set I of ALL possible worlds to the set of ALL TOTAL functions from the set A of ALL possible individuals to the truth values 0,1.",
        "The intuition is that b talks in 'world' i if meanine'talk.",
        ")(i)(d) ■ 1.",
        "It is built into the formalism that each world contains TOTAL information about the extensions of all words and expressions of the language.",
        "The meaning of an adverb like 'rapidly' is a total function from such functions (from I into Fun(A,2)) to other such functions.",
        "Simple arithmetic shows that even if there are only 10 individuals and 5 possible worlds, there are (2exp50)exp(2exp50) such functions and the specification of even one is completely out of the question.",
        "The same sorts of problems come up when one wants to study the actual model – theory that goes with Montague Semantics, as in Gallin's book.",
        "When one specifies the notion of a Henkin model of intensional logic, it must be done in a totally 'impredicative' way, since what constitutes an object at any one type depends on what the objects are of other types.",
        "For some time I toyed with the idea of giving a semantics for Montague's logic via partial functions but attempts convinced me that the basic intuition behind possible worlds is really inconsistent with the constraints placed on us by partial information.",
        "At the .",
        "same time work on the semantics of perception statements led me away from possible worlds, while reinforcing my conviction that it was crucial to represent partial information about the world around us, information present in the perception of the scenes before us and of the situations in which we find ourselves all the time."
      ]
    },
    {
      "heading": "3. ACTUAL SITUATIONS AND SITUATION – TYPES",
      "text": [
        "The world we perceive and talk about consists not just of objects, nor even of just objects, properties and relations, but of objects having properties and standing in various relations to one another; that is, we perceive and talk about various types of situations from the perspective of other situations.",
        "In situation semantics the meaning of a sentence is a relation between various types of situations, types of discourse situations on the one hand and types of 'subject matter' situations on the other.",
        "We represent various types of situations abstractly as PARTIAL functions from relations and objects to 0 and 1.",
        "For example, the type",
        "represents a number of true facts about my son, Jonny, and his dog.",
        "(It is important to realize that s is taken to be a function from objects, properties and relations to 0,1, not from words to 0,1.)",
        "A typical situation – type representing a discourse situation might be given by d(speak, Bill) ■ 1 d(father, Bill, Alfred) ■ 1 d(dog, Jackie) ■ 1 representing the type of discourse situation where Bill, the father of Alfred, is speaking and where there is a single dog, Jackie, present.",
        "The meaning of (2) The dog belongs to my son is a relation (or multi – valued function) R between various types of discourse situations and other types of situations.",
        "Applied to the d above R will have various values R(d) including s' given below, but not including the s from above: s'(belong, Jackie, Alfred) ■ 1 s'(tall, Alfred) = 1.",
        "Thus if Bill were to use this sentence in a situation of type d, and if s, not s', represents the true state of affairs, then what Bill said would be false.",
        "If s' represents the true state of affairs, then what he said would be true.",
        "Expressions of a language have a fixed linguistic meaning, independent of the discourse situation.",
        "The same sentence (2) can be used in different types of discourse situations to express different propositions.",
        "Thus, we can treat the linguistic meaning of an expression as a function from discourse situation types to other complexes of objects and properties.",
        "Application of this function to a particular discourse situation type we call the interpretation of the expression.",
        "In particular, the interpretation of a sentence like (2) in a discourse situation type like d is a set of various situation types, including s' above, but not including s. This set of types is called the proposition expressed by (2).",
        "Various syntactic categories of natural language will have various sorts of interpretations.",
        "Verb phrases, e.g., will be interpreted by relations between objects and situation types.",
        "Definite descriptions will be interpreted as functions from situation types to individuals.",
        "The difference between referential and attributive uses of definite descriptions will correspond to different ways of using such a function, evaluation at a particular accessible situation, or to constrain other types within its domain."
      ]
    },
    {
      "heading": "4. A FRAGMENT OF ENGLISH INVOLVING DEFINITE AND INDEFINITE DESCRIPTIONS",
      "text": [
        "At my talk I will illustrate the ideas discussed above by presenting a grammar and formal semantics for a fragment of English that embodies definite and indefinite descriptions, restrictive and nonrestrictive relative clauses, and indexicals like \"I\", \"you\", \"this\" and \"that\".",
        "The aim is to have a semantic account that does not go through any sort of first-order \"logical form\", but operates off of the syntactic rules of English.",
        "The fragment incorporates both referential and attributive uses of descriptions.",
        "The basic idea is that descriptions are interpreted as functions from situation types to individuals, restrictive relative clauses are interpreted as functions from situation types to sub-types, and the interpretation of the whole is to be the composition of the functions interpreting the parts.",
        "Thus, the interpretations of \"the\", \"dog\", and \"that talks\" are given by the following three functions, respectively: f(X) the unique element of X if there is one, undefined, otherwise.",
        "g(s) - the set of a such that s(dog, a)■1 h(s) - the 'restriction' of s to the set of a such that s(talk,a)■1.",
        "The interpretation of \"the dog that talks\" is just the composition of these three functions.",
        "From a logical point of view, this is quite interesting.",
        "In first-order logic, the meaning of 'the dog that talks' has to be built up from the meanings of 'the' and 'dog that talks', not from the meanings of 'the dog' and 'that talks'.",
        "However, in situation semantics, since composition of functions is associative, we can combine the meanings of these expressions either way: f.(g.h) (f.g).h.",
        "Thus, our semantic analysis is compatible with both of the syntactic structures argued for in the linguistic literature, the Det-Nom analysis and the NP-R analysis.",
        "One point that comes up in Situation Semantics that might interest people at this meeting is the reinterpretation of compositionality that it forces on one, more of a top-down than a bottom-up compositionality.",
        "This makes it much more computationally tractible, since it allows us to work with much smaller amount of information.",
        "Unfortunately, a full discussion of this point is beyond the scope of such a small paper.",
        "Another important point not discussed is the constraint placed by the requirement of persistence discussed in section 2.",
        "It forces us to introduce space-time locations for the analysis of attributive uses of definite descriptions, locations that are also needed for the semantics of tense, aspect and noun phrases like 'every man', 'neither dog', and the like."
      ]
    },
    {
      "heading": "5. CONCLUSION",
      "text": [
        "The main point of this paper has been to alert the readers to a perspective in the model theory of natural language which they might well find interesting and useful.",
        "Indeed, they may well find that it is one that they have in many ways adopted already for other reasons."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
