{
  "info": {
    "authors": [
      "Diane J. Litman",
      "Julia Hirschberg"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C90-2044",
    "title": "Disambiguating Cue Phrases in Text and Speech",
    "url": "https://aclweb.org/anthology/C90-2044",
    "year": 1990
  },
  "references": [
    "acl-A88-1019",
    "acl-J86-3001",
    "acl-P84-1055",
    "acl-P84-1085",
    "acl-P87-1023",
    "acl-P89-1015"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Cue phrases are linguistic expressions such as 'now' and 'welt that may explicitly mark the structure of a discourse.",
        "For example, while the cue phrase 'incidentally' may be used SENTENTIALLY as an adverbial, the DISCOURSE use initiates a digression.",
        "In [8], we noted the ambiguity of cue phrases with respect to discourse and sentential usage and proposed an intonational model for their disambiguation.",
        "In this paper, we extend our previous characterization of cue phrases and generalize its domain of coverage, based on a larger and more comprehensive empirical study: an examination of all cue phrases produced by a single speaker in recorded natural speech.",
        "We also associate this prosodic model with orthographic and part-of-speech analyses of cue phrases in text.",
        "Such a dual model provides both theoretical justification for current computational models of discourse and practical application to the generation of synthetic speech."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Words and phrases that may directly mark the structure of a discourse have been termed CUE PHRASES, CLUE WORDS, DISCOURSE MARKERS, and"
      ]
    },
    {
      "heading": "DISCOURSE PARTICLES [3, 4, 14, 17, 19]. Some exam",
      "text": [
        "ples are 'now', which marks the introduction of a new subtopic or return to a previous one, 'incidentally' and 'by the way', which indicate the beginning of a digression, and 'anyway' and 'in any case', which indicate return from a digression.",
        "In a previous study[8], we noted that such terms are potentially ambiguous between DISCOURSE and SENTENTIAL uses[18].",
        "So, `now' may be used as a temporal adverbial as well as a discourse marker, 'incidentally' may also function as an adverbial, and other cue phrases similarly have one or more senses in addition to their function as markers of discourse structure.",
        "Based upon an empirical study of 'now' in recorded speech, we proposed that such discourse and sentential uses of cue phrases can be disarnbiguated intonationally.",
        "In particular, we proposed a prosodic model for this disambiguation which discriminated all discourse from We thank Bengt Altenberg, Richard Omanson and Jan van Santen for providing information and helpful comments on this work.",
        "sentential uses of tokens in our sample.",
        "This model provided not only a plausibility argument for the disambiguation of cue phrases, but also the beginnings of a model for the generation of cue phrases in synthetic speech.",
        "In this paper, we show that our prosodic model generalizes to other cue phrases as well.",
        "We further propose an initial model for the disambiguation of cue phrases in text.",
        "We base these claims upon a further empirical study: an examination of all cue phrases produced by a single speaker in part of a recorded, transcribed lecture.",
        "In Section 2 we review our own and other work on cue phrases, in Section 3 we describe our current empirical studies, in Section 4 we present the results of our analysis, and in Section 5 we discuss theoretical and practical applications of our findings."
      ]
    },
    {
      "heading": "2 Previous Studies",
      "text": [
        "The important role that cue phrases play in understanding and generating discourse has been well documented in the computational linguistics literature.",
        "For example, by indicating the presence of a structural boundary or a relationship between parts of a discourse, cue phrases can assist in the resolution of anaphora[5, 4, 17] and in the identification of rhetorical relations [10, 12, 17].",
        "Cue phrases have also been used to reduce the complexity of discourse processing and to increase textual coherence[3, 11, 21].",
        "In Example (1)1, interpretation of the anaphor 'it' as (correctly) co-indexed with THE SYSTEM is facilitated by the presence of the cue phrases 'say' and `then', marking potential antecedents in `... as an"
      ]
    },
    {
      "heading": "EXPERT DATABASE for AN EXPERT SYSTEM ...' as",
      "text": [
        "structurally unavailable.2 (1) \"If THE SYSTEM attempts to hold rules, say as"
      ]
    },
    {
      "heading": "AN EXPERT DATABASE for AN EXPERT SYSTEM,",
      "text": [
        "then we expect it not only to hold the rules but to in fact apply them for us in appropriate situ-ations.\"",
        "Previous attempts to define the set of cue phrases have typically been extensional,3 with such lists of cue phrases then further classified as to their discourse function.",
        "For example, Cohen [3] uses a taxonomy of connectives based on that of Quirk [16] to associate with each class of cue phrases a semantic function with respect to a model of argument understanding.",
        "Grosz and Sidner [4] classify cue phrases based on changes to the attentional stack and intentional structure found in their theory of discourse.",
        "Schiffrin [18] classifies cue phrases into groups based on their sentential usage (e.g. conjunctive, adverbial, and clausal markers), while Reichman [17] and Hobbs[10] associate groups of cue phrases with the rhetorical relationships they signal.",
        "Finally, Zukerman [21] presents a taxonomy of cue phrases based on three functions relevant to her work in language generation: knowledge organization, knowledge acquisition, and affect maintenance.",
        "Once a cue phrase has been identified, however, it is not always clear whether to interpret it as a discourse marker or not[6, 4, 8, 18].",
        "The texts in Example (2) are potentially ambiguous between a temporal reading of 'now' and a discourse interpretation:",
        "(2) a.",
        "\"Now in AI our approach is to look at a knowledge base as a set of symbolic items that represent something.\" b.",
        "\"Now some of you may suspect from the title of this talk that this word is coming to you from Krypton or some other possible world.\"",
        "On the temporal reading, (2a), for example, would convey that 'at this moment the AI approach to knowledge bases has changed'; on the discourse reading, 'now' simply initiates the topic of 'the AI approach to knowledge bases'.",
        "It has been suggested that this difference between discourse and sentential use may be intonationally disambiguable.",
        "Halliday and Hassan [6] claim that, in general, items used COHESIVELY – i.e., to relate one part of a text to another [6, p. 4] – tend to be intonationally non-prominent (to be unaccented and reduced) unless they are \"definitely contrastive\".",
        "Non-cohesive uses, on the other hand, are indicated by non-reduced, accented forms.",
        "[6, p. 268] Halliday and Hassan particularly note that intonation disambiguates in this way between cohesive (discourse) and non-cohesive (sentential) uses of classes of items we term cue phrases, such as conjunctions and adverbials.",
        "Empirical studies to date have tended to bear out their observations.",
        "Studies of portions of the London-Lund corpus such as [1] have provided intonational profiles of word classes including DISCOURSE ITEMS, conjunctions and adverbials which are at least compatible with these views.",
        "However, the notion of `discourse item' used appears much more restrictive",
        "than the notion of 'cue phrase',` so it is difficult to make comparative use of these results.",
        "In an earlier study [8], we examined the use of various intonational, syntactic, and orthographic features to distinguish between discourse and sentential readings of a single cue phrase enow1.5 While features such as tense, structural configuration, surface order, and orthographic indicators were sometimes useful, we found that intonational features provided only only significant correlation with discourse/sentential status.",
        "All of the tokens in our sample were disambiguable in terms of intonational phrasing and type of pitch accent.6 In our study of now, we found that discourse uses were either uttered as a single intermediate phrase (or in a phrase containing only cue phrases) (Discourse Type A), or uttered at the beginning of a longer intermediate phrase (or preceded only by other cue phrases in the phrase) and with a L* pitch accent or without a pitch accent (Discourse Type B).",
        "Cue phrases judged to be of Sentential Type were never uttered as a single phrase; if first in intermediate phrase they were nearly always uttered with a H* or complex pitch accent (Sentential Type A); if not first in phrase they could bear any type of pitch accent or be deaccented (Sentential Type B).",
        "These results are summarized in Figure 1.",
        "Based on these findings, we proposed that listeners use prosodic information to disambiguate discourse from sentential uses of cue phrases.",
        "To investigate this possibility further, we conducted another multi-speaker study of discourse and sentential uses of the cue phrase 'well'.",
        "Our findings were almost identical to results for the earlier study; briefly, of the 52 in4 For example, in the 48 minute text Altenberg examines, he finds only 23 discourse items, or about 17% of what our study of a similar corpus (described below) would have predicted.",
        "Our corpus consisted of recordings of four days of the radio call-in program \"The Harry Gross Show: Speaking of Your Money,\" recorded during the week of 1 February 1982[15].",
        "The four shows provided approximately ten hours of conversation between expert(s) and callers.",
        "6 For the earlier study as well as the current one, we assume Pierrehumbert's[13] system of phonological description.",
        "In this system, intonational contours are described as sequences of low (L) and high (H) tones in the FUNDAMENTAL PRE, QUENCY (F0) CONTOUR.",
        "Pitch accents, peaks or valleys in the FO contour that fall on the stressed syllables of lexical items, signify intonational prominence.",
        "A pitch accent consists either of a single tone or an ordered pair of tones, such as L*-I-H.",
        "The tone aligned with the stressed syllable is indicated by a star *; thus, in an L*-FH accent, the low tone L* is aligned with the stressed syllable.",
        "There are six pitch accents in English: two simple tones – H and L – and four complex ones – L-+H*, H*-1-L, and A well-formed intermediate phrase consists of one or more pitch accents, and a simple high H or low L tone that represents the phrase accent.",
        "The phrase accent controls the pitch between the last pitch accent of the current intermediate phrase and the beginning of the next – or the end of the utterance.",
        "Intonational phrases are larger phonological units, composed of one of more intermediate phrases, plus a boundary tone which may also be H or L. The occurrence of phrase accents and boundary tones, together with other phrase-fmal characteristics such as pauses and syllable lengthening, enable us to identify intermediate and intonational phrases.",
        "Cue Phrases"
      ]
    },
    {
      "heading": "Sentential Discourse",
      "text": [
        "Initial in Larger Phrase Non-Initial in Alone in Initial in Larger Phrase H or Complex Accent Larger Phrase Phrase Deaccented or L Accent stances of 'well' we examined, all but one token fit the model depicted in Figure 1.",
        "To see whether these findings could be extended to cue phrases in general, we began a third study – of all cue phrases produced by a single speaker during 75 minutes of recorded speech.",
        "The remainder of this paper describes our first results from this study."
      ]
    },
    {
      "heading": "3 The Data",
      "text": [
        "To test whether our prosodic model of discourse and sentential uses of 'now' and 'well' extended to cue phrases in general, we examined intonational characteristics of all single-word cue phrases7 used in a keynote address given by Ronald Brachman at the First International Conference on Expert Database Systems in 1986.",
        "The address provides approximately 75 minutes of speech from a single speaker.",
        "For our first sample, we examined the 211 cue phrases uttered during the first 17 minutes of the address.",
        "Our tokens had the following distribution:8 actually (6), also (2), although (1), and (68), basically (1), because (2), but (12), finally (1), first (1), further (4), however (2), like (11), look (11), next (4), now (26), oh (1), or (19), say (12), second (1), see (5), since (1), so (9), then (3), therefore (1), well (7) .",
        "To determine the classification of each token (DISCOURSE, SENTENTIAL, or AMBIGUOUS), the authors separately judged each token by listening to the taped address while marking a transcription.° \"'We examined only single-word cue pleases in this study since our current prosodic model applies only to such items.",
        "In future work we plan to develop additional models for discourse and sentential uses of multi-word cue phrases, e.g 'that reminds me', 'first of all', 'speaking of' and so on.",
        "8 Our set of cue phrases was derived from extensional definitions provided by ourselves and others[3, 4, 17, 18, 21].",
        "The following lexical items, although also cue phrases, are not present in the portion of the address examined to date:",
        "In comparing our judgments, we were interested in areas of disagreement as well as agreement.",
        "The set of tokens whose classification as to discourse or sentential use we agreed upon provide a testbed for our continuing investigation of the intonational disambiguation of cue phrases.",
        "The set of tokens we found difficult to classify (i.e. those tokens we both found ambiguous or those whose classification we disagreed upon), provide insight into possible intonational correlates of discourse/sentential ambiguity.",
        "Table 1 presents the distribution of our judgments, where `classifiable' represent those tokens whose classification we agreed upon and 'unclassifiable' represents those we both found ambiguous or disagreed upon.",
        "Of the 211 tokens in this initial sample, we found only 133 cue phrases (63.03%) to be unambiguously discourse or sentential.",
        "When we looked more closely at the 'unclassifiable' cases, we found that fully 73.08% were coordinate conjunctions (and, or, and but).",
        "In fact, when we compare percent classifiable for conjunctions with other cue phrases, we find that, while only 42.42% of conjunctions were found to be classifiable, fully 81.25% of non-conjunctions were classified.",
        "Thus, the case of coordinate conjunction appears to explain a large portion of the our difficulty in agreeing upon a classification.",
        "Once we had made these judgments, we analyzed the tokens for their prosodic and syntactic features as well as their orthographic context, much as we had done with tokens for the earlier two studies.\" We noted whether each token was accented or not and, if accented, we noted the type of accent employed.",
        "We also identified the composition of the intermediate phrase containing each token as to whether the token constituted a separate phrase (possibly with other cue phrases) or not.",
        "And we noted each token's position within its intermediate phrase – first (including tokens preceded only by other cue phrases) or not.",
        "We also noted syntactic characteristics of each item, including part of speech and its immediately dominating constituent.\" Finally, we noted orthographic indicators in the transcript which might provide disambiguation, such as immediately preceding and succeeding punctuation and paragraph boundaries.",
        "In both the syntactic and orthographic analyses we were particularly interested in discovering how well non-prosodic features which might be obtained automatically from a text would do in differentiating discourse from sentential uses."
      ]
    },
    {
      "heading": "4 The Single-Speaker/MultiCue Phrase Study",
      "text": [
        "Our findings from the classified data (133 tokens) in this pilot study confirmed our model of prosodic distinction between discourse and sentential uses of cue phrases.",
        "The distribution of these judgments with respect to the prosodic model of discourse and sentential cue phrases depicted in Figure 1 is shown in Table 2.",
        "Recall that this model includes two intonational profiles for discourse uses: Discourse Type A, in which a cue phrase constitutes an entire intermediate phrase (or is in a phrase containing only other cue phrases) and may have any type of pitch accent; Discourse Type B, in which a cue phrase occurs at the beginning of a larger intermediate phrase (or is preceded only by other cue phrases) and bears a L* pitch accent or is deaccented; Sentential Type A, in which the cue phrase occurs at the beginning of a larger phrase and bears a H* or complex pitch accent; and Sentential Type B, in which the cue phrase occurs in non-initial position in a larger phrase.",
        "Now note in Table 2 that the ratio of discourse to sentential usage was about 1:2.",
        "Of the 44 tokens judged to represent discourse use and fitting our prosodic model, one third were of Discourse Type A and two-thirds of Discourse Type B.",
        "While overall results are quite significant, the 17 items judged sentential which nonetheless fit the discourse prosodic model must be explained.",
        "Of these 17, 14 (representing two thirds of the total error) are conjuncts (11 `and's and 3 'or's) which fit the type (b) discourse prosodic model.",
        "While all are thus first in intermediate phrase – and, in fact, in intonational phrase – none are utterance-initial.",
        "Both judges found such items relatively difficult to distinguish between discourse and sentential use.\" In (3), for example, while the first and seems clearly sentential, the second seems much more problematic.",
        "(3) \"But instead actually we are bringing some thoughts on expert databases from a place that is even stranger and further away and that of course is the magical world of artificial intelli-gence.\" The difficulty in such cases appears confined to instances of sentential coordination where the conjunct is not utterance initial.",
        "Table 3 shows how judgments were distributed with respect to our prosodic model when coordinate conjunctions are removed from the sample.",
        "Our model thus predicts 93.4% of nonconjunct cue phrase distinctions, as opposed to the 84.2% success rate shown in Table 2.",
        "Our prosodic model itself can of course be decomposed to examine the contributions of individual features to discourse/sentential judgments.",
        "Table 4 shows the distribution of judgments by all possible feature complexes for all tokens.13 This distribution reveals that there is considerable agreement when cue phrases appear alone in their intermediate phrase (OF*, corresponding to Discourse type A in Figure 1); such items are most frequently judged to be discourse uses.",
        "There is even more agreement when cue phrases appear in non-initial position in a larger intermediate phrase (NONF* – Sentential type B in \"See Section 3.",
        "Of the 99 conjuncts in this study, both judges agreed on a discourse/sentential distinction only 42.4% of the time, compared to 78.6% agreement on non-conjuncts.",
        "Conjunct tokens represented two-thirds of all tokens the judges disagreed on, and 68.9% of tokens at least one judge was unable to assign.",
        "Figure 1); these tend to be judged sentential.",
        "However, tokens which fit Discourse type B in Figure 1 (first in a larger phrase and deaccented (NOFD) or with a L* (NOFL)) appear more problematic: of the former, there was disagreement on fully two thirds.14 While there is more agreement that tokens characterized as NOFH (first in a larger phrase with a II* accent) or NOFC (same with a complex pitch accent) Sentential type A in Figure 1 ---- are sentential, this agreement is certainly less striking than in the case of tokens characterized as NONF* (non-initial in a larger phrase with any type of pitch accent Sentential type B).",
        "Since Discourse type B and Sentential type A differ only in 'type of pitch accent', we might conclude that the pitch accent feature is not as powerful a discriminator as the phrasal features `alone in intermediate phrase' or 'first in phrase'.",
        "As in our previous study, we also examined potential non-prosodic distinctions between discourse and sentential uses.",
        "Of the orthographic and syntactic features we examined, we found presence or absence of preceding punctuation and part-of-speech to be most successful in distinguishing discourse from sentential uses.",
        "For the 113 tokens on which both judges agreed as to discourse or sentential status,15 orthography distinguishes between discourse and sentential use in 101 (89.4%) of cases.",
        "Specifically, 21 of 30 discourse uses are preceded by punctuation and only 3 of 83 sentential items.",
        "We also found that part-of-speech distinguishes discourse from sentential use, although less successfully than orthography.",
        "If we simply predict discourse or sentential use by the assignment most frequently associated with a given part-of-speech, both",
        "Church's part-of-speech algorithm and Hindle's Fidditch predict discourse or sentential use in approximately 75% of cases where both judges agreed on discourse/sentential assignment.",
        "For example, we assume that since the majority of conjunctions and verbs are judged sentential that these parts-of-speech are predictors of sentential status, and since most adverbials are associated with discourse uses, these are predictors of discourse status, and so on.",
        "While part-of-speech thus might seem less useful than orthographic distinctions for our corpus, the fact that it is not subject to transcriber idiosyncracy might make it a more reliable predictor than orthographic indicators in the general case.",
        "Too, for text-to-speech applications, in which one would like to infer discourse or sentential use in order to employ the appropriate intonational features when synthesizing the item in question, these text-based results are encouraging."
      ]
    },
    {
      "heading": "5 Discussion",
      "text": [
        "Our findings for the first stage of our single-speaker multi-cue phrase study support the intonational model of discourse/sentential characteristics of cue phrases which we proposed in [8].",
        "Discourse uses of cue phrases fell into two groups: in one, the cue phrase was set apart as a separate intermediate phrase (possibly with other cue phrases); in the other, the cue phrase was first in its intermediate phrase (possibly preceded by other cue phrases) and either was deaccented or bore a L* pitch accent.",
        "Sentential uses were in general part of a larger intermediate phrase: if first in phrase, they bore a H* or complex pitch accent.",
        "The association between discourse/sentential models and discourse/sentential judgments is significant at the .001 level.",
        "We also found that the tokens we found difficult to classify were those in which disambiguation relied solely upon pitch accent, rather than some combination of pitch accent and phrasing.",
        "Furthermore, we found that orthographic cues (from transcription) successfully disambiguate between discourse and sentential usage in 89.4% of cases in our pilot study.",
        "Part-of-speech was less successful in distinguishing discourse from sentential use, disambiguating only 75% of cases in the study.",
        "The disambiguating power of both our textual and our prosodic models has both theoretical and practical import.",
        "From a practical point of view, the construction of both text-based and prosodic models permit improvement in the generation of synthetic speech from unrestricted text [9].",
        "With a prosodic model, we know how to convey discourse/sentential distinctions; with a text-based model, we know when to convey such distinctions.",
        "From a theoretical point of view, our findings demonstrate the feasibility of cue phrase disambiguation in both text and speech and provide a model for how that disambiguation might be done.",
        "Furthermore, these results strengthen the claim that the discourse structures crucial to computational models of interaction can indeed be identified."
      ]
    }
  ]
}
