{
  "info": {
    "authors": [
      "Juntae Yoon",
      "Key-Sun Choi",
      "Mansuk Song"
    ],
    "book": "Joint SIGDAT Conference on Empirical Methods in Natural Language Processing and Very Large Corpora",
    "id": "acl-W99-0635",
    "title": "Corpus-Based Approach for Nominal Compound Analysis for Korean Based on Linguistic and Statistical Information",
    "url": "https://aclweb.org/anthology/W99-0635",
    "year": 1999
  },
  "references": [
    "acl-A97-1046",
    "acl-C88-2110",
    "acl-C94-2125",
    "acl-C94-2139",
    "acl-J93-1005",
    "acl-J93-2005",
    "acl-P84-1109",
    "acl-P87-1009",
    "acl-P87-1020",
    "acl-P95-1007"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Accurate nominal compound analysis is crucial for in application of natural language processing such as information retrieval and extraction as well as nominal compound interpretation.",
        "In the nominal compound analysis area, some corpus-based approaches have reported successful results by using statistal co-occurrences of nouns.",
        "But a nominal compound often has the similar structure to a simple sentence, e.g. the complement-predicate structure, as well as representing compound meaning with several nouns combined.",
        "Due to the grammatical characteristics of nominal compounds, the framework based only on statistcal association between nouns often fails to analyze their structures accurately, especially in Korean.",
        "This paper presents a new model for Korean nominal compound analysis on the basis of linguistic and statistical knowledge.",
        "The syntactic relations often have an effect on determining the structure of nominal compounds, and we analyzed 40 million word corpus in order to acquire syntactic and statistical knowledge.",
        "The structure of a nominal compound is analyzed based on the linguistic lexical information extracted.",
        "By experiments, it is shown that our method is effective for accurate analysis of Korean nominal compounds."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Nominal compound analysis is one of crucial issues that have been continuously studied by computational and theoretical linguists.",
        "Many linguists have dealt with nominal compounds in view of semantic interpretation, and tried to explain how nominal compounds are semanti-- This work was partially supported by a KOSEF's post-doctoral fellowship grant.",
        "tally interpreted (Levi, 1978; Selkirk, 1982).",
        "In the field of natural language processing, various computational models have been established for syntactic analysis and semantic interpretation of nominal compounds (Finin, 1980; McDonald, 1982; Arens et al.",
        ", 1987; Pustejovsky et al.",
        ", 1993; Kobayasi et al.",
        ", 1994; Van-derwerde, 1994; Lauer, 1995).",
        "Recently it has been shown that noun phrase analysis is effective for the improvement of the application of natural language processing such as information retrieval (Zhai, 1997).",
        "Parsing nominal compound is a basic step for all problems related to it.",
        "From a bracketing point of view, structural ambiguity is also a main problem in nominal compound analysis like in other parsing problems.",
        "Recent works have shown that the corpus-based approach for nominal compound analysis makes a good result to resolve the ambiguities (Pustejovsky et al.",
        ", 1993; Kobayasi et al.",
        ", 1994; Lauer, 1995; Zhai, 1997).",
        "Lauer (1995) has compared two different models of corpus-based approaches for nominal compound analysis.",
        "One was called as the adjacency model which was inspired by (Puste-jovsky et al.",
        ", 1993), and the other was referred to as the dependency model which was presented by Kobayasi et al.",
        "(1994)2 and Lauer (1995).",
        "Given a nominal compound of three nouns n1n2n3, let A. he a metric used to evaluate the association of two nouns.",
        "In the adjacency model, if ,A1(TP,i,n2) > As (n2, n3), then the structure is determined as ((ni n2)713).",
        "Otherwise, (711 (n9 713)).",
        "On the other hand, in",
        "the dependency model, the decision is dependent on the association strength of nj for n2 and That is, the left branching tree ((ni n2) n3) is constructed if A.",
        "(Ii] , n2) > As(rt-i, n3), and the right branching tree (ni (tt2 tt3)) is made, otherwise.",
        "Lauer (1995) has claimed that the 41c.pendency model makes intuitive sense and produces better results.",
        "In this paper, we propose a new model for 11010111a' COMIAIIIIld analysis on the basis of wina I co-occusrences and grammatical relationships immanent-, in nominal compounds.",
        "\"Flie grammatical relation can sometimes lilakc the disainbiguation more precise as well as it gives a clue of the nominal interpretation.",
        "For example, in the nominal compound \"KYEONGJAENG(competition) YUBA T__:1( bringing about) CHEJE(system)\" which means system to bring about competition, the nominal_ compound \"KYEONGJAENG CHE.TE(competition system)\" co-occurs much more frequently titan \"KYEONGJAENG YIJBAL(bringing about competition)\".",
        "However.",
        "its structure is selected to be [[KYEONGAENG YUBAL] CHEJE].",
        "Why it is analyzed iu such a way can be shown easily by trans1.1 inning the nominal compound to the clause.",
        "Because \"YUBAL(bringing about)\" is the predicative noun that derives the verb with the predicative suffix attached, the modifying noun phrase can be transformed to the corresponding VP which has the meaning of \"to bring about competition\" (Figure 1).",
        "The verb \"YUBALHA-NEUN(to bring about)\" in VP takes the \"KYEONGJAENC(competition)\" as the object.",
        "The predicative noun \"YUBAL(bringing about)\" also subcategorizes a noun phrase \"KYEONGJAENG(competition)\" in the same manner as the verb.",
        "In the right syntactic tree of Figure 1, it should be noted that the object of a verb does not have the dependency relation to the noun outside the maximal projection of its head, VP.",
        "Likewise, the object \"KYEONGJAENG(competition)\" does not have any dependency with the other noun over the predicative noun \"YUBAL(bringing about)\" .",
        "There is not any adjective derivation in Korean.",
        "Rather, a noun itself plays an adverbial or adjective role in a nominal compound, or modifies other noun with possessive postposition attached.",
        "Table 1. shows various relations occurred in nominal compounds.",
        "As shown in the example, there is a relationship between two nouns which have dependency relation in a nominal compound.",
        "For instance, the first nominal compound in the example expresses compound meaning of individual nouns, i,e.",
        "the attribute that a file has.",
        "On the other hand, in the example (c) of the example, the noun \"GAENYEOM(concept)\" is the object of the predicative noun \"GlIBUN(discrimination)\".",
        "A nominal compound, as such, often has the similar structure to a simple sentence, e.g. complement-predicate structure, as well as representing compound meaning with several nouns combined.",
        "Many researchers have tried to explain constraints given in the process of word combination and the principle of semantic composition.",
        "Levi (1978) has tried to find the semantic constraints which govern the combination of each noun in a nominal compound.",
        "Sproat (1985) has taken into consideration the predicate-argument relation of nominals on the basis of generative syntax.",
        "He explained that the nominalization suffix nominalizes the syntactic category of a verb, but 0 role of the verb is percolated into its parent node.",
        "We claim that the nominalization is the phenomenon occurred at the syntactic level, and hence the syntactic relations should be reflected in nominal parsing.",
        "Namely, for accurate nominal compound parsing, we need syntactic knowledge about nominal compound in addition to lexical information about lexical selection.",
        "We propose a nominal parsing model based on two relations, which can be immediately applied to nominal interpretation.",
        "We classify the syntactic relations in a nominal compound as follows: modifier-head relation One noun (adnomi-nal, adjective) adds a certain meaning to the other noun (head) producing a compound meaning (1, 2 in Table 1).",
        "complement-predicate relation One is the",
        "file attribute basic concept discrimination of concept being elected to president to translate together",
        "complement (subject, object, adverb) of the other noun (predicative noun) in a nominal compound (3, 4, 5 in Table 1).",
        "When considering the complement-predicate relation, we can figure out some syntactic constraints imposed on nominal compounds.",
        "For example, in \"PA JL (file) SOGSEONG(attribute) BYEONKY-EONC (change)\", \"SOGSEONG(attribute)\" is the object of the predicative noun \"BYEONKYEONG (change)\" .",
        "It can be expanded to a sentence like \"X changes the file attribute\".",
        "In other words, the syntactic levels of two phrases \"PA'IL SOGSEONG(file attribute)\" and \"BYEONKYEONG(change)\" in the compound noun are different, where one is NP and the other is VP.",
        "That the syntactic levels (i.e. syntactic categories) of nominal compounds are different means that the different method is required for the proper analysis of their structures.",
        "Next, a predicative noun does not subcate-gorize more than two nominals with the same grammatical cases.",
        "For instance, a predicative noun in a nominal compound governs either a subject or an object at most.",
        "The situation is very similar to that occurred in a sentence.",
        "In this paper, this is called one ease per sentence, which means that a predicative noun cannot snbcategorize two nouns of the same grammat-leal cases when the relations of nominals can be expanded to a sentence."
      ]
    },
    {
      "heading": "3 Acquiring Lexical Knowledge",
      "text": [
        "We collect lexical co-occurrence instances from corpus in order to get knowledge for nominal compound analysis.",
        "The text material is composed of 40 million cojeols of Yonsei Lexicographical Center corpus and KAIST corpus (330M bytes).",
        "The Korean morphological ana-lyzer, the POS tagger and the partial parser are used to obtain co-occurrences.",
        "In order to constrnct linguistic lexical data for nominals, we first extracted verb-noun co-occurrence data from corpus using the partial parser.",
        "A noun is connected to a verb with a syntactic relation, and the co-occurrences are represented by triples (verb, noun, syntactic rcl(tion).",
        "The postpositions are reposited in the syntactic field in order to represent the syntactic relations which might occur between two nouns.",
        "Nominal pairs with complement-predicate relation are derived from the data extracted.",
        "Predicative nouns become verbs with the verbalization suffix such attached.",
        "For example, the predicative noun 'KEOMSAEK(retrieval)' is verbalized to `KEOMSAEK-HA(retrieve)' hy adding the suffix c-HA-'.",
        "Therefore, we can get",
        "complement-predicate relations by reducing verbs to predicative nouns with cutting, if any, the verbalization suffix.",
        "Table 2 shows some noun-noun co-occurrence examples of complement-predicate relation derived M that way.",
        "Second: co-occurrences composed of only two uns (complete nominal compound) were oh-au c1.",
        "In Korean, complete nominal compounds are extracted in the following way.",
        "Let sitppose that N, NA, NP be the set of nouns, the set of nouns with the possessive postposi-tion, and the set of nouns with a postposition except the possessive postposition, respectively.",
        "• For eojeols e2, c3, where ei N U",
        "NA, e2 E NUNA, e3 e NP, count (n2, n3), where 11.2 and n3 are the nouns that belong to c2 and e3 respectively.",
        "The data could contain two relations e.g. modifier-head relation and complement-head relation.",
        "Therefore, we manually divide them into two classes by hand according to the relation.",
        "Many erroneous pairs could be removed by the manual process.",
        "Furthermore, we manually assign to each nominal pair syntactic relations such as SUBJ, OBJ and ADV since the syntactic relation does not explicitly appear from pairs obtained in the second (Table 3), Actually, there is no immanent syntactic relation between two nouns of modifier-head relation.",
        "On the other hand, some syntactic relation such as case marker and adverbial relation can be given to two nouns with complement-predicate relation.",
        "Some examples are given in Table 3.",
        "The data of complement-head relation are merged with those established with_ the partial parser, which are complement-head co-occurrences.",
        "The rest of the data have modifier-head co-occurrences.",
        "Consequently, the complement-predicate co-oecurrence is represented with a triple (camp, pr ed-nown, syn-r el) as shown in Table 2.",
        "Syntactic relation is described with postposition for case mark or ADV in Korean.",
        "The syntactic relation is not given to the modifier-head co-occurrence.",
        "In the corpus based approach for natural language processing, we should take into consideration the data sparseness problem because the data do not contain whole phenomena of the language in most cases.",
        "Many researchers have proposed conceptual association to back off the lexical association on the assumption that words within a class behave similarly (It-Nsnik, 1993; Kobayasi et al., , 1994; Lauer, 1995).",
        "Namely, word classes were stored instead of word co-occurrences.",
        "Here, we must note that predicates does not act according to their semantic category.",
        "Predicates tend to have wholly different case frames from each other.",
        "Thus, we stored individual predicative nouns and semantic classes of their arguments instead of each semantic class for two nouns: In effect, given a word co-occurrence pair (ni, n2) and, if any, a syntactic relation .F, it is transformed and counted in the following way.",
        "1.",
        "Let c, be the thesaurus class which n, belongs to 2.",
        "If (n, , ) are a pair in co-occurrences of complement-predicate relation 3.",
        "Then 4.",
        "For each which 721 belongs to, 5.",
        "Increase the frequancv of (ci,n2,.․) with the.",
        "count",
        "6.",
        "Else.",
        "7.",
        "For each c1ae c and c, to which nj and n2 belongs respectively, 8.",
        "Increase the frequent:7i of (ci,c1) with the count of (rii, n2)",
        "Consequently, we built two knowledge sources with different properties, so that we needed to make the method to deal with them.",
        "In the next section, we will explain the effective method of analysis based on that different lexical knowledge."
      ]
    },
    {
      "heading": "4 Nominal Compound Analysis",
      "text": [
        "In order to make the process efficient, the analyzer identifies the relations in a nominal compound, if any, which can be the guideline of phrase structuring, and then analyzes the structures based on the relations.",
        "Figure 2 shows an example of the phrase structure of a nominal compound to include the complement-predicate relation.",
        "We showed that the nominal compound with the complement-predicate relation can be expanded to a simple sentence which contains NPs and VP.",
        "This means again that the nominal compound with",
        "the complement-predicate relation can be divided into one or more phrasal units which we call inside phrase.",
        "The nominal compound in Figure 2 has three inside phrases - NPsuBj, NPoHj and V. Some nominal compounds may not have any inside phrase.",
        "Besides, the structure in each inside phrase can be determined by the word co-occurrence based method presented by Lauer (1995) and.",
        "(Kobayasi et al.",
        ", 1994), i.e. only statistical association."
      ]
    },
    {
      "heading": "4.1 Association between nouns",
      "text": [
        "Inside phrases can be detected based on the association, since two nouns associated with the complement-predicate relation indicate existence of an inside phrase.",
        "We distinguish the association relation by discriminating knowledge source.",
        "Thus-the associations are calculated in a different way as follows.",
        "Here, ambi(n) is the number of thesaurus classes in which n appears, and Nc p and NmH are the total number of the complement-predicate and the modifier-head co-occurrences- respectively.",
        "1.",
        "Complement-Predicate",
        "The association can be computed based on the complement-predicate relations obtained from complement-predicate co-occurrence data.",
        "It measures the strength of statistical association between a noun, nL , and a predicative noun, n2, with a given syntactii: relation s which is the syntactic relation like subject, object, adverb.",
        "Let ei be categories to which n1 belongs.",
        "Then, the degree that 71.1 is associated with n2 as the complement of n,2 is defined as follows:",
        "The association of two nouns is estimated by the (:o-occurrences which were collected for the modifier-head relation.",
        "In the similar way to the above, let ci and e be the categories to which lb j and Tr9 belongs respectively.",
        "Then, the association degree of n1 and 712 is defined as follows:",
        "The syntactic relation is determined by the association.",
        "If tlie association between two nouns can be computed by the formula I. the complement-predicate relation i4-; given to the nouns.",
        "It' not, the relation of two nouns is simply concluded with the modifier-head relation.",
        "We can recognize the syntactic relation inside a nominal compound by the association involved.",
        "In order to distinguish the associations in accordance with the relations, the associaticm is expressed by a triple (relation.",
        "(syn-rel, value)).",
        "The r elation is chosen with CF or MH according to the fimnula used to estimate the association.",
        "If relation is C P , the syn-rel has as its value SUBJ, OW, ADV etc., which are given by co-occurrence data acquired.",
        "Otherwise, (/..) is assigned.",
        "Lastly, the value is computed by the formula.",
        "The association is estimated in the following way,",
        "If no co-occurrence data for a nominal I All )11)011Ild are found in both databases, the modifier-head relations is assumed and the left t.ssociation is favored for unseen data.",
        "The preference of left association is reasonable for bracketing of nominal compounds since the left associations occupy the bracketing patterns much more than the right associations as shown iii Table 6."
      ]
    },
    {
      "heading": "4.2 Parsing",
      "text": [
        "Since the head always follows its complement in Korean, the ith noun in the nominal compound consisting of 71 nouns has head candidates of – i that it might be depend on, and the parser selects the most probable one from them.",
        "The parser determines the head of a complement by an association degree of head candidates for the c:omplement.",
        "The easiest way is to have the head candidate list sorted on the association, and select most strongly associative one.",
        "In the process of selection, the following constraints are imposed if the relation of two nouns is complement-predicate(CP).",
        "Given a nominal compound of three nouns (7/1,7/2,77,3),",
        "• If (rt2, n3) are related with CP and the syn",
        "tactic relation of (02, n3) is the same as that of (rti ,n3) , then rt1 is not dependent on n3.",
        "This is called n rAISC sciacnce constraint.",
        "• If ni has an association with n2 by CP relation, it does not have dependency relation with T/3.",
        "See Figure 1 • If n2 plays an adverbial role for n3, then is not linked with r42• • Cross dependency is not allowed.",
        "It means that dependent-head relations do not cross each other.",
        "As an example, given the nominal compound \"iDAEJUNG (public) .,,MUNHWA (culture) 3BIPAN(criticism)\", we can get the association table as shown in Table 4.",
        "According to the table, the first and second noun can be linked with the modifier-head relation and the association degree of 0.00021.",
        "The second noun can depend on the third noun with the complement-predicate relation, and the association degree is 0.00018.",
        "Furthermore, the argument is inferred to the object of the predicate, which can be easily recognized by the co-occurrence data extracted.",
        "The table is sorted on the association so that the parser can easily search for the probable candidate for head.",
        "In order to effectively detect inside phrases and check the constraints, the syntactic relation should be checked prior to the comparison of the association value.",
        "That is, the first key is the 7.7,4ation and the second, u„ssociahon value.",
        "This, CP > MH, and the",
        "As a consequence, the association table is actually implemented to the association list as follows:",
        "From the list we know it is probable that the noun \"DAEJTJNG(pnblic)\" is dependent on \"BIPAN(criticism)\" with OBJ relation.",
        "On the other hand, two words \"DAEIUNG(public)\" and \"MUNHWA(culture)\" are found in modifier-head co-occurrences and thus associated with the modifier-head relation.",
        "Then, the parsing process can be defined as follows:",
        "Here index returns the index of noun mi whose association with ni is the maximum.",
        "Namely, the parser tries to find the following candidate for the bead of each noun ni in a nominal compound consisting of k nouns, and make a link between them.",
        "If constraints are violated while parsing, the next candidate of the list is considered by the parser.",
        "According to the algorithm, the given example is parsed as follows: I.",
        "There is only one candidate for \"MUNHWA\".",
        "\"MUNHWA(culture)\" has the dependency on \"BIPAN(criticism)\" with object relation.",
        "The fact that there is the complement-predicate relation between two nouns indicates that those are the elements of inside phrases, where one belongs to NP and the other has the property of VP.",
        "The inside phrases are detected by the syntactic relation.",
        "2.",
        "The most probable candidate of \"DAEJUNG (public)\" is also \"BIPAN(criticism)\", but it violates one case per sentence since the predicative noun already took the object.",
        "Thus, another candidate is taken.",
        "3.",
        "The next head candidate",
        "\"MUNHWA(culture)\" is satisfactory to the constraints as the modifier-head relation, and \"DAKTUNG(public)\" is linked to \"MUNHWA(culture)\" with the relation."
      ]
    },
    {
      "heading": "5 Experimental Results",
      "text": [
        "For experiments, we collected 387 nominal compounds from a million word corpus.",
        "Nominal compounds composed of more than four nouns (a series of 5 nouns or more) are excluded because the number of them is too small to eva,1nate our system.",
        "Some examples of analysis are shown in Table 5.",
        "In the table, the modifier-head relation is represented with MB, and the complement-predicate is described with OBJ and SUBJ that means object and subject respectively.",
        "No depedency between nouns is marked with For instance, the modifier-head relation is assigned to \"MUSOG SINANG\" which have the meaning of the religion of private s ()clay that is traditional and supenstitious.",
        "However, we don't know about the semantic relation hidden in the results analyzed.",
        "In addition, the nominal compound \"JISIK'IN-Yi(intellectual's) CHAEK'IM(responsibility) FIOTPI(evasion)\" means that the '1141C11Crilha1 ClIttdCH 11ZS re.spon.szbilUy.",
        "Actually, its structure is determined as [JISIK'IN-YIsutu [CHAEICIMoyi HOIPIv]] which can be expanded to a simple sentence.",
        "Bracketed patterns or die example nominal compounds are shown in Table According to the table, the baseline accura.ey of the default system is at least 73.6%.",
        "As shown in Table 7, the precision for analysis of nominal compounds",
        "of nouns in NP pattern freq",
        "Table 6: the patterns of nominal compound structures of the length three and four is about 88.3% and 66.3%.",
        "The result is fairly good in that nomi-lial compounds of length three occur much more frequently than those of length four.",
        "Overall -1)recision of analysis is about 84.2%.",
        "In addition, we compared three different models to evaluate our system - default model by the dominant pattern, dependency model presented by Kobayasi et al.",
        "(1994) and Lauer (1995), and our model.",
        "In the default analysis, nominal compounds were bracketed by the dominant patterns shown in Table 6.",
        "For the dependency model, we used the method presented by Lauer (1995).",
        "Table 8 shows the comparison of the results produced by our algorithm and the other two methods.",
        "Our system made a better result in the disambiguation process.",
        "The results show that the syntactic.",
        "information in nourri-nal phrases plays an important role in deciding their structures.",
        "However, there are still errors produced.",
        "Some norms has the word sense ambiguity, and are used as both predicative noun and common noun.",
        "Because of the sense ambiguity, some modifier-head relations are misrecognized to complement-predicate.",
        "Other errors contain the same kind of results as (Lauer, 1995).",
        "To overcome the errors, we think that semantic relations immanent in two nouns are considered."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "Many statistical parsers have not taken care of analysis of nominal compounds.",
        "Furthermore, many researches which dealt with nominal compound parsing seemed not to have computational approaches for linguistic phenomenon in nominal compounds.",
        "We proposed Korean nominal compound analysis based on linguistic statstical knowledge.",
        "Actually, immanent syntactic relations like subject and object as well as structures of nominal compounds are identified using our nominal compound analyzer and knowledge acquisition method.",
        "Syntactic relations identified can be effectively used in semantic interpretation of nominal compound.",
        "Moreover, the parser was more accurate by using linguistic knowledge such as structural information and syntactic relation immanent in nouns.",
        "It is expected that our parsing results including identification of syntactic relations are useful for the application system such as information extraction because many nominal compounds are contained in Korean document bodies and titles, which often represent some events.",
        "However, the system still has sonic difficul",
        "ties, which caused erroneous results.",
        "In the future work, we feel it is necessary that lexical parameters be transformed into conceptual parameters with large size of semantic knowledge, and further studies on linguistic properties of nominals be made."
      ]
    }
  ]
}
