{
  "info": {
    "authors": [
      "Hyun Seok Park"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P95-1049",
    "title": "Mapping Scrambled Korean Sentences into English Using Synchronous TAGs",
    "url": "https://aclweb.org/anthology/P95-1049",
    "year": 1995
  },
  "references": [
    "acl-C90-3001",
    "acl-C90-3045"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Synchronous Tree Adjoining Grammars can be used for Machine Translation.",
        "However, translating a free order language such as Korean to English is complicated.",
        "I present a mechanism to translate scrambled Korean sentences into English by combining the concepts of Multi-Component TAGs (MC-TAGs) and Synchronous TAGs (STAG s) .",
        "by looking in the transfer lexicon.",
        "And finally, the target sentence is generated from the target derivation tree obtained in the previous step.",
        "The transfer lexicon consists of pairs of trees, one from the source language and the other from the target language.",
        "Within the pair of trees, nodes may be linked.",
        "Whenever adjunction or substitution is performed on a linked node in a source tree, the corresponding operation applies to the linked node in the target tree."
      ]
    },
    {
      "heading": "1 Motivation",
      "text": [
        "Tree Adjoining Grammars (TAGs) were first developed by Joshi, Levy, and Takahashi (Joshi et al., 1975).",
        "There are other variants of TAGs such as STAGs (Shieber and Schabes, 1990), and MC-TAGs (Weir, 1988).",
        "STAGs in particular can be used for machine translation and were applied to Korean-English machine translation in a military message domain (Palmer et al., 1995).",
        "Park (Park, 1995) suggested a way of handling Korean scrambling using MC-TAGs together with a priority concept.",
        "However, as scrambled argument structures in Korean were represented as sets using MC-TAGs, a mechanism to combine MC-TAGs and STAGs was necessary to translate Korean scrambled sentences into English."
      ]
    },
    {
      "heading": "2 Korean-English Machine",
      "text": []
    },
    {
      "heading": "Translation Using STAGs",
      "text": [
        "STAGs are a variant of TAGs introduced to characterize correspondences between tree adjoining languages.",
        "They can be used to relate TAGs for two different languages for machine translation (Abeille et al., 1990).",
        "The translation process consists of three steps.",
        "The source sentence is parsed according to the source grammar.",
        "Each elementary tree in the derivation is considered with the features given from the derivation through unification.",
        "Second, the source derivation tree is transferred to a target derivation.",
        "This step maps each elementary tree in the source derivation tree to a tree in the target derivation tree",
        "Canonical ordering of the arguments of transitive verbs in Korean is SOY.",
        "Whereas the case marker in English is implicit in the word, case markers are explicit in Korean.",
        "This is reflected in the transfer lexicon of Figure 1.",
        "So, the pair a in Figure 1 shows that Korean has an explicit subject case marker i, and the pair shows that Korean has an explicit object case marker lul.",
        "Also, the pair 7 shows the links between SOY structure of Korean to SVO structure of English.",
        "To translate sentence (1), we start with the pair y in Figure 1, and we substitute the pair a on the link from the Korean node SP to the English node NP.",
        "Then, pair 13 is substituted into the NP-OP pairs in -y, thus correctly transferring sentence (1)."
      ]
    },
    {
      "heading": "3 Handling of Scrambling in Korean Using MC-TAGs",
      "text": [
        "TAGs and related formalisms, due to the extended domain of locality, can combine a lexical head and all of its arguments in a single elementary structure of the grammar.",
        "However, Becker and Rambow show that TAGs that obey the co-occurrence constraint cannot handle the full range of scrambled sentences (Becker and Rambow, 1990).",
        "As a result, non-local MC-TAG-DL (Multi-Component TAG with Dominance Link) was proposed as a way of handling scrambling'.",
        "Later, by adding a priority concept to MC-TAG-DL, Park (Park, 1995) suggested a way of handling scrambling in Korean."
      ]
    },
    {
      "heading": "3.1 aAR.0 & sAizg structures",
      "text": [
        "Tom, No: For handling scrambling, the multi-adjunction concept in MC-TAGs can be used for combining a scrambled argument and its landing site.",
        "For example, a subject (e.g., Tom) would have two Korean structures as above.",
        "For notational convenience, call the two structures, aAR.gsr and /3.ATegsp, respectively.",
        "In general, aARC represents a canonical NP structure and #ARg represents a scrambled NP structure.",
        "PATZgsT, shows a pair of structures for representing the scrambled subject argument.",
        "Call the left structure of PARgsv, P.A.R.gr, and the right structure, f3A7Z.g:Rs.p.",
        "flAR.g.fp represents a scrambled subject, and 13Al2.07, is used for representing the place where the subject would have been in the canonical sentence.",
        "Similarly, 13.117Zgo7 denotes a pair of structures for representing a scrambled object argument.",
        "The basic idea is that whenever an argument is not in a scrambled position, it should be substituted into an available empty slot using the crA72,g structure.",
        "The sA.R.g structure will be used only when the argument is in a scrambled position so that the aATeg structure cannot be used."
      ]
    },
    {
      "heading": "3.2 An Example",
      "text": [
        "K: Jerry-/u1"
      ]
    },
    {
      "heading": "2 Jerry-A CC",
      "text": [
        "An additional constraint system called dominance links was added, thus giving rise to MC-TAG-DL.",
        "Each elementary tree is given a priority.",
        "A higher priority is given to aA7Z.g structure over pARg.",
        "Generally, when a structure given a higher priority over others can be successfully used for the final derivation of a sentence, the remaining structures will not be tried at all.",
        "Only when the highest priority structure fails will the next available structure be tried2."
      ]
    },
    {
      "heading": "4 Using MC-TAGs in STAGs",
      "text": [
        "For mapping Korean to English, the simple object (NP) structure of English (e.g., the right structure of pair in Figure 1) can be mapped to two structures, i.e., aA7Z.g0p and /3A/Zg0p , thus generating two possible lexical pairs.",
        "For translating sentence (1), the aAR.Gor – NP pair is used for Jerry (similar to the pair in Figure 1).",
        "However, in sentence (2), the 0.47W0p – NP pair should be used instead for translating the scrambled argument Jerry (i.e., Figure 4(a)).",
        "Thus, it is necessary that a Korean PAR,g structure (MC-TAG) be mapped to an English NP structure (TAG) to transfer a scrambled argument in Korean.",
        "I assume that there is one head structure for each MC-TAG structure, and that the PA7?.G71 (place holder structure) is the head structure for each 13A1 structure.",
        "The root node of the head structure is always mapped to the root node of the target (English) structure.",
        "Usually, the nodes in the source language should be linked to each relevant node in the target language, and vice versa (in STAGs).",
        "However, in the case that it is a multicomponent structure (e.g., PARC), an adjunction node need not necessarily be linked to any node.",
        "If it is not linked to any node of the target language, the structure can be freely adjoined onto any available node of the partially derived tree of the source language, which is approximately what scrambling is about.",
        "However, substitution nodes will always be linked (the difference between a substitution node and an adjunction node is that an adjunction node does not introduce a new structure to the partially derived tree whereas a substitution node always does).",
        "In Figure 4(a), the root node NP of an English TAG is mapped to the OP node of f3A'R.ggp of a Korean TAG which is a head structure.",
        "All the other nodes are mapped to each relevant node except S. As it is not linked, f3A7Zg8p can be adjoined onto any available node in the partially derived Korean tree.",
        "Actually, the restriction on whether OAR.Ggp can be adjoined onto a certain node does not come from the formalism of Synchronous TAGs, but purely from the grammar of Korean TAGs.",
        "Figure 4(b) shows the final derived trees for both Korean and English after applying 4(a) to the partially derived trees."
      ]
    },
    {
      "heading": "5 Conclusion and Future Direction",
      "text": [
        "Using MC-TAGs allows the scrambled argument structure to be represented as a single (set) structure.",
        "This makes possible the mapping of Korean scrambled aizument structures into English argument structures.",
        "The application of similar mechanisms for other languages and for mapping quasi logical forms to logical forms (Alshawi et al., 1992) using STAGs is also being investigated."
      ]
    }
  ]
}
