{
  "info": {
    "authors": [
      "Fredy A. Amaya",
      "José-Miguel Benedí"
    ],
    "book": "Conference on Computational Natural Language Learning and of the Second Learning Language in Logic Workshop CoNLL and LLL",
    "id": "acl-W00-0714",
    "title": "Using Perfect Sampling in Parameter Estimation of a Whole Sentence Maximum Entropy Language Model",
    "url": "https://aclweb.org/anthology/W00-0714",
    "year": 2000
  },
  "references": [
    "acl-C00-1009",
    "acl-J96-1002"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The Maximum Entropy principle (ME) is an appropriate framework for combining information of a diverse nature from several sources into the same language model.",
        "In order to incorporate long-distance information into the ME framework in a language model, a Whole Sentence Maximum Entropy Language Model (WSME) could be used.",
        "Until now MonteCarlo Markov Chains (MCMC) sampling techniques has been used to estimate the paramenters of the WSME model.",
        "In this paper, we propose the application of another sampling technique: the Perfect Sampling (PS).",
        "The experiment has shown a reduction of 30% in the perplexity of the WSME model over the trigram model and a reduction of 2% over the WSME model trained with MCMC."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The language modeling problem may be defined as the problem of calculating the probability of a string, p(w) = p(wi, , wn).",
        "The probability p(w) is usually calculated via conditional probabilities.",
        "The n-gram model is one of the most widely used language models.",
        "The power of the n-gram, model resides in its simple formulation and the ease of training.",
        "On the other hand, n-grams only take into account local information, and important long-distance information contained in the string w1 wn cannot be modeled by it.",
        "In an attempt to supplement the local information with long-distance information, hybrid models have been proposed such us (Belle",
        "garda, 1998; Chelba, 1998; Benedi and Sanchez, 2000).",
        "The Maximum Entropy principle is an appropriate framework for combining information of a diverse nature from several sources into the same model: the Maximum Entropy model (ME) (Rosenfeld, 1996).",
        "The information is incorporated as features which are submitted to constraints.",
        "The conditional form of the ME model is:",
        "where Ai are the parameters to be learned (one for each feature), the fi are usually characteristic functions which are associated to the features and Z(x) = Ey exp{ali Azfi(x, y)} is the normalization constant.",
        "The main advantages of ME are its flexibility (local and global information can be included in the model) and its simplicity.",
        "The drawbacks are that the para-menter's estimation is computationally expensive, specially the evaluation of the normalization constant Z(x) and that the grammatical information contained in the sentence is poorly encoded in the conditional framework.",
        "This is due to the assumption of independence in the conditional events: in the events in the state space, only a part of the information contained in the sentence influences de calculation of the probability (Ristad, 1998)."
      ]
    },
    {
      "heading": "2 Whole Sentence Maximum Entropy Language Model",
      "text": [
        "An alternative to combining local, long-distance and structural information contained in the sentence, within the maximum entropy framework, is the Whole Sentence Maximum Entropy model (WSME) (Rosenfeld, 1997).",
        "The",
        "WSME is based in the calculation of unrestricted ME probability p(w) of a whole sentence w = wi wn.",
        "The probability distribution is the distribution p that has the maximum entropy relative to a prior distribution po (in other words: the distribution that minimize de divergence D(pJIpo)) (Della Pietra et al., 1995).",
        "The distribution p is given by:",
        "where ), and L are the same as in (1).",
        "Z is a (global) normalization constant and po is a prior proposal distribution.",
        "The A, and Z are unknown and must be learned.",
        "The parameters A, may be interpreted as being weights of the features and could be learned using some type of iterative algorithm.",
        "We have used the Improved Iterative Scaling algorithm (IIS) (Berger et al., 1996).",
        "In each iteration of the IIS, we find a Si value such that adding this value to Ai parameters, we obtain an increase in the the log-likelihood.",
        "The 8i values are obtained as the solution of the m equations:",
        "where i = 1, , m, f# (w) = (w) and Ci is a training corpus.",
        "Because the domain of WSME is not restricted to a part of the sentence (context) as in the conditional case, it allows us to combine global structural syntactic information which is contained in the sentence with local and other kinds of long range information such us triggers.",
        "Furthermore, the WSME model is easier to train than the conditional one, because in the WSME model we don't need to estimate the normalization constant Z during the training time.",
        "In contrast, for each event (x, y) in the training corpus, we have to calculate Z(x) in each iteration of the MEC model.",
        "The main drawbacks of the WSME model are its integration with other modules and the calculation of the expected value in the left part of equation (3), because the event space is huge.",
        "Here we focus on the problem of calculating the expected value in (3).",
        "The first sum in (3) is the expected value of fie(52f# , and it is obviously not possible to sum over all the sentences.",
        "However, we can estimate the mean by using the empirical expected value:",
        "where Si, , sm is a random sample from p(w).",
        "Once the parameters have been learned it is possible to estimate the value of the normalization",
        "[eaA f --=1 \"] , and it can be estimated by means of the sample mean with respect to po (Chen and Rosenfeld, 1999).",
        "In each iteration of IIS, the calculation of (4) requires sampling from a probability distribution which is partially known (Z is unknown), so the classical sampling techniques are not useful.",
        "In the literature, there are some methods like the MonteCarlo Markov Chain methods (MCMC) that generate random samples from p(w) (Sahu, 1997; Tierney, 1994).",
        "With the MCMC methods, we can simulate a sample approximately from the probability distribution and then use the sample to estimate the desired expected value in (4)."
      ]
    },
    {
      "heading": "3 Perfect Sampling",
      "text": [
        "In this paper, we propose the application of another sampling technique in the parameter estimation process of the WSME model which was introduced by Propp and Wilson (Propp and Wilson, 1996): the Perfect Sampling (PS).",
        "The PS method produces samples from the exact limit distribution and, thus, the sampling mean given in (4) is less biased than the one obtained with the MCMC methods.",
        "Therefore, we can obtain better estimations of the parameters Ai.",
        "In PS, we obtain a sample from the limit distribution of an ergodic Markov Chain X = {Xn;n > 0}, taking values in the state space S (in the WSME case, the state space is the set of possible sentences).",
        "Because of the ergodicity, if the transition law of X is P(x, A) := P(Xn E AlXn_i = x), then it has a limit distribution 71-, that is: if we start a path on the chain in any state at time n = 0, then as n oo, The first algorithm of the family of PS was presented by Propp and Wilson (Propp and Wilson, 1996) under the name Coupling From the Past (CFP) and is as follows: start a path in",
        "every state of S at some time ( – T) in the past such that at time n = 0, all the paths collapse to a unique value (due to the ergodicity).",
        "This value is a sample element.",
        "In the majority of cases, the state space is huge, so attempting to begin a path in every state is not practical.",
        "Thus, we can define a partial stochastic order in the state space and so we only need start two paths: one in the minimum and one in the maximum.",
        "The two paths collapse at time 71 = 0 and the value of the coalescence state is a sample element of r. The CFP algorithm first determines the time T to start and then runs the two paths from time ( – T) to 0.",
        "Information about PS methods may be consulted in (Corcoran and Tweedie, 1998; Propp and Wilson, 1998)."
      ]
    },
    {
      "heading": "4 Experimental work",
      "text": [
        "In this work, we have made preliminary experiments using PS in the estimation of the expected value (4) during the learning of the parameters of a WSME model.",
        "We have implemented the Cai algorithm (Cai, 1999) to obtain perfect samples.",
        "The Cai algorithm has the advantage that it doesn't need the definition of the partial order.",
        "The experiments were carried out using a pseudonatural corpus: \"the traveler task\"'.",
        "The traveler task consists in dialogs between travelers and hotel clerks.",
        "The size of the vocabulary is 693 words.",
        "The training set has 490,000 sentences and 4,748,690 words.",
        "The test set has 10,000 sentences and 97,153 words.",
        "Three kinds of features were used in the WSME model: n-grams (1-grams, 2-grams, 3 grams), distance 2 n-grams (d2-2-grams, d2-3grams) and triggers.",
        "The proposal prior distribution used was a trigram model.",
        "We trained WSME models with different sets of features using the two sampling techniques: MCMC and PS.",
        "We measured the perplexity (PP) of each of the models and obtained the percentage of improvement in the PP with respect to a trigram baseline model (see table 1).",
        "The first model used MCMC techniques (specifically the Independence Metropolis-Hastings algorithm (IMH) 2) and features of n-grams and distance 2 n-grams.",
        "The second model used a",
        "model over the traveler task corpus: IMH with features of n-grams and d-n-grams (IMH), PS with n-grams and d-n-grams (PS) IMH with triggers (IMH-T), PS with triggers (PS-T).",
        "The baseline model is a trigram model (Trigram) PS algorithm and features of n-grams and distance 2 n-grams.",
        "The third model used the IMH algorithm and features of triggers.",
        "The fourth used PS and features of triggers.",
        "Finally, in order to compare with the classical methods, we included the trigram baseline model.",
        "In all cases, the WSME had a better performance than the n-gram model.",
        "From the results in Table 1, we see that the use of features of triggers improves the performance of the model more than the use of n-gram features, this may be due to the correlation between the triggers and the n-grams, the n-gram information has been absorbed by the prior distribution and diminishes the effects of the feature of n-grams.",
        "We believe this is the reason why PST in Table 1 is better than PS.",
        "We also see how IMH and IHM-T shows the same improvement, i.e. the use of triggers does not seem improve the perplexity of the model but, this may be due to the sampling technique: the parameter values depends on the estimation of an expected value, and the estimation depends on the sampling.",
        "Finally, the PST has better perplexity than the IMH-T.",
        "The only difference between both of these is the sampling technique,neither of then has the correlation influence in the features, so we think that the improvement may be due to the sampling technique."
      ]
    },
    {
      "heading": "5 Conclusion and future works",
      "text": [
        "We have presented a different approach to the sampling step needed in the parameter estimation of a WSME model.",
        "Using this technique, we have obtained a reduction of 30% in the perplexity of the WSME model over the baseline",
        "trigram model and an improvement of 2% over the model trained with MCMC techniques.",
        "We are extending our experiments to a major corpus: the Wall Street Journal corpus and using a set of features which is more general, including features that reflect the global structure of the sentence.",
        "We are working on introducing the grammatical information contained into the sentence to the model; we believe that such information improves the quality of the model significantly."
      ]
    }
  ]
}
