{
  "info": {
    "authors": [
      "K. Bretonnel Cohen",
      "Lynne Fox",
      "Philip V. Ogren",
      "Lawrence Hunter"
    ],
    "book": "Workshop on Linking Biological Literature, Ontologies and Databases: Mining Biological Semantics",
    "id": "acl-W05-1306",
    "title": "Corpus Design for Biomedical Natural Language Processing",
    "url": "https://aclweb.org/anthology/W05-1306",
    "year": 2005
  },
  "references": [
    "acl-E99-1043",
    "acl-N03-4009",
    "acl-W02-0302",
    "acl-W02-0312",
    "acl-W04-0508",
    "acl-W04-1213",
    "acl-W04-3111",
    "acl-W05-1305"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper classifies six publicly available biomedical corpora according to various corpus design features and characteristics.",
        "We then present usage data for the six corpora.",
        "We show that corpora that are carefully annotated with respect to structural and linguistic characteristics and that are distributed in standard formats are more widely used than corpora that are not.",
        "These findings have implications for the design of the next generation of biomedical corpora."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "A small number of data sets for evaluating the performance of biomedical language processing (BLP) systems on a small number of task types have been made publicly available by their creators (Blaschke et al. 1999, Craven and Kumlein 19992, Pustejovsky et al. 2002, Franzen et al. 2002, Collier et al. 1999, Tanabe et al. 2005).",
        "From a biological perspective, a number of these corpora (PDG, GENIA, Medstract, Yapex, GENETAG) are exceptionally well curated.",
        "From the perspective of system evaluation, a number of these corpora (Wisconsin, GENETAG) are very well designed, with large numbers of both positive and negative examples for system training and testing.",
        "Despite the positive attributes of all of these corpora, they vary widely in their external usage rates: some of them have been found very useful in the natural language processing community outside of the labs that created them, as evinced by their high rates of usage in system construction and evaluation in the years since they have been released.",
        "In contrast, others have seen little or no use in the community at large.",
        "These data sets provide us with an opportunity to evaluate the consequences of a variety of approaches to biomedical corpus construction.",
        "We examine these corpora with respect to a number of design features and other characteristics, and look for features that characterize widely used – and infrequently used – corpora.",
        "Our findings have implications for how the next generation of biomedical corpora should be constructed, and for how the existing corpora can be modified to make them more widely useful."
      ]
    },
    {
      "heading": "2 Materials and methods",
      "text": [
        "Table 1 lists the publicly available biomedical corpora of which we are aware.",
        "We omit discussion here of the corpus currently in production by the University of Pennsylvania and the Children’s Hospital of Philadelphia (Kulick et al. 2004), since it is not yet available in finished form.",
        "We also omit text collections from our discussion.",
        "By text collection we mean textual data sets that may include metadata about documents, but do not contain mark-up of the document contents.",
        "So, the OHSUMED text collection (Hersh et al. 1994) and the TREC Genomics track data sets (Hersh and Bhupatiraju 2003, Hersh et al. 2004) are excluded from this work, although their utility in information retrieval is clear.",
        "Table 1 lists the corpora, and for each corpus, gives its release date (or the year of the corresponding publication), the genre of the contents of the corpus, and the size of the corpus.",
        "The left-hand side of Table 2 lists the data sets and, for each one, indicates the lower-level general language processing problems that it could be applied to, either as a source of training data or for evaluating systems that perform these tasks.",
        "We considered here sentence segmentation, word tokenization, and part-of-speech (POS) tagging.",
        "The right-hand side of Table 2 shows the higher-level tasks to which the various corpora can be applied.",
        "We considered here entity identification, information (relation) extraction, abbreviation/acronym definition, and coreference resolution.",
        "(Information retrieval is approached via text collections, versus corpora.)",
        "These tasks are directly related to the types of semantic annotation present in each corpus.",
        "The three EI-only corpora (GENIA, Yapex, GENETAG) are annotated with semantic classes of relevance to the molecular biology domain.",
        "In the case of the Yapex and GENETAG corpora, this annotation uses a single semantic class, roughly equivalent to the gene or gene product.",
        "In the case of the GENIA corpus, the annotation reflects a more sophisticated, if not widely used, ontology.",
        "The Medstract corpus uses multiple semantic classes, including gene, protein, cell type, and molecular process.",
        "In all of these cases, the semantic annotation was carefully curated, and in one (GENETAG) it includes alternative analyses.",
        "Two of the corpora (PDG, Wisconsin) are indicated in Table 2 as being applicable to both entity identification and information extraction tasks.",
        "From a biological perspective, the PDG corpus has exceptionally well-curated positive examples.",
        "From a linguistic perspective, it is almost unannotated.",
        "For each sentence, the entities are listed, but their locations in the text are not indicated, making them applicable to some definitions of the entity identification task but not others.",
        "The Wisconsin corpus contains both positive and negative examples.",
        "For each example, entities are listed in a normalized form, but without clear pointers to their locations in the text, making this corpus similarly difficult to apply to many definitions of the entity identification task.",
        "The Medstract corpus is unique among these in being annotated with coreferential equivalence sets, and also with acronym expansions.",
        "All six corpora draw on the same subject matter domain – molecular biology – but they vary widely with respect to their level of semantic restriction within that relatively broad category.",
        "One (GENIA) is restricted to the subdomain of human blood cell transcription factors.",
        "Another (Yapex) combines data from this domain with abstracts on protein binding in humans.",
        "The GENETAG corpus is considerably broader in topic, with all of PubMed/MEDLINE serving as a potential data",
        "gives the count of the number of systems that actually used the dataset, as opposed to publications that cited the paper but did not use the data itself.",
        "Age is in years as of 2005.",
        "Name age systems",
        "source.",
        "The Medstract corpus contains biomedical material not apparently related to molecular biology.",
        "The PDG corpus is drawn from a very narrow subdo-main on protein-protein interactions.",
        "The Wisconsin corpus is composed of data from three separate sub-domains: protein-protein interactions, subcellu-lar localization of proteins, and gene/disease associations.",
        "Table 3 shows the number of systems built outside of the lab that created the corpus that used each of the data sets described in Tables 1 and 2.",
        "The counts in this table reflect work that actually used the datasets, versus work that cites the publication that describes the data set but doesn’t actually use the data set.",
        "We assembled the data for these counts by consulting with the creators of the data sets and by doing our own literature searches8.",
        "If a system is described in multiple publications, we count it only once, so the number of systems is slightly smaller than the number of publications."
      ]
    },
    {
      "heading": "3 Results",
      "text": [
        "Even without examining the external usage data, two points are immediately evident from Tables 1 and 2: Only one of the currently publicly available corpora (GENIA) is suitable for evaluating performance on basic preprocessing tasks.",
        "8 In the cases of the two corpora for which we found only zero or one external usage, this search was repeated by an experienced medical librarian, and included reviewing 67 abstracts or full papers that cite Blaschke et al.",
        "(1999) and 37 that cite Craven and Kumlein (1999).",
        "These corpora include only a very limited range of genres: only abstracts and roughly sentence-sized inputs are represented.",
        "Examination of Table 3 makes another point immediately clear.",
        "The currently publicly available corpora fall into two groups: ones that have had a number of external applications (GENIA, GENETAG, and Yapex), and ones that have not (Medstract, Wisconsin, and PDG).",
        "We now consider a number of design features and other characteristics of these corpora that might explain these groupings9."
      ]
    },
    {
      "heading": "3.1 Effect of age",
      "text": [
        "We considered the very obvious hypothesis that it might be length of time that a corpus has been available that determines the amount of use to which it has been put.",
        "(Note that we use the terms “hypothesis” and “effect” in a non-statistical sense, and there is no significance-testing in the work reported here.)",
        "Tables 1 and 3 show clearly that this is not the case.",
        "The age of the PDG, Wisconsin, and GENIA data is the same, but the usage rates are considerably different – the GENIA corpus has been much more widely used.",
        "The GENETAG corpus is the newest, but has a relatively high usage rate.",
        "Usage of a corpus is determined by factors other than the length of time that it has been available."
      ]
    },
    {
      "heading": "3.2 Effect of size",
      "text": [
        "We considered the hypothesis that size might be the determinant of the amount of use to which a corpus is put – perhaps smaller corpora simply do not provide enough data to be helpful in the development and validation of learning-based systems.",
        "We can 9 Three points should be kept in mind with respect to this data.",
        "First, although the sample includes all of the corpora that we are aware of, it is small.",
        "Second, there is a variety of potential confounds related to sociological factors which we are aware of, but do not know how to quantify.",
        "One of these is the effect of association between a corpus and a shared task.",
        "This would tend to increase the usage of the corpus, and could explain the usage rates of GENIA and GENETAG, although not that of Yapex.",
        "Another is the effect of association between a corpus and an influential scientist.",
        "This might tend to increase the usage of the corpus, and could explain the usage rate of GENIA, although not that of GENETAG.",
        "Finally, there may be interactions between any of these factors, or as a reviewer pointed out, there may be a separate explanation for the usage rate of each corpus in this study.",
        "Nevertheless, the analysis of the quantifiable factors presented above clearly provides useful information about the design of successful corpora.",
        "reject this hypothesis: the Yapex corpus is one of the smallest (a fraction of the size of the largest, and only roughly a tenth of the size of GENIA), but has achieved fairly wide usage.",
        "The Wisconsin corpus is the largest, but has a very low usage rate."
      ]
    },
    {
      "heading": "3.3 Effect of structural and linguistic annotation",
      "text": [
        "We expected a priori that the corpus with the most extensive structural and linguistic annotation would have the highest usage rate.",
        "(In this context, by structural annotation we mean tokenization and sentence segmentation, and by linguistic annotation we mean POS tagging and shallow parsing.)",
        "There isn’t a clear-cut answer to this.",
        "The GENIA corpus is the only one with curated structural and POS annotation, and it has the highest usage rate.",
        "This is consistent with our initial hypothesis.",
        "On the other hand, the Wisconsin corpus could be considered the most “deeply” linguistically annotated, since it has both POS annotation and – unique among the various corpora – shallow parsing.",
        "It nevertheless has a very low usage rate.",
        "However, the comparison is not clearcut, since both the POS tagging and the shallow parsing are fully automatic and not manually corrected.",
        "(Additionally, the shallow parsing and the tokenization on which it is based are somewhat idiosyncratic.)",
        "It is clear that the Yapex corpus has relatively high usage despite the fact that it is, from a linguistic perspective, very lightly annotated (it is marked up for entities only, and nothing else).",
        "To our surprise, structural and linguistic annotation do not appear to uniquely determine usage rate."
      ]
    },
    {
      "heading": "3.4 Effect of format",
      "text": [
        "Annotation format has a large effect on usage.",
        "It bears repeating that these six corpora are distributed in six different formats – even the presumably simple task of populating the Size column in Table 1 required writing six scripts to parse the various data files.",
        "The two lowest-usage corpora are annotated in remarkably unique formats.",
        "In contrast, the three more widely used corpora are distributed in relatively more common formats.",
        "Two of them (GENIA and Yapex) are distributed in XML, and one of them (GENIA) offers a choice for POS tagging information between XML and the whitespace-separated, one-token-followed-by-tags-per-line format that is common to a number of POS taggers and parsers.",
        "The third (GENETAG) is distributed in the widely used slash-attached format (e.g. sense/NN)."
      ]
    },
    {
      "heading": "3.5 Effect of semantic annotation",
      "text": [
        "The data in Table 2 and Table 3 are consistent with the hypothesis that semantic annotation predicts usage.",
        "The claim would be that corpora that are built specifically for entity identification purposes are more widely used than corpora of other types, presumably due to a combination of the importance of the entity identification task as a prerequisite to a number of other important applications (e.g. information extraction and retrieval) and the fact that it is still an unsolved problem.",
        "There may be some truth to this, but we doubt that this is the full story: there are large differences in the usage rates of the three EI corpora, suggesting that semantic annotation is not the only relevant design feature.",
        "If this analysis is in fact correct, then certainly we should see a reduction in the use of all three of these corpora once the EI problem is solved, unless their semantic annotations are extended in new directions."
      ]
    },
    {
      "heading": "3.6 Effect of semantic domain",
      "text": [
        "Both the advantages and the disadvantages of restricted domains as targets for language processing systems are well known, and they seem to balance out here.",
        "The scope of the domain does not affect usage: both the low-use and higher-use groups of corpora contain at least one highly restricted domain (GENIA in the high-use group, and PDG in the low-use group) and one broader domain (GENETAG in the high-use group, and Wisconsin in the lower-use group)."
      ]
    },
    {
      "heading": "4 Discussion",
      "text": [
        "The data presented in this paper show clearly that external usage rates vary widely for publicly available biomedical corpora.",
        "This variability is not related to the biological relevance of the corpora – the PDG and Wisconsin corpora are clearly of high biological relevance as evinced by the number of systems that have tackled the information extraction tasks that they are meant to support.",
        "Additionally, from a biological perspective, the quality of the data in the",
        "PDG corpus is exceptionally high.",
        "Rather, our data suggest that basic issues of distribution format and of structural and linguistic annotation seem to be the strongest predictors of how widely used a biomedical corpus will be.",
        "This means that as builders of of data sources for BLP, we can benefit from the extensive experience of the corpus linguistics world.",
        "Based on that experience, and on the data that we have presented in this paper, we offer a number of suggestions for the design of the next generation of biomedical corpora.",
        "We also suggest that the considerable investments already made in the construction of the less-frequently-used corpora can be protected by modifying those corpora in accordance with these suggestions.",
        "Leech (1993) and McEnery and Wilson (2001), coming from the perspective of corpus linguistics, identify a number of definitional issues and design maxims for corpus construction.",
        "Some of these are quite relevant to the current state of biomedical corpus construction.",
        "We frame the remainder of our discussion in terms of these issues and maxims."
      ]
    },
    {
      "heading": "4.1 Level of annotation",
      "text": [
        "From a definitional point of view, annotation is one of the distinguishing points of a corpus, as opposed to a text collection.",
        "Perhaps the most salient characteristic of the currently publicly available corpora is that from a linguistic or language processing perspective, with the exception of GENIA and GENETAG, they are barely annotated at all.",
        "For example, although POS tagging has possibly been the sine qua non of the usable corpus since the earliest days of the modern corpus linguistic age, five of the six corpora listed in Table 2 either have no POS tagging or have only automatically generated, uncorrected POS tags.",
        "The GENIA corpus, with its carefully curated annotation of sentence segmentation, tokenization, and part-of-speech tagging, should serve as a model for future biomedical corpora in this respect.",
        "It is remarkable that with just these levels of annotation (in addition to its semantic mark-up), the GENIA corpus has been applied to a wide range of task types other than the one that it was originally designed for.",
        "Eight papers from COLING 2004 (Kim et al.",
        "2004) used it for evaluating entity identification tasks.",
        "Yang et al.",
        "(2002) adapted a subset of the corpus for use in developing and testing a coreference resolution system.",
        "Rinaldi et al.",
        "(2004) used it to develop and test a question-answering system.",
        "Locally, it has been used in teaching computational corpus linguistics for the past two years.",
        "We do not claim that it has not required extension for some of these tasks – our claim is that it is its annotation on these structural and linguistic levels, in combination with its format, that has made these extensions practical."
      ]
    },
    {
      "heading": "4.1.1 Formatting choices and formatting standardization",
      "text": [
        "A basic desideratum for a corpus is recoverability: it should be possible to map from the annotation to the raw text.",
        "A related principle is that it should be easy for the corpus user to extract all annotation information from the corpus, e.g. for external storage and processing: “in other words, the annotated corpus should allow the maximum flexibility for manipulation by the user” (McEnery and Wilson, p. 33).",
        "The extent to which these principles are met is a function of the annotation format.",
        "The currently available corpora are distributed in a variety of one-off formats.",
        "Working with any one of them requires learning a new format, and typically writing code to access it.",
        "At a minimum, none of the non-XML corpora meet the recoverability criterion.",
        "None 10 of these corpora are distributed in a standoff annotation format.",
        "Standoff annotation is the strategy of storing annotation and raw text separately (Leech 1993).",
        "Table 4 contrasts the two.",
        "Non-standoff annotation at least obscures – more frequently, destroys – important aspects of the structure of the text itself, such as which textual items are and are not immediately adjacent.",
        "Using standoff annotation, there is no information loss whatsoever.",
        "Furthermore, in the standoff annotation strategy, the original input text is immediately available in its raw form.",
        "In contrast, in the non-standoff annotation strategy, the original must be retrieved independently or recovered from the annotation (if it is recoverable at all).",
        "The standoff annotation strategy was relatively new at the time that most of the corpora in Table 1 were designed, but by now has become easy to implement, in part",
        "due to the availability of tools such as the University of Pennsylvania’s WordFreak (Morton and LaCivita 2003).",
        "Crucially, this annotation should be based on character offsets, avoiding a priori assumptions about tokenization.",
        "See Smith et al.",
        "(2005) for an approach to refactoring a corpus to use character offsets."
      ]
    },
    {
      "heading": "4.1.2 Guidelines",
      "text": [
        "The maxim of documentation suggests that annotation guidelines should be published.",
        "Further, basic data on who did the annotations and on their level of agreement should be available.",
        "The currently available datasets mostly lack assessments of inter-annotator agreement, utilize a small or unspecified number of annotators, and do not provide published annotation guidelines.",
        "(We note the Yang et al.",
        "(2002) coreference annotation guidelines, which are excellent, but the corresponding corpus is not publicly available.)",
        "This situation can be remedied by editors, who should insist on publication of all of these.",
        "The GENETAG corpus is notable for the detailed documentation of its annotation guidelines.",
        "We suspect that the level of detail of these guidelines contributed greatly to the success of some rule-based approaches to the EI task in the BioCreative competition, which utilized an early version of this corpus."
      ]
    },
    {
      "heading": "4.1.3 Balance and representativeness",
      "text": [
        "Corpus linguists generally strive for a well-structured stratified sample of language, seeking to “balance” in their data the representation of text types, different sorts of authors, and so on.",
        "Within the semantic domain of molecular biology texts, an important dimension on which to balance is the genre or text type.",
        "As is evident from Table 1, the extant datasets draw on a very small subset of the types of genres that are relevant to BLP: we have not done a good job yet of observing the principle of balance or representativeness.",
        "The range of genres that exist in the research (as opposed to clinical) domain alone includes abstracts, full-text articles, GeneRIFs, definitions, and books.",
        "We suggest that all of these should be included in future corpus development efforts.",
        "Some of these genres have been shown to have distinguishing characteristics that are relevant to BLP.",
        "Abstracts and isolated sentences from them are inadequate, and also unsuited to the opportunities that are now available to us for text data mining with the recent announcement of the NIH’s new policy on availability of full-text articles (NIH 2005).",
        "This policy will result in the public availability of a large and constantly growing archive of current, full-text publications.",
        "Abstracts and sentences are inadequate in that experience has shown that significant amounts of data are not found in abstracts at all, but are present only in the full texts of articles, sometimes not even in the body of the text itself, but rather in tables and figure captions (Shatkay and Feldman 2003).",
        "They are not suited to the upcoming opportunities in that it is not clear that practicing on abstracts will let us build the necessary skills for dealing with the flood of full-text articles that PubMedCentral is poised to deliver to us.",
        "Furthermore, there are other types of data – GeneRIFs and domain-specific dictionary definitions, for instance – that are fruitful sources of biological knowledge, and which may actually be easier to process automatically than abstracts.",
        "Space does not permit justifying the importance of all of these genres, but we discuss the rationale for including full text at some length due to the recent NIH announcement and due to the large body of evidence that can currently be brought to bear on the issue.",
        "A growing body of recent research makes",
        "two points clear: full-text articles are different from abstracts, and full-text articles must be tapped if we are to build high-recall text data mining systems.",
        "Corney et al.",
        "(2004) looked directly at the effectiveness of information extraction from full-text articles versus abstracts.",
        "They found that recall from full-text articles was more than double that from abstracts.",
        "Analyzing the relative contributions of the abstracts and the full articles, they found that more than half of the interactions that they were able to extract were found in the full text and were absent in the abstract.",
        "Tanabe and Wilbur (2002) looked at the performance on full-text articles of an entity identification system that had originally been developed and tested using abstracts.",
        "They found different false positive rates in the Methods sections compared to other sections of full-text articles.",
        "This suggests that full-text articles, unlike abstracts, will require parsing of document structure.",
        "They also noted a range of problems related to the wider range of characters (including, e.g., superscripts and Greek letters) that occurs in full-text articles, as opposed to abstracts.",
        "Schuemie et al.",
        "(2004) examined a set of 3902 full-text articles from Nature Genetics and BioMed Central, along with their abstracts.",
        "They found that about twice as many MeSH concepts were mentioned in the full-text articles as in the abstracts.",
        "They also found that full texts contained a larger number of unique gene names than did abstracts, with an average of 2.35 unique gene names in the full-text articles, but an average of only 0.61 unique gene names in the abstracts.",
        "It seems clear that for biomedical text data mining systems to reach anything like their full potential, they will need to be able to handle full-text inputs.",
        "However, as Table 1 shows, no publicly available corpus contains full-text articles.",
        "This is a deficiency that should be remedied."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": []
    },
    {
      "heading": "5.1 Best practices in biomedical corpus construction",
      "text": [
        "We have discussed the importance of recoverability, publication of guidelines, balance and representativeness, and linguistic annotation.",
        "Corpus maintenance is also important.",
        "Bada et al.",
        "(2004) point out the role that an organized and responsive maintenance plan has played in the success of the Gene Ontology.",
        "It seems likely that the continued development and maintenance reflected in the three major releases of GENIA (Ohta et al.",
        "2002, Kim et al.",
        "2003) have contributed to its improved quality and continued use over the years."
      ]
    },
    {
      "heading": "5.2 A testable prediction",
      "text": [
        "We have interpreted the data on the characteristics and usage rates of the various datasets discussed in this paper as suggesting that datasets that are developed in accordance with basic principles of corpus linguistics are more useful, and therefore more used, than datasets that are not.",
        "A current project at the University of Pennsylvania and the Children’s Hospital of Philadelphia (Kulick et al.",
        "2004) is producing a corpus that follows many of these basic principles.",
        "We predict that this corpus will see wide use by groups other than the one that created it."
      ]
    },
    {
      "heading": "5.3 The next step: grounded references",
      "text": [
        "The logical next step for BLP corpus construction efforts is the production of corpora in which entities and concepts are grounded with respect to external models of the world (Morgan et al.",
        "2004).",
        "The BioCreative Task 1B data set construction effort provides a proof-of-concept of the plausibility of building BLP corpora that are grounded with respect to external models of the world, and in particular, biological databases.",
        "These will be crucial in taking us beyond the stage of extracting information about text strings, and towards mining knowledge about known, biologically relevant entities."
      ]
    },
    {
      "heading": "6 Acknowledgements",
      "text": [
        "This work was supported by NIH grant R01-LM008111.",
        "The authors gratefully acknowledge helpful discussions with Lynette Hirschman, Alex Morgan, and Kristofer Franz´en, and thank Sonia Leach and Todd A. Gibson for LATEXassistance.",
        "Christian Blaschke, Mark Craven, Lorraine Tanabe, and again Kristofer Franz´en provided helpful data.",
        "We thank all of the corpus builders for their generosity in sharing their valuable resources."
      ]
    }
  ]
}
