{
  "info": {
    "authors": [
      "Yael Ravin"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P90-1033",
    "title": "Disambiguating and Interpreting Verb Definitions",
    "url": "https://aclweb.org/anthology/P90-1033",
    "year": 1990
  },
  "references": [
    "acl-J87-3001",
    "acl-J87-3005",
    "acl-J89-3002"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "To achieve our goal of building a comprehensive lexical database out of various on-line resources, it is necessary to interpret and disambiguate the information found in these resources.",
        "In this paper we describe a Disambiguation Module which analyzes the content of dictionary definitions, in particular, definitions of the form \"to VERB with NP\".",
        "We discuss the semantic relations holding between the head and the 'Prepositional phrase in such structures, as well as our heuristics for identifying these relations and for disambiguating the senses of the words involved.",
        "We present some results obtained by the Disambiguation Module and evaluate its rate of success as compared with results obtained from human judgements."
      ]
    },
    {
      "heading": "INTRODUCTION",
      "text": [
        "The goal of the Lexical Systems Group at IBM's Watson Research Center is to create COMPLEX, \"a lexical knowledge base in which word senses are identified, endowed with appropriate lexical information and properly related to one another\" (Byrd 1989).",
        "Information for COMPLEX is denvecl from multiple lexical sources so senses in one source need to be related to appropriate senses in the other sources.",
        "Similarly, the senses of defining words need to be disambiguated relative to the senses supplied for them by the various sources.",
        "(See Klavans et al., 1990.)",
        "Sense-disambiguation of the words found in dictionary entries can be viewed as a sub-problem of sense-disambiguation of text corpora in general, since dictionaries are large corpora of phrases and sentences exhibiting a variety of ambiguities, such as unresolved pronominal references, attachment ambiguities, and ellipsis.",
        "The resolution of these ambiguity problems in the context of dictionary definitions would directly benefit their resolution in other types of text.",
        "In order to solve the problem of lexical.ambiguity in dictionary definitions, we are investigating how to automatically analyze the semantics of these definitions and identify the relations holding between genus and differentia.",
        "This paper concentrates on one aspect of the task - the semantics of one class of verb definitions."
      ]
    },
    {
      "heading": "I. DISAMBIGUATING DEFINITIONS",
      "text": [
        "We have chosen to concentrate initially on definitions of the form \"to VERB with NP\" in Webster's 7th New Collegiate Dictionary (Merriam 1963; henceforth W7).",
        "Disambiguating these definitions consists of identifying the appropriate sense of \"with' (that is, the type of semantic relation linking the VERB to the NP) and choosing, if possible, the appropriate senses of the VERB and the NP-head from among all their W7 senses.",
        "For example, the disambiguation of the definition of angle(3,v1,1), \"to fish with a hook\", determines that the relation between fish and hook is use of instrument.' It also determines that the intended sense of fish is (vi,I)-\"to attempt to catch fish\" and the intended sense of hook is (n,1)-\"a curved or bent implement for catching, holding, or pulling\".",
        ")V7 lists 4 senses for intransitive fish and 4 for the noun hook.",
        "Together with the five senses of with (described in the next section), these yield 80 possible sense combinations for \"to fish with a hook\".",
        "In addition to contributing to the creation of COMPLEX, disambiguating strings of the form \"to VERB with NV' also contributes to the task of disambiguating prepositional phrases in free text, an important problem in lsiL processing.",
        "As is well known, parsing prepositional phrases (PPs) in free text is problematic because of the syntactic ambiguity of their attachment.",
        "It is usually impossible to determine on purely syntactic grounds which head a given PP attaches to from among all those that precede it in the sentence.",
        "Thus, sentences like \"the player hit the ball with the bat\" are usually parsed as syntactically ambiguous between \"with the bat\" as modifying the verb and its modifying the noun.",
        "One way to resolve the syntactic ambiguity is to fisrt resolve the semantic ambiguity that underlies it.",
        "To resolve it, we follow the approach proposed by Jensen & 'Knot (1987) and consult the dictionary definitions of the words involved.",
        "This approach differs from others that have been proposed for the Thus we differ From other attempts at disambiguating definitions, (such as Mshawi 1987), which leave these \"with' cases unresolved.",
        "disambiguation of polysemous words in context in that it accesses large published dictionaries rather than hand-built knowledge bases (as in Dalhgren & McDowell 1989).",
        "Moreover, it parses the information retrieved from the dictionary.",
        "Other approaches apply simple string matches (Lesk 1987) or statistical measures (Amster & Walker 1985).",
        "Consulting the dictionary for \"the player hit the ball with the bat\", we identify \"with the bat\" as meaning, among other things, the use of an implement and \"hit\" as a verb that can take a use modifier.",
        "These potential meanings favor an attachment of the PP to the verb.",
        "Furthermore, since no semantic connection can be established between 'ball\" and 'with the bat\" based on the dictionary, the likelihood of the verb attachment increases.",
        "Within this approach, we can view the disambiguation of the text of dictionary definitions as a subgoal of the general PP-attachment problem in free text.",
        "The structure of sentences like \"he hit the ball with the bat\" is \"to VERB NP with NV', where syntactic ambiguity arises between attachment to the verb and attachment to the syntactic object.",
        "These sentences differ from definition strings, which have the form of \"to VERB with NP\", lacking a syntactic object.",
        "Even definitions of transitive verbs, which are headed by transitive verbs, typically lack an object, as in bat (vt,1)-\"to strike or hit with or as if with a bat'.",
        "In the absence of an object, there is no attachment ambiguity, since there is only one head available (\"strike or hit\").",
        "However, semantic ambiguity still remains: lilt means both to strike and to score; \"bat\" refers both to a club and to an animal.",
        "We can view such strings as cases where attachment has already been resolved, and view their disambiguation as an attempt to supply the semantic basis for that attachment.",
        "Thus, obtaining the correct semantic representation for cases where attachment is known directly benefits cases where attachment is ambiguous.",
        "Our Disambiguation Module (henceforth DM) selects the most appropriate sense combination(s) in two parts: first, it tries to identify the semantic categories or types denoted by each sense of the VERB and the NP-head.",
        "It checks if the VERB denotes change, affliction, an act of covering, marking or providing.",
        "It tests whether the NP-head reters to an implement, a part of some other entity, a human being or group, an animal, a body part, a feeling, state, movement, sound, etc.",
        "Then it tries to identify the semantic relation holding between the VERB and NP-head.",
        "In the constructions we are interested in, the semantic relation between the two terms depends not only on their semantic categories but also on the semantics of with, which we discuss in the following section.3"
      ]
    },
    {
      "heading": "2. THE MEANING OF WITH",
      "text": [
        "To investigate the semantics of with, we turn to the linguistic literature on one hand and to lexicographical sources on the other.",
        "In the theoretical literature about prepositions and PPs, a syntactic distinction is made between PPs as complements of predicates and PPs as adjuncts.",
        "In traditional terms, a complement-PP is \"more closely related to the [predicate], which determines its choice, than to the prepositional complement\" (Quirk et al.",
        "1972).",
        "In current terms, complement-PPs are determined by the predicate and listed in its lexical (or thematic) entry, from which syntactic structures are projected.",
        "To assure correct projection, the occurrence of complements in syntactic structures is subject to various conditions of uniqueness and completeness (Chomsky 1981; Bresnan 1982).",
        "Adjuncts, by contrast, do not depend on the predicate.",
        "They freely attach to syntactic structures as modifiers and are not subject to these conditions.",
        "Although the syntactic distinction between complements and adjuncts is assumed by many theories, few provide criteria for deciding whether a given PP is a complement or adjunct.",
        "(Exceptions are Larson (1988) and Jackendoff (in preparation).)",
        "The theoretical status of with is particularly interesting in this context: It is generally agreed that some with-PPs (such as those expressing manner) are adjuncts and that others (like those occurring with \"spray/load\" predicates) are complements; but there is disagreement about the status of other classes, such as with-PPs expressing instruments.",
        "See Ravin (in press) for a discussion of this issue.",
        "The distinction between complements and adjuncts bears directly on our disambiguation problem, as we try to match it to our distinction between NP-based heuristics and VERB-based ones (see Section 3).",
        "In turn, the results provided by our DM put the various theoretical hypotheses to test, by applying them to a large amount of real data.",
        "Dictionaries and other lexicographical works typically explain the meaning of prepositions in a collection of senses, some involving semantic descriptions and others expressing usage comments.",
        "W7, for example, defines with(1) semantically: 'in opposition to; against",
        "Chad a fight with his brother')\"; it defines sense 2 by a usage comment: \"used as a function word to indicate one to whom a usu.",
        "reciprocal communication is made (\"talking with a friend\")\".",
        "W7 lists a total of 12 senses for with and various sub-senses.",
        "The Longman Dictionary of Contemporary English (Longman 1978; henceforth LDOCE) lists 20.",
        "Quirk et al.",
        "(1972) attempt to group the variety of meanings under a few general categories, such as means/instrument, accompaniment, and having.",
        "Others (Boguraev & Sparck Jones 1987, Collins 1987) offer somewhat different divisions into main categories.",
        "After reviewing the different characterizations of the meanings of with against a small corpus of verb definitions containing with, we have arrived at a set of five senses for it, corresponding to five semantic relations that can hold between the VERB and the NP-head in \"to VERB with NP\".",
        "Since we are concerned with verbs only, senses mentioned by our sources for \"NOUN with NP\" were not included (e.g., the \"having\" sense of Quirk et al., as in \"a man with a red nose\" or \"a woman with a large family\").",
        "Moreover, we have observed that certain common meanings of \"VERB with NP\" fail to occur in dictionary definitions.",
        "The accompaniment sense, for example, as in \"walk with Peter\" or \"drink with friends\", was not found in our corpus of 300 definitions .4 The five senses which we have identified are USE, MANNER, ALTERATION, CO-AGENCY/PARTICIPATION, and PROVISION, each including several smaller subclasses.",
        "Each sense is characterized by a description of the states of affairs it refers to and by some criteria which test it.",
        "As can be expected, however, the criteria are not always conclusive.",
        "There exist both unclear and overlapping cases.",
        "USE - examples are \"to fish with a hook\"; \"to obscure with a cloud\"; and \"to surround with an army\".",
        "With in this sense can usually be paraphrased as \"by means or or \"using\".",
        "The states of affairs in this categont involve three participants: an agent (usually the missing subject of the defirution), a patient (the missing object) and the thing used (the referent o \"with NP\").",
        "The agent usually manipulates, controls or uses the NP-referent and the NP-referent remains distinct and apart from the patient at the end of the action.",
        "The subclasses of USE are USE -OF-INSTRUMENT, -OF-SUBSTANCE, -OF-DODYPART, -OF-ANIMATE _BEING, -OP-OBJECT.",
        "MANNER - some examples are \"to examine with intent to verify\"; \"to anticipate with anx-iety\"; or 'to attack with blows or words\".",
        "\"With NP\" in this sense can be paraphrased with an adverb (e.g., 'anxiously\", \"violently\", \"verbally\") and it describes the way in which the agent acts.",
        "The MANNER subclasses are INTENTION-, SOUND-, MOTION-, FEELING or ATTITUDE-AS-MANNER.",
        "The distinction between USE and MANNER is usually quite straightforward but one class of overlapping cases we have identified has to do with verbal entities, such as \"retort' in \"to check or stop with a cutting retort\".",
        "Since verbal entities are abstract, they can be viewed as both being used by the agent as a type of instrument and describing how the action is performed.",
        "ALTERATION - examples are \"to mark with bars\"; \"to impregnate with alcohol\"; \"to fill with air\"; and \"to strike with fear\".",
        "In some cases, this sense can be paraphrased with \"make\" and an adjective (e.g., 'make full\", \"make afraid\"); in others, with \"put into/onto\" (e.g., \"put air into\"; \"put marks onto\").",
        "The states of affairs are ones in which change occurs in the patient and the NP-referent remains close to the patient or even becomes part of it.",
        "The subclasses are ALTERATION -BY-MARKING, -BY-COVERING, -BY-AFFLICTION, and CAUSAL ALTERATION.",
        "Cases of overlap between ALTERATION and USE are abundant.",
        "\"To spatter with some discoloring substance\" is an example of creating a change in the patient while using a substance.",
        "The definition of spatter itself indicates this overlap: \"to splash with or as if with a liquid; also to spoil in this way\".",
        "CO-AGENCY or PARTICIPATION - as in \"to combine with other parts\".",
        "Such strings can be paraphrased with \"and\" (\"one part and other parts combine\").",
        "The state of affairs is one in which there are two agents or participants sharing relatively equally in the event.",
        "PROVISION - as in \"to fit with clothes\"; and \"to furnish with an alphabet\".",
        "This sense can be paraphrased with 'give (and sometimes with \"to\" - \"to furnish an alphabet to\"), and it applies to states of affairs where the NP-referent is given to somebody by the agent.",
        "In addition to the five semantic meanings discussed above, there is also one purely syntactic function, PHRASAL, which with fulfills in verb-preposition combinations, such as 'invest with authority\".",
        "It can be argued that with in such cases simply serves to link the NP to the VERB.",
        "The DM disambiguates a given string by classifying it as an instance of one of these six categories, and thus selecting the appropriate sense combination of the words in the string.",
        "The process of disambiguation is a function of interdependencies among the senses of the VERB, the NP-head and with, as we show in the next section."
      ]
    },
    {
      "heading": "3. THE DISAMBIGUATION PROCESS",
      "text": [
        "The DM is an extended and modified version of an earlier prototype developed by Jensen and Binot for the resolution of prepositional-phrase attachment ambiguities (Jensen & Burnt 1987).",
        "It uses a syntactic parser, PEG (Jensen 1986), and a body of semantic heuristics which operate on the parsed dictionary definitions of the terms to be disambiguated.",
        "The first step in the disambiguation process is parsing the ambiguous string (e.g., \"to fish with a hook') by PEG and identifying the two relevant terms, the VERB and NP-head (fish and hook).",
        "Next, each of these terms is looked up in W7, its definitions are retrieved and also parsed by PEG.",
        "Heuristics then apply to the parsed definitions of the terms to determine their semantic categories.",
        "The heuristics contain a set of lexical and syntactic conditions to identify each semantic category.",
        "For example, the I STRUMENT heuristic for nouns checks if the head of the parsed definition is \"instrument\", implement', 'device ,\"tool\" or \"weapon\"; if the head is \"part\", post-modified by an of-pp, whose object is \"instrument\", Implement', etc.",
        "; if the head is post-modified by the participial \"used as a weapon\"; etc..",
        "If any of these conditions apply, that sense of the noun is marked + INSTRUMENT.' Next, each of the possible with-relations is tried.",
        "Let us take USE as a first example.",
        "To determine whether a USE relation holds in a particular string, the DM considers the semantic category of the NP-head.",
        "The most typical case is when the NP-head is + INSTRUMENT, as in \"to fish with a hook\".",
        "In this case, the relationship of USE is further supported by a link established between the NP-head definition and the VERB definition through catch: a hook is an \"... implement for catching, holding, or pulling\" and to fish is \"to attempt to catch fish\".",
        "(See Jensen & Binot 1987 for similar examples and discussion.)",
        "Such a link, however, is rarely found.",
        "In many other USE instances, it is the meaning of the NP-head alone that determines the relation.",
        "Thus, DM determines that USE applies to \"to attack with bombs' based on bomb(n,1)-\"an explosive device fused to detonate under specified conditions', although no link is established between attack and detonate.",
        "USE is also applied regardless of the VERB when the NP-head is + BODYPART and certain syntactic conditions (a definite article or a 3rd-person possessive pronoun) hold of the string, as in \"to strike or push with or as if with the head\" and \"to write with one's own hand\".",
        "USE is similarly assigned if the NP-head is + SUBSTANCE: \"to rub with oil or an oily substance' or \"to kill especially with poison\".",
        "MANNER, like USE, is also determined largely on the basis of the NP-head.",
        "It is assigned if the semantic category of the NP-head is a state (\"to progress with much tacking or difficulty\"); a feeling (\"to dispute with zeal, anger or heat\"); a movement (\"to move with a swaying or swinging motion\"); an intention (\"to examine with intent to verify\"); etc.",
        "Since USE and MANNER are largely determined on the basis of the semantic category of the NP, they correspond to adjuncts, in the theoretical distinction made between adjuncts and complements.",
        "By contrast, AL MR-ATio N, CO-AGENCY and PROVISION are determined mostly on the basis of the VERB and could be said to correspond to complements.",
        "(There are, however, many complications with this simple division, which we are currently studying.)",
        "To assign an ALTERATION relation to a string, the DM checks whether the VERB subcategorizes for an (optional) with-complement, based on information found in the online version of I,DOCE and whether the VERB denotes change.",
        "The first LDOCE sense of fill, 'to make or become full\", for example, fulfills both conditions.",
        "Therefore, ALTERATION is assigned in \"to become filled with or as if with air\", \"to fill with detrital material' and 'to become tilled with painful yearning'.",
        "ALTERATION also applies to other verb classes that are not marked for with-subcategorization in LDOCE, such as verbs denoting affliction (\"to overcome with fear or dread\") or actions of marking (\"to mark with an asterisk\").",
        "Finally, PHRASAL is assigned if a separate LDOCE entry exists for \"VERB with\", as in \"to charge with a crime\" and \"to ply with drink\".",
        "PHRASAL indicates that the semantic relation between the VERB and the NP is not restricted by the meaning of with but is more like the relation between a verb and its direct object.",
        "Since the heuristics for each semantic relation are independent of each other, conflicting interpretations may arise.",
        "There are cases of unresolved ambiguity, when different senses of one of the terms give rise to different interpretations.",
        "For example, \"to write with one's own hand\" receives a USE (-OF-BODYPART) interpretation but also a USE (-OF-ANIMATE BEING), which is incorrect but due to several W7 senses of hand which are marked + HUMAN (\"one who performs or executes a particular work\"; \"one employed at manual labor or general tasks\";",
        "\"worker, employee\", etc.).",
        "A general heuristic can be added to prefer a + BODYPART interpretation over a + HUMAN one, since this ambiguity occurs with other body parts too.",
        "Other instances of ambiguity, however, are more idiosyncratic.",
        "\"To utter with accent', for example, receives a MANNER interpretation (correct), based on accent(n,I)-\"a distinctive manner of usually oral expression\"; but it also receives USE(-0E-SUBSTANCE) (incorrect), based on accent(n,7,c)-\"a substance or object used for emphasis\".",
        "General heuristics cannot eliminate all cases of ambiguities of this kind.",
        "Another type of conflict arises when one semantic relation is assigned on the basis of the VERB while another is assigned on the basis of the NP-head.",
        "This is the case with \"to overcome with fear or dread\", for which the DM returns two interpretations: ALTERATION (correct) because the verb denotes affliction and MANNER (incorrect) because the NP denotes a mental attitude.",
        "For \"to combine or impregnate with ammonia or an ammonium compound' DM similarly returns ALTERATION (correct) because the verb is a causative verb of change and USE(-0E-SUBSTANCE) (incorrect) because the NP refers to a chemical substance.",
        "To handle this type of conflict, we have implemented a \"final preference\" heuristic which chooses the VERB-based interpretation over the NP-based one.",
        "Note, however, that this heuristic has implications for cases of overlap, such as \"spatter with a discoloring substance\", discussed above.",
        "When DM generates both the VP-based ALTERATION link and the NP-based link of USE for this string, the former would be preferred over the latter.",
        "Thus the fact that both links truly apply in this case will be lost.",
        "A third possible conflict arises between a PHRASAL interpretation and a semantic one.",
        "The DM returns PHRASAL-VERB (correct) and ALTERATION (incorrect) for \"to charge with a crime\", based on charge with-\"(especially of an official or an official group) to bnng a charge against (someone) for (something wrong); accuse or; and charge(with)-\"to (cause to) take in the correct amount of elec-tricity\".",
        "Since the existence of a PFIRASAL interpretation is an idiosyncratic property of verbs, there is no general heuristic for solving conflicts of this kind."
      ]
    },
    {
      "heading": "4. RESULTS",
      "text": [
        "We have developed our DM heuristics based on a training corpus of 170 strings - 148 transitive and 22 intransitive verb definitions extracted randomly from the letters a and b of W7 using a pattern extracting program developed by M. Chodorow (Chodorow & Klavans in preparation).",
        "The syntactic forms of the",
        "strings vary as can be seen from the following examples: \"to suffer from or become affected with blight\"; \"to contend with full strength, vigor, craft, or resources\"; \"to prevent from interfering with each other (as by a baffler However, since we submit the strings to the PEG parser and retrieve the VERB and NP-head from the parsed structures, we are able to abstract over most of the variations.",
        "Currently, the DM ignores multiple conjuncts in coordinate structures and considers only one VERB and one NP-head.",
        "In the future, all possible pairings should be considered (e.g. \"contend with strength\", \"contend with vigor, 'contend with craft', and so on, for the example mentioned above) and the results should be combined.",
        "As mentioned in Section 1, definition strings lack a syntactic object.",
        "The few strings that contain an object include it in parentheses (lo treat (flour) with nitrogent trichloride).",
        "This, again, is tolerated by the PEG parser, and allows us to assume that in all the strings the with-phrase attaches to the VERB rather than to the object.",
        "The DM results can be summarized as follows: The correct' semantic relation, based on the appropriate semantic category (of the NP-head or VERB), is assigned to 113 out of the 170 strings.",
        "Here are a few examples:",
        "We consider these 113 results to be completely satisfactory.",
        "In a second group of cases, the correct semantic relation, based on the appropriate semantic category, is one of 2 (and rarely of 3) semantic relations assigned to the string.",
        "There are 15 such cases.",
        "Here are two examples:",
        "The second interpretation is due to dog(n,3,a.",
        ")-\"any of various usually simple mechanical devices for holding, gripping, or fastening consisting of a spike, rod, or bar\".",
        "Lacking information about the frequency of different senses of words, we have at present no principled way to distinguish a primary sense (like the animal sense of dog) from more obscure senses (like the device sense).",
        "Make dirty with grime USE(-0E-S U BSTA NC E) correct (STATE-AS) MANNER incorrect The incorrect interpretation of grime as manner is due to the definition of its hypemyrn dirtiness as 'the quality or state of being dirty'.",
        "We consider this second group of cases, which are assigned two interpretations, to be partial successes, since they represent an improvement over the initial number of possible sense combinations even if they do not fully disambiguated them.",
        "In 37 cases, DM is unable to assign any interpretation.",
        "One reason is failure to identify the semantic category of the VERB or NP-head.",
        "For example, to pronounce with a burr\" should be assigned MANNER (SOUND), but the relevant definitions of burr read: \"a trilled uvular r as used by some speakers of English especially in northern England and in Scotland' and \"a tongue-point trill that is the usual Scottish r-, making it impossible for DM to identify it as a sound.",
        "(See discussion below) There are other reasons for failure: occasionally the NP-head is not listed as an entry in W, barking in \"to pursue with barking\" or drunkenness in \"to muddle with drunkenness or infatuation'.",
        "Even if we introduced morphological rules, identified the base of the derivational word and looked up the meaning of the base, the derived meaning in these cases would still not be obvious.",
        "Finally, a negligible number of failures is due to incorrect parsing by PEG, which in turn provides incorrect input for the heuristics.",
        "Failure to assign any interpretation does not, of course, count as success; but it does not produce much harm either.",
        "Far more dangerous than no assignment is the assignment of one incorrect interpretation, since incorrect interpretations cannot be differentiated from correct ones in any general or automatic way.",
        "Out of the set of 170 strings, only 5 are assigned a single incorrect interpretation.",
        "These are: press with requests (STATE-AS-) MANNER based on the fourth definition of request: \"the state of being sought after; demand\".",
        "Seize with teeth ALTERATION (BY-AFFLICTION) based on seize(vt,5,a)-\"to attack or overwhelm physically; afflict\".",
        "Speak with a burr USE(-0E-INSTRUMENT) based on burr(n,2,b,1)-\"a small rotary cutting tool\".",
        "where the semantic relation may seem correct, but the sense of light on which it is based (\"a flame for lighting something') is inappropriate.",
        "Possess with a devil USE(-0E-ANIMATE BEING) where the intended semarTtic relation is unclear (ALTERATION?)",
        "as is the semantic category of devil.",
        "However, the USE interpretation is clearly based on the several inappropriate + HUMAN senses of devil (\"an extremely and malignantly wicked person : fiend\"; 'a person of notable energy, recklessness, and clashing spirit\"; and others).",
        "As incorrect interpretations cannot be automatically identified as such, it is most important to design .the heuristics so that they generate as few incorrect interpretations as possible.",
        "One way of restricting the heuristics is by not considering the meaning of hypernyms, except in special cases.",
        "To return to \"pronounce with a burr\".",
        "We prefer to miss the fact that a burr, which is a trill, is a sound by ignoring the meaning of the hypemym trill than to have to take into account the meaning of all the hypernyms of burr.",
        "Considering the meaning of all the hypemy.ms will yield too many incorrect semantic interpretations for \"pronounce with a burr\".",
        "One hypernym of burr, weed, has a + HUMAN sense and a + ANIMAL sense; ridge, another hypernym, has a + BODYPART sense.",
        "Since results obtained with the training corpus were promising, we ran DM on a testing corpus: 132 definitions of the form \"to VERB with NP\" not processed by the program before.",
        "The results obtained with the testing corpus are compared below with those of the training corpus.",
        "The first column lists the total number of strings; the second, the number of strings assigned a single, correct interpretation; the third, the number of strings assigned two interpretations, one of which is correct; the fourth column shows the number of strings for which no interpretation was found, and the last column lists the number of strings assigned one or more incorrect interpretations (but no correct ones).",
        "TOT COR 1/2 0 INC TRAINING 170 113 15 37 5 TESTING 132 75 13 22 22 To measure the coverage of DM, we calculate the ratio of strings interpreted (correctly and incorrectly) to the total number of strings: COVERAGE RATIO TRAINING 133/170 (or 78.2%) TESTING 110/132 (or 83.3%) 'To measure the reliability of DM, we calculate the ratio of correct interpretations to incorrect ones: Suffuse with light USE 265 COR-TO-INC RATIO TRAINING 113/133 (or 85%) TESTING 75/110 (or 68%) If we include in the correct category those strings for which two interpretations were found (only one of which is correct), the reliability measure increases: COR+ 112-TO-INC RATIO TRAINING 128/133 (or 96.2%) TESTING 88/110 (or 80%) As expected, reliability for the testing material is lower than for the training set.",
        "This is due to the several iterations of fine-tuning to which the training corpus has been subjected.",
        "The examination of the testing results suggests some further fine-tuning, which is currently being 'implemented, and which will reduce the number of incorrect interpretations.",
        "Finally, we developed a criterion by which to measure the accuracy of our judgements of correctness.",
        "To ensure that our personal judgements of the correctness of the DM interpretations as reported above were neither idiosyncratic nor favorably biased, we compared them with the judgements of other human subjects, both linguists and non-linguists.",
        "We randomly selected 58 definition strings whose interpretation we judged to be correct and assigned each of them to 3-4 different participants for their judgements.",
        "Participants were asked to perform the same task as the module's, namely, for each definition string, select the relevant with-link from among the six we have stipulated and choose the relevant senses of the VERB and the NP-head from among all their W7 senses.",
        "We provided short explanations of the different with-links (based on the descriptions found here in Section 2) with a few examples.",
        "We allowed participants to choose more than one link if necessary, so that we can detect cases of overlap; we also allowed the choice of OTHER, if no link seemed suitable; or a question mark, if the siring seemed confusing.",
        "In 3 cases there was no consensus among the human judgements.",
        "Either 4 different choices of with-links or two question marks were given, as shown below: Affect with a blighting influence USE, PHRASAL, ALTERATION/PHRASAL,?",
        "Fill with bewildered wonder PROVISION, PHRASAL, ALTERATION, MANNER tit to or with a stock PROVISION, USE, ?, ?",
        "Even though the DM choice for these strings (deemed correct by us) coincided with one of the human choices, the variation is too large to validate the correctness of this choice.",
        "These 3 cases were therefore ignored.",
        "En 44 cases out of the remaining 55, there was (almost) unanimous agreement (3 or 4) among the human judgements on a single with-link.",
        "The DM choice was identical to 41 of those 44.",
        "That is, in 41 out of 44 cases, our own judgement of correctness coincides with that of others.",
        "The cases where we differ are: flavor, blend, or preserve with brandy 4 subjects out of 4: ALTERATION DM: USE face or endure with courage 2 subjects out of 3: MANNER third subject: MANNER/USE DM: USE strengthen with or as if with buckram 4 subjects out of 4: ALTERATION DM: USE In the remaining 11 strings, there was an even split in the human judgements between two with-links, indicative to some extent of genuine overlap.",
        "For example, treat with a bromate' was interpreted as USE by two participants and as ALTERATION by two others.",
        "One participant explained that his choice depended on the implied object: he would categorize treating a patient with medicine as USE but treating a metal with a chemical substance as ALTERATION.",
        "The DM choice was identical to one of the two alternative human choices in 10 out of these 11 strings.",
        "That is, in 10 out of 11 cases, our judgement of correctness fits one of the two choices made by others.",
        "To summarize, our judgements of correctness were validated by others in 51 cases out of 56 (or 91 %).Our practical conclusion from this experiment is simply that our semantic judgements concerning the meaning of with in context coincides with those of others often enough to allow us to rely on our intuitions when informally evaluating the results of our program.. More generally, this experiment seems to indicate that people reach consensus on the meaning of prepositions once they are given a set of alternatives to choose from, even though they may find it very difficult to define the meaning of prepositions themselves.",
        "The significance of the unclear cases and the overlap cases in the experiment requires further study."
      ]
    },
    {
      "heading": "CONCLUSION",
      "text": [
        "As our evaluations indicate, the DM which we are developing is quite successful in identifying the correct semantic relation that holds between the terms of a definition string.",
        "In identifying this relation, the DM also par",
        "tinily disambiguates the senses of the definition terms.",
        "In assigning MANNER, for example, to \"utter with accent\", DM selects two senses of accent as relevant, from among the nine listed in its W7 entry.",
        "In assigning ALTERATION to \"mark with a written or printed accent\", it selects 3 completely different senses of accent as relevant.",
        "'Thus, the same noun (accent), occurring in identical syntactic structures (\"VERB with NP\") is assigned different sense(s), based on its semantic link to its head.",
        "Interpreting the semantic relations between genus and differentia and disambiguating the senses of defining terms are both crucial for our general goal - the creation of a comprehensive, yet disambiguated, lexical database.",
        "There are other important applications: the heuristics that have been developed for the analysis of dictionary definitions should be helpful in the disambiguation of PPs occurring in free text, In cases of syntactic ambiguity, the need to determine proper attachment is evident.",
        "In addition, we should point out that there is a need to identify the semantic relation between a head and a PP, even when attachment is clear.",
        "In translation, for example, resolving the semantic ambiguity of a source preposition is needed when ambiguity cannot be preserved in the target preposition.",
        "Finally, we hope that the computational disambiguation of the meanings of prepositions will contribute interesting insights to the linguistic issues concerning the distinction between adjuncts and complements."
      ]
    },
    {
      "heading": "ACKNOWLEDGMENTS",
      "text": [
        "I thank John Justeson (Watson Research Ctr., IBM), Martin Chodorow (Hunter College, CU NY), Michael Gunther (ASD, IBM) and Howard Sachar (ESD, IBM) for many critical comments and insights."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
