{
  "info": {
    "authors": [
      "Chu-Ren Huang",
      "Keh-Jiann Chen",
      "Yun-Yan Yang"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1088",
    "title": "Character-Based Collocation for Mandarin Chinese",
    "url": "https://aclweb.org/anthology/C94-1088",
    "year": 1994
  },
  "references": [
    "acl-C92-1019",
    "acl-C92-4194",
    "acl-J90-1003",
    "acl-J93-1001",
    "acl-J93-3004"
  ],
  "sections": [
    {
      "text": [
        "This paper describes a characters-based Chinese collocation system and discusses the advantages of it over a traditional word-based system.",
        "Since wordbreaks arc not conventionally marked in Chinese text corpora, a character-based collocation system has the dual advantages of avoiding preprocessing distortion and directly accessing sub-lexical information.",
        "Furthermore, word-based collocational properties can be obtained through an auxiliary module of automatic segmentation."
      ]
    },
    {
      "heading": "I. Introduction",
      "text": [
        "Collocation has been established as an essential tool in computational linguistics (Church and Mercer 1993).",
        "In addition, various collocational programs have been proven to be indispensable in automatic acquisition of lexical information (e.g. Sinclair 1991, and Bibcr 1993).",
        "Since words arc the natural and undisputed units in available text corpora, virtually all the current collocational programs are word-based.",
        "However, there are languages where texts do not conventionally mark words, such as Chinese.",
        "Unless a large tagged corpus is available, a word-based collocation system in these languages faces the following inevitable difficulties.",
        "First, hand-segmentation of a large corpus is tedious and financially nearly impossible.",
        "Second, automatic segmentation program can neither identify words not listed in the lexicon nor correctly segment all which are listed.",
        "Third, estimation of lexical probability relics on word-frequency counts based on the inaccurate results of automatic segmentation thus the deviation tends to be greater than standard tolerance.",
        "Text corpora without wordbreaks, nevertheless, also has their advantages.",
        "Take Chinese for example, the basic units of text corpora are zi4 'character', a fairly faithful representation of the morphemic level of the language.",
        "In other words, if we take Chinese text corpora as they are, we will be able to access sub-lexical information without additional cost.",
        "To take the full advantage of the nature of texts, reliable tools can also be devised to obtain lexical collocation.",
        "In this paper, we will describe the design and implementation of a Chinese collocational system that does not require the preprocessing of automatic segmentation but is able to allow both lexical and sub-lexical information be automatically extracted.",
        "II.",
        "Background: Corpus and Computational Platform This collocation system is developed on the 20 million character modern Chinese corpus at Academia Sinica (Huang and Chen 1992, Huang In Press).",
        "This corpus is composed mostly of newspaper texts.",
        "It is estimated to have 14 million words.",
        "Following industrial standard in Taiwan, our collocation system can deal with any corpora encoded by BIG-5 code.",
        "The program is developed under a UNIX environment on HP workstation.",
        "It should, however, be portable to any UNIX machine with compatible Chinese solution.",
        "The collocation system is currently used in research by more than 10 linguists affiliated with the Chinese Knowledge Information Processing (CKIP) group at Academia Sinica.",
        "It is also open to any visiting scholar for on-site use.",
        "III.",
        "Overall Design of the System There .are two major modules in the collocation system: one deals directly with unsegmented texts and the other which incorporates automatic segmentation before collocation.",
        "The two modules share the pre-process of KWIC search module, which allows user-specified linguistic patterns (Huang and Chen 1992).",
        "They also share three common routines to detect character collocation, to identify possible collocation words through N-grams, and to contextually filter texts with user-specified strings.",
        "The overall design of the system is schematically represented in diagram 1.",
        "IV.",
        "Collocation Without Segmentation There arc three collocational tools available in tins system without segmenting the texts into words.",
        "First, character collocation allows automatic acquisition of sub-lexical information, such as the conditions on mor-pho-lexical rules.",
        "This is attested by the studies on the notion of word in the mental lexicon reported in Huang et al.",
        "(1993), and the generalizations of productive derivational rules in Mandarin offered in flung et al.",
        "(1992).",
        "Take note that when applying KWIC search to the corpus, a user has the freedom to specify a key that is a single character, a multi-character string, or even a discontinuous string of characters.",
        "These character strings may or may not be words.",
        "Thus the extracted collocational relation is not simply between characters.",
        "It can also be between characters and either a simplex word, a compound, or a phrase.",
        "The collocational relation in our system is measured and represented by both Mutual Information (Church and hanks 1990) and frequency.",
        "The user can choose to sort and rank the.",
        "collocates by either criteria.",
        "S/he can also specify threshold value by either criteria.",
        "Usually, the most effective method is to use frequency threshold and Mutual Information ranking (I luang In Press).",
        "In addition to the measures or correlation, distribution of the collocates is also indicated in terms of positions relative to the key and frequency of occurrences at each position for each collocating character.",
        "Second, lexical information can also be derived .from this collocational system regardless of its lack of demarcation of lexical items.",
        "This is achieved through a simple Markov model.",
        "Once the KWIC search extracted the relevant contexts, a simple N-gram routine can be performed on the context(s) specified by the user.",
        "Depending on the purpose of the study and the size of relevant texts, the length of the target sequence as well as the threshold number can be specified.",
        "tkr instance, a linguist may want to look for all two or three character sequences that occur over 5 times after a key verb.",
        "This would likely turn out a list of possible arguments (i.e. syntactic words) for that verb.",
        "Hence lexical information such as semantic restriction of the predicates on its post-arguments can be indirectly extracted.",
        "In our system, the user is allowed to iterate the N-gram search by designating different contexts and string length (N).",
        "The following is an example of collocation without segmentation.",
        "Huang et al.",
        "(1994) argue that Mandarin light verbs select the verbs they nominalize.",
        "This is supported by the N-grain collocation results in diagram 2.",
        "The collocation is extracted from a 20 million character corpus and the collocation window is 5 characters to the right of the key word.",
        "It shows that the verb jin4.ving2 typically nominalizes a process verb.",
        "Diagram 2.",
        "N-gram Collocation (By Frequency) Hi-syllabic Collocation with the verb jin4xing2 gonglzuo4 'to work' 437 diao4cha2 'to investigate' 354 gong I cheng2 'engineering work' 233 tao3 lo n4 'to discuss' 223 goultong l 'to communicate' 198 x ie2tiao2 'to coordinate' 185 yan2jiu4 'to study' 185 I i ao3j ie3 'to understand' 166 gue I hua4 'to plan' 156 x ie2shangl 'to negotiate' 154 Last, the user can specify a character string in the context as a filter.",
        "The most useful application is to specify a string that forms a syntactic word.",
        "This is a technique commonly used to resolve categorical or sense ambiguities.",
        "Combining both N-gram search and string filtering, frequency-based word collocation is achieved without segmentation.",
        "V. Collocation After Segmentation When lexical or phrasal relation is the focus of the study, the above collocation module may sometimes be",
        "inadequate.",
        "In this case, we will need to apply the automatic segmentation/tagging program such that we can acquire information involving word pairs as well as grammatical categories.",
        "The automatic segmentation procedure is an revised version of the program reported in Chen and Liu (1992).",
        "The on-line lexicon is the CKIP lexicon of more than 80 thousand entries (Chen 1994).",
        "We did not automatically segment and tag the whole corpus for very good reasons.",
        "First, without a correctly tagged corpus, no statistically-based tagger can perform satisfactorily yet.",
        "Second, there is no practical way to recover incorrectly identified words.",
        "That is, when the automatic tagger takes a character from a target word to form an inappropriate word with a neighboring character; that target word is lost and cannot be identified in this context.",
        "Thus, it will be linguistically more felicitous to allow KWIC to identify all matching strings and allow filtering of incorrect matched words in later steps.",
        "Last, segmented texts restrict the available collocation information exclusively at word level.",
        "For instance, not only morpheme-morpheme collocation will not be available, neither can correlations between a morpheme and a word be extracted.",
        "In contrast, when optional segmentation is performed on-line on the result of KWIC search, the collocational system can be applied to any electronic text corpora with minimal preprocessing.",
        "This current approach also allows us to mix sub-lexical, lexical, and extra-lexical conditions according to our research need.",
        "Even though the post-segmentation module shared three routines with the module without segmentation, they do differ non-trivially in their applications.",
        "First, the character collocation module is basically the same.",
        "The additional step of segmentation excludes accidental string matches.",
        "For instance, with qu4shi4 'to pass away' as the keyword, KWIC may extract the incorrect context '!al qu4 shi4 jie4 ge4 di4 1u3 xing2'.",
        "This error in identifying word boundaries can be easily avoided when the text is correctly segmented.",
        "In this case, the correct segmentation is '101 qu4 shi4jie4 ge4di4 1u3xing2 (s/he go world everywhere travel)'.",
        "Second, N-gram in this module now can include both sequences of characters and sequences of words.",
        "Two additional tools directly utilize grammatical tags.",
        "The first one is the computing of the distribution of grammatical categories in the context.",
        "The second is contextual filtering in terms of grammatical categories.",
        "One caution needs to be mentioned here.",
        "As mentioned earlier, we do not have a highly reliable automatic tagger yet because there is no dependably tagged large Chinese corpus.",
        "Hence our automatic segmentation program looks up the categories of the words but do not attempt to resolve ambiguity.",
        "Since categorically ambiguous words make up only around 20% of the texts (Chen and Liu 1992, Chen et al. In Preparation), keeping all possible tags seem to be an acceptable compromise for the moment.",
        "But this also means that a user must be on the lookout for possible errors caused by multiple tags.",
        "Our system allows the user to view the categorical distribution of the whole context, as well as to focus on a smaller context and specific categories.",
        "Diagram 3 shows the categorical collocation of the head of the post-verbal argument of huo4de2 'to get/ receive.'",
        "We obtained this information by first perform the discontinuous KWIC on huo4de2 and the relative clause head marker de.",
        "After segmentation and collocation, we restrict the display to the first position to the right of de, and to the two major categories of N and V. The result shows that this verb typically take subclasses of common noun and (nominalized) transitive verbs as arguments.",
        "Last, the word-based collocation system is the part of our system that will take the most processing capacity.",
        "This is also the only part of our system that is still being tested at this moment.",
        "Word frequencies of our corpus have already been calculated and stored.",
        "The automatically segmented word-based collocation module should be available for linguistic research within weeks.",
        "VI.",
        "Conclusion In this paper, we described a collocation system that works on text corpora without word marks.",
        "This system has the advantage of extracting sub-lexical information.",
        "This is also particularly useful in studying Chinese language corpora since sociological words are distinct from syntactic words in Chinese (Chao 1968).",
        "Thus in linguistic and literary computing, it is often necessary to formulate generalizations based on zi4, the sociological word.",
        "The techniques reported in this paper should also find applications in two aspects of future computational linguistic research.",
        "First, it can be applied to other language text corpora for extraction of sub-lexical collocation.",
        "Second, it can be applied to text corpora",
        "which do not come with clear word demarcation: including corpora in languages in which sociological words and syntactic words do not coincide and spoken corpora.",
        "Acknowledgements Research of this project was partially funded by the Chiang Ching-kuo Foundation for International Scholarly Exchanges, the National Science Council of R.O.C., and Academia Sinica.",
        "We would like to thank I,i-ping Chang and other colleagues at CKIP for their help and comments.",
        "Responsibility of any remaining errors is ours alone."
      ]
    },
    {
      "heading": "Bibliography",
      "text": []
    }
  ]
}
