{
  "info": {
    "authors": [
      "Debasri Chakrabarti",
      "Hemang Mandalia",
      "Ritwik Priya",
      "Vaijayanthi Sarma",
      "Pushpak Bhattacharyya"
    ],
    "book": "COLING – Posters",
    "id": "acl-C08-2007",
    "title": "Hindi Compound Verbs and their Automatic Extraction",
    "url": "https://aclweb.org/anthology/C08-2007",
    "year": 2008
  },
  "references": [
    "acl-W07-1104"
  ],
  "sections": [
    {
      "text": [
        "Computer Science and Engineering Department IIT Bombay pb@cse.iitb.ac.in",
        "We analyse Hindi complex predicates and propose linguistic tests for their detection.",
        "This analysis enables us to identify a category of V+V complex predicates called lexical compound verbs (LCpdVs) which need to be stored in the dictionary.",
        "Based on the linguistic analysis, a simple automatic method has been devised for extracting LCpdVs from corpora.",
        "We achieve an accuracy of around 98% in this task.",
        "The LCpdVs thus extracted may be used to automatically augment lexical resources like wordnets, an otherwise time consuming and labour-intensive process"
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Complex predicates (CPs) abound in South Asian languages [Butt, 1995; Hook, 1974] primarily as either, noun+verb combinations (conjunct verbs) or verb+verb (V+V) combinations (compound verbs).",
        "This paper discusses the latter.",
        "Of the many V+V sequences in Hindi, only a subset constitutes true CPs.",
        "Thus, we first need diagnostic tests to differentiate between CP and non-CP V+V sequences.",
        "Of the CPs thus isolated, we need to distinguish between those CPs that are formed in the syntax (derivationally) and those that are formed in the lexicon (LCpdVs) in order to include only the latter in lexical knowledge bases.",
        "Further, automatic extraction of LCpdVs from electronic corpora and their inclusion in lexical knowledge bases is a desirable goal for languages like Hindi, which liberally use CPs.",
        "This paper discusses Hindi Verb+Verb (V+V) CPs and their automatic extraction from a corpus.",
        "Alsina (1996) discusses the general theory of complex predicates.",
        "Early work on conjunct and compound verbs in Hindi appears in Burton-Page (1957) and Arora (1979).",
        "Our work on diagnostic tests for CPs, as reported here, has been inspired by Butt (1993, 1995 for Urdu) and Paul (2004, for Bengali).",
        "The analysis of lexical derivation of LCpdVs derives from the work on compound verbs by Abbi (1991, 1992) and Gopalkrishnan and Abbi (1992).",
        "This work is motivated primarily by the need to automatically augment lexical networks such as the Princeton Wordnet (Miller et al., 1990) and the Hindi Wordnet (Narayan et al., 2002).",
        "Paşca (2005) and Snow et al. (2006) report work on such augmentations by processing web documents.",
        "To the best of our knowledge ours is the first attempt at automatic extraction of LCpdVs from Hindi corpora.",
        "Section 2 discusses CPs in Hindi and the ways to distinguish them from other, similar looking, constructions.",
        "Section 3 discusses the automatic extraction of CPs from corpora.",
        "Section 4 concludes the paper."
      ]
    },
    {
      "heading": "2. V+V Complex Predicates in Hindi",
      "text": [
        "We have identified five different types of V+V sequences in Hindi.",
        "These are:",
        "1.",
        "V1 stem+V2: maar Daalnaa (kill-put) 'kill'.",
        "2.",
        "V1 inf-e+lagnaa: rone lagnaa (cry-feel) 'start crying'.",
        "3.",
        "V1 inf+paRnaa: bolnaapaRaa (say-lie) 'say'.",
        "4.",
        "V1 inf-e+V2: likhne ko/ke lie kahaa 'asked to write'.",
        "5.",
        "V1-kar+V2: lekar gayaa 'took and went'.",
        "Following Butt (1993) and Paul (2004), we use the following diagnostic tests to identify CPs in"
      ]
    },
    {
      "heading": "1.. Scope of adverbs",
      "text": []
    },
    {
      "heading": "2.. Scope of negation",
      "text": []
    },
    {
      "heading": "3.. Nominalization",
      "text": []
    },
    {
      "heading": "4.. Passivization",
      "text": []
    },
    {
      "heading": "5.. Causativization",
      "text": []
    },
    {
      "heading": "6.. Movement",
      "text": [
        "(see Appendix A for an example of these tests)",
        "The tests above have been exhaustively applied to varied data.",
        "The results of these tests show that some V+V sequences function as single semantic units and others do not.",
        "They also show that the V1stem+V2, V1inf-e+lagnaa and V1inf+paRnaa sequences show similar properties and the V1 inf-e+V2 stem and the V1-kar+V2 behave similarly.",
        "We call these Group 1 and Group 2 respectively.",
        "Group 1 sequences are true CPs in Hindi.",
        "The V+V sequences are simple predicates (mono-clausal) with one subject.",
        "Group 2 constructions are not CPs.",
        "They show clausal embedding and each verb behaves as if it were an independent syntactic entity.",
        "In the next section we summarize the semantic properties of CPs (Group 1).",
        "After identifying the CPs from among different V+V sequences, the next step was to determine how they are formed.",
        "To accomplish this we examined the semantic properties of the second verbs (V2) in Group 1:",
        "Examples include karnaa paRaa 'do-lie (had to do)', bolnaa paRaa 'say-lie (had to say)' etc.",
        "The second verb is always paRnaa 'to lie (lay)'.",
        "It appears in its stem form and bears all the inflections.",
        "As V2, paRnaa has the meaning of compulsion/force.",
        "paRnaa 'lie' as a V2 can be combined with any V1 irrespective of the latter's semantic properties.",
        "Since there are no syntactic or semantic restrictions on the selection of V1, this construction should be treated in the syntax as a combination of a V1 and a modal auxiliary.",
        "Examples include karne lagaa 'do-feel (start to do)', bolne lagaa 'say-feel (start to say)' etc.",
        "The V2 in this sequence is always lagnaa 'feel' in the bare form and carries all the inflections.",
        "The core meaning of lagnaa 'feel' is lost when it is combined with a V1.",
        "As a V2 it always has the meaning of beginning, happening of an event.",
        "lagnaa 'feel' as a V2 can be combined with any V1 irrespective of the latter's semantic properties.",
        "Thus, this is also an instance of a modal auxiliary and should be derived in the syntax.",
        "In the formation of V1 stem+V2, the V2 may be any one of ten verbs, as shown in Figure 1.",
        "All these V2s also occur as main verbs.",
        "As V2, the core meaning of these verbs is lost (bleached), but they acquire some new semantic properties which are otherwise not seen (Abbi, 1991, 1992; Gopalkrishnan and Abbi, 1992).",
        "The semantic properties of V2s include finality, definiteness, negative value, manner of the action, attitude of the speaker etc.",
        "The combination of V1 and V2 is subject to the semantic compatibility between the two verbs.",
        "1.",
        "Daalnaa 'put'",
        "2.",
        "lenaa 'take'",
        "3.",
        "denaa 'give'",
        "4.",
        "uThnaa 'wake\"",
        "5.",
        "jaanaa 'go'",
        "6.",
        "paRnaa 'lie'",
        "7.",
        "baiThnaa 'sit'",
        "8.",
        "maarnaa 'kill'",
        "9.",
        "dhamaknaa 'throb",
        "10.",
        "girnaa 'fall'",
        "The argument structure of the CP is determined by V1 as is the case-marking on the internal arguments, but the case-marking on the external argument (subject) is determined by both verbs.",
        "From this analysis we conclude that V+V CPs are formed both lexically and syntactically in Hindi.",
        "Detailed investigation shows us that the V2 in the V1inf-e+lagnaa and the V1inf+paRnaa constructions is a type of modal auxiliary and its semantic features are predictable and unvarying.",
        "We propose to deal with these verbs in the syntax and call these verbs syntactic compound verbs (SCpdVs).",
        "The V2 choice in the V1stem+V2 is not predictable and the CPs function as a single complex of syntactic and semantic features.",
        "We call these verbs lexical compound verbs (LCpdVs) and we propose to include them in the lexical knowledge base.",
        "In the next section we provide a heuristic for automatic extraction of LCpdVs for storage in the lexicon.",
        "By scanning the corpus, V1stem+V2 sequences were found given the heuristic H* specified in Figure 2.",
        "(Heuristic H*) If a verb V1 is in the stem form and is followed by a verb V2 from a prestored list of verbs that can form the second component of the CP (section 2.2, Figure 3), i.e., the 'vector', then this verb along with the V2 is taken to be an instance of an LCpdV.",
        "Ten native speakers of Hindi were consulted.",
        "They were asked to construct sentences with the extracted sequences.",
        "If they were able to do so, that sequence was registered as a true LCpdV.",
        "The precision of the heuristic is calculated as the ratio of the actual LCpdVs arrived at through manual validation to the total number of anticipated LCpdVs identified by the heuristic.",
        "The results of these calculations are shown in Table 1, with a precision rate of 70% for the BBC corpus and 79% for the CIIL one.",
        "The loss in precision was caused by (i) part of speech ambiguity, (ii) passivisation and (iii) idiomatic usages.",
        "For lack of space, we do not discuss this here.",
        "When measures were taken to remedy these errors, we reached an accuracy of close to 98% (see table 2).",
        "A partial list of LCpdVs extracted from a test run on the CIIL corpus is presented in Table 3."
      ]
    },
    {
      "heading": "3. Conclusions and Future Work",
      "text": [
        "In this paper, we have presented a study of Hindi compound verbs, proposed diagnostic tests for their detection and given automatic methods for their extraction from a corpus.",
        "Native speakers verify that the accuracy of our method is close to 98% on representative corpora.",
        "BBC",
        "40",
        "8",
        "4",
        "28",
        "0.7 (28/4",
        "0)",
        "CIIL",
        "174",
        "32",
        "7",
        "135",
        "0.79",
        "(135/ 174)",
        "BBC",
        "CIIL",
        "Confirmed LCpdVs",
        "423",
        "953",
        "(A)",
        "Not LCpdVs (B)",
        "13",
        "12",
        "Different POS (C)",
        "65",
        "179",
        "Possible LCpdVs but contexts insufficient",
        "(D)",
        "44",
        "36",
        "Minimum Precision",
        "0.88",
        "0.95",
        "(A/(A+B+D))",
        "(423/480)",
        "(953/1001)",
        "Maximum Precision",
        "0.97",
        "0.99",
        "((A+B)/(A+B+D))",
        "(467/480)",
        "(989/1001)",
        "Total V1stem+V2",
        "constructions in the corpus",
        "10,145",
        "36,115",
        "Table 2: Final results of LCpdV extraction",
        "baandh denaa",
        "'tie'",
        "Kar",
        "lenaa",
        "'do'",
        "Bhar",
        "denaa",
        "'fill'",
        "le jaanaa 'take'",
        "Banaa denaa",
        "'make'",
        "jaan",
        "lenaa 'know'",
        "kaaT",
        "denaa",
        "'cut'",
        "Kar denaa 'do'",
        "Badal",
        "jaanaa 'change'",
        "Bhuul",
        "jaanaa 'forget'",
        "jalaa",
        "denaa",
        "'burn'",
        "Gir",
        "jaanaa 'fall'",
        "Samajh lenaa 'understand'",
        "Samjhaa denaa 'make understand'",
        "Khod",
        "lenaa 'dig'",
        "lauTaa",
        "denaa",
        "'return'",
        "Rah",
        "jaanaa",
        "'stay'",
        "Le lenaa 'take'",
        "De denaa",
        "'give'",
        "ghusaa",
        "denaa",
        "'enter'",
        "Cor-",
        "To-",
        "POS",
        "Pas-",
        "LCpdVs",
        "Preci",
        "pus",
        "tal",
        "ambi",
        "sive",
        "(manu-",
        "sion",
        "de-",
        "gui-",
        "forms",
        "ally",
        "tec-",
        "ties",
        "de-",
        "tio",
        "tected)",
        "ns",
        "Future work will consist in inserting the extracted LCpdVs into lexical resources such as the Hindi wordnet at the right places with the right links.",
        "Verb",
        "Example",
        "Comment",
        "Type",
        "V1",
        "us-ne jaldii",
        "Scope over",
        "stem+",
        "jaldii",
        "the whole",
        "V2",
        "khaa li-",
        "aa'(S)he",
        "ate",
        "quickly.'",
        "sequence",
        "V1inf-",
        "vah jaldii",
        "Scope over",
        "e+ lag-",
        "se khaan-e",
        "the whole",
        "naa",
        "lag-aa 'He started eating immediately.'",
        "sequence",
        "V1",
        "inf+",
        "mujhe yah kaam jaldii",
        "Scope over the whole",
        "paRnaa",
        "karnaa paR-aa 'I had to do the work quickly.'",
        "sequence",
        "V1inf-",
        "us-ne mu-",
        "Either over",
        "e+V2",
        "jhe khat",
        "V1 or V2 de-",
        "jaldii se likhn-e",
        "pends upon the syntactic",
        "kah-aa 'He",
        "position of",
        "asked me",
        "the adverb",
        "to write the",
        "letter quickly.'",
        "V1-",
        "vah jaldii",
        "Either over",
        "kar+",
        "se nahaa-",
        "V1 or V2 de-",
        "V2",
        "kar aa-",
        "pends upon",
        "yeg-aa",
        "the syntactic",
        "'He will",
        "position of",
        "take bath",
        "the adverb",
        "quickly and come.'"
      ]
    }
  ]
}
