{
  "info": {
    "authors": [
      "Dong-Il Kim",
      "Zheng Cui",
      "Jinji Li",
      "Jong-Hyeok Lee"
    ],
    "book": "SIGHAN Workshop on Chinese Language Processing",
    "id": "acl-W02-1807",
    "title": "A Knowledge Based Approach to Identification of Serial Verb Construction in Chinese-To-Korean Machine Translation System",
    "url": "https://aclweb.org/anthology/W02-1807",
    "year": 2002
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstraction",
      "text": [
        "In Chinese language processing, the recognition and analysis for serial verb constructions (SVCs) is a fascinating research topic.",
        "Chinese language researchers each may have a different definition and interpretation of SVC since the structure of SVC makes Chinese unique to other languages and contains complex semantic and pragmatic information.",
        "This paper proposes a formal definition of SVC and a knowledge based approach for the recognition of SVCs, which is adopted in TOTAL-CK, a transfer-based MT system from Chinese to Korean.",
        "The recognition process is carried out in two stages: the analysis stage classifies SVCs into general categories, and the transfer stage performs further classification for Korean transfer.",
        "Some evaluation result for each stage was also given with statistics of each category of SVCs"
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "Many Chinese language researchers have paid special attention to the so-called ‘serial verb constructions (SVCs)’, where two or more semantically or pragmatically related verb phrases or clauses are juxtaposed together without any functional marker.",
        "Because of different definitions and interpretations of SVCs among researchers, their categorizations differ according to researchers’ viewpoints.",
        "∗ Also an assistant professor at Yanbian University of Science & Technology (YUST) Yanji, Jilin, China.",
        "∗∗ Also a lecturer at YUST In a Chinese to Korean machine translation, the hidden relation of the serial verbs should be expressed with some function words from the target language viewpoint.",
        "Moreover, the conceptual scope of these function words is different from the scope of SVC categorizations that are classified based on the viewpoint of the Chinese language itself.",
        "In this paper, we proposes a different categorization of SVCs defined by the contrastive analysis of the two languages, and also an SVC identification method that is adopted in a Chinese-to-Korean MT system, TOTAL-CK.",
        "The TOTAL (Translator Of Three Asian Languages: Chinese, Korean and Japanese) project has been conducted under a hybrid strategy with transfer-based and example-based engines."
      ]
    },
    {
      "heading": "1. Language Characteristics between Chinese and Korean",
      "text": [
        "In this section, some contrastive analyses of the two languages are introduced for better understanding of an SVC sentence.",
        "Since Chinese is an isolating language, morphological or syntactic markers rarely appear in a sentence, while in an agglutinative language such as Korean, these functional markers are not an optional unit but an obligatory unit in a sentence.",
        "An example is given in (1).",
        "Notice that the Korean alphabets are written with Yale Romanization in this paper.",
        "He opens the door and enters (the room).",
        "In the Korean sentence, ko is a connective particle, and also nun, ul, and nta denote a topic auxiliary particle, an object case particle and declarative terminative ending, respectively.",
        "All these functional markers should be decided in the Korean transfer stage.",
        "Specifically, we require a process to select one from the possible conjugational markers when a Chinese SVC sentence is transferred to its Korean counterpart."
      ]
    },
    {
      "heading": "2. Related Works",
      "text": [
        "A SVC is studied among several researchers as different names.",
        "But the general syntactic form is (NP) V1 (NP) V2 (NP)1.",
        "The variance of definition for SVC comes from the different scope of interpretation for the sentence pattern.",
        "We will introduce three typical researches to clearly outline our definition of SVC.",
        "The narrowest view of scope is suggested in (Lü, 1953).",
        "In his interpretation, V1 and V2 have the same subject and should be not coordinative, but it is difficult to decide which one is main or additional.",
        "Zhu (Zhu, 1981) includes all cases of Lü’s and the possibility of adding an adjective to substitute for the second verb position.",
        "He also includes the case where an additional verb and a main verb are used, such as V+ 着 expression in V1 position, which indicates that V1 is additional and V2 is main.",
        "The broadest scope is proposed in (Li & Thompson, 1981).",
        "According to his interpretation, an SVC includes not only all the patterns noted above but also a pivot construction, a subject/object clause, and a coordinate clause, but excludes the pattern with an adjective in the V2 position.",
        "In this paper, the scope of SVC is almost same as Li’s but the classification of SVCs differs slightly, detailing the categorization in chapter 4.",
        "A few computational solutions to identifying SVCs have been proposed by some researchers.",
        "A formal description is shown in (Chan, 1998) using time lapse notation and the related definition.",
        "However, her method makes it difficult to computationally detect SVCs without the resources containing the deep level of",
        "analysis of each lexical, which is not obtainable in the current stage of language processing."
      ]
    },
    {
      "heading": "3. Overview of TOTAL-CK System Architecture",
      "text": [
        "As a typical transfer system, TOTAL-CK consists of three parts: Chinese analysis, dependency tree transfer, and Korean generation.",
        "The system architecture of TOTAL-CK is shown in figure 1.",
        "The design principles and the detail descriptions are given in (Kim et al., 2002)."
      ]
    },
    {
      "heading": "4. Classification of Serial Verb Construction",
      "text": [
        "In the previous chapter, we mentioned the syntactic format of SVCs which is NP V1 (NP) V2 (NP) and the different scope of definition of SVCs by the Chinese language researches.",
        "To outline the scope of SVCs, we define SVCs in terms of dependency relation such that V1 is the head of V2, or V2 is the head of V1.",
        "It is formally defined as follows:"
      ]
    },
    {
      "heading": "Definition 1",
      "text": [
        "Let N represent a set of nodes in a dependency tree, and W a set of words.",
        "Further Let V be a set of verbs, and P be a set of all parts of speech in Chinese.",
        "Then the functions: head, nw, and npos, are defined as below:",
        "A definition of SVC is: Given a node n such that npos(n) ∈ V and Head(n) = hn, If and only if npos(hn) ∈ V and hn is the head of a given sentence then the sentence is a SVC.",
        "The three sentences from the top of table 1 satisfy the given condition.",
        "Also the head of the node is the sentence head, thus these must be SVCs.",
        "For the last sentence, nw(n) is 接 入, and nw(Head(n)) is 总数 whose the POS is not verb and also whose the node is not the sentence head.",
        "Thus it is not an SVC.",
        "Where nw: nw(n); nwh: nw(head(n)); SH :testing if head(n) is the sentence head ; n is a given node.",
        "Our definition is employed to recognize a SVC in the Chinese analysis stage.",
        "First we describe the classification that is used in the Chinese analysis stage."
      ]
    },
    {
      "heading": "4.1 Categories in Chinese Analysis Stage",
      "text": [
        "All dependency relations, which are detected by the above definition, are classified into five categories: separate events, object, subject, pivotal construction and descriptive clauses, based on the classification of Li (Li & Thompson, 1981).",
        "The serial verb patterns classified by most researchers belong to this group where switching V1 to V2 provides us a different meaning.",
        "In addition, we add the case where transposing V1 to V2 provides us the same meaning in this group."
      ]
    },
    {
      "heading": "4.1.2 Object",
      "text": [
        "If V2 is the main verb in an object clause or a object phrase then it belongs to this group.",
        "If V1 is the main verb in the subject clause or subject phrase, it is assigned to this group.",
        "If the noun phrase between V1 and V2 is the object of V1 and the subject of V2, then it is a pivot construction.",
        "If V2 describes the noun phrase between V1 and V2, then it is a descriptive SVC.",
        "All categories of SVCs are shown in Table 2 The corresponding Chinese dependency relations to object, subject and pivot constructions also appear in the some research in Chinese language processing (Zhou & Huang, 1994) but the other two are not shown due to their different viewpoints.",
        "The descriptive construction is directly able to be one-to-one mapped to the Korean counterpart.",
        "However the separate event SVCs should be further classified for Korean transfer since the separate event SVC is possibly mapped into sentences with several different Korean conjunctional particles.",
        "Thus, it is touched in the transfer stage."
      ]
    },
    {
      "heading": "4.2 Subcategories in Transfer Stage",
      "text": [
        "The separate event SVC for each sense of Korean conjunctional particles is classified into the following subcategories: restrictive, quasi-coordinative, simultaneous, transitional, and circumstantial by the Korean language viewpoint.",
        "The action of V2 is performed under the restriction given by V1.",
        "There are different types of restriction, such as space, group-related, causal, and instrumental.",
        "The examples are presented in table 3.",
        "In quasi-coordinative, two different cases exist.",
        "First, transposing V1 to V2 never causes a meaning shift of the sentence, named alternative.",
        "The other is that V1 and V2 are only sequentially related, called consecutive.",
        "In a simultaneous case, V1 and V2 occur at the same time.",
        "If the action of V1 is interrupted by the action V2, then it is transitional.",
        "When V2 occurs on the condition of the action of V1, then it is classified as a circumstantial case.",
        "The examples for rests of the separate event are given in Table 4.",
        "handled.",
        "There are two possible ambiguous structures of SVCs Case 1 : NP V1 V2 (NP2) Case 2 : NP V1 NP1 V2 (NP2) Where NP, NP1 and NP2 are noun phrases.",
        "The algorithm for each case is illustrated in figure 2 and figure 3.",
        "In Figure 3, the test ‘V1 takes NP & VP’ means that the verb 偷听 can have a noun phrase or an object clause as an object.",
        "The test, ‘satisfy valency’ denotes that the second verb 喜欢 takes a human subject, and 外 国人 can be the subject of the verb 喜欢, thus it is classified as an object case.",
        "For the other sentence, since 公 园 cannot be the subject of the verb 锻炼, it is determined as a subject case.",
        "In restrictive, quasi-coordinate, simultaneous, transitional, and circumstantial separate event SVC Chinese sentences, all the above verbs are mapped into the corresponding Korean verb followed by the Korean conjunctional particle ‘se’, ‘ko’, ‘un-chay-lo’, ‘taka’ and ‘myen’, respectively."
      ]
    },
    {
      "heading": "5. Identification of SVCs",
      "text": [
        "To recognize SVCs, we divide the identifying process into two stages.",
        "The general categories of SVCs are able to be found at the analysis stage and the subcategories of a separated event SVC are detected in the transfer stage."
      ]
    },
    {
      "heading": "5.1 Analysis Stage",
      "text": [
        "To recognize the five general categories of SVCs, two resources are used: one is the Grammatical Knowledge Base of Contemporary Chinese (GKBCC) and the other is a verb list with valency information (VLVI) (Zhu et al., 1995).",
        "Checking a verb in GKBCC allows us to simply detect a pivot SVC.",
        "The remainders of the other types of SVCs should be carefully"
      ]
    },
    {
      "heading": "5.2 Transfer Stage",
      "text": [
        "The simultaneous separate events is easily recognized by the lexical (着) attached to the first verb.",
        "Also, we use a simple heuristic to detect the circumstantial separate events with the lexical pattern information.",
        "The resource used in this stage is a Chinese thesaurus called Tongyi-ci-cilin (Mei, 1983).",
        "With the thesaurus the remainders of separate event SVCs are processed with great care.",
        "If V2 is related to the interrupt concept then the transitional separate events are assigned.",
        "The most difficult and frequently occurring cases are the restrictive separate events and quasi-coordinative separate event.",
        "The key idea of using the thesaurus is based on the observation that the verb V2, if restricted by V1 makes it possible that the concept of V2 will also be restricted by the concept of V1.",
        "To complete the solution, we first define the relations: RSTV, RSTL and RSTM as follows: Definition 2 We define the relations: RSTV, RSTL, and RSTM, as follows: RSTV= {(V1, V2) where V1 and V2 are the first verb and second verb in a given SVC sentence and V2 is semantically restricted by V1 : (V1, V2) ≠ (V2, V1)} RSTL= {(CL1,CL2) where CL1 and CL2 are the low level concept of the first verb and the low level concept 3 of second verb in the Chinese thesaurus, respectively, and CL2 is semantically restricted by CL1 : (CL1,CL2)≠ (CL2, CL1)} RSTM= {(CM1, CM2) where CM1 and CM2 are the middle level concept of the first verb and the middle level concept of second verb in the Chinese thesaurus, respectively, and ML2 is semantically restricted by ML1 : (ML1,ML2)≠ (ML2, ML1)} The relations RSTV, RSTL, and RSTM are not symmetric and not reflexive.",
        "Based on the definition we derive the following heuristics:",
        "All three examples from the top of table 5 satisfy the condition that, if (V1, V2) E RSTV then (CL1,CL2) ∈ RSTL and (CM1,CM2) ∈ RSTM.",
        "If the condition is always true, then we use the middle-level concept relation for detecting a restrictive separate event in order to increase the applicability of our rules.",
        "Also, the data structure of RSTM is easily represented with an adjacent matrix with the size of 21*21 4 (Sahni, 1998) where the matrix M is a square matrix, whose column and row are the middle-level concept, and if M(i,j) = 1 then concept j is semantically restricted by concept i, otherwise (i,j) ∉ RSTM.",
        "However, the last example reveals that the condition is not always true since we have the result, both (Hi,Hj) and (Hj,Hi) ∈ RSTM.",
        "Thus, it violates the definition of RSTM.",
        "Hence, we may not directly use the middle-level concept adjacent matrix and the size of the low-level concept matrix is too large to be used.5 We come up with a solution of a frame with multi level concepts.",
        "The frame consists of three parts: the middle-level concept adjacent matrix, the low-level concept adjacent lists and the collocation serial verb list for detecting a serial verb that always appears together.",
        "Our solution is that the exceptional cases are covered by either the collocation verb lists or the low-level concept adjacent list.",
        "The remaining frequently occurring cases are captured by the middle-level adjacent matrix.",
        "This leads to the sparse matrix of the low-level concept which",
        "causes the adaptation of adjacent lists rather than an adjacent matrix for the low-level concepts.",
        "The order of searching the frame is the collocation list, the low-level concept list and the middle-level concept matrix.",
        "In the collocation list, if V1 and V2 belongs to the collocation list of the restrictive separate events, such as 捉拿归 案 or the one of quasi-coordinative, such as 立案 侦察 then the sentence is assigned to a restrictive case or a quasi-coordinative case, respectively.",
        "In the low-level concept lists and the middle-level concept matrix, if matching succeeds, which means that V2 is semantically restricted by V1, then a restrictive case is assigned; otherwise, a quasi-coordinate case is detected6.",
        "The detailed process for identifying the subcategories of separate events is shown in figure 4."
      ]
    },
    {
      "heading": "6. Evaluation",
      "text": [
        "We randomly selected 1000 SVC sentences from 1998 people’s daily newspapers.",
        "The number of verbs in the sentence is two since our dependency parser is still being improved to detect the sentences with multiple embedding clauses.",
        "In table 6, the distribution of each type of SVC and the precision are shown.",
        "The precision is 94.4% and some of the errors occur from the tagger, thus some sentences are not SVCs.",
        "The rest of the errors result from missing information in the knowledge bases:"
      ]
    },
    {
      "heading": "6 For a sentence 国 家 主 席 江 泽 民 出 席 讲 话 where the",
      "text": [
        "relation (Hj20,Hj 12) is not in the low-level adjacent list, but (Hj,Hi) is 1 in the middle-level matrix, it is assigned to the restrictive case, while for the sentence 他代表山西省出席 了 座谈会 where (Hi17,Hj20) is in the low-level adjacent list, thus searching is stopped, it is assigned as a restrictive case.",
        "A sententence 他 在饭 店 吃饭 喝 茶 do not satisfy all conditions, thus it is detected as Quasi-Coordinate.",
        "GKBCC and VLVI.",
        "We need the complete list of verbs, which has a clause as a subject.",
        "These verbs in the list will be gradually collected in future works.",
        "The evaluation table for the separate event SVCs is provided in Table 7.",
        "The precision of identifying the category of separate event is 95.3%.",
        "The errors resulted from a circumstantial case since our heuristics is too restrictive to detect all cases, thus, it might be revised further, and since the low-level concept lists are not completed.",
        "The low-level concept lists will be continuously updated for increasing coverage in the tuning stage of the machine translation system.",
        "Table 8 shows the distribution of the subcategory of restrictive separate events for Korean transfer.",
        "In table 9, the frequency for each type of accessed resource is listed.",
        "Notice that most restrictive separate event SVCs are recognized in the middle-level matrix.",
        "The two cases in collocation are all the case of quasi-coordinative, thus, the total number is greater than 153.",
        "In figure 5, a demo system of TOTAL-CK is illustrated.",
        "For a given Chinese SVC sentence displayed in the top position of the rightmost window, the corresponding Korean sentence is followed in the next row.",
        "The tagged results, the segment of chunking, and the Chinese dependency tree with indentation are shown in each window from left to right."
      ]
    },
    {
      "heading": "Conclusion and Future work",
      "text": [
        "In this paper, we formally define serial verb constructions, and classified the SVC into several categories.",
        "These categories are related to the analysis stage and the transfer stage of TALK-CK.",
        "We provided a resolution algorithm detecting SVCs in each step.",
        "Finally, at each stage, a promising experimental result is shown.",
        "Further research must help to better resolve the conditional separate event SVC and purposive separate event SVC."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This work was supported by the Korea Science and Engineering Foundation (KOSEF) through the Advanced Information Technology Research Center(AITrc)."
      ]
    }
  ]
}
