{
  "info": {
    "authors": [
      "Masao Utiyama",
      "Hitoshi Isahara"
    ],
    "book": "Human Language Technologies 2007: the Conference of the North American Chapter of the Association for Computational Linguistics; Proceedings of the Main Conference",
    "id": "acl-N07-1061",
    "title": "A Comparison of Pivot Methods for Phrase-Based Statistical Machine Translation",
    "url": "https://aclweb.org/anthology/N07-1061",
    "year": 2007
  },
  "references": [
    "acl-C88-2125",
    "acl-E06-1032",
    "acl-E99-1010",
    "acl-J03-1002",
    "acl-J03-3002",
    "acl-J04-2003",
    "acl-J04-4002",
    "acl-J05-4003",
    "acl-J93-2003",
    "acl-N03-1017",
    "acl-N04-1021",
    "acl-N06-1003",
    "acl-P02-1038",
    "acl-P02-1040",
    "acl-P03-1010",
    "acl-P03-1021",
    "acl-P06-2112",
    "acl-W02-2026",
    "acl-W06-3114"
  ],
  "sections": [
    {
      "text": [
        "A Comparison of Pivot Methods for Phrase-based Statistical Machine",
        "Translation",
        "Masao Utiyama and Hitoshi Isahara",
        "National Institute of Information and Communications Technology 3-5 Hikari-dai, Soraku-gun, Kyoto 619-0289 Japan {mutiyama,isahara}@nict.go.jp",
        "We compare two pivot strategies for phrase-based statistical machine translation (SMT), namely phrase translation and sentence translation.",
        "The phrase translation strategy means that we directly construct a phrase translation table (phrase-table) of the source and target language pair from two phrase-tables; one constructed from the source language and English and one constructed from English and the target language.",
        "We then use that phrase-table in a phrase-based SMT system.",
        "The sentence translation strategy means that we first translate a source language sentence into n English sentences and then translate these n sentences into target language sentences separately.",
        "Then, we select the highest scoring sentence from these target sentences.",
        "We conducted controlled experiments using the Europarl corpus to evaluate the performance of these pivot strategies as compared to directly trained SMT systems.",
        "The phrase translation strategy significantly outperformed the sentence translation strategy.",
        "Its relative performance was 0.92 to 0.97 compared to directly trained SMT systems."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The rapid and steady progress in corpus-based machine translation (Nagao, 1981; Brown et al., 1993) has been supported by large parallel corpora such as the Arabic-English and Chinese-English parallel corpora distributed by the Linguistic Data Consortium and the Europarl corpus (Koehn, 2005), which consists of 11 European languages.",
        "However, large parallel corpora do not exist for many language pairs.",
        "For example, there are no publicly available Arabic-Chinese large-scale parallel corpora even though there are Arabic-English and Chinese-English parallel corpora.",
        "Much work has been done to overcome the lack of parallel corpora.",
        "For example, Resnik and Smith (2003) propose mining the web to collect parallel corpora for low-density language pairs.",
        "Utiyama and Isahara (2003) extract Japanese-English parallel sentences from a noisy-parallel corpus.",
        "Munteanu and Marcu (2005) extract parallel sentences from large Chinese, Arabic, and English non-parallel newspaper corpora.",
        "Researchers can also make the best use of existing (small) parallel corpora.",
        "For example, NieBen and Ney (2004) use morpho-syntactic information to take into account the interdependencies of inflected forms of the same lemma in order to reduce the amount of bilingual data necessary to sufficiently cover the vocabulary in translation.",
        "Callison-Burch et al.",
        "(2006a) use paraphrases to deal with unknown source language phrases to improve coverage and translation quality.",
        "In this paper, we focus on situations where no parallel corpus is available (except a few hundred parallel sentences for tuning parameters).",
        "To tackle these extremely scarce training data situations, we propose using a pivot language (English) to bridge the source and target languages in translation.",
        "We first translate source language sentences or phrases into English and then translate those English sentences or phrases into the target language, as described in Section 3.",
        "We thus assume that there is a parallel corpus consisting of the source language and English as well as one consisting of English and the target language.",
        "Selecting English as a pivot language is a reasonable pragmatic choice because English is included in parallel corpora more often than other languages are, though any language can be used as a pivot language.",
        "In Section 2, we describe a phrase-based statistical machine translation (SMT) system that was used to develop the pivot methods described in Section 3.",
        "This is the shared task baseline system for the 2006 NAACL/HLT workshop on statistical machine translation (Koehn and Monz, 2006) and consists of the Pharaoh decoder (Koehn, 2004), SRILM (Stol-cke, 2002), GIZA++ (Och and Ney, 2003), mkcls (Och, 1999), Carmel, and a phrase model training code."
      ]
    },
    {
      "heading": "2. Phrase-based SMT",
      "text": [
        "We use a phrase-based SMT system, Pharaoh, (Koehn et al., 2003; Koehn, 2004), which is based on a log-linear formulation (Och and Ney, 2002).",
        "It is a state-of-the-art SMT system with freely available software, as described in the introduction.",
        "The system segments the source sentence into so-called phrases (a number of sequences of consecutive words).",
        "Each phrase is translated into a target language phrase.",
        "Phrases may be reordered.",
        "Let f be a source sentence (e.g, French) and e be a target sentence (e.g., English), the SMT system outputs an ê that satisfies where hm(e, f ) is a feature function and Xm is a weight.",
        "The system uses a total of eight feature functions: a trigram language model probability of the target language, two phrase translation probabilities (both directions), two lexical translation probabilities (both directions), a word penalty, a phrase penalty, and a linear reordering penalty.",
        "For details on these feature functions, please refer to (Koehn et al., 2003; Koehn, 2004; Koehn et al., 2005).",
        "To set the weights, Am, we carried out minimum error rate training (Och, 2003) using BLEU (Papineni et al., 2002) as the objective function."
      ]
    },
    {
      "heading": "3. Pivot methods",
      "text": [
        "We use the phrase-based SMT system described in the previous section to develop pivot methods.",
        "We use English e as the pivot language.",
        "We use French f and German g as examples of the source and target languages in this section.",
        "We describe two types of pivot strategies, namely phrase translation and sentence translation.",
        "The phrase translation strategy means that we directly construct a French-German phrase translation table (phrase-table for short) from a French-English phrase-table and an English-German phrase-table.",
        "We assume that these French-English and English-German tables are built using the phrase model training code in the baseline system described in the introduction.",
        "That is, phrases are heuristically extracted from word-level alignments produced by doing GIZA++ training on the corresponding parallel corpora (Koehn et al., 2003).",
        "The sentence translation strategy means that we first translate a French sentence into n English sentences and translate these n sentences into German separately.",
        "Then, we select the highest scoring sentence from the German sentences.",
        "The phrase translation strategy is based on the fact that the phrase-based SMT system needs a phrase-table and a language model for translation.",
        "Usually, we have the language model of a target language.",
        "Consequently, we only need to construct a phrase-table to train the phrase-based SMT system.",
        "We assume that we have a French-English phrase-table Tpe and an English-German phrase-table Teg.",
        "From these tables, we construct a French-German phrase-table Tfg, which requires estimating four feature functions; phrase translation probabilities for both directions, 4>(flg) and 4>(glf) and lexical translation probabilities for both directions,",
        "Pw(/I 9) and pw(g\\/), where / and g are French and German phrases that are parts of phrase translation pairs in TFE and TEG, respectively.",
        "We estimate these probabilities using the probabilities available in TFE and TEG as follows.",
        "eeTpECTeg",
        "where e £ TFE nTEG means that the English phrase e is included in both TFE and TEG as part of phrase translation pairs.",
        "f(f\\e) and f(e\\f) are phrase translation probabilities for TFE and f(e\\g) and f(g \\ e) are those for Teg.",
        "Pw (f\\ e) and Pw (e \\ f) are lexical translation probabilities for TFE and pw (e \\ g) and pw (g \\ e) are those for TEG.",
        "The definitions of the phrase and lexical translation probabilities are as follows (Koehn et al., 2003).",
        "where count(f , e ) gives the total number of times the phrase f is aligned with the phrase e in the parallel corpus.",
        "Eq.",
        "7 means that f(f\\e) is calculated using maximum likelihood estimation.",
        "The definition of the lexical translation probability is where count(f, e) gives the total number of times the word f is aligned with the word e in the parallel corpus.",
        "Thus, w(f e) is the maximum likelihood estimation of the word translation probability of f given e. Ew(fi e , a) is calculated from a word alignment a between a phrase pair f = f\\f2 ... fnand e = e\\e2 ...em where fi is connected to several ( \\ {j\\£ a}\\) English words.",
        "Thus, Ew(fi\\e, a) is the average (or mixture) of w(fi\\ej).",
        "This means that Ew(fi e , a) is an estimation of the probability of fi in a. Consequently, pw(f e , a) estimates the probability of f given e and a using the product of the probabilities Ew(fi e , a).",
        "This assumes that the probability of fi is independent given e and a. pw(f e ) takes the highest pw(f e , a) if there are multiple alignments a.",
        "This discussion, which is partly based on Section 4.1.2 of (Och and Ney, 2004), means that the lexical translation probability pw(f e ) is another probability estimated using the word translation probability w(f e).",
        "The justification of Eqs.",
        "3-6 is straightforward.",
        "From the discussion above, we know that the probabilitie s, f (f e ), f (e f ), f (g e ), f (e g ), pw(f e ),pw(e f ), pw(g e ), and pw(e g ) are probabilities inthe ordinary sense.",
        "Thus, we can derive f (f g ), f (g f ), pw(f g ), and pw(g f ) by assuming that these probabilities are independent given an English phrase e (e.g., f (f g , e ) = f (f e )).",
        "We construct a TFG that consists of all French-German phrases whose phrase and lexical translation probabilities as defined in Eqs.",
        "3-6 are greater than 0.",
        "We use the term PhraseTrans to denote SMT systems that use the phrase translation strategy described above.",
        "The sentence translation strategy uses two independently trained SMT systems.",
        "We first translate a French sentence f into n English sentences e\\, e2,en using a French-English SMT system.",
        "Each ei (i = 1 ...n) has the eight scores calculated from the eight feature functions described in Section 2.",
        "We denote these scores heil,hei2,... he8.",
        "Second, we translate each ei into n German sentences gii, gi2,..., gin using an English-German",
        "<Kf\\g)",
        "= £ M(f\\ e)<t>(e\\9)",
        "(3)",
        "eeTpE CTeg",
        "<t>(91 f)",
        "= £ HgI e)M(e\\ f)",
        "(4)",
        "eeTpE CTeg",
        "pw (f \\ g )",
        "= pw(f e )pw(e g )",
        "(5)",
        "pw(g f )",
        "= pw(g e )pw(e f )",
        "(6)",
        "SMT system.",
        "Each gij (j = 1 .",
        ".",
        ".",
        "n) has the eight scores, which are denoted as haij1,haij2,...,hj8.",
        "This situation is depicted as",
        "We define the score of gij, S (gij), as where Xm and XL are weights set by performing minimum error rate training as described in Section 2.",
        "We select the highest scoring German sentence as the translation of the French sentence f.",
        "A drawback of this strategy is that translation speed is about O(n) times slower than those of the component SMT systems.",
        "This is because we have to run the English-German SMT system n times for a French sentence.",
        "Consequently, we cannot set n very high.",
        "When we used n = 15 in the experiments described in Section 4, it took more than two days to translate 3064 test sentences on a 3.06GHz LINUX machine.",
        "Note that when n = 1 , the above strategy produces the same translation with the simple sequential method that we first translate a French sentence into an English sentence and then translate that sentence into a German sentence.",
        "We use the terms SntTrans15 and SntTransl to denote SMT systems that use the sentence translation strategy with n = 15 and n = 1, respectively."
      ]
    },
    {
      "heading": "4. Experiments",
      "text": [
        "We conducted controlled experiments using the Europarl corpus.",
        "For each language pair described below, the Europarl corpus provides three types of parallel corpora; the source language-English, English-the target language, and the source language-the target language.",
        "This means that we can directly train an SMT system using the source and target language parallel corpus as well as pivot SMT systems using English as the pivot language.",
        "We use the term Direct to denote directly trained SMT systems.",
        "For each language pair, we compare four SMT systems; Direct, PhraseTrans, Snt-Transl5, and SntTransl.",
        "We used the training data for the shared task of the SMT workshop (Koehn and Monz, 2006) to train our SMT systems.",
        "It consists of three parallel corpora: French-English, Spanish-English, and German-English.",
        "We used these three corpora to extract a set of sentences that were aligned to each other across all four languages.",
        "For that purpose, we used English as the pivot.",
        "For each distinct English sentence, we extracted the corresponding French, Spanish, and German sentences.",
        "When an English sentence occurred multiple times, we extracted the most frequent translation.",
        "For example, because \"Resumption of the session\" was translated into \"Wiederaufnahme der Sitzungsperiode\" 120 times and \"Wiederaufnahme der Sitzung\" once, we extracted \"Wiederaufnahme der Sitzungsperiode\" as its translation.",
        "Consequently, we extracted 585,830 sentences for each language.",
        "From these corpora, we constructed the training parallel corpora for all language pairs.",
        "We followed the instruction of the shared task baseline system to train our SMT systems.",
        "We used the trigram language models provided with the shared task.",
        "We did minimum error rate training on the first 500 sentences in the shared task development data to tune our SMT systems and used the 3064 test sentences for each language as our test set.",
        "Our evaluation metric was %BLEU scores, as calculated by the script provided along with the shared task.",
        "We lowercased the training, development and test sentences.",
        "Table 1 compares the BLEU scores of the four SMT systems; Direct, PhraseTrans, SntTrans15, and Snt-Transl for each language pair.",
        "The columns SE and ET list the BLEU scores of the Direct SMT systems trained on the source language-English and English-the target language parallel corpora.",
        "The numbers in the parentheses are the relative scores of the pivot SMT systems, which were obtained by dividing their BLEU scores by that of the corresponding Direct system.",
        "For example, for the Spanish-French language pair, the BLEU score of the Direct SMT system was 35.78, that of the PhraseTrans SMT system was 32.90, and the relative performance was 0.92 = (32.90/355.78).",
        "For the SntTrans15 SMT system, the BLEU score was 29.49 and the relative performance was 0.82 = (29.49/35.78).",
        "The BLEU scores of the Direct SMT systems were higher than those of the PhraseTrans SMT systems for all six source-target language pairs.",
        "The PhraseTrans SMT systems performed better than the SntTrans15 SMT systems for all pairs.",
        "The SntTrans15 SMT systems were better than the Snt-Trans1 SMT systems for four pairs.",
        "According to the sign test, under the null hypothesis that the BLEU scores of two systems are equivalent, finding one system obtaining better BLEU scores on all six language pairs is statistically significant at the 5 % level.",
        "Obtaining four better scores is not statistically significant.",
        "Thus, Table 1 indicates Direct > PhraseTrans > SntTrans15 ~ SntTrans1 where \">\" and \"~\" means that the differences of the BLEU scores of the corresponding SMT systems are statistically significant and insignificant, respectively.",
        "As expected, the Direct SMT systems outperformed the other systems.",
        "We regard the BLEU scores of the Direct systems as the upperbound.",
        "The SntTrans15 SMT systems did not significantly outperform the SntTrans1 SMT systems.",
        "We think that this is because n = 15 was not large enough to cover good translation candidates.",
        "Selecting the highest scoring translation from a small pool did not always lead to better performance.",
        "To improve the performance of the sentence translation strategy, we need to use a large n. However, this is not practical because of the slow translation speed, as discussed in Section 3.2.",
        "The PhraseTrans SMT systems significantly outperformed the SntTrans15 and SntTrans1 systems.",
        "That is, the phrase translation strategy is better than the sentence translation strategy.",
        "Since the phrase-tables constructed using the phrase translation strategy can be integrated into the Pharaoh decoder as well as the directly extracted phrase-tables, the PhraseTrans SMT systems can fully exploit the power of the decoder.",
        "This led to better performance even when the induced phrase-tables were noisy, as described below.",
        "The relative performance of the PhraseTrans SMT systems compared to the Direct SMT systems was 0.92 to 0.97.",
        "These are very promising results.",
        "To show how these systems translated the test sentences, we translated some outputs of the Spanish-French Direct and PhraseTrans SMT systems into English using the French-English Direct system.",
        "These are shown in Table 3 with the reference English sentences.",
        "The relative performance seems to be related to the BLEU scores for the Direct SMT systems.",
        "It was relatively high (0.95 to 0.97) for the difficult (in terms of BLEU) language pairs but relatively low (0.92) for the easy language pairs; Spanish-French and French-Spanish.",
        "There is a lot of room for improvement for the relatively easy language pairs.",
        "This relationship is stronger than the relationship between the BLEU scores for SE/ET and those for the PhraseTrans systems, where no clear trend exists.",
        "\"S\", \"F\", and \"G\" are the acronyms of Spanish, French, and German, respectively.",
        "\"X-Y\" means that \"X\" is the source language and \"Y\" is the target language.",
        "18.2 million phrases, and the PhraseTrans systems had 168.2 to 190.8 million phrases.",
        "The numbers of phrases stored in the PhraseTrans systems were very large compared to those of Direct systems.",
        "However, this does not cause a computational problem in decoding because those phrases that do not appear in source sentences are filtered so that only the relevant phrases are used during decoding.",
        "The figures in the common column are the number of phrases common to the Direct and PhraseTrans systems.",
        "R (recall) and P (precision) are defined as follows.",
        "No.",
        "of common phrases X 100",
        "No.",
        "of phrases in Direct system",
        "No.",
        "of phrases in PhraseTrans system",
        "Recall was reasonably high.",
        "However, the upper bound of recall was 100 percent because we used a multilingual corpus whose sentences were aligned to each other across all four languages, as described in Section 4.1.",
        "Thus, there is a lot of room for improvement with respect to recall.",
        "Precision, on the other hand, was very low.",
        "However, translation performance was not significantly affected by this low precision, as is shown in Table 1.",
        "This indicates that recall is more important than precision in building phrase-tables."
      ]
    },
    {
      "heading": "5. Related work",
      "text": [
        "Pivot languages have been used in rule-based machine translation systems.",
        "Boitet (1988) discusses the pros and cons of the pivot approaches in multilingual machine translation.",
        "Schubert (1988) argues that a pivot language needs to be a natural language, due to the inherent lack of expressiveness of artificial languages.",
        "Pivot-based methods have also been used in other related areas, such as translation lexicon induction (Schafer and Yarowsky, 2002), word alignment (Wang et al., 2006), and cross language information retrieval (Gollins and Sanderson, 2001).",
        "The translation disambiguation techniques used in these studies could be used for improving the quality of phrase translation tables.",
        "In contrast to these, very little work has been done on pivot-based methods for SMT.",
        "Kauers et al.",
        "(2002) used an artificial interlingua for spoken language translation.",
        "Gispert and Mariüo (2006) created an English-Catalan parallel corpus by automatically translating the Spanish part of an English-Spanish parallel corpus into Catalan with a Spanish-Catalan SMT system.",
        "They then directly trained an SMT system on the English-Catalan corpus.",
        "They showed that this direct training method is superior to the sentence translation strategy (SntTrans1) in translating Catalan into English but is inferior to it in the opposite translation direction (in terms of the BLEU score).",
        "In contrast, we have shown that the phrase translation strategy consistently outperformed the sentence translation strategy in the controlled experiments.",
        "Source-Target",
        "Direct",
        "PhraseTrans",
        "SntTransl5",
        "SntTransl",
        "SE",
        "ET",
        "Spanish-French",
        "35.78",
        ">",
        "32.90",
        "(0.92)",
        ">",
        "29.49",
        "(0.82)",
        ">",
        "29.16",
        "(0.81)",
        "29.31",
        "28.80",
        "French-Spanish",
        "34.16",
        ">",
        "31.49",
        "(0.92)",
        ">",
        "28.41",
        "(0.83)",
        ">",
        "27.99",
        "(0.82)",
        "27.59",
        "29.07",
        "German-French",
        "23.37",
        ">",
        "22.47",
        "(0.96)",
        ">",
        "22.03",
        "(0.94)",
        ">",
        "21.64",
        "(0.93)",
        "22.40",
        "28.80",
        "French-German",
        "15.27",
        ">",
        "14.51",
        "(0.95)",
        ">",
        "14.03",
        "(0.92)",
        "<",
        "14.21",
        "(0.93)",
        "27.59",
        "15.81",
        "German-Spanish",
        "22.34",
        ">",
        "21.76",
        "(0.97)",
        ">",
        "21.36",
        "(0.96)",
        ">",
        "20.97",
        "(0.94)",
        "22.40",
        "29.07",
        "Spanish-German",
        "15.50",
        ">",
        "15.11",
        "(0.97)",
        ">",
        "14.46",
        "(0.93)",
        "<",
        "14.61",
        "(0.94)",
        "29.31",
        "15.81",
        "No.",
        "of phrases (\"M\" means 10)",
        "R",
        "P",
        "Direct",
        "PhraseTrans",
        "common",
        "S-F",
        "18.2M",
        "190.8M",
        "6.3M",
        "34.7",
        "3.3",
        "F-S",
        "18.2M",
        "186.8M",
        "6.3M",
        "34.7",
        "3.4",
        "G-F",
        "7.3M",
        "174.9M",
        "3.1M",
        "43.2",
        "1.8",
        "F-G",
        "7.3M",
        "168.2M",
        "3.1M",
        "43.2",
        "1.9",
        "G-S",
        "7.5M",
        "179.6M",
        "3.3M",
        "44.1",
        "1.9",
        "S-G",
        "7.6M",
        "176.6M",
        "3.3M",
        "44.1",
        "1.9"
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "We have compared two types of pivot strategies, namely phrase translation and sentence translation.",
        "The phrase translation strategy directly constructs a phrase translation table from a source language and English phrase-table and a target language and English phrase-table.",
        "It then uses this phrase table in a phrase-based SMT system.",
        "The sentence translation strategy first translates a source language sentence into n English sentences and translates these n sentences into target language sentences separately.",
        "Then, it selects the highest scoring sentence from the target language sentences.",
        "We conducted controlled experiments using the Europarl corpus to compare the performance of these two strategies to that of directly trained SMT systems.",
        "The experiments showed that the performance of the phrase translation strategy was statistically significantly better than that of the sentence translation strategy and that its relative performance compared to the directly trained SMT systems was 0.92 to 0.97.",
        "These are very promising results.",
        "Although we used the Europarl corpus for controlled experiments, we intend to use the pivot strategies in situations where very limited amount of parallel corpora are available for a source and target language but where relatively large parallel corpora are available for the source language-English and the target language-English.",
        "In future work, we will further investigate the pivot strategies described in this paper to confirm that the phrase translation strategy is better than the sentence translation strategy in the intended situation as well as with the Europarl corpus.",
        "Source-Target",
        "PhraseTrans",
        "SntTrans1",
        "Spanish-French",
        "31.57",
        "28.36",
        "French-Spanish",
        "30.18",
        "27.75",
        "German-French",
        "20.48",
        "19.83",
        "French-German",
        "14.38",
        "14.11",
        "German-Spanish",
        "19.58",
        "18.67",
        "Spanish-German",
        "14.80",
        "14.46",
        "Ref",
        "i hope with all my heart, and i must say this quite emphatically , that an opportunity will arise when this document can be incorporated into the treaties at some point in the future .",
        "Dir",
        "i hope with conviction , and put great emphasis , that again is a serious possibility of including this in the treaties .",
        "PT",
        "i hope with conviction , and i very much , insisted that never be a serious possibility of including this in the treaties .",
        "Ref",
        "should this fail to materialise , we should not be surprised if public opinion proves sceptical about europe , or even rejects it.",
        "Dir",
        "otherwise , we must not be surprised by the scepticism , even the rejection of europe in the public .",
        "PT",
        "otherwise , we must not be surprised by the scepticism , and even the rejection of europe in the public .",
        "Ref",
        "the intergovernmental conference - to address a third subject - on the reform of the european institutions is also of decisive significance for us in parliament.",
        "Dir",
        "the intergovernmental conference - and this i turn to the third issue on the reform of the european institutions is of enormous importance for the european parliament.",
        "PT",
        "the intergovernmental conference - and this brings me to the third issue - on the reform of the european institutions has enormous importance for the european parliament."
      ]
    }
  ]
}
