{
  "info": {
    "authors": [
      "Kenneth Ward Church"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P85-1030",
    "title": "Stress Assignment in Letter to Sound Rules for Speech Synthesis",
    "url": "https://aclweb.org/anthology/P85-1030",
    "year": 1985
  },
  "references": [],
  "sections": [
    {
      "heading": "AT&T Bell Laboratories",
      "text": [
        "Abstrsct This paper will discuss how to determine word stress from spelling.",
        "Stress assignment is a well-established weak point for many speech synthesizers because stress dependencies cannot be determined locally.",
        "It is impossible to determine the stress of a word by looking through a five or six character window, as many speech synthesizers do.",
        "Well-known examples such as degrade I degradation and telegraph I telegraphy demonstrate that stress dependencies can span over two and three syllables.",
        "This paper will present a principled framework for dealing with these long distance dependencies.",
        "Stress assignment will be formulated in terms of Waltz' style constraint propagation with four sources of constraints: (1) syllable weight, (2) part of speech.",
        "(3) morphology and (4) etymology.",
        "Syllable weight is perhaps the most interesting, and will be the main focus of this paper.",
        "Most of what follows has been implemented.",
        "A speech synthesizer is a machine that inputs a text stream and outputs an accoustic signal.",
        "One small piece of this problem will be discussed here: words – phonemes.",
        "The resulting phonemes are then mapped into a sequence of Ipc dyads which are combined with duration and pitch information to produce speech.",
        "text – intonation phrases – words phonemes – Ipc dyads + prosody accoustics There are two general approaches to word phonemes:",
        "• Dictionary Lookup • Letter to Sound (i.e., sound the word out from basic principles)",
        "Both approaches have their advantages and disadvantages; the dictionary approach fails for unknown words (e.g., proper nouns) and the letter to sound approach fails when the word doesn't follow the rules, which happens all too often in English.",
        "Most speech synthesizers adopt a hybrid strategy, using the dictionary when appropriate and letter to sound for the rest.",
        "Some people have suggested to roe that modern speech synthesizers should do away with letter to sound rules now that memory prices are dropping so low that it ought to be practical those days to put every word of English into a tiny box.",
        "Actually memory prices are still a major factor in the cost of a machine.",
        "But more seriously, it is not possible to completely do away with letter to sound rules because it is not possible to enumerate all of the words of English.",
        "A typical college dictionary of 50,000 headwords will account for about 93% of a typical newspaper text.",
        "The bulk of the unknown words are proper nouns.",
        "The difficulty with proper nouns is demonstrated by the table below which compares the Brown Corpus with the surnames in the Kansas City Telephone Book.",
        "The table answers the question: how much of each corpus would be covered by a dictionary of n words?",
        "Thus the first line shows that a dictionary of 2000 words would cover 68% of the Brown Corpus, and a dictionary of 2000 names would cover only 46% of the Kansas City Telephone Book.",
        "It should be clear from the table that a dictionary of surnames must be much larger than a typical college dictionary (-20,000 entries).",
        "Moreover, it would be a lot of work to construct such a dictionary since there are no existing computer readable dictionaries for surnames.",
        "Actually, this table overestimates the effectiveness of the dictionary, for practical applications.",
        "A fair test would not use the same corpus for both selecting the words to go into the dictionary and for testing the coverage.",
        "The worm reported here were computed post hoc, a classic statistical error.",
        "I tried a more fair test, where a dictionary of 43777 words (the entire Brown Corpus) was tested against a corpus of 10687 words selected from the AP news wire.",
        "The results showed 96% coverage, which is slightly lower (as expected) than the 99% figure reported in the table for a 40000 dictionary.",
        "For names, the facts are much more striking as demonstrated in the following table which tests name lists of various sizes against the Bell Laboratories phone book.",
        "(As above, the name lists were gathered from the Kansas City Telephone Book.",
        ")•",
        "Note that the asymptote of 60% coverage is quickly reached after only about 5000-1000 words, suggesting (a) that the dictionary approach may only be suitable for the 5000 to 1000 most frequent names because larger dictionaries yield only negligible improvements in performance, and (b) that the dictionary approach has an inherent limitation on coverage of about 60%.",
        "To increase the coverage beyond this, it is probably necessary to apply alternative methods such as letter to sound rules.",
        "Over the past year I have been developing a set of letter to sound rules as part of a larger speech synthesis project currently underway at Murray Hill.",
        "Only one small piece of my letter to sound rules, orthography stress, will be discussed here.",
        "The output stress assignment is then used to condition a number of rules such as palatalization in the mapping from letters to phonemes.",
        "2.",
        "Weight u an biteneetlate Level of Repress:madam",
        "Intuitively, stress dependencies come in two flavors: (a) those that apply locally within a syllable, and (b) those that apply globally between syllables.",
        "Syllable weight is an attempt to represent the local stress constraints.",
        "Syllables are marked either heavy or light, depending only on the local 'shape' (e.g., vowel length and number of post-vocalic consonants).",
        "Heavy syllables are more likely to be",
        "• Admittedly.",
        "this test is somewhat unfair to the dictionary approach since the ethnic mixture in Kansas City is very different from that found here at Bell Laboratories.",
        "stressed than light syllables, though the actual outcome depends upon contextual constraints, such as the English main stress rule, which will be discussed shortly.",
        "The notion of weight is derived from Chomsky and Halle's notion of strong and weak clusters [Chomsky and Halley (SPE).",
        "In phonological theory, weight is used as an intermediate level of representation between the input underlying phonological representation and the output stress assignment.",
        "In a similar fashion, I will use weight as an intermediate level of representation between the input orthography and the output stress.",
        "The orthography – stress problem will be split into two subproblems:",
        "• Orthography – Weight • Weight Stress 3.",
        "What is Syllable Weight?",
        "Weight is a binary feature (Heavy or Light) assigned to each syllable.",
        "The final syllables of the verbs obey, maintain, erase, torment, collapse, and exhaust are heavy because they end in a long vowel or two consonants.",
        "In constrast, the final syllables of develop, astonish.",
        "edit, consider, and promise are light because they end in a short vowel and at most one consonant.",
        "More precisely, to compute the weight of a syllable from the underlying phonological representation, strip off the final consonant and then parse the word into syllables (assigning consonants to the right when there is ambiguity)."
      ]
    },
    {
      "heading": "Example Weight Reason",
      "text": [
        "ow-bey heavy final syllable long vowel tor-men heavy final syllable closed syllable diy-ve-lo light final syllable open syllable & short vowel Then, if the syllable is closed (i.e., ends in a consonant as in tor-men) or if the vowel is marked underiyingly long (as in ow-bey), the syllable is marked heavy.",
        "Otherwise, the syllable ends in an open short vowel and it is marked light.",
        "Determining syllable weight from the orthography is considerably more difficult than from the underlying phonological form.",
        "I will return to this question shortly.",
        "4.",
        "Weight • Strew",
        "Global stress assignment rules apply off the weight representation.",
        "For example, the main stress rule of English says that verbs have final stress if the final syllable is heavy syllable (e.g., obey), and penultimate stress if the final syllable light syllable (e.g., develop).",
        "The main stress rule works similarly for nouns, except that the final syllable is ignored (extrametrical IHayesI).",
        "Thus, nouns have penultimate stress if the penultimate syllable is heavy (e.g.. aroma) and antipertultimate stress if the penultimate syllable is light (e.g., cinema)."
      ]
    },
    {
      "heading": "Examples Penultimate Weight Reason",
      "text": [
        "aroma heavy long vowel verrtinda heavy closed syllable cinema light open syllable & short vowel",
        "Adjectives stress just like verbs except suffixes are ignored (extrametrical).",
        "Thus monomorphemic adjectives such as district, robist and timmon stress just like verbs (the final syllable is stressed if it is heavy and otherwise the penultimate syllable is stress) whereas adjectives with single syllable suffixes such as -al, -ous.",
        "-ant, em and lye follow the same pattern as regular nouns [Hayes, p. 2421."
      ]
    },
    {
      "heading": "5. Sproat's Weight Table",
      "text": [
        "A large number of phonological studies (e.g.. [Chomsky and Hanel.",
        "[Liberman and Princel, (Hayesp outline a deterministic procedure for assigning stress from the weight representation and the number of extrametrical syllables (1 for nouns.",
        "0 for verbs).",
        "A version of this procedure was implemented by Richard Sproat last summer.",
        "For efficiency purposes.",
        "Sproat's program was compiled into a table, which associated each possible input with the appropriate stress pattern.",
        "Note that the table is extremely small.",
        "Assuming that words have up ,v to N syllables and up to E extrametrical syllables, there are E Z2' possible inputs.",
        "For E 2 and N 8, the table has only 1020 entries, which is not unreasonable."
      ]
    },
    {
      "heading": "6. Analogy with Waltz' Constraint Propagation Paradigm",
      "text": [
        "Recall that Waltz was the first to showed how contraints could be used effectively in his program that analyzed line drawings in order to separate the figure from the ground and to distinguish concave edges from convex ones.",
        "He first assigned each line a convex label (+), a concave label ( – ) or a boundary label (<, >), using only local information.",
        "If the local information was ambiguous, he would assign a line two or more labels.",
        "Waltz then took advantage of the constraints imposed where multiple lines come together at a common vertex.",
        "One would think that there ought to be 42 ways to label a vertex of two lines and 42 ways to label a vertex of three lines and so on.",
        "By this argument, there ought to be 208 ways to label a vertex.",
        "But Waltz noted that there were only 18 vetex labelings that were consistent with certain reasonable assumptions about the physical world.",
        "Because the inventory of possible labelings was so small, he could disambiguate lines with multiple assignments by checking the junctures at each end of the line to see which of the assignments were consistent with one of the 18 possible junctures.",
        "This simple test turned out to be extremely powerful.",
        "Sproat's weight table is very analogous with Waltz' list of vertex constraints; both define an inventory of global contextual constraints on a set of local labels (H and L syllables in this application, and +.",
        ">, < in Waltz application).",
        "Waltz' constraint propagation paradigm depends on a highly constrained inventory of junctures.",
        "Recall that only 18 of 208 possible junctures turned out to be grammatical.",
        "Similarly, in this application there are very strong grammatical constraints.",
        "According to Sproat's table, there are only 51 distinct output stress assignments, a very small number considering that there are 1020 distinct inputs.",
        "The strength of these constraints will help make up for the fact that the mapping from orthography to weight is usually underdetermined.",
        "In terms of information theory, about half of the bits in the weight representation are redundant since log 51 is about half of log 1020.",
        "This means that 1 only have to determine the weight for about half of the syllables in a word in order to assign stress.",
        "The redundancy of the weight representation can also been seen directly from Sproat's weight table as shown below.",
        "For a one syllable noun, the weight is irrelevant.",
        "For a two syllable noun, the weight of the penultimate is irrelevant.",
        "For a three syllable noun, the weight of",
        "the antipenultimate syllable is irrelevant if the penultimate is light.",
        "For a four syllable noun, the weight of the antipenultimate is irrelevant if the penultimate is light and the weight of the initial two syllables are irrelevant if the penultimate is heavy.",
        "These redundancies follow, of course, from general phonological principles of stress assignment.",
        "7.",
        "Orthography – Weight",
        "For practical purposes, Sproat's table offers a complete solution to the weight – stress subtask.",
        "All that remains to be solved is: orthography weight.",
        "Unfortunately, this problem is much more difficult and much less well understood.",
        "start by discussing some easy cases, and then introduce the pseudo-weight heuristic which helps in some of the more difficult cases.",
        "Fortunately, I don't need a complete solution to orthography – weight since weight – stress is so well constrained.",
        "In easy cases, it is possible to determine the weight directly for the orthography.",
        "For example, the weight of torment must be 'HH' because both syllables are closed (even after stripping off the final consonant).",
        "Thus, the stress of torment is either '31' or '13' stress depending on whether is has 0 or 1 extrametrical final syllables:* (stress-from-weights 'HH 0) – • 0311 ; verb (stress-from-weights 'HH' 1) – • (131 ; noun However, most cases are not this easy.",
        "Consider a word like record where the first syllable might be light if the first vowel is reduced or it might be heavy if the vowel is underlyingly long or if the first syllable includes the /k/.",
        "It seems like it is impossible to say anything in a case like this.",
        "The weight, it appears is either \"LH' or 'HH\".",
        "Even with this ambiguity, there are only three distinct stress assignments: 01, 31, and 13.",
        "• Ammo, in practice.",
        "tbe %mese determination is amtpliented by the posubiliry that YAWN and -ent =est be suffism.",
        "Nate.",
        "foe atemple.",
        "Om the *Omit, amen, dose not some like the verb tovetim because the adjemival sniffs am is auransemscat.",
        "(stress-from-weights 'LW 0) 0011 (stress-from-weights 'HH' 0) – • 0311 (stress-from-weights 'LH\" 1) 0131 (stress-from-weights \"HH' 1) (131 Psaitoo-Weight In fact, it is possible now to use the stress to further constrain the weight.",
        "Note that if the first syllable of record is light it must also be unstressed and if it is heavy it also must be stressed.",
        "Thus, the third line above is inconsistent.",
        "I implement this additional constraint by assigning record a pseudo-weight of '••H', where the \"..\" sign indicates that the weight assigment is constrained to be the same as the stress assigment (either heavy & stressed or not heavy & not stressed).",
        "I can now determine the possible stress assignments of the pseudo-weight \"••H\" by filling in the •••\" constraint with all possible bindings (H or L) and testing the results to make sure the constraint is met.",
        "(stress-from-weights \"LH\" 0) – 0011 (stress-from-weights 'HH\" 0) – 0311 (stress-from-weights \"LH\" 1) – 0131 ; No Good (stress-from-weights 'HH' 1) – 0131 Of the four logical inputs, the constraint excludes the third case which would assign the first syllable a stress but not a heavy weight.",
        "Thus, there are only three possible input/output relations meeting all of the constraints:*"
      ]
    },
    {
      "heading": "Weight Extrametrical Syllables Stress",
      "text": [
        "LH 0 (verb) 01 HH 0 (verb) 31 HH 1 (noun) 13 All three of these possibilities are grammatical.",
        "The following pseudo-weights are defined:",
        "• Ile noon should probably have the woo 10 rather than the mesa 13. assume that se varsmetrics1 syllable has 3 stress if it is heavy.",
        "and 0 cress if it is tight flu mem of the atrametrical tyllable is very difficult to predict.",
        "as discusted Mosel.",
        "have already given examples of the labels H, L and S and R are used in certain morphological analyses (see below), N is used for examples where Hayes would invoke his rule of Sonorant Destressing (see below), and ?",
        "is not used except for demonstrating the program.",
        "The procedure that assigns pseudo-weight to orthography is roughly as outlined below, ignoring morphology, etymological and more special cases than I wish to admit.",
        "1.",
        "Tokenize the orthography so that digraphs such as th.",
        "gh.",
        "wh, ae.",
        "ai, ei, etc., are single units.",
        "2.",
        "Parse the string of tokens into syllables (assigning amsonants to the right when the location of the syllable boundary is ambiguous).",
        "3.",
        "Strip oft' the final consonant.",
        "4.",
        "For each syllable a.",
        "Silent e, Vocalic y and Syllabic Sonorants (e.g., -Ie.",
        "-er, -re) are assigned no weight.",
        "b. Digraphs that are usually realized as long vowels (e.g., oi) are marked H. c. Syllables ending with sonorant consonants are marked N: other closed syllables are marked H. d. Open syllables are marked",
        "In practice.",
        "I have observed that there are remarkably few stress assignments meeting all of the constraints.",
        "After analyzing over 20.000 words, there were no more than 4 possible stress assigments for any particular combination of pseudo-weight and number of extrametrical number of syllables.",
        "Most observed combinations had a unique stress assignment, and the average (by observed combination with no frequency normalization) has 1.5 solutions.",
        "In short, the constraints are extremely powerful; words like record with multiple stress patterns are the exception rather than the rule."
      ]
    },
    {
      "heading": "9. Ordering Multiple Solutions",
      "text": [
        "Generally, when there are multiple stress assignments, one of the possible stress assigments is much more plausible than the others.",
        "For instance, nouns with the pseudo-weight of (e.g., difference) have a strong tendency toward antipenultimate stress, even though they could have either 100 or 310 stress depending on the weight of the penultimate.",
        "The program takes advantage of this fact by returning a sorted list of solutions, all of which meet the constraints, but the solutions toward the front of the list are deemed more plausible than the solutions toward the rear of the list.",
        "Sorting the solution space in this way could be thought of as a kind of default reasoning mechanism.",
        "That is.",
        "the ordering criterion, in effect, assigns the penultimate syllable a default weight of L. unless there is positive evidence to the contrary.",
        "Of course, this sorting technique is not as general as an arbitrary default reasoner.",
        "but it seems to be general enough for the application.",
        "This limited defaulting mechanism is extremely efficient when there are only a few solutions meeting the constraints.",
        "This default mechanism is also used to stress the following nouns Hottentot Jackendoff balderdash ampersand Hackensack Arkansas Algernon mackintosh davenport merchandise cavalcade palindrome nightingale Appelbaum Aberdeen misanthrope where the penultimate syllable ends with a sonorant consonant (n, r, According to what has been said so far, these sonorant syllables are closed and so the penultimate syllable should be heavy and should therefore be stressed.",
        "Of course, these nouns all have antipenultimate stress, so the rules need to be modified.",
        "Hayes suggested a Sonorant Destressing rule which produced the desired results by erasing the foot structure (destressing) over the penultimate syllable so that later rules will reanalyze the syllable as unstressed.",
        "I propose instead to assign these sonorant syllables the pseudo-weight of N which is essentially identical to ■.• In this way; all of these words will have the pseudo-weight of HNH which is most likely stressed as 103 (the correct answer) even though 313 also meets the constraints, but fair worse on the ordering criteron.",
        "(stress-from-weights 1-INH\" 1) (\"103\"313/ Contrast the examples above with Adirondack where the stress does not back up past the sonorant syllable.",
        "The ordering criterion is adjusted to produce the desired results in this case, by assuming that two binary feet (i.e., 2010 stress) are more plausible than one tertiary foot (i.e.. 0100 stress).",
        "(weights-from-orthography \"Adirondack\") – \"1...•NH\" (stress-from-weights \"L■NI-1-) (\"2013' \"0103\") It ought to be possible to adjust the ordering criterion in this way to produce (essentially) the same results as Hayes' rules."
      ]
    },
    {
      "heading": "10. Morphology",
      "text": [
        "Thus far, the discusion has assumed monomorphemic input.",
        "Morphological affixes add yet another rich set of constraints.",
        "Recall the examples mentioned in the abstract, degrade/degradation and telegraphheligraphy, which were used to illustrate that stress alternations are conditioned by morphology.",
        "This section will discuss how this is handled in the program.",
        "The task is divided into two questions: (1) how to parse the word into morphemes.",
        "and (2) how to integrate the morphological parse into the rest of stress assignment procedure discussed above.",
        "N and • used to be identical.",
        "I am gill not sure the differeoces tie justified.",
        "At any rate, the differences we very subtle and certainly act worth goins into here.",
        "where latinate affixes such as in+.",
        "ir+, ac+, +ity, +ion.",
        "+ive.",
        "-al are found at level I, Greek and Germanic affixes such as hetero#, un#, under# #ness.",
        "#ly arc found at level 2. and compounding is found at level 3.",
        "The term level refers to Mohanan's theory of Level Ordered Morphology and Phonology IMohanani which builds upon a number of well-known differences between + boundary affixes (level 1) and # boundary affixes (level 2).",
        "• Distributional Evidence: It is common to find a level I affix inside the scope of a level 2 affix (e.g., uninn + serried and form +al#ly).",
        "but not the other way around (e.g., *in +un#terned and • form#1y +al).",
        "• Wordness: Level 2 affixes attach to words, whereas level I affixes may attach to fragments.",
        "Thus, for example, in+ and +al can attach to fragments as in intern and criminal in ways that level 2 cannot sun#tern and •crimin#rtess.",
        "• Stress Alternations: Stress alternations are found at level I parent",
        "parenr+ai but not at level 2 as demonstrated by parent#hood.",
        "Level 2 suffixes are called stress neutral because they do not move stress.",
        "• Level I Phonological Rules: Quite a number of phonological rules apply at level I but not at level 2.",
        "For instance, the so-called tri",
        "syllabic will lax a vowel before a level I suffix (e.g.. divine divin +ity) but not before a level 2 suffix (e.g., devine#1y and devine#ness).",
        "Similarly, the rule that maps /t/ into /s/ in president – presidency also fails to apply before a level 2 affix:"
      ]
    },
    {
      "heading": "president#hood (not •presidence#hood).",
      "text": [
        "Given evidence such as this, there can be little doubt on the necessity of the level ordering distinction.",
        "Level 2 affixes are fairly easy to implement; the parser simply strips off the stress neutral affixes, assigns stress to the parts and then pastes the results back together.",
        "For instance, parenthood is parsed into parent and *hood.",
        "The pieces are assigned 10 and 3 stress respectively, producing 103 stress when the pieces are recombined.",
        "In general, the parsing of level 2 affixes is not very difficult, though there are some cases where it is very difficult to distinguish between a level I and level 2 affix.",
        "For example, able is level 2 in changeable (because of silent e which is not found before level 1 suffixes), but level I in comparable (because of the stress shift from compare which is not found before level 2 suffixes).",
        "For dealing"
      ]
    },
    {
      "heading": "with a limited number of affixes like able and -ment, there are a",
      "text": [
        "number of special purpose diagnostic procedures which decide the appropriate level.",
        "Level 1 suffixes have to be stressed differently.",
        "In the lexicon, each level I suffix is marked with a weight.",
        "Thus, for example, the suffix +ity is marked RR.",
        "These weights are assigned to the last two",
        "These selected results are biased slightly in favor of the program.",
        "Over all, the program correctly assigns primary stress to 82% of the words in the dictionary, and 85% for words ending with a level I affix.",
        "Prefixes are more difficult than suffixes.",
        "Examples such as super +Amu (level I I).",
        "sitper#conductor (level 2), and siper##market (level 3) illustrate just how difficult it is to assign the prefix to the correct level.",
        "Even with the correct parse, it not a simple matter to assign stress.",
        "In general, level 2 prefixes are stressed like compounds, assigning primary stress to the left morpheme (e.g., indercarriage) for nouns and to the right for verbs (e.g., undergO) and adjectives (e.g., iltraconsirvative).",
        "though there seem to be two classes of exceptions.",
        "First, in technical terms, under certain conditions",
        "• Strings such as ization.",
        "across.",
        "login are really sequences of several affixes.",
        "In order",
        "to avoid scene difficult parsing issues, I dscided not to allow inure than one level I suffix per word This linlitilli00 requires that I enter sequences of level I suffices into the lexicon.",
        "(Hayes, pp.",
        "307-3091, primary stress can back up onto the prefix: (e.g., telegraphy).",
        "Secondly, certain level I suffixes such as +ity seem to induce a remarkable stress shift (e.g., siper#conductor and sUper#conductivity), in violation of level ordering as far as I can see.",
        "For level 1 suffixes, the program assumes the prefixes are marked light and that they are extrametrical in verbs, but not in nouns.",
        "Prefix extrametricality accounts for the well-known alternation permit (noun) versus permit (verb).",
        "Both have weight (recall the prefix is L), but the noun has initial stress since the final syllable is extrametrical hereas the verb has final stress since the initial syllable is extrametrical.",
        "Extrametricality is required here, because otherwise both the noun and verb would receive initial stress.",
        "Etymology The stress rules outlined above work very well for the bulk of the language, but they do have difficulties with certain loan words.",
        "For instance, consider the Italian word tortOni.",
        "By the reasoning outlined above, torgini ought to stress like th/culi since both words have the same part of speech and the same syllable weights, but obviously.",
        "it doesn't.",
        "In fact, almost all Italian loan words have penultimate stress.",
        "as illustrated by the Italian surnames: Aldrighetti.",
        "eingeletti.",
        "BellOtti, lanniscci.",
        "ltaliâno.",
        "Lombardino.",
        "Mercian°.",
        "Marconi.",
        "Morillo, Olivetti.",
        "It is clear from examples such as these that the stress of Italian loans is not dependent upon the weight of the penultimate syllable, unlike the stress of native English words.",
        "Japanese loan words are perhaps even more striking in this respect.",
        "They too have a very strong tendency toward penultimate stress when (mis)pronounced by English speakers: Asahâra.",
        "Enomino.",
        "FujimOki.",
        "FujimOto.",
        "Fujimitra.",
        "Funasiika.",
        "Toyina.",
        "Umida.",
        "One might expect that a loan word would be stressed using either the rules of the the language that it was borrowed from or the rules of the language that it was borrowed into.",
        "But neither the rules of Japanese nor the rules of English can account for the penultimate stress in Japanese loans.",
        "I believe that speakers of English adopt what I like to call a pseudo-foreign accent.",
        "That is, when speakers want to communciate that a word is non-native, they modify certain parameters of the English stress rules in simple ways that produce bizarre \"foreign sounding\" outputs.",
        "Thus, if an English speaker wants to indicate that a word is Japanese, he might adopt a pseudo-Japanese accent that marks all syllables heavy reguardless of their shape.",
        "Thus.",
        "Fujimitra, on this account, would be assigned penultimate stress because it is noun and the penultimate syllable is heavy.",
        "Of course there are numerous alternative pseudo-Japanese accents that also produce the observed penultimate stress.",
        "The current version of the program assumes that Japanese loans have light syllables and no extrametricality.",
        "At the present time, I have no arguments for deciding between these two alternative pseudo-Japanese accents.",
        "The pseudo-accent approach presupposes that there is a method for distinguishing native from non-native words, and for identifying the etymological distinctions required for selecting the appropriate pseudo-accent.",
        "Ideally, this decision would make use of a number of phonotactic and morphological cues, such as the fact that Japanese has extremely restricted inventory of syllables and that Germanic makes heavy use of morphemes such as -berg.",
        "wein- and -stein.",
        "Unfortunately, because I haven't had the time to develop the right model, the relavant etymological distinctions are currently decided by a statistical trigram model.",
        "Using a number of training sets (gathered from the telephone book, computer readable dictionaries.",
        "bibliographies, and so forth), one for each etymological distinction.",
        "I estimated a probability P(xyzle) that each three letter sequence xyz is associated with etymology e. Then, when the program sees a new word w, a straightforward Baysian argument is applied in order to estimate for each etymology a probability P(elw) based on the three letter sequences in w. I have only just begun to collect training sets, but already the results appear promising.",
        "Probability estimates are shown in the figure below for some common names whose etymology most readers probably know.",
        "The current set of etymologies are: Old French (OF).",
        "Old English (OE), International Scientific Vocabulary (ISV), Middle",
        "French (MF), Middle English (ME), Latin (L), Gaelic (NBrit), French (Fr), Core (Core), Swedish (Swed), Russian (Rus), Japanese (Jap), Germanic (Get), and Southern Romance (SRom).",
        "Only the top two candidates are shown and only if the probability estimate is 0.05 or better.",
        "As is to be expected.",
        "the model is relatively good at fitting the training data.",
        "For example.",
        "the following names selected from the training data where rim through the model and assigned the label Jap with",
        "exceptions demonstrate, the model has relatively more difficulty with short names, for the obvious reason that short names have fewer trigrams to base the decision on.",
        "Perhaps short names should be dealt with in some other way (e.g., an exception dictionary).",
        "I expect the model to improve as the training sets are enlarged.",
        "It is not out of the question that it might be possible to train the model on a very large number of names, so that there is a relatively small probability that the program will be asked to estimate the etymology of a name that was not in one of the training sets.",
        "If, for example, the training sets included the 10000 most frequent names, then most of the names the program would be asked about would probably be in one the training sets (assuming that the results reported above for the telephone directories also apply here).",
        "Before concluding, I would like to point out that etymology is not just used for stress assignment.",
        "Note, for instance, that orthographic ch and gh are hard in Italian loans Macchi and spaghetti, in constrast to the general pattern where ch is /ch/ and /ghl is silent.",
        "In general, velar softening seems to be conditionalized by etymology.",
        "Thus, for example, /g/ is usually soft before /I/ (as in ginger) but not in girl and Gibson and many other Germanic words.",
        "Similarly, other phonological rules (especially vowel shift) seem to be conditionalized by etymology.",
        "I hope to include these topics in a longer version of this paper to be written this summer.",
        "12.",
        "Coedaitlag Remarks Stress assignment was formulated in terms of Waltz' constraint propagation paradigm, where syllable weight played the role of Waltz' • labels and Sproat's weight table played the role of Waltz' vertex constraints.",
        "It was argued that this formalism provided a clean computational framework for dealing with the following four linguistic issues:",
        "• Syllable Weight obey I develop • Part of Speech: torment (n) / torment (v) • Morphology: degrade / degradation • Etymology: calculi / tortani",
        "Currently, the program correctly assigns primary stress to 82% of the words in the dictionary."
      ]
    },
    {
      "heading": "Releresees",
      "text": []
    }
  ]
}
