{
  "info": {
    "authors": [
      "W. Randolph Ford",
      "Raoul N. Smith"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2023",
    "title": "Collocational Grammar as a Model for Human-Computer Interaction",
    "url": "https://aclweb.org/anthology/C82-2023",
    "year": 1982
  },
  "references": [
    "acl-J81-1003",
    "acl-P81-1009",
    "acl-P81-1011",
    "acl-T75-2013"
  ],
  "sections": [
    {
      "text": [
        "Contrary to the long-held belief of transformational grammarians for communication in general, the majority of natural language sentences which people actually use in communicating with a computer, in an unconstrained mode, are not novel.",
        "As Thompson and Thompson 1981:660 observe: \"monotony of structure is the rule rather than the exception in human-computer communication.\" Thompson 1981:41 reports in her study of such communications that 75 percent of the queries were wh-questions, 19 percent were commands, 5 percent were statements, and 1 percent were yes/no questions.",
        "The repetitive feature of natural language is not a new concept.",
        "Similar observations have been made before.",
        "Damerau 1971 used collocation of lexical items as the basis for a Markov model in an experiment for text generation.",
        "Becker claims that \"the wonderful feats of the human intellect... are based as much on memorization as on any impromptu problem--solving\" (1975:62).",
        "He posits a phrasal lexicon consisting of six major categories of lexical phrases by which we \"stitch together swatches of text that we have heard before; productive processes have the secondary role of adapting the old phrases to the new situations\" (1975:60).",
        "All of these approaches to natural language data rely heavily on the observation that many lexical items tend -106-co-occur.",
        "This surface co-occurrence is the result of what may at times be complicated syntactic and eemantio interrelations of language units.",
        "Unfortunately, a systematic accounting of these interrelations has not been achieved in any linguistic theory.",
        "The thrust of our approach is that the more of language which can be handled lexically, the easier will human language be able to be modelled.",
        "Actual data on the frequency of lexical collocation are very sparse.",
        "A study of word sequences in PANALOG text has shown a surprising amount of repetition of word sequences (Bienstook and Smith in preparation).",
        "(PANALOG is a system for passing messages among small groups in computer conferencing with telemail and calendar features.",
        "See Housman 1979.",
        "The data are of human-human communication and not human-computer communication and are thematically restricted.",
        "They therefore resemble Damerau's data.)",
        "A study of parts of the Brown English Corpus has been undertaken in order to get less thematically homogeneous material.",
        "In addition, Wizard of OZ experiments with unconstrained human-computer input will begin soon at GTE Laboratories in order to gather the more relevant human-computer data.",
        "A PANALOG text of 16,133 words chosen for study.",
        "The longest string which occurred more than once was a seven word quote from Nietzsche.",
        "Two six-word strings occurred twice ' and at length five, one occurred three times and thirteen were repeated twice.",
        "This is a revealing measure of the amount of repetition in a text of this length.",
        "In particular, recurring two word strings account for 40.8 percent of the running text and recurring three word strings comprise 8.1 percent of the text.",
        "The basic assumption of the frequent occurrence of lexical collocation in natural language texts, especially in human-computer communication, is the basis for the development of a new type of natural language processor.",
        "Ford, 1981, has constructed a natural language processing system for database updating, retrieval, and manipulation, which relies critically on the observation that real users tend to employ a very limited set .of lexical String types in querying databases.",
        "The Ford natural language processor consists of a two stage reduction algorithm for translating natural language inputs into basic functions which are then used to perform the query.",
        "The first stage of the reduction changes the input words to meaning representations using a list of lexical items and a meaning correlate list.",
        "The second stage takes as input strings of these meaning correlates and changes them into basic list.",
        "409 numeric representations for words mapped down to 132 unique meanings and 1328 canonical sentence vectors mapped down",
        "to 19 functions.",
        "This two stage reduction scheme worked efficiently enough to respond to 93.8 percent of the 1697 input queries, including ungrammatical ones from inexperienced users, with a response time of 1.5 seconds, operating in an environment of 90K 8-bit bytes.",
        "This compares very favorably to Thompson 1981 where only 67.7 percent of REL queries were correctly parsed with an average response time of 10 seconds.",
        "(Space requirements were not reported.)",
        "Similarly, Damerau 1981 and Petrick 1981 report a success rate for TQA of 65.1 percent inputs correctly parsed with the time required to process a sentence typically being 10 seconds.",
        "The reason why the system works so well in terms of accuracy, speed, and small storage requirements is based on the two stage reduction technique which, in turn, is based on the fact that a great many inputs in human-computer communication are repetitious syntactically, semantically, and lexically.",
        "Repetition is a principal characteristic of human-computer communication."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
