{
  "info": {
    "authors": [
      "Deepak Ravichandran",
      "Abraham Ittycheriah",
      "Salim Roukos"
    ],
    "book": "Human Language Technology Conference and Meeting of the North American Association for Computational Linguistics – Short Papers",
    "id": "acl-N03-2029",
    "title": "Automatic Derivation of Surface Text Patterns for a Maximum Entropy Based Question Answering System",
    "url": "https://aclweb.org/anthology/N03-2029",
    "year": 2003
  },
  "references": [
    "acl-N01-1005",
    "acl-P02-1006"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper we investigate the use of surface text patterns for a Maximum Entropy based Question Answering (QA) system.",
        "These text patterns are collected automatically in an unsupervised fashion using a collection of trivia question and answer pairs as seeds.",
        "These patterns are used to generate features for a statistical question answering system.",
        "We report our results on the TREC-10 question set."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Several QA systems have investigated the use of text patterns for QA (Soubbotin and Soubbotin, 2001), (Soubbotin and Soubbotin, 2002), (Ravichandran and Hovy, 2002).",
        "For example, for questions like “When was Gandhi born?”, typical answers are “Gandhi was born in 1869” and “Gandhi (1869-1948)”.",
        "These examples suggest that the text patterns such as “ NAME was born in BIRTHDATE ” and “ NAME ( BIRTHDATE - DEATHYEAR )” when formulated as regular expressions, can be used to select the answer phrase to questions.",
        "Another approach to a QA system is learning correspondences between question and answer pairs.",
        "IBM’s Statistical QA (Ittycheriah et al., 2001 a) system uses a probabilistic model trainable from Question-Answer sentence pairs.",
        "The training is performed under a Maximum Entropy model, using bag of words, syntactic and name entity features.",
        "This QA system does not employ the use of patterns.",
        "In this paper, we explore the inclusion of surface text patterns into the framework of a statistical question answering system."
      ]
    },
    {
      "heading": "2 KM Corpus",
      "text": [
        "A corpus of question-answer pairs was obtained from Knowledge Master (1999).",
        "We refer to this corpus as the",
        "KM database.",
        "Each of the pairs in KM represents a trivia question and its corresponding answer, such as the ones used in the trivia card game.",
        "The question-answer pairs in KM were filtered to retain only questions that look similar to the ones presented in the TREC task2.",
        "Some examples of QA pairs in KM:",
        "1.",
        "Which country was invaded by the Libyan troops in 1983?- Chad 2. Who led the 1930 Salt March in India?",
        "- Mohandas Gandhi"
      ]
    },
    {
      "heading": "3 Unsupervised Construction of Training",
      "text": []
    },
    {
      "heading": "Set for Pattern Extraction",
      "text": [
        "We use an unsupervised technique that uses the QA in KM as seeds to learn patterns.",
        "This method was first described in Ravichandran and Hovy (2002).",
        "However, in this work we have enriched the pattern format by inducing specific semantic types of QTerms, and have learned many more patterns using the KM."
      ]
    },
    {
      "heading": "3.1 Algorithm for sentence construction",
      "text": [
        "1.",
        "For every question, we run a Named Entity Tagger HMMNE 3 and identify chunks of words, that signify entities.",
        "Each such entity obtained from the Question is defined as a Question term (QTerm).",
        "The Answer Term (ATerm) is the Answer given by the KM corpus.",
        "2.",
        "Each of the question-answer pairs is submitted as query to a popular Internet search engine 4.",
        "We use the top 50 relevant documents after stripping off the HTML tags.",
        "The text is then tokenized to smoothen white space variations and chopped to individual sentences.",
        "3.",
        "For every sentence obtained from Step (3) apply",
        "tains at least one of the QTerms plus the ATerm.",
        "For example, we obtain the following sentences for the QA pair “Which country was invaded by the Libyan troops in 1983?",
        "- Chad”:",
        "1.",
        "More than 7,000 Libyan troops entered Chad.",
        "2.",
        "An OUA peacekeeping force of 3,500 troops replaced the Libyan forces in the remainder of Chad.",
        "3.",
        "In the summer of 1983, GUNT forces launched an offen",
        "sive against government positions in northern and eastern Chad.",
        "The underlined words indicate the QTerms and the ATerms that helped to select the sentence as a potential way of answering the Question.",
        "The algorithm described above was applied to each of the 16,228 QA pairs in our KM database.",
        "A total of more than 250K sentences was obtained."
      ]
    },
    {
      "heading": "3.2 Sentence Canonicalization",
      "text": [
        "Every sentence obtained from the sentence construction algorithm is canonicalized.",
        "Canonicalization of a sentence is performed on the basis of the information provided by HMMNE, the QTerms and the ATerm.",
        "Canonicalization in this context may be defined as the general",
        "ization of a sentence based on the following process: 1.",
        "Apply HMMNE to each sentence obtained from the sentence construction algorithm.",
        "2.",
        "Identify the QTerms and ATerm in the answer sentence.",
        "3.",
        "Replace the ATerm by the tag “ ANSWER ”.",
        "4.",
        "Replace each identified Named Entity by the class of entity it represents.",
        "5.",
        "If a given Named Entity is also a QTerm, indicate it",
        "by the tag “QT”.",
        "The following example illustrates canonicalization.",
        "Consider the sentence: More than 7,000 Libyan troops entered Chad.",
        "The application of HMMNE results in: The canonicalization step gives the sentence:"
      ]
    },
    {
      "heading": "3.3 Pattern Extraction",
      "text": [
        "Pattern extraction algorithm.",
        "1.",
        "Every sentence obtained from sentence canonicalization algorithm is delimited by the tags “ START ” and “ END ” and then passed through a Suffix Tree.",
        "The Suffix Tree algorithm obtains the counts of all sub-strings of the sentence.",
        "2.",
        "From the Suffix Tree we obtain only those sub-strings that are at least a trigram, contain both the “ ANSWER ” and the “ QT ” tag and have at least a count of 3 occurrences.",
        "Some examples of patterns obtained from the Suffix Tree algorithm are as follows: A set of 22,353 such patterns were obtained by the application of the pattern extraction algorithm from more than 250,000 sentences.",
        "Some patterns are very general and applicable to many questions, such as the ones in examples (7) and (8) while others are more specific to a few questions, such as examples (9) and (10).",
        "Having obtained these patterns we now can learn the appropriate “weights” to use these patterns in a Question Answering System."
      ]
    },
    {
      "heading": "4 Maximum Entropy Training",
      "text": [
        "For these experiments we use the Maximum Entropy formulation (Della Pietra et al., 1995) and model the distribution (Ittycheriah, 2001b),",
        "The patterns derived above are used as features to model the distribution , which predicts the “correctness” of the configuration of the question, , the predicted answer tag, , and the answer candidate, .",
        "The training data for the algorithm consists of TREC-8, TREC-9, and a subset of the KM questions which have been judged to have answers in the TREC corpus5.",
        "The total number of questions available for training is shown in Table 1.",
        "We perform 3 sets of experiment with different choice of feature sets for training: 1.",
        "In the first experiment, the patterns obtained automatically from the web are trained along with the expected type of answer using the Maximum Entropy Framework.",
        "We refer to this system as the Pat Only System.",
        "This feature collection consisted",
        "of roughly 22,353 pattern features along with the 30 different expected answer types (the ones recognized by HMMNE).",
        "2.",
        "In the second experiment we use a Statistical QA system that contains bag of words, syntactic and named-entity features.",
        "We refer to this system as the IBM TREC1 1 System.",
        "Details of this system appear in (Ittycheriah and Roukos, 2002).",
        "This system has approximately 8,000 features.",
        "3.",
        "In the third experiment we add the patterns as additional features to the base system IBM TREC11 and train the system.",
        "We refer to this system as the ME PAT System.",
        "Hence, the total number of features in this system is equal to the sum of the ones in Pat Only and IBM TREC1 1 system.",
        "These systems were trained on TREC-9 and KM and for picking the optimum model we used TREC-8 as held-out test data."
      ]
    },
    {
      "heading": "5 Results on TREC-10",
      "text": [
        "We then tested the model on TREC-10.",
        "We tabulate the results in Table 2.",
        "The TREC-10 collection consisted of 500 questions.",
        "The Rank column indicates the number of questions answered by the QA systems with that particular rank.",
        "Finally the Mean Rank Reciprocal (MRR) scores are reported."
      ]
    },
    {
      "heading": "6 Conclusion and Future Work",
      "text": [
        "Not surprisingly, the PAT ONLY system shows only average performance as compared to other TREC-10 systems.",
        "This is because the system has no information about the question except about its expected answer-type.",
        "Hence, the PAT ONLY system would answer all the questions involving TIME such as: “When was A born?”, “When did A die?”, “Which year did A start attending college?”, “When did A author book B?”with the same answer!",
        "Nonetheless, the ME PAT results show that surface text patterns are useful for a Question Answering System.",
        "Although in these experiments a feature set of 22,353 patterns was trained on approximately 210,000 instances, only 1500 patterns was actually found in the final training data which had a count of at least 8 instances.",
        "This suggests that the approach used here to train weights suffers from the problem of having very little training data as compared to the number of features.",
        "A much better approach would be to train the weights of the patterns from the unsupervised collection itself.",
        "However, the effect of noise introduced due to such unsupervised training is unclear.",
        "The above technique represents a very clean approach to integrating the use of patterns into a QA system.",
        "Most of the rule based systems take years to engineer and are very difficult to duplicate.",
        "However, a good statistical system can be duplicated to give good performance in a relatively short amount of time."
      ]
    }
  ]
}
