{
  "info": {
    "authors": [
      "Kyung-Mi Park",
      "Seonho Kim",
      "Ki-Joong Lee",
      "Do-Gil Lee",
      "Hae-Chang Rim"
    ],
    "book": "International Joint Workshop on Natural Language Processing in Biomedicine and Its Applications NLPBA BioNLP",
    "id": "acl-W04-1214",
    "title": "Incorporating Lexical Knowledge into Biomedical NE Recognition",
    "url": "https://aclweb.org/anthology/W04-1214",
    "year": 2004
  },
  "references": [
    "acl-A00-1031",
    "acl-W03-1305",
    "acl-W95-0107"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we propose a two-phase biomedical named entity(NE) recognition method based on SVMs.",
        "We first recognize biomedical terms, and then assign appropriate semantic classes to the recognized terms.",
        "In the two-phase NE recognition method, the performance of term recognition is critical to the overall performance of the system because term recognition errors can be propagated to the semantic classification phase.",
        "In this study, we try to improve the performance of term recognition by using lexical knowledge.",
        "We utilize salient NPs and collocations as lexical knowledge extracted from raw corpus.",
        "In addition, we use morphological knowledge extracted from training data as features for learning SVM classifiers.",
        "Experimental results show that our system obtains an F-measure of 62.97% on the test data, and that the performance can be improved upto 2.82% by using lexical knowledge."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Biomedical NE recognition can be divided into two phases: the term recognition phase which finds the boundaries of terms for a given sentence, and the semantic classification phase which determines the semantic classes of the terms.",
        "With two-phase NE recognition method, we can alleviate the unbalanced class distribution problem by decreasing the number of negative examples, which is much larger than positive examples.",
        "Also, we can utilize different feature sets appropriate for each phase.",
        "However, since the output of recognition phase is used as the input of classification phase, the coverage of recognition phase needs to be high.",
        "Furthermore, since recognition errors can be propagated to the next phase, it is important to improve the performance of term recognition.",
        "In this paper, we propose a two-phase biomedical NE recognition method based on SVMs (K. J. Lee, 2003).",
        "In order to improve the accuracy of term recognition, we try to incorporate lexical knowledge into preprocessing and post-processing steps of the term recognition phase.",
        "In these steps, we use lexical knowledge extracted from raw corpus.",
        "Also, we use morphological knowledge extracted from training data as features for the SVM learning.",
        "The remaining part of this paper is organized as follows: In section 2, we explain the proposed method of two-phase biomedical NE recognition.",
        "In section 3, we describe an automatic extraction method of lexical and morphological knowledge.",
        "Finally, we show some experimental results in section 4, and conclude the paper in section 5."
      ]
    },
    {
      "heading": "2 Biomedical NE Recognition",
      "text": [
        "As shown in Figure 1, the proposed NE recognition method consists of three-steps term recognition phase and the classification phase.",
        "In the preprocessing step, input sentences are POS-tagged and NP-chunked, and then noun phrases that include biomedically salient words such as biochemical, pathways, activation, human, cells, and R24 are identified.",
        "In the boundary identification step, one of B, I, O class is assigned to words in the identified noun phrases.",
        "In the post-processing step, collocation relations between words inside the boundary and words outside the boundary are identified.",
        "Finally, we classify the term identified by B and I as one of protein, DNA, RNA, cell-line, or cell-type in the semantic classification phase.",
        "To recognize biomedical terms, we do not need to examine all words in a sentence.",
        "We filter out words which have a strong possibility of becoming a non-term.",
        "In this study, we find the terms only in noun phrases which include biomedically salient words.",
        "When some words are occurred more frequently in the training data than in out-of-domain corpus, we regard the words as"
      ]
    },
    {
      "heading": "Term Recognition Semantic Classification",
      "text": [
        "salient words of the domain.",
        "Therefore, salient words can be extracted through corpus comparison.",
        "Most terms of the biomedical domain such as NF-kappa scarcely occur in out-of-domain text.",
        "Therefore, salient words can provide useful information for spotting the probable noun phrases which include terms.",
        "The italicized words in Figure 1 correspond to salient words.",
        "In order to find noun phrases including salient words, we first identify noun phrases by using POS tagger (T. Brants, 2000) and NP chun-ker (L. Ramshaw, 1995), and then perform NP spotting by using salient words.",
        "As a result, about 95% of terms can be seen in the spotted NPs.",
        "This step identifies boundaries of biomedical terms in noun phases that include salient words.",
        "In order to train a SVM for the identification task, we use the following features.",
        "• word: We use 5 words: the target word, left two words, and right two words.",
        "• prefix/suffix: Morphological patterns reflect orthographical characteristics of words as prefix or suffix.",
        "In case that a target word infrequently occurs in the training data, a morphological pattern can become an important feature as a normalized form of the word.",
        "Also, when a target word is only constituted by lower letters, a morphological pattern such as -ase can become a useful information to indicate whether the word is a term or not.",
        "Morphological patterns are sorted in the descending order of the amount of relative entropy of each pattern.",
        "When a word is given, we find the most highly ranked morphological pattern that matches one of the word's substrings.",
        "• word construction form: This feature indicates whether a target word contains capital letters, lower letters, numbers, or symbols.",
        "• gene sequence: This binary feature indicates whether a target word represents a gene sequence or not.",
        "• Greek: If a target word includes a Greek letter such as alpha, beta, or kappa, we use the Greek letter as a feature.",
        "• dot, hyphen: This feature represents whether a target word has dot or hyphen.",
        "• first word, capital start: This binary feature indicates whether the target word is the first word or not, and whether the target word starts with the capital letter.",
        "Using SVM classifiers, we assign one of the following classes to each word: B-TERM class representing the beginning of a biomedical term, /- TERM class representing a part of a biomedical term, or O class indicating that the word does not belong to the biomedical term.",
        "In order to reduce term recognition errors, we extract collocations from Medline database, and extend a term boundary when the word inside the boundary and the word outside the boundary have a collocation relation.",
        "In Figure 1, a bigram human T is identified as a collocation, and human is included in the term.",
        "As shown in Figure 1, since words such as human, transcription, and binding are frequently used as both a term and a non-term, it is difficult to determine whether the words become a term or not.",
        "Therefore, if the words occur outside the boundary, it can be useful to identify whether the words have a collocation relation with words inside the boundary.",
        "In this phase, a proper semantic class is assigned to the recognized term by voting the SVM classifiers.",
        "We use the following features.",
        "• word: Only 4 words on the rightside of the term are used as features.",
        "• word variation: We also use 4 word variations like word features.",
        "To make a word variation, we alter capital letters to lower letters and substitute # for numbers.",
        "Also, to segment words into two parts, we regard symbols as space.",
        "Among the parts of the target words, we select the longest part as a word variation."
      ]
    },
    {
      "heading": "3 Automated Extraction of Lexical and Morphological Knowledge",
      "text": [
        "In order to extract salient words from GENIA corpus, we compute each word's probabilities both in out-of-domain corpus and in GENIA corpus respectively.",
        "We use Penn II raw corpus as out-of-domain corpus.",
        "From the estimated probabilities, we compute the relative frequency ratio of a word w by equation (1).",
        "We regard the word as a salient word when its relative frequency ratio value is larger than a threshold.",
        "Table 1 shows the examples of salient words."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "The term recognition phase generally finds the boundary of all terms in a given sentence.",
        "However, in a given training data, biomedical NEs which belong to the only 5 specific classes are tagged.",
        "We thought that it is proper to identify all terms and to assign appropriate semantic classes to the identified terms.",
        "In this study, we tagged all biomedical NEs in the training data by using GENIA 3.02p version.",
        "Thus, in the term recognition phase, we find all the biomedical terms represented in sentences.",
        "In the classification phase, we extract only the biomedical NEs which belong to 5 specific classes among the identified terms.",
        "The total number of biomedical NEs that belong to other classes is 25,703.",
        "For experiments, we utilized the SVM light package.",
        "In both phases, we used a polynomial kernel (degree 2) with the one-vs-rest classification method.",
        "Table 4 shows the overall performance on the test data.",
        "Our system obtains an F-measure of 62.97%.",
        "Table 5 shows the performance of each phase on the test data.",
        "Our system obtains an F-measure of 51.57% in the term recognition phase.",
        "Due to other class, our system obtains a recall of 76.66% and a precision of 38.85% in the recognition phase.",
        "For the classification task, our system obtains an accuracy of 85.11%.",
        "Table 6 shows the effectiveness of the lexical knowledge.",
        "The baseline performance represents the result of the NE recognition without using any additional knowledge.",
        "We obtain the performance improvement of 2.82% by using additional knowledge."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "In this study, we divide the task of biomedical NE recognition into two phases.",
        "To improve the"
      ]
    }
  ]
}
