{
  "info": {
    "authors": [
      "Sameer S. Pradhan",
      "Kadri Hacioglu",
      "Wayne H. Ward",
      "James H. Martin",
      "Daniel Jurafsky"
    ],
    "book": "Conference on Computational Natural Language Learning CoNLL",
    "id": "acl-W05-0634",
    "title": "Semantic Role Chunking Combining Complementary Syntactic Views",
    "url": "https://aclweb.org/anthology/W05-0634",
    "year": 2005
  },
  "references": [
    "acl-J02-3001",
    "acl-N01-1025",
    "acl-N03-2009",
    "acl-N04-1030",
    "acl-N04-4037",
    "acl-P03-1002",
    "acl-P05-1072",
    "acl-W00-0730",
    "acl-W04-2416",
    "acl-W04-3212",
    "acl-W05-0620",
    "acl-W95-0107"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes a semantic role labeling system that uses features derived from different syntactic views, and combines them within a phrase-based chunking paradigm.",
        "For an input sentence, syntactic constituent structure parses are generated by a Charniak parser and a Collins parser.",
        "Semantic role labels are assigned to the constituents of each parse using Support Vector Machine classifiers.",
        "The resulting semantic role labels are converted to an IOB representation.",
        "These IOB representations are used as additional features, along with flat syntactic chunks, by a chunking SVM classifier that produces the final SRL output.",
        "This strategy for combining features from three different syntactic views gives a significant improvement in performance over roles produced by using any one of the syntactic views individually."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The task of Semantic Role Labeling (SRL) involves tagging groups of words in a sentence with the semantic roles that they play with respect to a particular predicate in that sentence.",
        "Our approach is to use supervised machine learning classifiers to produce the role labels based on features extracted from the input.",
        "This approach is neutral to the particular set of labels used, and will learn to tag input according to the annotated data that it is trained on.",
        "The task reported on here is to produce PropBank (Kingsbury and Palmer, 2002) labels, given the features provided for the CoNLL-2005 closed task (Carreras and M`arquez, 2005).",
        "We have previously reported on using SVM classifiers for semantic role labeling.",
        "In this work, we formulate the semantic labeling problem as a multi-class classification problem using Support Vector Machine (SVM) classifiers.",
        "Some of these systems use features based on syntactic constituents produced by a Charniak parser (Pradhan et al., 2003; Pradhan et al., 2004) and others use only a flat syntactic representation produced by a syntactic chunker (Hacioglu et al., 2003; Hacioglu and Ward, 2003; Hacioglu, 2004; Hacioglu et al., 2004).",
        "The latter approach lacks the information provided by the hierarchical syntactic structure, and the former imposes a limitation that the possible candidate roles should be one of the nodes already present in the syntax tree.",
        "We found that, while the chunk based systems are very efficient and robust, the systems that use features based on full syntactic parses are generally more accurate.",
        "Analysis of the source of errors for the parse constituent based systems showed that incorrect parses were a major source of error.",
        "The syntactic parser did not produce any constituent that corresponded to the correct segmentation for the semantic argument.",
        "In Pradhan et al.",
        "(2005), we reported on a first attempt to overcome this problem by combining semantic role labels produced from different syntactic parses.",
        "The hope is that the syntactic parsers will make different errors, and that combining their outputs will improve on",
        "either system alone.",
        "This initial attempt used features from a Charniak parser, a Minipar parser and a chunk based parser.",
        "It did show some improvement from the combination, but the method for combining the information was heuristic and suboptimal.",
        "In this paper, we report on what we believe is an improved framework for combining information from different syntactic views.",
        "Our goal is to preserve the robustness and flexibility of the segmentation of the phrase-based chunker, but to take advantage of features from full syntactic parses.",
        "We also want to combine features from different syntactic parses to gain additional robustness.",
        "To this end, we use features generated from a Charniak parser and a Collins parser, as supplied for the CoNLL-2005 closed task."
      ]
    },
    {
      "heading": "2 System Description",
      "text": [
        "We again formulate the semantic labeling problem as a multi-class classification problem using Support Vector Machine (SVM) classifiers.",
        "TinySVM1 along with YamCha2 (Kudo and Matsumoto, 2000; Kudo and Matsumoto, 2001) are used to implement the system.",
        "Using what is known as the ONE VS ALL classification strategy, n binary classifiers are trained, where n is number of semantic classes including a NULL class.",
        "The general framework is to train separate semantic role labeling systems for each of the parse tree views, and then to use the role arguments output by these systems as additional features in a semantic role classifier using a flat syntactic view.",
        "The constituent based classifiers walk a syntactic parse tree and classify each node as NULL (no role) or as one of the set of semantic roles.",
        "Chunk based systems classify each base phrase as being the B(eginning) of a semantic role, I(nside) a semantic role, or O(utside) any semantic role (ie.",
        "NULL).",
        "This is referred to as an IOB representation (Ramshaw and Marcus, 1995).",
        "The constituent level roles are mapped to the IOB representation used by the chunker.",
        "The IOB tags are then used as features for a separate base-phase semantic role labeler (chunker), in addition to the standard set of features used by the chunker.",
        "An n-fold cross-validation paradigm is used to train the constituent based role classifiers",
        "and the chunk based classifier.",
        "For the system reported here, two full syntactic parsers were used, a Charniak parser and a Collins parser.",
        "Features were extracted by first generating the Collins and Charniak syntax trees from the word-by-word decomposed trees in the CoNLL data.",
        "The chunking system for combining all features was trained using a 4-fold paradigm.",
        "In each fold, separate SVM classifiers were trained for the Collins and Charniak parses using 75% of the training data.",
        "That is, one system assigned role labels to the nodes in Charniak based trees and a separate system assigned roles to nodes in Collins based trees.",
        "The other 25% of the training data was then labeled by each of the systems.",
        "Iterating this process 4 times created the training set for the chunker.",
        "After the chunker was trained, the Charniak and Collins based semantic labelers were then retrained using all of the training data.",
        "Two pieces of the system have problems scaling to large training sets – the final chunk based classifier and the NULL VS NON-NULL classifier for the parse tree syntactic views.",
        "Two techniques were used to reduce the amount of training data – active sampling and NULL filtering.",
        "The active sampling process was performed as follows.",
        "We first train a system using 10k seed examples from the training set.",
        "We then labeled an additional block of data using this system.",
        "Any sentences containing an error were added to the seed training set.",
        "The system was retrained and the procedure repeated until there were no misclassified sentences remaining in the training data.",
        "The set of examples produced by this procedure was used to train the final NULL VS NON-NULL classifier.",
        "The same procedure was carried out for the chunking system.",
        "After both these were trained, we tagged the training data using them and removed all most likely NULLs from the data.",
        "Table 1 lists the features used in the constituent based systems.",
        "They are a combination of features introduced by Gildea and Jurafsky (2002), ones proposed in Pradhan et al.",
        "(2004), Surdeanu et al.",
        "(2003) and the syntactic frame feature proposed in (Xue and Palmer, 2004).",
        "These features are extracted from the parse tree being labeled.",
        "In addition to the features extracted from the parse tree being labeled, five features were extracted from the other parse tree (phrase, head word, head word POS, path",
        "and predicate sub-categorization).",
        "So for example, when assigning labels to constituents in a Charniak parse, all of the features in Table 1 were extracted from the Charniak tree, and in addition phrase, head word, head word POS, path and sub-categorization were extracted from the Collins tree.",
        "We have previously determined that using different sets of features for each argument (role) achieves better results than using the same set of features for all argument classes.",
        "A simple feature selection was implemented by adding features one by one to an initial set of features and selecting those that contribute significantly to the performance.",
        "As described in Pradhan et al.",
        "(2004), we post-process lattices of n-best decision using a trigram language model of argument sequences.",
        "Table 2 lists the features used by the chunker.",
        "These are the same set of features that were used in the CoNLL-2004 semantic role labeling task by Hacioglu, et al.",
        "(2004) with the addition of the two semantic argument (IOB) features.",
        "For each token (base phrase) to be tagged, a set of features is created from a fixed size context that surrounds each token.",
        "In addition to the features in Table 2, it also uses previous semantic tags that have already been assigned to the tokens contained in the linguistic context.",
        "A 5-token sliding window is used for the context.",
        "SVMs were trained for begin (B) and inside (I) classes of all arguments and an outside (O) class."
      ]
    },
    {
      "heading": "3 Experimental Results",
      "text": [
        "Table 3 shows the results obtained on the WSJ development set (Section 24), the WSJ test set (Section 23) and the Brown test set (Section ck/01-03)"
      ]
    },
    {
      "heading": "4 Acknowledgments",
      "text": [
        "This research was partially supported by the ARDA AQUAINT program via contract OCG4423B and by the NSF via grants IS-9978025 and ITR/HCI"
      ]
    }
  ]
}
