{
  "info": {
    "authors": [
      "Michael Flor",
      "Yoko Futagi"
    ],
    "book": "Proceedings of the Seventh Workshop on Building Educational Applications Using NLP",
    "id": "acl-W12-2012",
    "title": "On using context for automatic correction of non-word misspellings in student essays",
    "url": "https://aclweb.org/anthology/W12-2012",
    "year": 2012
  },
  "references": [
    "acl-C08-1022",
    "acl-C90-2036",
    "acl-C96-2136",
    "acl-D07-1019",
    "acl-D09-1093",
    "acl-D09-1129",
    "acl-N09-3006",
    "acl-P00-1037",
    "acl-P11-1121",
    "acl-W04-3238"
  ],
  "sections": [
    {
      "text": [
        "The 7th Workshop on the Innovative Use of NLP for Building Educational Applications, pages 105?115, Montre?al, Canada, June 3-8, 2012. c?2012 Association for Computational Linguistics On using context for automatic correction of non-word misspellings in student essays"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "In this paper we present a new spell-checking system that utilizes contextual information for automatic correction of non-word misspellings.",
        "The system is evaluated with a large corpus of essays written by native and non-native speakers of English to the writing prompts of high-stakes standardized tests (TOEFL?",
        "and GRE?).",
        "We also present comparative evaluations with Aspell and the speller from Microsoft Office 2007.",
        "Using context-informed re-ranking of candidate suggestions, our system exhibits superior error-correction results overall and also corrects errors generated by non-native English writers with almost same rate of success as it does for writers who are native English speakers."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Misspellings are ubiquitous in student writing.",
        "Connors and Lunsford (1988) have found that spelling errors accounted for about one quarter of all errors found in a random sample of 300 student essays.",
        "Desmet and Balthazor (2006) found that spelling errors are among the five most frequent errors in first-year college composition of US students.",
        "Lunsford and Lunsford (2008) found that spelling errors constituted about 6.5% of all errors found in a US national sample of 3000 college composition essays, despite the fact that writers had access to spellcheckers.",
        "Misspellings are even more ubiquitous in texts written by non-native speakers of English, especially English Language Learners (ELL).",
        "The types of misspellings produced by L2 writers are typically different from errors produced by native speakers (Hovermale, 2010; Al-Jarf, 2010; Okada, 2005).",
        "In the area of automatic assessment of writing, detection of misspellings is utilized in computer-aided language learning applications and in some automatic scoring systems, especially when feedback to users is involved (Dikli, 2006; Warschauer and Ware, 2006).",
        "Yet spelling errors may have a deeper influence on automated text assessment.",
        "As noted by Nagata, et al. (2011), suboptimal automatic detection of grammar and mechanics errors may be attributed to poor performance of NLP tools over noisy text.",
        "Presence of spelling errors also hinders systems that require only lexical analysis of text (Landauer, et al. , 2003; P?rez, et al., 2004).",
        "Granger and Wynne (1999) have shown that spelling errors can affect automated estimates of lexical variation, which in turn are used as predictors of text quality (Crossley, et al., 2008; Yu, 2010).",
        "In the context of automated preposition and determiner error correction in L2 English, De Felice and Pulman (2008) noted that the process is often disrupted by misspellings.",
        "Futagi (2010) described how misspellings pose problems in development of a tool for detection of phraseological collocation errors.",
        "Given this state of affairs, it is only natural for automatic text assessment systems to utilize automatic spellchecking components.",
        "However, generic spellcheckers are typically oriented for errors produced by writers who are native speakers of a language.",
        "Rimrott and Heift (2008, 2005) have demonstrated that a generic speller has poor performance on data from German language learners.",
        "Bestgen and Granger (2011) and Hovermale (2010) have demonstrated similar results on data from ELL.",
        "Many researchers have suggested that spellcheckers for L2 users need to be adapted for the particular patterns of errors that characterize each native language (L1), by studying patterns of interference and influence from L1 to L2 (Mitton and Okada, 2007; Mitton, 1996; Rimrott and Heift, 2008, 2005; Bestgen and Granger, 2011; Hovermale, 2010).",
        "We have set up to explore a different path, in the context of automated text assessment.",
        "Our goal in the present study is to examine to what extent detection and automatic correction of non-word misspellings can be improved by utilizing essay context, for data from both native and non-native English speakers.",
        "The rest of this paper is organized as follows.",
        "Section 2 provides a description of the corpus of texts and misspellings that was used in this study.",
        "Section 3 describes the ConSpel automatic spell-checking system.",
        "Section 4 presents results from a comparative evaluation of our system, ConSpel, the popular Aspell speller and the Microsoft Office 2007 speller.",
        "Section 5 compares our findings with some recent studies and discusses implications for further development of automatic spell-checking systems."
      ]
    },
    {
      "heading": "2 Corpus",
      "text": [
        "The corpus used in this study is a collection of essays, annotated for misspellings by trained annotators.",
        "It is developed for evaluation of automatic spellcheckers, and for research on patterns of misspellings produced by both native English speakers and ELL."
      ]
    },
    {
      "heading": "2.1 Texts",
      "text": [
        "The corpus comprises essays written by examinees on the writing sections of GRE?",
        "(Graduate Record Examinations) and TOEFL?",
        "(Test of English as a Foreign Language) (ETS, 2011a,b).",
        "The TOEFL test includes two different writing tasks: a short opinion essay, on a preassigned topic, and a summary essay that compares arguments from two different sources (both supplied during the test).",
        "GRE also includes two different writing tasks: one is a short argumentative essay taking a position on an assigned topic, the other is an essay evaluating the soundness of arguments presented in prompt.",
        "Both tests are delivered on computer (at test cen-ters around the world and via Internet), always using the standard English language computer keyboard (QWERTY).",
        "Editing tools such as a spellchecker are not provided in the test-delivery software (ETS, 2011a).",
        "All writing tasks have time constraints.",
        "In the current phase of the project, the corpus includes 3000 essays, for a total of 963,428 words.",
        "The essays were selected equally from the two tests (4 tasks, 10 prompts per task, 75 essays per prompt), also covering full range of scores (as a proxy for English proficiency levels) for each task.",
        "The majority of essays in this collection were written by examinees for whom English is not the first language (98.73% of TOEFL essays, 57.86% of GRE essays)."
      ]
    },
    {
      "heading": "2.2 Annotation",
      "text": [
        "Each text was independently reviewed by two annotators, who are native English speakers experienced in linguistic annotation.",
        "Annotators were asked to identify all non-word misspellings and provide the adequate correction for each one.",
        "Inter-annotator agreement was quite high - annotators agreed in 82.6% of the cases (Cohen's Kappa=0.8, p<.001).",
        "All disagreements were resolved by a third annotator (adjudicator).",
        "For details of the annotation procedure, see Flor and Futagi (2011).",
        "The Annotation Scheme for this project provides three classes of misspellings, as summarized in"
      ]
    },
    {
      "heading": "3 multi-token non-word misspelling",
      "text": [
        "(e.g. ?mor efun?",
        "for ?more fun?)",
        "annotated in the study corpus.",
        "The annotation effort focused specifically on misspellings, rather than on a wider category of orthographic errors in general.",
        "The annotation ignored repeated words, missing spaces1 and improper capitalization.",
        "Many of the essays have inconsistent capitalization and essays written fully in capital letters are not uncommon (not only in our corpus).",
        "In addition, different spelling variants were acceptable.",
        "This consideration stems from the international nature of the two tests ?",
        "the examinees come from all around the world, being accustomed to either British, American, or some other English spelling standard; so, it is only fair to accept all of them.",
        "Overall, the annotated corpus of 3,000 essays has the following statistics.",
        "Average essay length is 321 words (the range is 28-798 words).",
        "148 essays turned out to have no misspellings at all.",
        "Total spelling error counts are given in Table 1; 2.24% of the words in the corpus are non-word misspellings."
      ]
    },
    {
      "heading": "3 Spelling correction systems",
      "text": []
    },
    {
      "heading": "3.1 Background",
      "text": [
        "Classic approaches to the problem of spelling correction of non-word errors were reviewed by Ku-kich (1992).",
        "The typical approach for error detection is using good spelling dictionaries.",
        "The typical approach for correction of non-word errors is to include modules for computing edit distance (Damerau, 1964; Levenshtein, 1966) and phonetic similarity.",
        "These are used for ranking suggestions by their orthographic and phonetic similarity to the misspelled word.",
        "A more recent feature utilizes word frequency data for candidate ranking.",
        "Mitton (2009) and Deorowicz and Ciura (2005) describe state of the art approaches to non-word correction without contextual information.",
        "The use of context for spelling correction was initially proposed by Mayes, et al. (1991) only for ?contextual spelling?",
        "?",
        "correcting real-word errors (e.g. writing ?fig?",
        "instead of ?fog?).",
        "A common strategy for this task is using predefined confusion sets, which makes it more amenable to classifier-based approaches (Golding and Roth, 1999).",
        "Sev1 Annotation ignored missing spaces around punctuation (e.g.",
        "?chairs,tables?, but all cases where missing spaces result in fused words were marked in annotation (e.g.",
        "?inthe?).",
        "eral recent studies used a web-scale language model (Google Web1T n-gram corpus ?",
        "Brants and Franz, 2006) for ?context-sensitive?",
        "(i.e. real-words) spelling correction (Bergsma, et al., 2009; Islam and Inkpen, 2009; Carlson and Fette, 2007).",
        "Chen, et al. (2007) used a LM for pruning candidate corrections for non-words in web queries.",
        "Whitelaw, et al. (2009) used a LM for correcting non-word and real-word errors without a dictionary and using a statistically trained error model.",
        "Our study extends the use of language models to automatic correction of non-word errors, with a dictionary, but without any explicit error model."
      ]
    },
    {
      "heading": "3.2 ConSpel system",
      "text": [
        "The ConSpel system was designed and implemented as a fully automatic system for detection and correction of spelling errors.",
        "The current version is focused on non-word misspellings.",
        "The system has two intended uses.",
        "One is to serve as a component in NLP systems for automatic evaluation of student essays.",
        "The other use is to facilitate automation for research on patterns of misspellings in ELL essays.",
        "In ConSpel, detection policy is quite simple.",
        "A token in a text is potentially a misspelling if the string is not in the system dictionaries.",
        "A text may include some non-dictionary tokens that systematically are not misspellings.",
        "ConSpel has several parameterized options to handle such cases.",
        "By default, the system will ignore numbers, dates, web and email addresses, and mixed alphanumeric strings (e.g.",
        "?RV400?).",
        "The system can be instructed to ignore capitalized words (e.g.",
        "?London?)",
        "and/or words in all uppercase (e.g.",
        "?ROME?).",
        "ConSpel spelling dictionaries include about 360,000 entries.",
        "The core set includes 245,000 entries, providing a comprehensive coverage of modern English vocabulary.",
        "This lexicon includes all inflectional variants for a given word (e.g.",
        "?love?, ?loved?, ?loves?, ?loving?",
        "), and international spelling variants (e.g. American and British English).",
        "Additional dictionaries include about 120,000 entries for international surnames and first names, and names for geographical places.",
        "Dictionaries are also the source of suggested corrections.",
        "Candidate suggestions for each detected misspelling are generated by returning all dictionary words that have an edit distance up to a given threshold.",
        "With the default threshold of 5, a",
        "misspelling can easily get hundreds of correction candidates.",
        "Since ConSpel is intended to work on ELL data, and ELL misspellings can be quite dissimilar from the intended words, starting with a large number of candidates is a deliberate strategy to ensure that the adequate correction will be included in the candidate set.",
        "Candidates are pruned during the re-ranking process, so that only a few candidates from the initial set survive to the final decision making stage.",
        "Candidate suggestions for each detected misspelling are ranked using a set of algorithms.",
        "An edit distance module is used to compute orthographic similarity between each candidate and the original misspelling.",
        "Phonetic similarity is computed using the Double Metaphone algorithm (Philips, 2000).",
        "Word frequency is computed for each candidate using a very large word-frequency data source.",
        "The main thrust of our new spelling correction system is the conjecture that non-word misspellings can be corrected better when their context is taken into account.",
        "Local context (several words around the misspelled word in the text) provides lots of information for choosing the adequate correction.",
        "For each candidate, we check the frequency of its co-occurrence (in a language model) with the adjacent words in the text.",
        "This approach borrows from the family of noisy-channel error-correction models (Zhang, et al., 2006; Cucerzan and Brill, 2004; Kernigham, et al., 1990).",
        "With the advent of very large word n-gram language models, we can utilize large contexts (about 4 words on each side of a misspelling).",
        "Our current language model uses a filtered version of the Google Web1T collection, containing 1,881,244,352 n-gram types of size 1-5, with punctuation included.2 Notably, ConSpel does not use any statistical error model.",
        "A second context-sensitive algorithm utilizes non-local context in the essay.",
        "The idea is quite simple ?",
        "given a misspelled token in a text and a set of correction-candidates for that word, for each candidate we check whether that candidate string occurs elsewhere in the text.",
        "Since content words have some tendency of recurrence in same text, the 2 ConSpel system uses the TrendStream n-gram compression software library (Flor, 2012) for fast and memory efficient retrieval of n-gram data.",
        "As a result, the ConSpel system runs even on modest hardware (e.g. a 4GB RAM laptop), concurrently with other applications.",
        "misspelled token might be such a case, and the candidate should be strengthened.",
        "The idea is somewhat similar to cache-based language model adaptation (Kuhn and De Mori, 1990), though there are considerable differences.",
        "First, our system looks not only in preceding context, but over the whole essay text.",
        "Second, and unique to our system, ConSpel looks not only in the text, but also into the k-best candidate correction lists of the other misspelled words.",
        "Thus, if a word is systematically misspelled in a document, ConSpel will strengthen a candidate correction that appears as a candidate for multiple misspelled instances.3 For each misspelling found in a text, each algorithm produces ranking scores for each candidate.",
        "We use a linear-weighted ensemble method to combine scores from different algorithms.",
        "First, scores for all candidates of a given misspelling are normalized into a 0-1 range, separately for each ranker.",
        "Normalized scores are then summed using a set of constant weights.",
        "The ConSpel system is implemented as a flexible configurable system.",
        "Configuration settings include choice of dictionaries, choice of algorithms and weights for computing the final ranking, and choice of the output formats."
      ]
    },
    {
      "heading": "4 Comparative evaluation",
      "text": [
        "In this section we report the results of evaluation on data from our gold-standard corpus of 3,000 essays described in section 2.",
        "This evaluation focuses on detection and correction of the 21,212 single-token non-word misspellings (types 1 and 2 in Table 1) as well as false alarms raised by spellcheckers.",
        "Evaluation included three systems.",
        "In addition to ConSpel, we tested Aspell (version 0.60.6), a popular open-source spell checking library (Atkinson, 2011).",
        "The third system is spellchecker included in Microsoft Office 2007 (hereafter ?MS Word?).",
        "All evaluations were performed ?in full context?",
        "(rather than word-by-word) ?",
        "each essay in the corpus was submitted to each system separately, as a simple text file.",
        "All evaluations used standard",
        "measures of recall, precision and F-score (Leacock, et al., 2010).",
        "Evaluations for Aspell and MS Word were conducted twice ?",
        "once with their original dictionaries5 and once with the ConSpel spelling dictionary of about 360,000 word forms.",
        "Evaluations where Aspell and MS Word were bundled with ConSpel dictionary are marked below as Aspell+ and MS Word+."
      ]
    },
    {
      "heading": "4.1 Error Detection",
      "text": [
        "Detection results for non-word misspellings are presented in Table 2.",
        "All systems show very strong recall rates, above 99%.",
        "There is more variability when precision of error detection is concerned.",
        "Both MS Word and Aspell benefit from using the larger dictionary ?",
        "they raise much less false alarms than with original dictionaries (Aspell improves precision by about 4% and MS Word by about 6%).",
        "ConSpel shows best precision, the difference with second-best (MS Word+) is statistically significant at p<.01."
      ]
    },
    {
      "heading": "4.2 Error Correction",
      "text": [
        "For evaluating spelling correction, we again use the measures of recall, precision and F-score.",
        "Note that precision of error correction is defined as proportion of adequately corrected misspellings out of total number of misspellings that a system tried to correct (this excludes cases missed in detection).",
        "We conducted error-correction evaluations with ConSpel in two variants.",
        "The baseline variant, ConSpel-A, ranks candidate suggestions using edit distance, phonetic similarity and word-frequency.",
        "5 Notably, both Aspell and MS Word in this evaluation came with respective default dictionaries for US spelling, and generated many false alarms when flagging words that are British and other international spelling variants.",
        "Such false alarm cases were discounted from the evaluation statistics.",
        "The contextual variant, ConSpel-B, adds contextual information in the ranking process.",
        "Results of error-correction evaluations are shown in Table 3.",
        "While MS Word speller provided the adequate correction (top ranked suggestion) in about 73% of annotated cases, its precision is only about 67-69%, due to large number of false alarms.",
        "Aspell has markedly lower accuracy ?",
        "both in recall and precision.",
        "ConSpel-A has approximately same recall as MS-Word, but better precision (due to low rate of false alarms).",
        "ConSpel-B, which uses contextual information in ranking candidate suggestions, shows markedly better recall and precision than either ConSpel-A or MS Word (statistically significant at p<.01).",
        "For Aspell, use of the larger spelling dictionary improved detection precision (fewer false alarms ?",
        "see Table 2), but it has led to degradation in error correction ?",
        "as shown in Table 3 (possibly ranking of candidates is affected by larger dictionaries).",
        "(top ranked candidates only) An additional way to evaluate automatic spelling correction is to consider how often the adequate target correction is found among the k-best of the candidate suggestions (Mitton, 2009; Brill and Moore, 2000).",
        "Figure 1 shows error-correction recall and precision results for four systems6 using k-best values 1-5 and 10.",
        "When two-or-more best-ranked candidates are considered for each misspelling, the baseline Con-Spel-A system shows better performance than MS Word.",
        "Aspell results lag significantly below the other systems, although it catches up with MS",
        "Word beyond k=5.",
        "ConSpel-B system outperforms all other systems, in both recall and precision.",
        "It 6 ?MS Word?",
        "and ?MS Word+?",
        "overlap for all values of k, except for k=1, thus only ?MS Word?",
        "is shown in Figure 1.",
        "places the target correction among the top two candidates in 88% of cases, and among top three or more candidates in beyond 90% of cases.",
        "for four systems, with different k-best cutoffs."
      ]
    },
    {
      "heading": "4.3 Evaluation with data from native and",
      "text": [
        "non-native English speakers In this section we report the results of spell-check evaluation with data breakdown by native and non-native English speakers.",
        "Out of 21,212 single-token non-word misspellings in our corpus, 2,859 came from 570 essays written by native English speakers (NS) and 18,353 misspellings came from 2,282 essays written by test-takers who are not native speakers of English (NNS).",
        "Comparison of error-detection for five systems is presented in Table 4.",
        "All systems show very strong recall results for both types of populations (all values are above 99%).",
        "The results are a bit different for error-detection precision.",
        "ConSpel achieves best results in both populations (the differences with second-best, MS Word+, are statistically significant at p<.01).",
        "MS Word has precision around 91%, approximately same in both populations.",
        "Compared to MS Word, MS Word+ has better recall rates, in both populations ?",
        "due to a larger dictionary, it raises much less false alarms.",
        "Aspell lags behind in this comparison.",
        "Using a larger dictionary helps, as Aspell+ precision is better than that of Aspell in both populations; improvement is manifest for NNS data and only 2% for NS data.",
        "Aspell detection precision on NS data (77%) is lower than its precision on NNS data (88%).",
        "This may be due to Aspell having a problem with possessive forms (80% of the false alarms on NS data are possessives, but only 70% for NNS",
        "non-word error detection, with breakdown for data from native (ns) and non-native (nns) English speakers Results of error-correction recall, with k-best levels 1-5 and 10, are presented in Figure 2.",
        "In comparisons of recall, with k=1, on NS data (right panel), MS Word (81.3%) and ConSpel-B (80.7%) show best results (the difference is not significant).",
        "For larger k-values, MS Word correction rate8 improves to a ceiling of about 88.5% and both ConSpel variants have better improvement than MS Word.",
        "The context-informed ConSpel-B system has error-correction recall above 90% for k?2 and reaches 94.2% at k=5.",
        "On NNS data, ConSpel-B has a clear advantage over all other systems.",
        "At k=1, ConSpel-A and MS Word show equal correction performance (72%).",
        "For k ?2, ConSpel-A shows constant improvement, while MS Word improves to a ceiling of about 85%.",
        "For both NS and NNS populations, Aspell error-correction performance lags considerably behind the other systems, although it catches up with and even outperforms MS Word for k?3.",
        "Interestingly, Aspell+ performs consistently worse",
        "than Aspell; the larger dictionary has detrimental effect on error-correction for Aspell, but not for MS Word.",
        "7 ConSpel dictionary does not contain possessive forms."
      ]
    },
    {
      "heading": "8 Results for ?MS Word? and ?MS Word+? on this data overlap",
      "text": [
        "for all values of k, in both populations.",
        "systems, for both NS and NNS populations.",
        "On NS data, for k=1, MS Word+ (77%), ConSpel-A (76%) and MS Word (75%) are very close.",
        "For k?2, ConSpel-A shows better improvement, reaching 89.4% at k=5, while MS Word+ reaches a ceiling of about 85% (81% for MS Word).",
        "Aspell performance lags clearly behind the other systems, although it also improves considerably with larger k-values.",
        "For NNS data, the separation between systems is even clearer.",
        "Aspell lags behind, although it catches up to MS Word at k?5.",
        "Except for ConSpel-B, all systems have manifestly better error-correction precision on NS data than on NNS data ?",
        "misspellings made by non-native English speakers are harder to correct.",
        "Con-Spel-B, with context-informed ranking of spelling suggestions, performs almost equally well for both populations.",
        "For k=1, its error-correction precision is 77.5% for NNS data and 78% for NS data.",
        "For k=2, precision is 87.9% for NNS and 88.2% for NS data.",
        "These differences are not statistically significant.",
        "For both populations, precision rises beyond 90% for k?3.",
        "ConSpel-B also shows remarkably close error-correction recall in both populations: at k=1, recall is 77.9% for NNS and 80.7% for NS; at k=2, recall is 88.4% for NNS, 91.4% for NS (the differences are statistically significant).",
        "For k?3, recall is beyond 90% for both populations, with",
        "Table 5 presents F-scores for error-correction evaluation results, for six systems, for k-best values 1-5 and 10, for NS and NNS data.",
        "For each value of k, the ConSpel-B system has best values for both NS and NNS data.",
        "For each cell in Table 5, we calculated the absolute difference between",
        "marked differences in performance on NS and NNS data.",
        "The differences tend to diminish for larger k-values.",
        "ConSpel-B is the only system for which the differences in error-correction between NS and NNS data are consistently below 2%, even for k=1.",
        "K-best: 1 2 3 4 5 10",
        "F-scores for six systems, data from native (upper value in each cell) and non-native English speakers",
        "A question we need to address is whether there are any real differences in misspellings produced by NS and NNS writers in our corpus.",
        "Our initial analyses show that there are some distinguishing characteristics.",
        "One characterization is obtained when we look at the ?complexity?",
        "of the error, defining it as the edit distance between misspelling and correct word.",
        "The data is presented in Table 6.",
        "Native English speakers make significantly more simple errors (edit distance 1) than non-native speakers, while the latter make more complex errors (edit distance 4+).",
        "Edit distance between misspelling and correct form NS NNS",
        "by edit distance to correct word, for native and non-native populations.",
        "* difference significant at p<.01 Another difference we found in our data is the length (number of characters) of the correct word that was misspelled, for each population (Figure 5).",
        "For words of length 2 to 7, non-native speakers produce relatively more misspellings than native speakers.",
        "For words of length 8 and longer, native speakers produce relatively more misspellings than non-native speakers.",
        "ConSpel-B performs about the same on NS and NNS data, and better than the other systems.",
        "Given the above differences of NS and NNS misspellings in our corpus, and given that all evaluated systems, except ConSpel-B, show better correction on NS data, we conclude that ConSpel-B shows this real advantage due to utilization of contextual data.",
        "Figure 5.",
        "Percent of non-word misspellings (tokens) by length of the ?intended?",
        "correct word, for native and non-native populations."
      ]
    },
    {
      "heading": "5 Discussion",
      "text": [
        "Large scale comparative studies of spellchecker performance on data from non-native language speakers are scarce, possibly due to large amount of effort required for expert annotation of data.",
        "Hovermale (2010) analyzed 500 spelling errors from a corpus of essays produced by ELL in Japan.",
        "In that study, MS Word 2007 successfully corrected 72% of non-word errors, while Aspell had a success rate of 81% (presumably at k=1).",
        "In our study, with data from an international sample of non-native English speakers, Aspell error-correction precision rate is only 52% at k=1, and rises to 78% for k=5.",
        "MS Word and ConSpel-A (no-context) begin with precision of about 75-77% at k=1.",
        "At k=5, MS Word improves to about 85%, and ConSpel-A to above 89%.",
        "Bestgen and Granger (2011) analyzed 222 argumentative essays from the ICLE corpus (Granger et al., 2009), written by European EFL students across different levels of English proficiency.",
        "Their sample included about 150,000 words and had 1,549 spelling errors.",
        "This amounts to spel",
        "ling-error rate of about 1%, compared to 2.2% in our data.",
        "In that study, MS Word 2007 had detection recall of 80.43%, and detection precision of 82.35%.",
        "In our study, MS Word had 99.6% recall and 90.1% precision in error detection.",
        "The difference may be attributed to the fact that we focus on single-token non-word misspellings, while Bestgen and Granger included other categories, specifically multi-token errors.",
        "Error-correction recall was 71% and precision 59% (at k=1).",
        "In our study, at k=1, MS Word achieved 72% recall and 65% precision, which is quite close to the above figures.",
        "Given that our context-informed system has error-correction F-score of 77.9% at k=1, and 91.8% at k=5, it is obvious that the system picks up the right corrections.",
        "There is a potential for improvement, possibly by better ranking.",
        "Why doesn't the context help even more?",
        "Could the system perform with 90% at k=1?",
        "We have tentatively identified three major types of influences that detract the system from better performance.",
        "Those are a) local error density; b) poor grammar; and c) competition among inflectional variants.",
        "Local error density means simply that adjacent words are misspelled so there is not enough reliable context to use n-grams in such cases.",
        "Poor grammar is also problematic for n-gram-based approach.",
        "In a fragment ?If docter want to operate, he...?, the intended word was ?doctor?, but ?doctor want?",
        "is a subject-verb agreement error, which is not frequent in the normative n-gram data.",
        "Thus, under n-gram frequency influence, the system prefers ?doctors?",
        "as top ranked candidate.",
        "There is competition of inflectional variants in presence of grammatical errors.",
        "We have observed that even in absence of grammatical errors, sometimes an inadequate top ranked candidate is an inflectional variant of the adequate correction.",
        "For example: ?They received fresh air, interacte with other youth their age, solved problems...?.",
        "The adequate correction is 'interacted', but ConSpel ranks it third, while 'interacts' comes second and 'interact' is ranked first.",
        "Notably, non-local context is not always beneficial ?",
        "for a example, the presence of word 'interact' elsewhere in the essay will strengthen the wrong candidate.",
        "Possibly, additional linguistic information could help improve ranking in such cases, e.g. by observing that all verbs in this sentence come in past tense.",
        "Mitton (1996) suggested that it should be possible to adapt a spellchecker to cope specifically with L1-characteristic errors of English learners.",
        "Granger and Wynne (1999) analyzed misspellings produced by students with several different L1 backgrounds and have also suggested that it might be ?useful to adapt tools such as spellcheckers to the needs of non-native users.?",
        "Mitton and Okada (2007) have demonstrated a successful adaptation of a spellchecker (oriented for native English speakers) to Japanese learners of English.9 However, adaptation to each specific L1 would require considerable resources.",
        "As noted by Hovermale (2010), it is not clear whether it is worthwhile to customize spellchecker heuristics for each learner population or better to just have one ELL spellchecker.",
        "Results from our study indicate that it is at least feasible to produce a general-purpose spellchecker that can successfully correct misspellings produced by non-native English speakers, almost as well as it does for native English speakers.",
        "A key for such development is utilization of essay context for re-ranking of spelling suggestions."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "In this paper we presented a method for context-informed correction of single-token non-word spelling errors.",
        "Our results with ConSpel system demonstrate that utilizing contextual information helps improve automatic correction of non-word misspellings, for both native and non-native speakers of English, at least for essays written by test takers on standardized English proficiency tests.",
        "In future work we intend to produce a detailed study of the different ways of context utilization.",
        "We also intend to expand the system to handle multi-word spelling errors."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Many thanks to Chong Min Lee and Daniel Blanchard for assisting in evaluation with Aspell and Microsoft Office 2007; to our annotators, Nicole DiCrecchio, Julia Farnum, Melissa Lopez, Susanne Miller, Matthew Mulholland, Sarah Ohls, and Waverely VanWinkle.",
        "The manuscript has also benefited from the comments of three anonymous reviewers.",
        "9 Boyd (2009) used non-native (Japanese ELL) pronunciation modeling to improve a speller that uses just an orthographic error-model.",
        "Her combined system achieved 65% correction precision at k=1, and 82.6% at k=5.",
        "Our context-informed system achieves 77.5% and 91.4% respectively."
      ]
    }
  ]
}
