{
  "info": {
    "authors": [
      "Cong-phap Huynh",
      "Christian Boitet",
      "Hervé Blanchon"
    ],
    "book": "LREC",
    "id": "acl-L08-1061",
    "title": "SECTra_w.1: an Online Collaborative System for Evaluating, Post-editing and Presenting MT Translation Corpora",
    "url": "https://aclweb.org/anthology/L08-1061",
    "year": 2008
  },
  "references": [],
  "sections": [
    {
      "text": [
        "SECTraw.l : an Online Collaborative System for Evaluating, Post-editing and Presenting MT Translation Corpora",
        "Cong-Phap Huynh, Christian Boitet, Hervé Blanchon",
        "Laboratoire LIG, GETALP, GETA, Université Joseph Fourier 385, rue de la Bibliothèque, 38041 Grenoble, France {Cong-Phap.Huynh, Christian.Boitet, Herve.Blanchon}@imag.fr"
      ]
    },
    {
      "heading": null,
      "text": [
        "SECTra_w.1 is a web-oriented system mainly dedicated to the evaluation of MT systems.",
        "After importing a source corpus, and possibly reference translations, one can call various MT systems, store their results, and have a collection of human judges perform subjective evaluation online (fluidity, adequacy).",
        "It is also possible to perform objective, task-oriented evaluation by letting humans post-edit the MT results, using a web translation editor, and measuring an edit distance and/or the post-editing time.",
        "The post-edited results can be added to the set of reference translations, or constitute it if there were no references.",
        "SECTra_w.1 makes it possible to show not only tables of figures as results of an evaluation campaign, but also the real data (source, MT outputs, references, post-edited outputs), and to make the post-edition effort sensible by transforming the trace of the edit distance computation in an intuitive presentation, much like a \"revision\" presentation in Word.",
        "The system is written in java under Xwiki and uses the Ajax technique.",
        "It can handle large, multilingual and multimedia corpora: EuroParl, BTEC, ERIM (bilingual interpreted dialogues with audio and text), Unesco-B@bel, and a test corpus by France Telecom have been loaded together and used in tests.",
        "agreement between judges is often not very good, and the procedure itself is often biased.",
        "The first bias comes from showing judges a reference translation of an input instead of the input itself when judging adequacy (monolingual judges are cheaper than bilingual ones), and the second from showing to one judge the results of several MT systems in parallel, so that they compare them instead of grading them independently.",
        "A third problem is that, judges being expensive, only a very small fraction of the MT outputs can be judged subjectively.",
        "Hence, it would be good to make it possible for other people to continue to do subjective evaluation after the evaluation campaign, in a contributive, wiki way.",
        "Finally, none of the above classical evaluation methods evaluate the \"real\" quality of MT systems, i.e. their utility for a certain task.",
        "The task of an MT system may be (1) to help humans understand texts in foreign languages (MT for watchers: intelligence, web browsing...), or (2) produce HQ translations (MT for translators, interactive MT for monolingual users), or (3) communicate (support of bilingual dialogues).",
        "These are the main reasons why we started the SECTraw project.",
        "SECTra_w.1 is a web-oriented system mainly dedicated to the evaluation of MT systems.",
        "As we concentrate now on the second task (produce HQ translations), SECTra_w.1 supports MT post-editing, and measures of the effort spent by a bilingual person to produce good (HQ) translations from the MT output, after having read the input.",
        "After importing a source corpus, and possibly reference translations, one can call various MT systems, store their results, and have a collection of human judges perform subjective evaluation online (fluidity, adequacy).",
        "It is also possible to perform objective, task-oriented evaluation by letting humans post-edit the MT results, using a web translation editor, and measuring an edit distance and/or the postediting time.",
        "The post-edited results can be added to the set of reference translations, or constitute it if there were no references.",
        "With SECTra_w.1, it possible to show not only tables of figures as results of an evaluation campaign, but also the real data (source, MT outputs, references, post-edited outputs), and to make the post-edition effort sensible by transforming the trace of the edit distance computation in an intuitive presentation, much like a \"revision\" presentation in Word.",
        "It is also possible to recompute n-gram-based scores by using the post-edited translations as references, and/or by adding them to the already available references.",
        "However, that experiment has only been performed to date internally, with a small data set and off-the-shelf systems.",
        "We are looking forward to do it in a large evaluation campaign with many competing systems.",
        "The system is written in java under Xwiki and uses the Ajax technique.",
        "It can handle large, multilingual and multimedia corpora: EuroParl, BTEC, ERIM (bilingual interpreted dialogues with audio and text), Unesco-B@bel, and a test corpus by France Telecom have been loaded together and used in tests.",
        "During the development of SECTra_w.1, we encountered other interesting problems, and we plan to further develop SECTra_w to elucidate them.",
        "First is the question of how to handle extremely large corpora, containing not only text, but audio, video, and various annotations such as POS tags, morpho-syntactic lattices, dependence and constituent trees, logical formulas, UNL hypergraphs, and correspondences (between successive representation levels in one language, and between similar levels across two languages).",
        "An interesting goal is to find an architecture to dynamically attach annotation platforms to SECTra_w.",
        "Second, corpora such as phrasebooks do not contain only fixed sentences, but sentences with variables (\"please give us $nb plates of $meat and $vegi.",
        "\"): one would like to develop systems to translate them and to store their instances and corresponding translations.",
        "Third, a good corpus exploitation tool should offer a way of considering the \"segments\" of text as occurrences within documents.",
        "For that, it is necessary to store the context of production of each occurrence of a given segment.",
        "It may also be necessary to find ways to refer to the structures of the documents where segments occur.",
        "For example, we have integrated in SECTra_w.1 a \"player\" for the ERIM corpus of bilingual interpreted dialogues (French – Chinese, Vietnamese, Hindi, Tamil), and would like to integrate a generic functionality of that kind into a future version of SECTra_w."
      ]
    },
    {
      "heading": "2.. Visualizing Parallel Corpora",
      "text": [
        "That interface is not an autonomous java application; rather, it is realized by any web browser.",
        "We follow the following presentation principles:",
        "• Verticality: all objects of the same type should appear in the same \"column\".",
        "• Horizontality: all objects linked with the same source segment (possibly including its corrections) constitute a \"polyphrase\" and are presented in the same \"row\".",
        "• No direct manipulation of the presentation parameters, but modifications of parameters (to be as \"bare-bone\" as possible, thus reducing development time and helping to concentrate on adding more useful features).",
        "The interface to control the presentation of columns will be the same as for PIVAX, a web-oriented data base for heterogeneous MT systems (Nguyen 2007).",
        "As it was not finished at the time of writing, we show an example from PIVAX.",
        "The first screen shot shows columns in a certain order, with a movement button enhanced.",
        "After the user clicks on it, the column moves, as shown by the second screen shot.",
        "In the next SECTraw example (Figure 3), the source text is at the left, and the post-edition column has been moved to the right with respect to its position in the post-edition interface, to bring a MT column near to the source text column.",
        "In the future, we will add the possibility to show some annotation under the source, such as its pronunciation, or an \"active reading\" presentation showing possible equivalents of words found in attached dictionaries.",
        "Next entries",
        "ariane",
        "< - fra + >",
        "< -fra.systran + >",
        "< - fra.axeme + >",
        "tester",
        "=(V, Prl, 1) ariane.fra.tester.2",
        "+",
        "=(V, Prl, 1)",
        "tester +",
        "=(V, Prl, 1)",
        "ariane.fra.tester.l",
        "EDIT DUPLICATE DELETE HISTORY MORE +",
        "tester",
        "= (V, Prl, 1) ariane.fra.tester.l",
        "faire + =(V, Prl, 1)",
        "tester +",
        "=(V, Prl, 2)",
        "ariane.fra.tester.3",
        "tester",
        "= (V, Prl, 2) ariane.fra.tester.3",
        "EDIT DUPLICATE DELETE HISTORY MORE +",
        "tester +",
        "=(V, Prl, 1)",
        "ariane.fra.tester.l",
        "tester",
        "=single entry no relation",
        "tester +",
        "= (V, Prl, 2)",
        "ariane.fra.tester.3",
        "Next entries",
        "ariane",
        "< - f ra + >",
        "< - fra.axeme + >",
        "< - fra.systran + >",
        "tester",
        "=(V, Prl, 1) ariane.fra.tester.2",
        "tester +",
        "=(V, Prl, 1) ariane.fra.tester.l",
        "tester + =(V, Prl, 1)",
        "faire + =(V, Prl, 1)",
        "tester",
        "= (V, Prl, 1) ariane.fra.tester.",
        "1",
        "EDIT DUPLICATE DELETE HISTORY MORE +",
        "tester +",
        "=(V, Prl, 2) ariane.fra.tester.3",
        "tester",
        "= (V, Prl, 2) ariane.fra.tester.3",
        "tester +",
        "=(V, Prl, 1) ariane.fra.tester.l",
        "^^^^^^^^^^^^H MORE +",
        "tester",
        "=single entry no relation",
        "tester +",
        "=(V, Prl, 2) ariane.fra.tester.3",
        "Of course, this \"table-like\" presentation has nothing to \"business level\"), and with the way it is stored in the do with the logical structure of the data (at the underlying database (at the \"physical level\")."
      ]
    },
    {
      "heading": "3.. Classical MT Evaluation",
      "text": [
        "We have integrated scripts provided by NIST to compute BLEU and NIST.",
        "WER is named \"Dw\" in the interface, while \"Dc\" is the character-based distance, and Dsent is a linear combination of both: Dsent = a Dc + p Dw (a and p are modifiable).",
        "In the future, we will use not only insertions, deletions and exchanges, but also shifts of blocks, and global changes (over a set of segments or a whole corpus).",
        "In the default presentation, the first column contains the source segments, and the second is the post-edition column.",
        "Then comes a column for the MT output to be judged, with a radio button for each level of adequacy (Al – A5) and fluidity (Fl – F5).",
        "The fourth column is dedicated to post-edition.",
        "It is initialized by the MT output.",
        "The trace of the editdistance computation is shown in that column: in red, inserted strings, in overstriked blue, erased strings.",
        "We follow the same presentation principles as above, and add a new one:",
        "• Constant help: each grading button is \"self-explaining\" (an explanation of the score appears in a bubble when the cursor lies over it).",
        "Figure 4 shows the default interface used by judges, and Figure 5 the interface used by the organizer (the scores given by all judges are shown).",
        "lin hombni^ei et du iti$oiit à dioite sur le côte et de la idode.",
        "s'il vois plaît",
        "Dc: character distance, Dw: word distance D: sentence distance",
        "Source",
        "Translation (Reverso)",
        "Distance",
        "Post-édition",
        "D=s.",
        "Debar *ft Dwcri s.iU fcflï",
        "\\ Trace |",
        "| Rejecl ]",
        "■'Hamburger and stew on the ri$ht side and salad, please.",
        "Hamburger et nucmi î droite cote et salade, s'il vous plaît.",
        "Dc=20,Dw=7 Dsent= 9.6",
        "Vu Hamburger et du nucvt a droite sur te côte et de la salade, s'il vous plaît.",
        "That fried fish, one sausa$e with $ieen peas, please.",
        "Cela a frit du poisson, une sauàsse avec les pois veits, s'il vous plaît.",
        "Dc=25,Dw=8 Dsent-11.4",
        "Ce poisson frit, CeUt a fut du poisson, une saucisse avec le* des pei*petits vetts^pois.",
        "s'il vous plaît.",
        "T-bone steak and sauerkraut and fried potatoes, please.",
        "Steak avec un os en T et choucroute et a frit des pommes de terre, s'il vous plaît.",
        "Dc=33 Dw=11 Dsent=15.4",
        "Du bifteck à l'os Steak et avet de m la 04, e*t I e4 choucroute et a-fut des pommes de terre, terre fri te s, s'il vous plaît.",
        "Roast chicken and two slices of ham on this side and spinach, please.",
        "Poulet du tàti et deux tianches de jambon sur ce cote et epiitards, s'il vous plaît.",
        "Dc=8,Dw=2 Dsent=3.2",
        "Du Poulet du rôti et deux tianches de jambon sut ce coté et des epiitards, s'il vous plaît.",
        "I'd like breakfast, please.",
        "J'aimerais petit déjeuner, s'il vous plaît.",
        "Dc=3,Dw=1 Dsent-1.4",
        "J'aimerais un J'aimeiais petit déjeuner, s'il vous plaît.",
        "Figure 5: Visualization of results of subjective evaluation",
        "In the current implementation,• every candidate translation is judged by 3 judges,",
        "• the distribution and control of work is done through a \"mini-workflow\".",
        "We have tested SECTraw.",
        "1 in an internal evaluation campaign funded by FT R&D, on two English-French corpora constructed from English segments from the BTEC corpus [Kikul, G., et al.",
        "2004, Takezawa, T., et al.2002], distributed by ATR for IWSLT-06, from their translations by 2 commercial and 1 research MT systems, and from post-editions of MT results.",
        "For lack of time and human resources, we did not perform again the evaluations we did for the IWSLT-06 evaluation campaign.",
        "However, we measured the average time taken by judges to perform subjective evaluation on our (admittedly different) data, and that time diminished by a factor of about 5.",
        "As this factor is almost the same as that observed in our lab during IWSLT-06, when we asked Cao WenJie, a Chinese PhD researcher, to stop comparing MT outputs before rating them, when she evaluated adequacy on the Chinese-English test corpus, we attribute that result to the new presentation, where a judge never sees more than 1 MT output for a given segment in the same screen."
      ]
    },
    {
      "heading": "4.. Task-related Objective Evaluation",
      "text": [
        "Measures involving humans but no human judgments, such as task-related measures, are objective, not subjective.",
        "There are 3 main tasks of MT, namely helping humans produce high quality translations, understand texts in foreign languages, and communicate.",
        "We have chosen the first task, as it seems easier to rate than the others.",
        "As a matter of fact, there are classical possible measures:",
        "• in the profession, translators are paid by words or by pages (1 standard page has 250 words), with rates corresponding to the time taken, itself linked to the difficulty of the task (language pair, complexity of syntax, difficulty of terminology, proportion of examples found in the translation memory for each bracket of \"matching ratio\", e.g. [0%..74%], [75%..89%], [90%..100%o]).",
        "The simplest and most reliable measure is the postediting time (see Jeff Allen's mtpostediting web site on geocities for references and experiments).",
        "• post-editing time can quite reliably be estimated a posteriori, by measuring an adequate edit distance between the MT output and the final post-edited result.",
        "Remark: measures such as WER and mWER (used in many recent MT evaluation campaigns) are edit distances, but are not related to the task performed because they compare MT outputs with \"reference translations\", and not with post-ed-editions.",
        "That is because the set of (good) possible translations of a sentence (even if short) is very big, and quite sparse for any edit distance – contrary to the set of possible written transcriptions of a spoken utterance.",
        "Hence, they do not qualify as task-related measures.",
        "We follow the same principles as above (verticality, horizontality, constant help, bare-bone presentation), and add a few others:",
        "• Locality: main functions always reside in the same area.",
        "Post-edition happens in the upper pane, where everything concerning segments appears (source text, post-edited text, MT results, suggestions from the TM).",
        "Dictionary-related information and activity is located in the lower pane (lexical information merged from available",
        "sonice",
        "Tianslation (Reveiso)",
        "Distance",
        "Post-edition",
        "( Trace |",
        "s:O.X h0.1",
        "I Reject I",
        "HERVE",
        "GEORGES",
        "ACHILLE",
        ">Hambui$ei and stew on the liqht side oitd salad, please.",
        "Hantbui^ei et ia$oùt a dioite coté et salade, s'il vous plait.",
        "Dc=20,Dw=7 j Dsent= 9 6",
        "Un Hambui^ei et du layout a droite sur le côté et de la salade, s'il vous plaît.",
        "®(A2) ®(F2)",
        "®(A2) ®(F3)",
        "®(AI) ®IF3)",
        "That fiied fish, one sausage with sreerr peas, please.",
        "(eta a flit du poisson, une saucisse avec les pois veits.",
        "s'il vous plaît.",
        "Dc=25,Dw=8 Dsent= 11 4",
        "(e poisson flit.",
        "Cela a frU du-poisson.",
        "une saucisse avec le* des peUpetits vet4±rpois, s'il vous plaît.",
        "®(A3) ®(F3)",
        "®(A2) ®(F3)",
        "®(A2) ®(F3)",
        "T-bone steak and sauerkraut and fiied potatoes, please.",
        "steak avec un os en T et choncioute et a flit des pommes de tene.",
        "s'il vous plait.",
        "Dc=33,Dw=11 Dsent=15.4",
        "Du bifteck à l'os steak et avec- de h# ta o* e#£ei choncioute et a fui des pommes de terre, tene frire s s'il vous plaît.",
        "®(A3) ®(F3)",
        "®(A21 ®(F3)",
        "®(A31 ®(F3)",
        "Roast chicken and two slices of ham on this side and spinach, please.",
        "Poulet du i6ti et deux tianches de jambon sur ce côté et épinaids.",
        "s'il vous plaît.",
        "Dc=8,Dw=2 psent= 3.2",
        "Du Poulet du rôti et deux tianches de jambon sur ce core et i/es épinards.",
        "s'il vous plaît.",
        "®(A2) ®(FZ)",
        "®(A2) ®(F2)",
        "®(A2) ®<F3)",
        "I'd like bieakfast.",
        "please.",
        "J'aimeiais petit dejetinei.",
        "s'il vous plait.",
        "|Dc=3,Dw=1 Dsent» 1A",
        "J'aimeiais un J'aimorais petit déjeuner, s'il vous plaît.",
        "®(A1) ®<F2)",
        "®(At) ®(Ft)",
        "®(At) ®(Ft)",
        "sources, and minimal interface with an online lexical database dedicated to the corpus at hand).",
        "Layout: objects or important zones should be kept at the same place and with approximately the same size.",
        "Accordingly, the \"current segment\" (polyphrase) does not move down when the translator clicks to go to the next one.",
        "Rather, the next one moves up.",
        "We also try to show approximately twice as many previous segments as succeeding ones e.g., 6 before and 3 after), which corresponds to the \"golden ratio\".",
        "Proactivity: the system should propose suggestions for translations of a segment and its words or expressions immediately when the user clicks on it.",
        "Hence, MT as well as search in the TM and in dictionaries should happen before, in the background, and be available without any explicit action of the user."
      ]
    },
    {
      "heading": "1. océan",
      "text": [
        "In SECTraw.1, translation suggestions are provided only by calls to MT systems.",
        "We have only implemented the search for exact matches in the TM.",
        "A good fuzzy search is actually quite complex to program, and we hope to integrate in the future that of Similis™, based on the model of \"layered translation memories\" (Planas 1998, 2000).",
        "As far as lexical help is concerned, the left side of the lower pane shows a list of equivalents from one or more online dictionaries or terminological databases, and the right part is a small form to access an instance of the PIVAX database [Nguyen 2007].",
        "A first experimentation has been performed in November 2007, without integrated language resources (dictionaries, terminologies, glossaries).",
        "Work is in process in the framework of the EOLSS project.",
        "This project aims at translating 25 articles of the online Encyclopedia of Life Support Systems (EOLSS) – about 220 K words, or 880 K standard pages.",
        "In that context, access to some dictionaries and to PIVAX from the post-edition interface has been developed."
      ]
    },
    {
      "heading": "5.. Conclusion",
      "text": [
        "SECTraw.",
        "1 is a web-oriented system for managing multilingual corpora on the web.",
        "In its current state, it is mainly dedicated to the evaluation of MT systems.",
        "After importing a source corpus, and possibly reference translations, one can call various MT systems, store their results, and have a collection of human judges perform subjective evaluation online (fluidity, adequacy).",
        "It is also possible to perform objective, task-oriented evaluation by letting humans post-edit the MT results, using a web translation editor, and measuring an edit distance (and/or the post-editing time).",
        "The post-edited results can be added to the set of reference translations, or constitute it if there were no references.",
        "A first experiment has been performed on a real evaluation task, without integrated dictionary help.",
        "Another one is in progress in the context of the EOLSS/UnescoL project, on a larger scale, with integrated dictionary help.",
        "Further research will concern ways to handle special types of documents (structured \"multifile\" documents), multimodal documents (to manage really large-scale data), and processing of annotations of various types (morphosyntactic lattices, decorated trees, UNL hypergraphs, etc.)"
      ]
    },
    {
      "heading": "6.. Acknowledgements",
      "text": [
        "This work has been partly supported by a MIRA scholarship of the Rhône-Alpes Region and by the research contract TRANSAT awarded to our laboratory by FranceTelecom R&D."
      ]
    }
  ]
}
