{
  "info": {
    "authors": [
      "Hiroshi Nakano",
      "Shin'Ichi Tsuchiya",
      "Akio Tsuruoka"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C80-1050",
    "title": "An Automatic Processing of the Natural Language in the Word Count System",
    "url": "https://aclweb.org/anthology/C80-1050",
    "year": 1980
  },
  "references": [],
  "sections": [
    {
      "heading": "AN AUTOMATIC PROCESSING OF THE NATURAL LANGUAGE IN THE WORD COUNT SYSTEM HIROSHI NAKANO, SHIN'ICHI TSUCHIYA, AKIO TSURUOKA THE NATIONAL LANGUAGE RESEARCH INSTITUTE 3-9-14, NISHIGAOKA, KITAKU, TOKYO, JAPAN Summary",
      "text": [
        "We succeeded in making a program having the following four functions:",
        "1. segmenting the Japanese sentence 2. transliterating from Chinese characters (called Kanii in Japanese) to the Japanese syllabary (kana) or to Roman letters 3. classifying the parts-of-speech in the Japanese vocabulary 4. making a concordance",
        "We are using this program for the pre editing of surveys of Japanese vocabulary.",
        "In Japanese writing we use many kinds of writing systems, i.e. Kanji, kana, the alphabet, numerals, and so on.",
        "We have thought of this as a demerit in language data processing.",
        "But we can change this from a demerit to a merit.",
        "That is, we can make good use of these many writing systems in our program.",
        "Our program has only a small table containing 300 units.",
        "And it is very fast.",
        "In our experiments we have obtained approximately 90% correct answers.",
        "Introduction Obtaining clean date is very important in language data processing.",
        "There are two problems here.",
        "One is how to input the Japanese text and the other is how to find errors in the data and correct them.",
        "The human being is suited to complicated work but not to simple work.",
        "The machine, on the contrary, is suited to simple work but not to complicated work.",
        "In the word count system using computers, the machine has simple work (sorting, computation, making a list), and the humans have complicated work (segmentation, transliteration from Kanii to kana, classification of parts of speech, finding errors in the data, discrimination of homonyms and homographs, ets.).",
        "However, in this system there is one major problem -- humans often make mistakes.",
        "And, regrettably, we cannot predict where they will make them.",
        "Thus we decided to make an automatic processing system.",
        "This system has to be compact, fast, and over 90% accurate.",
        "In Japanese writing we generally use many kinds of writing systems.",
        "For example, ce,OL I 1\\15 8 CM(DtIst.",
        ":./1)T In this example sentence we find used the alphabet (C, 0, L, I, N, G), numerals (8, 0), kana (hiragana the Japanese cursive syllabary A:, and katakana -- the Japanese straight-lined syllabary9, , ,) , Kanj i (,,, fri ,,) and signs (.).",
        "And as you can see, there are no spaces left between words.",
        "This makes Japanese data processing difficult.",
        "Our program makes good use of these different elements in the writing system.",
        "At present the automatic processing program makes more mistakes than humans do.",
        "But we can predict where it will make them and easily correct errors in the data.",
        "Objective Our objective is a system having the following functions:",
        "1. segmentation 2. tranliteration from Kanii to kana 3. classification of parts of speech 4. adding lexical information by use of a dictionary 5. making a concordance b. making a word list",
        "Numbers 1, 2, and 3 are especially important for our program.",
        "Our report will mainly deal with these three functions.",
        "The input data is generally a text written in Japanese.",
        "The output is a concordance sorted in the Japanese alphabetical order, giving information of the parts of speech, and marked with a thesaurus number."
      ]
    },
    {
      "heading": "System",
      "text": [
        "Figure 1 is a flow chart of our program.",
        "Input is by magnetic tape, paper tape, or card.",
        "The input code is the NLRI (National Language Research Institute) code or some other code.",
        "Of course we have a code conversion program from other codes to the NLRI code.",
        "The second block of Figure 1 shows what we call the automatic processing of natural language.",
        "In the supervisor square we check and select the results of the three automatic processing programs.",
        "Some of these programs have many kinds of processing of natural language .",
        "For example, the automatic segmentation program involves the classification of parts of speech, automatic syntactic analysis, automatic transliteration from Kanji to kana, and so on.",
        "(An example will be found in the next section.)",
        "In the adding lexical information block of Figure 1, we make use of the dictionary obtained by research into some 5 million words at the NLRI.",
        "This dictionary includes word frequencies, parts of speech, classes by word origin, and a thesaurus number.",
        "By using the concordance we can find and correct errors in the data.",
        "As our program is unfortunately not always complete, this concordance is very useful.",
        "In the output block of Figure 1 we can choose a variety of output devices -- an alphabet line printer, a kana line printer, a high-speed Kanji printez, or a Kanji display."
      ]
    },
    {
      "heading": "Method",
      "text": [
        "1.",
        "Automatic transliteration from Kanji to Roman letters",
        "The Chinese characters have many different readings in Japanese.",
        "For example, sei/ /syo/ /um-/ /iki/ name!",
        "/ai/ A./ tachi/ /tatsu/ /tate/ /dachi/ /ritsu/ /rittoru/ --/ ichi/ /itsu/ /kazu/ hajime//hito/ We have to arrange the Japanese words in the Japanese alphabetical order.",
        "The program puts the reading way to each word for the word list.",
        "The method of selecting the reading is to choose it in accordance with the surroundings of the Kanji in the text.",
        "The possible readings for each Kanji are listed in a small table.",
        "The records in this table are of 3types- Groups1,2, and 3 represented by numbers 1;2,3; and 4,5, 6 respectively in Figure 2.",
        "The Kanji in Group 1 have one reading each.",
        "The program replaces the Kanji with this reading.",
        "In Figure 2, No.",
        "1 falls into this category.",
        "We have about 700 Kanji in Group 1 (JR.",
        "etc.).",
        "The Kanji in Group 2 have tow or more readings each.",
        "In Figure 2, Nos.",
        "2 and 3 fall into this category.",
        "The format for these entries is group number, the Kanji, the operation code (a numeral or Capital letter), and the reading (up to 8 small letters).",
        "The appropriate reading is chosen for the situation of the Kanij in accordance with Table 1."
      ]
    },
    {
      "heading": "FROM KANJI TOKANA PUTTING LEXICAL INFORMATION INPUTSUPER VISORSEGMENTATIONMAKING CONCORDANCE CLASSIFICATION 9 OUTPUT",
      "text": [
        "Therefore, if the different characters are used properly they suggest the type of word.",
        "We checked the character combinations.",
        "The ratio of segmental point to the character combinations is as follows.",
        "We can segment at character combinations with a high ratio in Table 2 but not at those with a low ratio.",
        "For our program we converted Table 2 to the form found in Table 3.",
        "We can segment a sentence at the places where numeral 1 is found in the table.",
        "Hiragana-Hiragana type is use of the second most frequent combinations in Japanese.",
        "According to Table 2, We are unable to segment for this combination.",
        "'Therefore we make the following rule.",
        "The hiragana//is used only as a particle and we always segment at it.",
        "The other hiragana characters are segmented according to the character string table found in Figure 5.",
        "The format, as in the second line in Figure 5, is the number of characters in the string (4), the character string (up to 10 characters) Li:), the length of the words (2 1, 1), the parts of speech (c, E, P), and the conjugation (9).",
        "This table contains only 300 records.",
        "These are the particles, auxiliary verbs, adverbs, and character strings which cannot be segmented by Table 3 (ex..51.,k.",
        "in Figure 5).",
        "This table is applied as follows.",
        "The program first searches the character strings of the table in the input sentences.",
        "If a character string (c\"--)Lt.:.)",
        "fits part of an input sentence ( L-51.,tcol then the program segments it into parts by the lengths of words in the table and adds the information about the parts of speech and conjugation.",
        "As a result we obtain the wordsL/tc/).",
        "Figure 6 shows the results of automatic segmentation and automatic transliteration from Kanji to Roman letters.",
        "The operation of Table 3 has resulted in no segmentation for the strings (/COLING80 I)( //) , (/0h---/) , and (I MIN",
        "/) as well as the segmentation at the sign (I.!).",
        "The operation of the table in Figure 5 has resulted in the segmentation for the hiragana (//.4/), (/ /) (/%.1,/), and (/k /).",
        "3.",
        "Automatic classification of parts of speech",
        "In order to analyze the vocabulary we have to classify it by parts of speech.",
        "The program dose this by three methods.",
        "The first method is by using the table found in Figure 5.",
        "The second method is by the form of the word, applying the rules below.",
        "The ratio of correct answers obtained is given in parentheses after each rule.",
        "1.",
        "If the last character of the word is in Kenji, katakana,or the alphabet, then the word is a noun.",
        "(94.4%) 2.",
        "If the last character is/t/, then",
        "it is a verb in the renyo form (conjugation) or an adjective in the syushi or rental form.",
        "(86.2%) 3.",
        "If the last character is/{/, then it is a verb in the syushi or rental form or an adjective in the",
        "10.",
        "If the last character is a numeral, then it is a figure and if it is a sign, then it is a sign.",
        "The third method is by word combinations.",
        "That is, in Japanese grammer word combination -- especially of nouns or verbs and particles or auxiliary verbs is not free.",
        "The formula given in Figure 7 is made from this rule.",
        "Its format is as follows:",
        "1. the word 2. its part of speech 3. auxiliary verbs*lor particles which can be used in front of this word 4. parts of speech and conjugations which can be used in front of this word 5. if 3 and 4 do not agree then 5 applies obligatorily.",
        "Figure 8 is the result of automatic classification of parts of speech.",
        "The explanation of the codes used in it is as follows: 1 (noun).",
        "E (verb,), M (adjective) P (auxiliary ver , R (particle) C (adverb), A (conjanction), B(interjection), Y (sighn), X (figure) 4.",
        "If the last character is//, then it is verb, syushi form.",
        "(95.8%) 5.",
        "If the last characterthen it is verb, katei form, or demonstrative pronoun, or auxiliary *1 verb.",
        "(92.9%) 6.",
        "If the last character is/0, then it is verb, meirei form, or noun.",
        "(63.3%) 7.",
        "If the last tow characters are/-6',/, then it is adjective, mizen form, or verb, renyo form.",
        "(74.2%) 8.",
        "If the last character is, then it is verb, renyo form.",
        "(79.6%) 9.",
        "If the last tow characters are Kanji-hiragana,then it is a verb.",
        "(94.4%)",
        "If the vowel of the last hiragana is /a/, then its conjugation is mizen or renyo form, and if it is /i/, then it is mizen or renyo if it is /u/, then it is syushi or rentai if it is /e/, then it is katei or meirei if it is /0/, then it is meirei",
        "Q (auxiliary verb or particle) 8 ('mizen' form), 9 (1renyo' form) # ('mizen' or 'renyo' form) ('syushi' or 'rental' form) 6. automatic classification by method 3, resulting in/V Vbeing changed from a verb to a noun (using the formula for/t/found in Figure 7 ).",
        "The steps in Figure 8 are",
        "1. input data 2. the result of segmentation 3. the result of transliteration from Kanji to Roman letters 4. the automatic classification of the parts of speech by methods 1 and 2 (by table and by word form) 5. the conjugations (1)WO*11.11/t, t /IJ -if"
      ]
    },
    {
      "heading": "4. Supervisor",
      "text": [
        "The supervisor program checks the results of the three automatic processing programs and selects the correct results or processes feedback.",
        "It also utilizes information obtained through each program.",
        "That is, 1.",
        "The results of the character check -343 - and conversion from kana to Roman letters are used for each program.",
        "2.",
        "The information obtained in automatic transliteration is used in segmentation.",
        "Namely, if the special context is applied, then the program does not segment at that point because the character string is a word.",
        "3.",
        "The information obtained at the conversion from kana to Roman letters is used in segmentation.",
        "Namely, if the consonant of the Romanized Japanese is (*), (J), or (Q)-- these are used as special small characters in kana -- then the program dose not segment at that point.",
        "4.",
        "The information obtained in segmentation is used in classification.",
        "Namely, the program obtains information concerning parts of speech and conjugation through using the table in Figure 5 in segmentation.",
        "Checking the results of the processing involves the following:",
        "1.",
        "Checking particle and auxiliary verb strings obtained by the program at classification.",
        "If these strings are impossible in Japanese, then the segmentation was mistaken.",
        "The program corrects these.",
        "2.",
        "There are not many words composed of one character in Japanese except for particles and auxiliary verbs.",
        "Figure 9 gives the frequency of some characters and the frequency of words consisting of that character alone.",
        "Words of high frequency that are not particles or auxiliary verbs are produced by errors in segmentation.",
        "The program then corrects these errors, combining them into longer words.",
        "3.",
        "If a verb in the renyo form is followed by another verb, then it is a compound word and the program corrects the error to produce a longer word.",
        "Figure 10 shows the results of the supervisor program.",
        "In test sentence 1, the program at first segmented/ /as auxiliary verbs through the use of the table in Figure 5.",
        "But the supervisor program checks and corrects this string and the classification program adds thgeinformation of verb to/It.",
        "/X'1 /, as can be seen in Figure 10.",
        "In test sentence 2, the program at first segmented it /#ASOBI/SUGI/TA /, but the supervisor program checked this and corrected this string to the compound word, /#ASOBISUGI/,plus /TA/.",
        "We can process Japanese sentences using these methods and obtain words and various information about these words.",
        "With this program we can obtain a rate of correct answers of approximately 90 percent .",
        "*3 We should be able to improve this program at the level of the supervisor and the tables.",
        "However, we don't think that it will be possible to obtain 100 percent correct answers because this system uses Japanese writing and the Japanese writing system is not 100 percent standardized.",
        "In addition, if we wish to produce a complete program, it is necessary to process on the basis of syntax and meaning.",
        "At persent, this is not the object of our efforts.",
        "5.",
        "Adding lexical information The National Language Research Institute has been investigating the vocabulary of modern Japanese since 1952, and has been using the computer in this research since 1966.",
        "As a result, some five million words are available as machine readable data.",
        "This data contains various information such as word frequency, part of speech, class by word origin, and thesaurus number.",
        "The thesaurus, Bunrui goihyp in Japanese, was produced by Doctor Oki Hayashi.",
        "It contains about 38,000 words in the natural language of Japanese."
      ]
    },
    {
      "heading": "6. Making the concordance",
      "text": [
        "We will not explain this program here since we have written a separate report about it (number 6 in the list of references below).",
        "Please refer to this report for further details.",
        "Figure 11 is the result of this process.",
        "Acknowledgements Professor Akio Tanaka developed this plan, made a prototype for automatic transliteration from Kanji to kana, and permitted us to use this program.",
        "Mr.Kiyoshi Egawa made a prototype for an automatic segmentation program and permitted us to use it.",
        "They also contributed to this study through our - 344--discussions with them.Mr.",
        "Oki Hayashi furnished us with the opportunity to study this and provided his support for our efforts."
      ]
    }
  ]
}
