{
  "info": {
    "authors": [
      "Hideo Watanabe"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-2164",
    "title": "A Method for Abstracting Newspaper Articles by Using Surface Clues",
    "url": "https://aclweb.org/anthology/C96-2164",
    "year": 1996
  },
  "references": [
    "acl-C94-1056"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes a system which automatically creates an abstract of a newspaper article by selecting important sentences of a given text.",
        "To determine the importance of a sentence, several superficial features are considered, and weights for features are determined by multiple-regression analysis of a hand processed corpus."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The rapid expansion of the Internet enables us to easily access a lot of information sources in the world.",
        "The ability to browse information quickly is therefore a very important feature of an information retrieval and navigation system.",
        "Abstraction of a document is one useful tool for quick browsing of textual information.",
        "Generally, an abstract can be considered to be a concise text giving an outline of the original text.",
        "Creating an abstract requires deep semantic processing with broad knowledge, and the strategy for generating an abstract depends on the type of target text.",
        "Abstracts created by humans tend to differ according to their creators' background knowledge and interests.",
        "Furthermore, as stated in [6], the same person is likely to create different abstracts of the same text at different times.",
        "Simulating this human process is clearly outside the area that can be dealt with by current corn-putational linguistics.",
        "There are, however, some cases in which an abstract can be created by using surface clues to make conjectures as to which portions are the most important without using deep semantic processing.",
        "The most practical way to create an abstract is thus to determine the most important portions by using surface clues.",
        "There are two lines of research based on this approach: one analyzes some aspects of a text's structure, such as the rhetorical structure [7], and selects some sentences according to this structure [5, 3]; the other analyzes surface features for each sentence in a given text and selects the most important sentences according to some heuristics [6, 1, 9].",
        "In methods of former type, the rhetorical structure is appropriate for a relatively small set of sentences such as a paragraph, but it does not give enough information to create an abstract for a large set of sentences.",
        "In methods of the latter type, the validity of the heuristics is uncertain when the target text is changed.",
        "Therefore, this paper proposes a method for selecting important sentences by using an equation based on surface features and their weights, and a method for determining these weights by multiple-regression analysis of abstracts created by humans.",
        "The target texts of this method are Japanese newspaper articles.",
        "2 Surface Features of a Sentence The proposed method is to create an abstract by determining important sentences according to features extracted from each sentence.",
        "For each sentence in a given Japanese newspaper article, the following fea-tures' are analyzed:",
        "• Important Keywords:",
        "An important keyword is defined as a keyword that appears in another sentence or in a title.",
        "The number of points for this feature is the total number of occurrences of important keywords.",
        "• Tense:",
        "The tense of a sentence is analyzed as past or present.",
        "This feature gives 1 point for present, and 0 for past.",
        "• Type of a Sentence:",
        "Sentence types are fact, conjecture, or insistence.",
        "This feature gives 0 points for fact, 1 for conjecture, and 2 for insistence.",
        "• Rhetorical Relation:",
        "The rhetorical relations to the preceding context is analyzed as example, adverse, parallel, comparison, or connection.",
        "This feature gives 1 point for reason, 2 for example, and 0 for others.",
        "• Distance from the beginning of a text:",
        "In general, sentences located near the beginning of a text tend to be important.",
        "Therefore, sentences in the first paragraph are given 5 points for this feature, sentences in the next paragraph 4, and so on.",
        "• Distance from the end of a text:",
        "Sentences located near the ending of a text also tend to be important.",
        "Therefore, sentences in the last paragraph are given 5 points for this feature, sentences in the previous paragraph 4, and so on.",
        "The tense of a sentence is simply determined to be past if it has \"ta\" (an inflection for the past tense) in the last phrase.",
        "The reason why tense is used is that sentences stating about the current fact seem to be more important than ones about the past fact in the context of editorial articles.",
        "The sentence type is determined by checking special expressions in the last phrase.' For instance, if the final phrase contains \"bekida\" (\"should\") or \"nakerebanaranai\" (\"must\"), then its sentence type is insistence; if it contains \"darou\" (\"probably ...\"), then its type is conjecture; otherwise, its type is fact.",
        "Examples of special expressions used to determine sentence type are as follows:",
        "• Conjecture: kamosirenai (may), kanenai (be capable of), souda (likely to), youda (likely to), darou (probably), etc.",
        "• Insistence: tai (want to do), hosii (want someone to do), bekida (should), nakereba-naranai (must), taisetu-dearu (important), hituyouda (necessary), etc.",
        "2 In this method, past does not imply the past tense in a strict sense but rather 'the sentence is not in the present tense.",
        "In Japanese, \"ta\" implies the past tense, completion, and so on.",
        "Most cases are actual instances of the past tense.",
        "a ft is sufficient to check in the last phrase for Japanese sentences, because a predicative phrase is always located at the end of a Japanese sentence.",
        "Therefore, another strategy is needed for languages in which a predicative phrase may be located in the middle of a sentence.",
        "The rhetorical relation is determined by checking special expressions both in the first phrase and in the last phrase of a sentence.",
        "For instance, if \"sitakarada\" is found in the last phrase, then the rhetorical relation is reason, and if the conjunction \"sikasi\" (\"but\") is found, then the rhetorical relation is adverse.\" Examples of special expressions used to determine rhetorical relations are listed below:",
        "• Example: tatoeba (for instance), nado (etc.",
        "), etc.",
        "• Adverse: sikasi (but), tokoroga (however), etc.",
        "• Comparison: koreni-taisi (while), etc.",
        "• Parallel: mata (further), sarani (in addition), etc.",
        "• Reason: karada (because), tameda (because), etc."
      ]
    },
    {
      "heading": "3 Process of Creating an Abstract",
      "text": [
        "The basic method for creating an abstract in most previous studies has been to analyze the sentences of a text in terms of some surface features, and a heuristic to determine the most important sentences on the basis of these features.",
        "The method proposed in this paper formalizes the above approach so that the importance of each sentence is calculated as the sum of feature points multiplied by their feature weights.",
        "The most important sentences are then extracted as an abstract.",
        "The importance S of a sentence is calculated as follows:",
        "where a is a constant, Pi is the number of points assigned to the i-th feature, which is normalized to be between 0 and 1, and Wi is the weight assigned to the i-th feature.",
        "The steps in creating an abstract are as follows:",
        "1.",
        "For each sentence, calculate the importance.",
        "2.",
        "Select the sentence that has the highest importance value among the unselected sentences.",
        "3.",
        "If the selected sentence si has another sentence 32 in the previous context that is related to s1 by any rhetorical structure, then 32 is also selected and marked.",
        "4.",
        "If the ratio of the number of selected sentences to the number of sentences in the text exceeds the specified one, then terminate this process; otherwise, goto 2.",
        "These steps select sentences on the basis of their importance value, but they also respect the rhetorical structure to some extent (step 3), because if the rhetorical structure is totally ignored, the output text will be awkward to read."
      ]
    },
    {
      "heading": "4 A Method for Determining",
      "text": []
    },
    {
      "heading": "the Weights of Features",
      "text": [
        "Most previous systems can be considered to determine the weights of features according to human intuition.",
        "On the other hand, this paper proposes a method for determining the wieghts of features by multiple-regression analysis of correct examples, which are abstracts created by testers.",
        "A tester selects important sentences that should be included in an abstract.",
        "The importance value of a sentence is defined as the number of supporters (testers who selected it as an important one) divided by the total number of testers.",
        "Let this importance value be S; we then get the following equation for each sentence:"
      ]
    },
    {
      "heading": "S = a",
      "text": [
        "where, a is a constant, Pi is the number of points assigned to the i-th feature which is normalized to be between 0 to 1, and Wi is the weight assigned to the i-th feature.",
        "In this equation, W is the only variable.",
        "Therefore, the feature weight Wi is calculated by multiple-regression analysis."
      ]
    },
    {
      "heading": "5 Experiment",
      "text": [
        "`We conducted an experiment to check the validity of the proposed method.",
        "The testers were divided into two groups, A and B, each consisting 10 people.",
        "Those in group A selected important sentences (about 1/3 of the article) in 5 editorials and 3 general articles from the Nikkei Newspaper.",
        "Those in group B selected important sentences (about 1/3 of the article) in 3 editorials and 3 general articles, which were different from those used for group A.",
        "One of the editorials and one of the general articles",
        "used for group B are shown in Figures 1 (a) and 2 (a), respectively.",
        "In each of these figures, the first number is a sentence number, the second number is the number of supporters in group B, and the last part is a rough English translation.' Table 1 shows two weight sets; weight set 1 was created by the author in such a way that sentences located near the beginning and end are regarded as important, sentence importance is not proportional to points for rhetorical relation, and the importance of insistence-type sentences is higher in editorials than in general articles.?",
        "Weight set 2, on the other hand, was calculated from the results obtained from group A by the method described in the previous section.",
        "Weight set 2 for general articles implies that sentences near the beginning are more important than ones near the end, and insistence-type sentences are less important, and so on.",
        "On the other hand, weight set 2 for editorials implies that sentences both near the beginning and near the end are important, and that insistence-type sentences are important.' To check the validity of these weight sets, we compared the abstracts created by the system, using weight set 1 and 2, from the articles supplied to group B, with",
        "the abstracts created by group B.",
        "For the general article in Figure 1 (a), the three most important sentences (roughly 1/3 of the article) determined by using the weight sets 1 and 2 are listed in Figures 1 (b) and (c), respectively.",
        "In this case, the three most important sentences selected by group B were 0, 2, and 3.",
        "Likewise, for the editorial in Figure 2 (a), the eight most important sentences (roughly 1/3 of the article) determined by using weight sets 1 and 2 are listed in Figures 2 (b) and (c), respectively.",
        "In this case, the eight most important sentences selected by group B are 0, 2, 3, 12, 15, 20, 21, 22.",
        "Here, we introduce the following metric of estrangement to check which abstract is most similar to the result of group B: Estrangement -,-- Es, (the number of supporters of a sentence si) - (the number of supporters of a sentence si) where si is a sentence that is included in an abstract by group B but not in an abstract created by the system, and sj is a sentence that is not included in an abstract by group B but is included in an abstract created by the system.",
        "The estrangements of the articles in Figures 1 and 2 are as follows: From this result, the weight set 2 calcu-to adjust these heuristics for the given text.",
        "This paper proposed a method for this adjustment; that is, a method for determining weights of surface features by multiple-regression analysis of abstracts created by human.",
        "By using this method, a system can have an ability to be applied to a variety of texts."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "This paper has proposed a method for creating an abstract by using surface features and their weights to select important sentences, and a method for determining these feature weights by multiple-regression analysis of abstracts created by humans.",
        "By using the proposed method to calculate feature weight, this system can be applied to other types of texts, and gives results more similar to those of a human process than a set of weights based on human intuition.",
        "This abstract creation system is currently used in an information navigation assistance system [8] as a tool for quickly viewing the contents of newspaper articles."
      ]
    },
    {
      "heading": "References",
      "text": [
        "lated by multiple-regression analysis is more similar to the human selection than the weight set 1 created according to the author's intuition.",
        "For the other general articles used with group B, the estrangement values of weight set 2 are also better than those of weight set 1.",
        "In the other editorials, the estrangement values are comparable.",
        "This implies that the weight set 1 is not such a bad estimate for editorials."
      ]
    },
    {
      "heading": "6 Discussion",
      "text": [
        "So far, most systems for creating an abstract of a text has been selected important sentences by some heuristics on the basis of surface features.",
        "However, most of these heuristics were derived from human intuition, and the validity of them are uncertain if the target text is changed.",
        "As mentioned in the introduction, the strategy of an abstraction should be changed according to the given text.",
        "Therefore, it is needed [3] Ono, K., Sumita, K., and Miike, S., \"Abstract Generation based on Rhetorical Structure Extraction,\" Proc.",
        "of Col-ing'94, pp.",
        "344-348,1994.",
        "[41 Tamura, T., and Tamura, N., \"A Summary Generation based on The Form of Text\" (in Japanese), Report 92-1 of NLWG of IPSJ, 1992.",
        "[5] Schank, It.",
        "and Abelson, A., \"Script Plans Goals and Un-derstanding,\" Lawrence Erlbaum Associates, Hillside, New Jersey, 1977.",
        "16] Lul', 11.",
        "P., \"The Automatic Creation of Literature Ab-stracts,\" IBM Journal of Research and Development, Vol.",
        "2, No.",
        "2, pp.",
        "159-165, 1958.",
        "[71 Mann, W. C., \"Rhetorical Structure Theory: Description and Construction of Text Structure,\" In G. Kempen, editor, Natural Language Generation, pp.",
        "279-300, Martini's Nilijhoff Publishers, 1987.",
        "[81 Morohashi, M., Takeda, K., and et.",
        "al., \"Information Outlining - Filling the Gap between Visualization and Navigation in Digital Libraries,\" Proc.",
        "of Int.",
        "Symposium on Digital Libraries 1995, pp.",
        "151-158, 1995.",
        "PigratifVaiL t, v)1,4\",74 5' r 71fle:MOZatff1.",
        "(The above three types of PC will provide additional multimedia functions by including CD-ROM, microphone, stereo audio, and voice recognition functions as standard features.)",
        "intended to compete with Intel CPUs, which are de-facto standards in the PC microprocessor market.",
        "Its main advantages are low price and fast processing.)",
        "8 (1) )1'7n :-'1W1-1Z.orY7 •Y711h'il7 – P cgr-tivi-)n:/* JI-Pc-4-Z1-1.111“a•A.",
        "(The second largest PC maker, Apple, has announced a plan to release a \"PowerPC\"-based PC next year.)",
        "1 (3) fto-m-Laaititit.ialh , vq-DoPZ4I144KKVP05M-- LtI (The aim of this move is to shut out economic refugees and accept only political refugees.)",
        "2 (8) 11*.qa.A01kialICItt::71', lt,f11131t#1±1, F 4 sy41.-0-)N Ur.4.",
        "-Vtr4-14•71•coffiRLII‘.",
        "*...1 -).",
        "(This retreat from idealism is disappointing, but in view of the current situation of Germany, it is an inevitable measure.)",
        "ot..-f. (The restriction, which will come into effect in July, will prohibit refugees from \"countries without persecution\" (e.g. Romania, Bulgaria, and Hungary) from being granted entry except in special cases, and will repatriate political refugees through \"safe countries\" (e.g. western European countries, Poland, and Czechoslovakia) which permitpolitical refugees.)",
        "number arriving in Germany, which has loose restrictions, was 440,000, over 60% of the total for Europe.)",
        "to (0) 09EIA l:ItINfiE-T-A7V V - Ylz.e._.-AF“IiiN fr).12666t4t.:6Dil-t;ffA.t.fft,±-07'.",
        ":0 (43,000 people applied to Germany for refugee status this April; of these, 410,000 were interviewed but only 700 were accepted.)",
        "k 2gVANIA'--1,1E-6311P.WattZoDt tr'MII,N.",
        "(It is important to alleviate the conditions that produce economic refugees through worldwide cooperation, and it may be inevitable for European countries to impose some level of restricts.)",
        "23 (5).",
        "oPil 1. al5-C,0--k•60-AIRINU'SD7)-)0 (However, it is not appropriate to apply these examples to Japan, because Japan's circumstances are different from those in Europe.)"
      ]
    }
  ]
}
