{
  "info": {
    "authors": [
      "Rebecca Green",
      "Lisa Pearl",
      "Bonnie Jean Dorr",
      "Philip Resnik"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P01-1032",
    "title": "Mapping Lexical Entries in a Verbs Database to WordNet Senses",
    "url": "https://aclweb.org/anthology/P01-1032",
    "year": 2001
  },
  "references": [
    "acl-A00-2026",
    "acl-J96-2004",
    "acl-P00-1059",
    "acl-P97-1020",
    "acl-P98-1081"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes automatic techniques for mapping 9611 entries in a database of English verbs to WordNet senses.",
        "The verbs were initially grouped into 491 classes based on syntactic features.",
        "Mapping these verbs into WordNet senses provides a resource that supports disambiguation in multilingual applications such as machine translation and cross-language information retrieval.",
        "Our techniques make use of (1) a training set of 1791 disambiguated entries, representing",
        "1442 verb entries from 167 classes; (2) word sense probabilities, from frequency counts in a tagged corpus; (3) semantic similarity of WordNet senses for verbs within the same class; (4) probabilistic correlations between",
        "WordNet data and attributes of the verb classes.",
        "The best results achieved 72% precision and 58% recall, versus a lower bound of 62% precision and 38% recall for assigning the most frequently occurring WordNet sense, and an upper bound of 87% precision and 75% recall for human judgment."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Our goal is to map entries in a lexical database of 4076 English verbs automatically to WordNet senses (Miller and Fellbaum, 1991), (Fell-baum, 1998) to support such applications as machine translation and cross-language information retrieval.",
        "For example, the verb drop is multiply ambiguous, with many potential translations in Spanish: bajar, caerse, dejar caer, derribar, disminuir, echar, hundir, soltar, etc.",
        "The database specifies a set of interpretations for drop, depending on its context in the source-language (SL).",
        "Inclusion of WordNet senses in the database enables the selection of an appropriate verb in the target language (TL).",
        "Final selection is based on a frequency count of WordNet senses across all classes to which the verb belongse.g., disminuir is selected when the WordNet sense corresponds to the meaning of drop in Prices dropped.",
        "Our task differs from standard word sense disambiguation (WSD) in several ways.",
        "First, the words to be disambiguated are entries in a lexical database, not tokens in a text corpus.",
        "Second, we take an all-words rather than a lexical-sample approach (Kilgarriff and Rosenzweig, 2000): All words in the lexical database text are disambiguated, not just a small number for which detailed knowledge is available.",
        "Third, we replace the contextual data typically used for WSD with information about verb senses encoded in terms of thematic grids and lexical-semantic representations from (Olsen et al., 1997).",
        "Fourth, whereas a single word sense for each token in a text corpus is often assumed, the absence of sentential context leads to a situation where several WordNet senses may be equally appropriate for a database entry.",
        "Indeed, as distinctions between WordNet senses can be fine-grained (Palmer, 2000), it may be unclear, even in context, which sense is meant.",
        "The verb database contains mostly syntactic information about its entries, much of which applies at the class level within the database.",
        "WordNet, on the other hand, is a significant source for information about semantic relationships, much of which applies at the synset level (synsets are WordNets groupings of synonymous word senses).",
        "Mapping entries in the database to their corresponding WordNet senses greatly extends the semantic potential of the database."
      ]
    },
    {
      "heading": "2 Lexical Resources",
      "text": [
        "We use an existing classification of 4076 English verbs, based initially on English Verbs Classes and Alternations (Levin, 1993) and extended through the splitting of some classes into subclasses and the addition of new classes.",
        "The resulting 491 classes (e.g., Roll Verbs, Group I, which includes drift, drop, glide, roll, swing) are referred to here as Levin+ classes.",
        "As verbs may be assigned to multiple Levin+ classes, the actual number of entries in the database is larger, 9611.",
        "Following the model of (Dorr and Olsen, 1997), each Levin+ class is associated with a thematic grid (henceforth abbreviated 0-grid), which summarizes a verbs syntactic behavior by specifying its predicate argument structure.",
        "For example, the Levin+ class Roll Verbs, Group I is associated with the 0-grid [ th goal], in which a theme and a goal are used (e.g., The ball dropped to the ground).1 Each 0-grid specification corresponds to a Grid class.",
        "There are 48 Grid classes, with a one-to-many relationship between Grid and Levin+ classes.",
        "WordNet, the lexical resource to which we are mapping entries from the lexical database, groups synonymous word senses into synsets and structures the synsets into part-of-speech hierarchies.",
        "Our mapping operation uses several other data elements pertaining to WordNet: semantic relationships between synsets, frequency data, and syntactic information.",
        "Seven semantic relationship types exist between synsets, including, for example, antonymy, hyperonymy, and entailment.",
        "Synsets are often related to a half dozen or more other synsets; they 1 There is also a Levin+ class Roll Verbs, Group II which is associated with the 0-grid [th particle(down)], in which a theme and a particle down are used (e.g., The ball dropped down).",
        "may be related to multiple synsets through a single relationship or may be related to a single synset through multiple relationship types.",
        "Our frequency data for WordNet senses is derived from SEMCORa semantic concordance incorporating tagging of the Brown corpus with WordNet senses.2 Syntactic patterns (frames) are associated with each synset, e.g., Somebody ____s something; Something ____s; Somebody ____s somebody into V-ing something.",
        "There are 35 such verb frames in WordNet and a synset may have only one or as many as a half dozen or so frames assigned to it.",
        "Our mapping of verbs in Levin+ classes to WordNet senses relies in part on the relation between thematic roles in Levin+ and verb frames in WordNet.",
        "Both reflect how many and what kinds of arguments a verb may take.",
        "However, constructing a direct mapping between 0-grids and WordNet frames is not possible, as the underlying classifications differ in significant ways.",
        "The correlations between the two sets of data are better viewed probabilistically.",
        "Table 1 illustrates the relation between Levin+ classes and WordNet for the verb drop.",
        "In our multilingual applications (e.g., lexical selection in machine translation), the Grid information provides a context-based means of associating a verb with a Levin+ class according to its usage in the SL sentence.",
        "The WordNet sense possibilities are thus pared down during SL analysis, but not sufficiently for the final selection of a TL verb.",
        "For example, Levin+ class 9.4 has three possible WordNet senses for drop.",
        "However, the WordNet sense 8 is not associated with any of the other classes; thus, it is considered to have a higher information content than the others.",
        "The upshot is that the lexical-selection routine prefers dejar caer over other translations such as derribar and bajar.",
        "The other classes are similarly associated with ap-2For further information see the WordNet manuals, section 7, SEMCOR at http://www.cogsci.princeton.edu.",
        "3 This lexical-selection approach is an adaptation of the notion of reduction in entropy, measured by information gain (Mitchell, 1997).",
        "Using information content to quantify the value of a node in the WordNet hierarchy has also been used for measuring semantic similarity in a taxonomy (Resnik, 1999b).",
        "More recently, context-based models of disambiguation have been shown to represent significant improvements over the baseline (Bangalore and Ram-bow, 2000), (Ratnaparkhi, 2000)."
      ]
    },
    {
      "heading": "Levin+Grid/ExampleWN SenseSpanish Verb(s)",
      "text": [
        "9.4[ag th mod-loc src goal]1. move, displace1.",
        "derribar, echar DirectionalI dropped the stone2.",
        "descend, fall, go down2.",
        "bajar, caerse Put8.",
        "drop set down, put down8.",
        "dejar caer, echar, soltar 45.6[th]1. move, displace1.",
        "derribar, echar CalibratablePrices dropped3.",
        "decline, go down, wane3.",
        "disminuir Change of State 47.7[th src goal]2. descend, fall, go down2.",
        "bajar, caerse MeanderThe river dropped from4.",
        "sink, drop, drop down4.",
        "hundir, caer the lake to the sea 51.3.1[th goal]2. descend, fall, go down2.",
        "bajar, caerse Roll IThe ball dropped to the ground 51.3.1[th particle(down)]2. descend, fall, go down2.",
        "bajar, caerse Roll IIThe ball dropped down",
        "propriate TL verbs during lexical selection: disminuir (class 45.6), hundir (class 47.7), and bajar (class 51.3.1).4"
      ]
    },
    {
      "heading": "3 Training Data",
      "text": [
        "We began with the lexical database of (Dorr and Jones, 1996), which contains a significant number of WordNet-tagged verb entries.",
        "Some of the assignments were in doubt, since class splitting had occurred subsequent to those assignments, with all old WordNet senses carried over to new subclasses.",
        "New classes had also been added since the manual tagging.",
        "It was determined that the tagging for only 1791 entriesincluding 1442 verbs in 167 classescould be considered stable; for these entries, 2756 assignments of WordNet senses had been made.",
        "Data for these entries, taken from both WordNet and the verb lexicon, constitute the training data for this study.",
        "The following probabilities were generated from the training data: Gridrobabilit=I{r,x & G1=G2}1 pyxj{r.}1, where r, is a relation (of relationship type x, e.g., synonymy) between two synsets, s, and s2, where s, is mapped to by a verb in Grid class G, and .s2 is mapped to by a verb in Grid class G2.",
        "4 The full set of Spanish translations is selected from WordNet associations developed in the EuroWordNet effort (Dorr et al., 1997).",
        "This is the probability that if one synset is related to another through a particular relationship type, then a verb mapped to the first synset will belong to the same Grid class as a verb mapped to the second synset.",
        "Computed values generally range between .3 and .35.",
        "where rx is as above, except that sl is mapped to by a verb in Levin+ class L+1 and s2 is mapped to by a verb in Levin+ class L+2.",
        "This is the probability that if one synset is related to another through a particular relationship type, then a verb mapped to the first synset will belong to the same Levin+ class as a verb mapped to the second synset.",
        "Computed values generally range between .25 and .3.",
        "where BZ ~is the occurrence of the entire B-grid i for verb entry z and cfj ~ ~is the occurrence of the entire frame sequence j for a WordNet sense to which verb entry z is mapped.",
        "This is the probability that a verb in a Levin+ class is mapped to a WordNet verb sense with some specific combination of frames.",
        "Values average only .11, but in some cases the probability is 1.0.",
        "Indv framerobabilit_ I{e ,2, & cf,,2,}1 PYz,~ I{ei\"11 where BZ ~is the occurrence of the single B-grid component i for verb entry z and cfj ~ ~is the occurrence of the single frame j for a WordNet sense to which verb entry z is mapped.",
        "This is the probability that a verb in a Levin+ class with a particular 0-grid component (possibly among others) is mapped to a WordNet verb sense assigned a specific frame (possibly among others).",
        "Values average .20, but in some cases the probability is 1.0.",
        "Prior WN probability s = ift2 }i,where is is an occurrence of tag s (for a particular synset) in SEMCOR and t, is an occurrence of any of a set of tags for verb z in SEMCOR, with s being one of the senses possible for verb z.",
        "This probability is the prior probability of specific WordNet verb senses.",
        "Values average .11, but in some cases the probability is 1.0.",
        "In addition to the foregoing data elements, based on the training set, we also made use of a semantic similarity measure, which reflects the confidence with which a verb, given the total set of verbs assigned to its Levin+ class, is mapped to a specific WordNet sense.",
        "This represents an implementation of a class disambiguation algorithm (Resnik, 1999a), modified to run against the WordNet verb hierarchy.5 We also made a powerful same-synset assumption: If (1) two verbs are assigned to the same Levin+ class, (2) one of the verbs , has been mapped to a specific WordNet sense .sI, and (3) the other verb z2 has a WordNet sense s2 synonymous with sI, then z2 should be mapped to s2.",
        "Since WordNet groups synonymous word senses into synsets, sl and s2 would correspond to the same synset.",
        "Since Levin+ verbs are mapped to WordNet senses via their corresponding synset identifiers, when the set of conditions enumerated above are met, the two verb entries would be mapped to the same WordNet synset.",
        "As an example, the two verbs tag and mark have been assigned to the same Levin+ class.",
        "In WordNet, each occurs in five synsets, only one in which they both occur.",
        "If tag has a WordNet synset assigned to it for the Levin+ class it shares with mark, and it is the synset that covers senses 5 The assumption underlying this measure is that the appropriate word senses for a group of semantically related words should themselves be semantically related.",
        "Given WordNets hierarchical structure, the semantic similarity between two WordNet senses corresponds to the degree of informativeness of the most specific concept that subsumes them both.",
        "of both tag and mark, we can safely assume that that synset is also appropriate for mark, since in that context, the two verb senses are synonymous."
      ]
    },
    {
      "heading": "4 Evaluation",
      "text": [
        "Subsequent to the culling of the training set, several processes were undertaken that resulted in full mapping of entries in the lexical database to WordNet senses.",
        "Much, but not all, of this mapping was accomplished manually.",
        "Each entry whose WordNet senses were assigned manually was considered by at least two coders, one coder who was involved in the entire manual assignment process and the other drawn from a handful of coders working independently on different subsets of the verb lexicon.",
        "In the manual tagging, if a WordNet sense was considered appropriate for a lexical entry by any one of the coders, it was assigned.",
        "Overall, 13452 WordNet sense assignments were made.",
        "Of these, 51 % were agreed upon by multiple coders.",
        "The kappa coefficient (K) of intercoder agreement was .47 for a first round of manual tagging and (only) .24 for a second round of more problematic cases.6 While the full tagging of the lexical database may make the automatic tagging task appear superfluous, the low rate of agreement between coders and the automatic nature of some of the tagging suggest there is still room for adjustment of WordNet sense assignments in the verb database.",
        "On the one hand, even the higher of the kappa coefficients mentioned above is significantly lower than the standard suggested for good reliability (K > .8) or even the level where tentative conclusions maybe drawn (.67 < K < .8) (Carletta, 1996), (Krippendorff, 1980).",
        "On the other hand, if the automatic assignments agree with human coding at levels comparable to the degree of agreement among humans, it may be used to identify current assignments that need review",
        "agreement of coders on a classification task surpasses what would be expected by chance; the standard definition of this coefficient is: K = (P(A) P(E))I(1 P(E)), where P(A) is the actual percentage of agreement and P(E) is the expected percentage of agreement, averaged over all pairs of assignments.",
        "Several adjustments in the computation of the kappa coefficient were made necessary by the possible assignment of multiple senses for each verb in a Levin+ class, since without prior knowledge of how many senses are to be assigned, there is no basis on which to compute P(E).",
        "and to suggest new assignments for consideration.",
        "In addition, consistency checking is done more easily by machine than by hand.",
        "For example, the same-synset assumption is more easily enforced automatically than manually.",
        "When this assumption is implemented for the 2756 senses in the training set, another 967 sense assignments are generated, only 131 of which were actually assigned manually.",
        "Similarly, when this premise is enforced on the entirety of the lexical database of 13452 assignments, another 5059 sense assignments are generated.",
        "If the same-synset assumption is valid and if the senses assigned in the database are accurate, then the human tagging has a recall of no more than 73%.",
        "Because a word sense was assigned even if only one coder judged it to apply, human coding has been treated as having a precision of 100%.",
        "However, some of the solo judgments are likely to have been in error.",
        "To determine what proportion of such judgments were in reality precision failures, a random sample of 50 WordNet senses selected by only one of the two original coders was investigated further by a team of three judges.",
        "In this round, judges rated WordNet senses assigned to verb entries as falling into one of three categories: definitely correct, definitely incorrect, and arguable whether correct.",
        "As it turned out, if any one of the judges rated a sense definitely correct, another judge independently judged it definitely correct; this accounts for 31 instances.",
        "In 13 instances the assignments were judged definitely incorrect by at least two of the judges.",
        "No consensus was reached on the remaining 6 instances.",
        "Extrapolating from this sample to the full set of solo judgments in the database leads to an estimate that approximately 1725 (26% of 6636 solo judgments) of those senses are incorrect.",
        "This suggests that the precision of the human coding is approximately 87%.",
        "The upper bound for this task, as set by human performance, is thus 73% recall and 87% precision.",
        "The lower bound, based on assigning the WordNet sense with the greatest prior probability, is 38% recall and 62% precision."
      ]
    },
    {
      "heading": "5 Mapping Strategies",
      "text": [
        "Recent work (Van Halteren et al., 1998) has demonstrated improvement in part-of-speech tagging when the outputs of multiple taggers are combined.",
        "When the errors of multiple classifiers are not significantly correlated, the result of combining votes from a set of individual classifiers often outperforms the best result from any single classifier.",
        "Using a voting strategy seems especially appropriate here: The measures outlined in Section 3 average only 41 % recall on the training set, but the senses picked out by their highest values vary significantly.",
        "The investigations undertaken used both simple and aggregate voters, combined using various voting strategies.",
        "The simple voters were the 7 measures previously introduced .7 In addition, three aggregate voters were generated: (1) the product of the simple measures (smoothed so that zero values wouldnt offset all other measures); (2) the weighted sum of the simple measures, with weights representing the percentage of the training set assignments correctly identified by the highest score of the simple probabilities; and (3) the maximum score of the simple measures.",
        "Using these data, two different types of voting schemes were investigated.",
        "The schemes differ most significantly on the circumstances under which a voter casts its vote for a WordNet sense, the size of the vote cast by each voter, and the circumstances under which a WordNet sense was selected.",
        "We will refer to these two schemes as Majority Voting Scheme and Threshold Voting Scheme."
      ]
    },
    {
      "heading": "5.1 Majority Voting Scheme",
      "text": [
        "Although we do not know in advance how many WordNet senses should be assigned to an entry in the lexical database, we assume that, in general, there is at least one.",
        "In line with this intuition, one strategy we investigated was to have both simple and aggregate measures cast a vote for whichever sense(s) of a verb in a Levin+ class received the highest (non-zero) value for that measure.",
        "Ten variations are given here:"
      ]
    },
    {
      "heading": "and MajAggr",
      "text": [
        "Table 2 gives recall and precision measures for all variations of this voting scheme, both with and without enforcement of the same-synset assumption.",
        "If we use the harmonic mean of recall and precision as a criterion for comparing results, the best voting scheme is MajAggr, with 58% recall and 72% precision without enforcement of the same-synset assumption.",
        "Note that if the same-synset assumption is correct, the drop in precision that accompanies its enforcement mostly reflects inconsistencies in human judgments in the training set; the true precision value for MajAggr after enforcing the same-synset assumption is probably close to 67%.",
        "Of the simple voters, only PriorProb and SemSim are individually strong enough to warrant discussion.",
        "Although PriorProb was used to establish our lower bound, SemSim proves to be the stronger voter, bested only by MajAggr (the majority vote of SimpleProd and SimpleWtdSum) in voting that enforces the same-synset assumption.",
        "Both PriorProb and SemSim provide better results than the majority vote of all 7 simple voters (MajSimpleSgl) and the majority vote of all 21 pairs of simple voters (MajSimplePair).",
        "Moreover, the inclusion of MajSimpleSgl and MajSimplePair in a majority vote with MajAggr (in MajSgl+Aggr 8A pair cast a vote for a sense if, among all the senses of a verb, a specific sense had the highest value for both measures."
      ]
    },
    {
      "heading": "Voting Scheme",
      "text": [
        "and MapPair+Aggr, respectively) turn in poorer results than MajAggr alone.",
        "The poor performance of MajSimpleSgl and MajSimplePair do not point, however, to a general failure of the principle that multiple voters are better than individual voters.",
        "SimpleProd, the product of all simple measures, and SimpleWtdSum, the weighted sum of all simple measures, provide reasonably strong results, and a majority vote of the both of them (MajAggr) gives the best results of all.",
        "When they are joined by SemSim in Maj3Best, they continue to provide good results.",
        "The bottom line is that SemSim makes the most significant contribution of any single simple voter, while the product and weighted sums of all simple voters, in concert with each other, provide the best results of all with this voting scheme."
      ]
    },
    {
      "heading": "5.2 Threshold Voting Scheme",
      "text": [
        "The second voting strategy first identified, for each simple and aggregate measure, the threshold value at which the product of recall and precision scores in the training set has the highest value if that threshold is used to select WordNet senses.",
        "During the voting, if a WordNet sense has a higher score for a measure than its threshold, the measure votes for the sense; otherwise, it votes against it.",
        "The weight of the measures vote is the precision-recall product at the threshold.",
        "This voting strategy has the advantage of taking into account each individual attributes strength of prediction.",
        "Five variations on this basic voting scheme were investigated.",
        "In each, senses were selected if their vote total exceeded a variation-specific threshold.",
        "Table 3 summarizes recall and precision for these variations at their optimal vote thresholds.",
        "In the AutoMap+ variation, Grid and Levin+ probabilities abstain from voting when their values are zero (a common occurrence, because of data sparsity in the training set); the same-synset assumption is automatically implemented.",
        "AutoMap- differs in that it disregards the Grid and Levin+ probabilities completely.",
        "The Triples variation places the simple and composite measures into three groups, the three with the highest weights, the three with the lowest weights, and the middle or remaining three.",
        "Voting first occurs within the group, and the groups vote is brought forward with a weight equaling the sum of the group members weights.",
        "This variation also adds to the vote total if the sense was assigned in the training data.",
        "The Combo variation is like Triples, but rather than using the weights and thresholds calculated for the single measures from the training data, this variation calculates weights and thresholds for combinations of two, three, four, five, six, and, seven measures.",
        "Finally, the Combo&Auto variation adds the same-synset assumption to the previous variation.",
        "Although not evident in Table 3 because of rounding, AutoMap- has slightly higher values for both recall and precision than does AutoMap+, giving it the highest recall-precision product of the threshold voting schemes.",
        "This suggests that the Grid and Levin+ probabilities could profitably be dropped from further use.",
        "Of the more exotic voting variations, Triples voting achieved results nearly as good as the AutoMap voting schemes, but the Combo schemes fell short, indicating that weights and thresholds are better based on single measures than combinations of measures."
      ]
    },
    {
      "heading": "6 Conclusions and Future Work",
      "text": [
        "The voting schemes still leave room for improvement, as the best results (58% recall and 72% precision, or, optimistically, 63% recall and 67% precision) fall shy of the upper bound of 73% recall and 87% precision for human coding.9 At the same time, these results are far better than the lower bound of 38% recall and 62% precision for the most frequent WordNet sense.",
        "As has been true in many other evaluation studies, the best results come from combining classifiers (MajAggr): not only does this variation use a majority voting scheme, but more importantly, the two voters take into account all of the simple voters, in different ways.",
        "The next-best results come from Maj3Best, in which the three best single measures vote.",
        "We should note, however, that the single best measure, the semantic similarity measure from SemSim, lags only slightly behind the two best voting schemes.",
        "This research demonstrates that credible word sense disambiguation results can be achieved without recourse to contextual data.",
        "Lexical resources enriched with, for example, syntactic information, in which some portion of the resource is hand-mapped to another lexical resource may be rich enough to support such a task.",
        "The degree of success achieved here also owes much to the confluence of WordNets hierarchical structure and SEMCOR tagging, as used in the computation of the semantic similarity measure, on the one hand, and the classified structure of the verb lexicon, which provided the underlying groupings used in that measure, on the other hand.",
        "Even where one measure yields good results, several data sources needed to be combined to enable its success."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors are supported, in part, by"
      ]
    },
    {
      "heading": "PFF/PECASE Award IRI-9629108, DOD",
      "text": []
    }
  ]
}
