{
  "info": {
    "authors": [
      "Mengqiu Wang",
      "Wanxiang Che",
      "Christopher D. Manning"
    ],
    "book": "ACL",
    "id": "acl-P13-1106",
    "title": "Joint Word Alignment and Bilingual Named Entity Recognition Using Dual Decomposition",
    "url": "https://aclweb.org/anthology/P13-1106",
    "year": 2013
  },
  "references": [
    "acl-D09-1127",
    "acl-D10-1001",
    "acl-D10-1125",
    "acl-D11-1001",
    "acl-D11-1022",
    "acl-D12-1131",
    "acl-E09-1020",
    "acl-N06-1014",
    "acl-N06-2015",
    "acl-N10-1015",
    "acl-P02-1051",
    "acl-P04-1056",
    "acl-P05-1045",
    "acl-P08-2007",
    "acl-P09-1104",
    "acl-P10-1065",
    "acl-P11-1043",
    "acl-P12-1073",
    "acl-P91-1034",
    "acl-W10-2906"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Translated bi-texts contain complementary language cues, and previous work on Named Entity Recognition (NER) has demonstrated improvements in performance over monolingual taggers by promoting agreement of tagging decisions between the two languages.",
        "However, most previous approaches to bilingual tagging assume word alignments are given as fixed input, which can cause cascading errors.",
        "We observe that NER label information can be used to correct alignment mistakes, and present a graphical model that performs bilingual NER tagging jointly with word alignment, by combining two monolingual tagging models with two unidirectional alignment models.",
        "We introduce additional cross-lingual edge factors that encourage agreements between tagging and alignment decisions.",
        "We design a dual decomposition inference algorithm to perform joint decoding over the combined alignment and NER output space.",
        "Experiments on the OntoNotes dataset demonstrate that our method yields significant improvements in both NER and word alignment over state-of-the-art monolingual baselines."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "We study the problem of Named Entity Recognition (NER) in a bilingual context, where the goal is to annotate parallel bi-texts with named entity tags.",
        "This is a particularly important problem for machine translation (MT) since entities such as person names, locations, organizations, etc.",
        "carry much of the information expressed in the source sentence.",
        "Recognizing them provides useful information for phrase detection and word sense disambiguation (e.g., ?melody?",
        "as in a female name has a different translation from the word ?melody?",
        "in a musical sense), and can be directly leveraged to improve translation quality (Babych and Hartley, 2003).",
        "We can also automatically construct a named entity translation lexicon by annotating and extracting entities from bi-texts, and use it to improve MT performance (Huang and Vogel, 2002; Al-Onaizan and Knight, 2002).",
        "Previous work such as Burkett et al. (2010b), Li et al. (2012) and Kim et al. (2012) have also demonstrated that bi-texts annotated with NER tags can provide useful additional training sources for improving the performance of standalone monolingual taggers.",
        "Because human translation in general preserves semantic equivalence, bi-texts represent two perspectives on the same semantic content (Burkett et al., 2010b).",
        "As a result, we can find complementary cues in the two languages that help to disambiguate named entity mentions (Brown et al., 1991).",
        "For example, the English word ?Jordan?",
        "can be either a last name or a country.",
        "Without sufficient context it can be difficult to distinguish the two; however, in Chinese, these two senses are disambiguated: ????",
        "as a last name, and ????",
        "as a country name.",
        "In this work, we first develop a bilingual NER model (denoted as BI-NER) by embedding two monolingual CRF-based NER models into a larger undirected graphical model, and introduce additional edge factors based on word alignment (WA).",
        "Because the new bilingual model contains many cyclic cliques, exact inference is intractable.",
        "We employ a dual decomposition (DD) inference algorithm (Bertsekas, 1999; Rush et al., 2010) for performing approximate inference.",
        "Unlike most",
        "an example of a wrong tag assignment.",
        "The dashed alignment link between e3 and f2 is an example of alignment error.",
        "previous applications of the DD method in NLP, where the model typically factors over two components and agreement is to be sought between the two (Rush et al., 2010; Koo et al., 2010; DeNero and Macherey, 2011; Chieu and Teow, 2012), our method decomposes the larger graphical model into many overlapping components where each alignment edge forms a separate factor.",
        "We design clique potentials over the alignment-based edges to encourage entity tag agreements.",
        "Our method does not require any manual annotation of word alignments or named entities over the bilingual training data.",
        "The aforementioned BI-NER model assumes fixed alignment input given by an underlying word aligner.",
        "But the entity span and type predictions given by the NER models contain complementary information for correcting alignment errors.",
        "To capture this source of information, we present a novel extension that combines the BI-NER model with two unidirectional HMM-based alignment models, and perform joint decoding of NER and word alignments.",
        "The new model (denoted as BI-NER-WA) factors over five components: one NER model and one word alignment model for each language, plus a joint NER-alignment model which not only enforces NER label agreements but also facilitates message passing among the other four components.",
        "An extended DD decoding algorithm is again employed to perform approximate inference.",
        "We give a formal definition of the Bi-NER model in Section 2, and then move to present the Bi-NER-WA model in Section 3."
      ]
    },
    {
      "heading": "2 Bilingual NER by Agreement",
      "text": [
        "The inputs to our models are parallel sentence pairs (see Figure 1 for an example in English and Chinese).",
        "We denote the sentences as e (for English) and f (for Chinese).",
        "We assume access to two monolingual linear-chain CRF-based NER models that are already trained.",
        "The English-side CRF model assigns the following probability for a tag sequence ye:",
        "where Ve is the set of vertices in the CRF and De is the set of edges.",
        "?",
        "(vi) and ?",
        "(vi, vj) are the node and edge clique potentials, and Ze(e) is the partition function for input sequence e under the English CRF model.",
        "We let k(ye) be the un-normalized log-probability of tag sequence ye, defined as:",
        "Similarly, we define model PCRFf and un-normalized log-probability l(yf) for Chinese.",
        "We also assume that a set of word alignments (A = {(i, j) : ei ?",
        "fj}) is given by a word aligner and remain fixed in our model.",
        "For clarity, we assume ye and yf are binary variables in the description of our algorithms.",
        "The extension to the multi-class case is straightforward and does not affect the core algorithms."
      ]
    },
    {
      "heading": "2.1 Hard Agreement",
      "text": [
        "We define a BI-NER model which imposes hard agreement of entity labels over aligned word pairs.",
        "At inference time, we solve the following opti",
        "mization problem:",
        "We dropped the Ze(e) and Zf(f) terms because they remain constant at inference time.",
        "The Lagrangian relaxation of this term is:",
        "where u(i, j) are the Lagrangian multipliers.",
        "Instead of solving the Lagrangian directly, we can form the dual of this problem and solve it using dual decomposition (Rush et al., 2010):",
        "Similar to previous work, we solve this DD problem by iteratively updating the sub-gradient as depicted in Algorithm 1.",
        "T is the maximum number of iterations before early stopping, and ?t is the learning rate at time t. We adopt a learning rate update rule from Koo et al. (2010) where ?t is defined as 1N , where N is the number of times weobserved a consecutive dual value increase from iteration 1 to t. A thorough introduction to the theoretical foundations of dual decomposition algorithms is beyond the scope of this paper; we encourage unfamiliar readers to read Rush and Collins (2012) for a full tutorial."
      ]
    },
    {
      "heading": "2.2 Soft Agreement",
      "text": [
        "The previously discussed hard agreement model rests on the core assumption that aligned words must have identical entity tags.",
        "In reality, however, this assumption does not always hold.",
        "Firstly, assuming words are correctly aligned, their entity tags may not agree due to inconsistency in annotation standards.",
        "In Figure 1, for example, the Algorithm 1 DD inference algorithm for hard agreement model.",
        "?",
        "(i, j) ?",
        "A : u(i, j) = 0 for t?",
        "1 to T do",
        "word ?Beijing?",
        "can be either a Geo-Political Entity (GPE) or a location.",
        "The Chinese annotation standard may enforce that ?Beijing?",
        "should always be tagged as GPE when it is mentioned in isolation, while the English standard may require the annotator to judge based on word usage context.",
        "The assumption in the hard agreement model can also be violated if there are word alignment errors.",
        "In order to model this uncertainty, we extend the two previously independent CRF models into a larger undirected graphical model, by introducing a cross-lingual edge factor ?",
        "(i, j) for every pair of word positions (i, j) ?",
        "A.",
        "We associate a clique potential function h(i,j)(yei , yfj) for ?",
        "(i, j):",
        "where pmi(yei , yfj) is the point-wise mutual information (PMI) of the tag pair, and we raise it to the power of a posterior alignment probability P?",
        "(ei, fj).",
        "For a pair of NEs that are aligned with low probability, we cannot be too sure about the association of the two NEs, therefore the model should not impose too much influence from the bilingual agreement model; instead, we will let the monolingual NE models make their decisions, and trust that those are the best estimates we can come up with when we do not have much confidence in their bilingual association.",
        "The use of the posterior alignment probability facilitates this purpose.",
        "Initially, each of the cross-lingual edge factors will attempt to assign a pair of tags that has the highest PMI score, but if the monolingual taggers do not agree, a penalty will start accumulating over this pair, until some other pair that agrees better with the monolingual models takes the top spot.",
        "Simultaneously, the monolingual models will also be encouraged to agree with the cross-lingual edge factors.",
        "This way, the various components effectively trade penalties indirectly through the cross-lingual edges, until a tag sequence that maximizes the joint probability is achieved.",
        "Since we assume no bilingually annotated NER corpus is available, in order to get an estimate of the PMI scores, we first tag a collection of unan-notated bilingual sentence pairs using the monolingual CRF taggers, and collect counts of aligned entity pairs from this auto-generated tagged data.",
        "Each of the ?",
        "(i, j) edge factors (e.g., the edge between node f3 and e4 in Figure 1) overlaps with each of the two CRF models over one vertex (e.g., f3 on Chinese side and e4 on English side), and we seek agreement with the Chinese CRF model over tag assignment of fj , and similarly for ei on English side.",
        "In other words, no direct agreement between the two CRF models is enforced, but they both need to agree with the bilingual edge factors.",
        "The updated optimization problem becomes:",
        "where the notation ye(k)i denotes tag assignment to word ei by the English CRF and ye(h)i denotes assignment to word ei by the bilingual factor; yf (l)j denotes the tag assignment to word fj by the Chinese CRF and yf (h)j denotes assignment to word fj by the bilingual factor.",
        "The updated DD algorithm is illustrated in Algorithm 2 (case 2).",
        "We introduce two separate sets of dual constraints we and wf, which range over the set of vertices on their respective half of the graph.",
        "Decoding the edge factor model h(i,j)(yei , y f j) simply involves finding the pair of tag assignments that gives the highest PMI score, subject to the dual constraints.",
        "The way DD algorithms work in decomposing undirected graphical models is analogous to other message passing algorithms such as loopy belief propagation, but DD gives a stronger optimality guarantee upon convergence (Rush et al., 2010)."
      ]
    },
    {
      "heading": "3 Joint Alignment and NER Decoding",
      "text": [
        "In this section we develop an extended model in which NER information can in turn be used to improve alignment accuracy.",
        "Although we have seen more than a handful of recent papers that apply the dual decomposition method for joint inference problems, all of the past work deals with cases where the various model components have the same inference output space (e.g., dependency parsing (Koo et al., 2010), POS tagging (Rush et al., 2012), etc.).",
        "In our case the output space is the much more complex joint alignment and NER tagging space.",
        "We propose a novel dual decomposition variant for performing inference over this joint space.",
        "Most commonly used alignment models, such as the IBM models and HMM-based aligner are unsupervised learners, and can only capture simple distortion features and lexical translational features due to the high complexity of the structure prediction space.",
        "On the other hand, the CRF-based NER models are trained on manually annotated data, and admit richer sequence and lexical features.",
        "The entity label predictions made by the NER model can potentially be leveraged to correct alignment mistakes.",
        "For example, in Figure 1, if the tagger knows that the word ?Agency?",
        "is tagged I-ORG, and if it also knows that the first comma in the Chinese sentence is not part of any entity, then we can infer it is very unlikely that there exists an alignment link between ?Agency?",
        "and the comma.",
        "To capture this intuition, we extend the BI-NER model to jointly perform word alignment and NER decoding, and call the resulting model BI-NERWA.",
        "As a first step, instead of taking the output from an aligner as fixed input, we incorporate two unidirectional aligners into our model.",
        "We name the Chinese-to-English aligner model as m(Be) and the reverse directional model n(Bf ).",
        "Be is a matrix that holds the output of the Chinese-to-English aligner.",
        "Each be(i, j) binary variable in Be indicates whether fj is aligned to ei; similarly we define output matrix Bf and bf (i, j) for Chinese.",
        "In our experiments, we used two HMM-based alignment models.",
        "But in principle we can adopt any alignment model as long as we can perform efficient inference over it.",
        "We introduce a cross-lingual edge factor ?",
        "(i, j) in the undirected graphical model for every pair of word indices (i, j), which predicts a binary vari",
        "alignment and NER model.",
        "A line marked with (2) means it applies to the BI-NER model; a line marked with (3) means it applies to the BI-NER-WA model.",
        "for t?",
        "1 to T do",
        "for all (i, j) ?",
        "S do de(i, j)?",
        "de(i, j) + ?t (ae?",
        "(i, j)?",
        "be?",
        "(i, j)) (3) df(i, j)?",
        "df(i, j) + ?t",
        "able a(i, j) for an alignment link between ei and fj .",
        "The edge factor also predicts the entity tags for ei and fj .",
        "The new edge potential q is defined as:",
        "signed by the bilingual edge factor between node ei and fj .",
        "We initialize this value to P?",
        "(ei, fj) =",
        "Pn(ei, fj) are the posterior probabilities assigned by the HMM-aligners.",
        "The joint optimization problem is defined as:",
        "We include two dual constraints de(i, j) and df (i, j) over alignments for every bilingual edge factor ?",
        "(i, j), which are applied to the English and Chinese sides of the alignment space, respectively.",
        "The DD algorithm used for this model is given in Algorithm 2 (case 3).",
        "One special note is that after each iteration when we consider updates to the dual constraint for entity tags, we only check tag agreements for cross-lingual edge factors that have an alignment assignment value of 1.",
        "In other words, cross-lingual edges that are not aligned do not affect bilingual NER tagging.",
        "Similar to ?",
        "(i, j), ?",
        "(i, j) factors do not provide that much additional information other than some selectional preferences via PMI score.",
        "But the real power of these cross-language edge cliques is that they act as a liaison between the NER and alignment models on each language side, and encourage these models to indirectly agree with each other by having them all agree with the edge cliques.",
        "It is also worth noting that since we decode the alignment models with Viterbi inference, additional constraints such as the neighborhood constraint proposed by DeNero and Macherey (2011) can be easily integrated into our model.",
        "The neighborhood constraint enforces that if fj is aligned to ei, then fj can only be aligned to ei+1 or ei?1 (with a small penalty), but not any other word position.",
        "We report results of adding neighborhood constraints to our model in Section 6."
      ]
    },
    {
      "heading": "4 Experimental Setup",
      "text": [
        "We evaluate on the large OntoNotes (v4.0) corpus (Hovy et al., 2006) which contains manually",
        "annotated NER tags for both Chinese and English.",
        "Document pairs are sentence aligned using the Champollion Tool Kit (Ma, 2006).",
        "After discarding sentences with no aligned counterpart, a total of 402 documents and 8,249 parallel sentence pairs were used for evaluation.",
        "We will refer to this evaluation set as full-set.",
        "We use odd-numbered documents as the dev set and even-numbered documents as the blind test set.",
        "We did not perform parameter tuning on the dev set to optimize performance, instead we fix the initial learning rate to 0.5 and maximum iterations to 1,000 in all DD experiments.",
        "We only use the dev set for model development.",
        "The Stanford CRF-based NER tagger was used as the monolingual component in our models (Finkel et al., 2005).",
        "It also serves as a state-of-the-art monolingual baseline for both English and Chinese.",
        "For English, we use the default tagger setting from Finkel et al. (2005).",
        "For Chinese, we use an improved set of features over the default tagger, which includes distributional similarity features trained on large amounts of non-overlapping data.1 We train the two CRF models on all portions of the OntoNotes corpus that are annotated with named entity tags, except the parallel-aligned portion which we reserve for development and test purposes.",
        "In total, there are about 660 training documents (?16k sentences) for Chinese and 1,400 documents (?39k sentences) for English.",
        "Out of the 18 named entity types that are annotated in OntoNotes, which include person, location, date, money, and so on, we select the four most commonly seen named entity types for evaluation.",
        "They are person, location, organization and GPE.",
        "All entities of these four types are converted to the standard BIO format, and background tokens and all other entity types are marked with tag O.",
        "When we consider label agreements over aligned word pairs in all bilingual agreement models, we ignore the distinction between Band I-tags.",
        "We report standard NER measures (entity precision (P), recall (R) and F1 score) on the test set.",
        "Statistical significance tests are done using the paired bootstrap resampling method (Efron and Tibshirani, 1993).",
        "For alignment experiments, we train two uni",
        "software/CRF-NER.shtml directional HMM models as our baseline and monolingual alignment models.",
        "The parameters of the HMM were initialized by IBM Model 1 using the agreement-based EM training algorithms from Liang et al. (2006).",
        "Each model is trained for 2 iterations over a parallel corpus of 12 million English words and Chinese words, almost twice as much data as used in previous work that yields state-of-the-art unsupervised alignment results (DeNero and Klein, 2008; Haghighi et al., 2009; DeNero and Macherey, 2011).",
        "Word alignment evaluation is done over the sections of OntoNotes that have matching gold-standard word alignment annotations from GALE Y1Q4 dataset.2 This subset contains 288 documents and 3,391 sentence pairs.",
        "We will refer to this subset as wa-subset.",
        "This evaluation set is over 20 times larger than the 150 sentences set used in most past evaluations (DeNero and Klein, 2008; Haghighi et al., 2009; DeNero and Macherey, 2011).",
        "Alignments input to the BI-NER model are produced by thresholding the averaged posterior probability at 0.5.",
        "In joint NER and alignment experiments, instead of posterior thresholding, we take the direct intersection of the Viterbi-best alignment of the two directional models.",
        "We report the standard P, R, F1 and Alignment Error Rate (AER) measures for alignment experiments.",
        "An important past work to make comparisons with is Burkett et al. (2010b).",
        "Their method is similar to ours in that they also model bilingual agreement in conjunction with two CRF-based monolingual models.",
        "But instead of using just the PMI scores of bilingual NE pairs, as in our work, they employed a feature-rich log-linear model to capture bilingual correlations.",
        "Parameters in their log-linear model require training with bilingually annotated data, which is not readily available.",
        "To counter this problem, they proposed an ?up-training?",
        "method which simulates a supervised learning environment by pairing a weak classifier with strong classifiers, and train the bilingual model to rank the output of the strong classifier highly among the N-best outputs of the weak classifier.",
        "In order to compare directly with their method, we obtained the code behind Burkett et al.",
        "(2010b) and reproduced their experimental setting for the OntoNotes data.",
        "An extra set of 5,000 unannotated parallel sentence pairs are used for",
        "Best numbers on each measure that are statistically significantly better than the monolingual baseline and Burkett et al. (2010b) are highlighted in bold.",
        "training the reranker, and the reranker model selection was performed on the development dataset."
      ]
    },
    {
      "heading": "5 Bilingual NER Results",
      "text": [
        "The main results on bilingual NER over the test portion of full-set are shown in Table 1.",
        "We initially experimented with the hard agreement model, but it performs quite poorly for reasons we discussed in Section 2.2.",
        "The BI-NER model with soft agreement constraints, however, significantly outperforms all baselines.",
        "In particular, it achieves an absolute F1 improvement of 6.7% in Chinese and 2.1% in English over the CRF monolingual baselines.",
        "A well-known issue with the DD method is that when the model does not necessarily converge, then the procedure could be very sensitive to hyper-parameters such as initial step size and early termination criteria.",
        "If a model only gives good performance with well-tuned hyper-parameters, then we must have manually annotated data for tuning, which would significantly reduce the applicability and portability of this method to other language pairs and tasks.",
        "To evaluate the parameter sensitivity of our model, we run the model from 50 to 3000 iterations before early stopping, and with 6 different initial step sizes from 0.01 to 1.",
        "The results are shown in Figure 2.",
        "The soft agreement model does not seem to be sensitive to initial step size and almost always converges to a superior solution than the baseline."
      ]
    },
    {
      "heading": "6 Joint NER and Alignment Results",
      "text": [
        "We present results for the BI-NER-WA model in Table 2.",
        "By jointly decoding NER with word alignment, our model not only maintains significant improvements in NER performance, but also yields significant improvements to alignment performance.",
        "Overall, joint decoding with NER alone yields a 10.8% error reduction in AER over the baseline HMM-aligners, and also gives improve",
        "neighborhood constraints gives a further 6% error reduction in AER, at the cost of a small loss in Chinese NER.",
        "In terms of word alignment results, we see great increases in F1 and recall, but precision goes down significantly.",
        "This is because the joint decoding algorithm promotes an effect of ?soft-union?, by encouraging the two unidirectional aligners to agree more often.",
        "Adding the neighborhood constraints further enhances this union effect."
      ]
    },
    {
      "heading": "7 Error Analysis and Discussion",
      "text": [
        "We can examine the example in Figure 3 to gain an understanding of the model's performance.",
        "In this example, a snippet of a longer sentence pair is shown with NER and word alignment results.",
        "The monolingual Chinese tagger provides a strong cue that word f6 is a person name because the unique 4-character word pattern is commonly associated with foreign names in Chinese, and also the word is immediately preceded by the word ?president?.",
        "The English monolingual tagger, however, confuses the aligned word e0 with a GPE.",
        "Our bilingual NER model is able to correct this error as expected.",
        "Similarly, the bilingual model corrects the error over e11.",
        "However, the model also propagates labeling errors from the English side over the entity ?Tibet Autonomous Region?",
        "to the Chinese side.",
        "Nevertheless, the resulting Chinese tags are arguably more useful than the original tags assigned by the baseline model.",
        "In terms of word alignment, the HMM models failed badly on this example because of the long",
        "gold line (closest to nodes ei and fj) are the gold-standard tags; in the green line (second closest to nodes) are output from our model; and in the crimson line (furthest from nodes) are baseline output.",
        "distance swapping phenomena.",
        "The two unidirectional HMMs also have strong disagreements over the alignments, and the resulting baseline aligner output only recovers two links.",
        "If we were to take this alignment as fixed input, most likely we would not be able to recover the error over e11, but the joint decoding method successfully recovered 4 more links, and indirectly resulted in the NER tagging improvement discussed above."
      ]
    },
    {
      "heading": "8 Related Work",
      "text": [
        "The idea of employing bilingual resources to improve over monolingual systems has been explored by much previous work.",
        "For example, Huang et al. (2009) improved parsing performance using a bilingual parallel corpus.",
        "In the NER domain, Li et al. (2012) presented a cyclic CRF model very similar to our BI-NER model, and performed approximate inference using loopy belief propagation.",
        "The feature-rich CRF formulation of bilingual edge potentials in their model is much more powerful than our simple PMI-based bilingual edge model.",
        "Adding a richer bilingual edge model might well further improve our results, and this is a possible direction for further experimentation.",
        "However, a big drawback of this approach is that training such a feature-rich model requires manually annotated bilingual NER data, which can be prohibitively expensive to generate.",
        "How and where to obtain training signals without manual supervision is an interesting and open question.",
        "One of the most interesting papers in this regard is Burkett et al. (2010b), which explored an ?up-training?",
        "mechanism by using the outputs from a strong monolingual model as ground-truth, and simulated a learning environment where a bilingual model is trained to help a ?weakened?",
        "monolingual model to recover the results of the strong model.",
        "It is worth mentioning that since our method does not require additional training and can take pretty much any existing model as ?black-box?",
        "during decoding, the richer and more accurate bilingual model learned from Burkett et al.",
        "(2010b) can be directly plugged into our model.",
        "A similar dual decomposition algorithm to ours was proposed by Riedel and McCallum (2011) for biomedical event detection.",
        "In their Model 3, the trigger and argument extraction models are reminiscent of the two monolingual CRFs in our model; additional binding agreements are enforced over every protein pair, similar to how we enforce agreement between every aligned word",
        "pair.",
        "Martins et al. (2011b) presented a new DD method that combines the power of DD with the augmented Lagrangian method.",
        "They showed that their method can achieve faster convergence than traditional sub-gradient methods in models with many overlapping components (Martins et al., 2011a).",
        "This method is directly applicable to our work.",
        "Another promising direction for improving NER performance is in enforcing global label consistency across documents, which is an idea that has been greatly explored in the past (Sutton and McCallum, 2004; Bunescu and Mooney, 2004; Finkel et al., 2005).",
        "More recently, Rush et al. (2012) and Chieu and Teow (2012) have shown that combining local prediction models with global consistency models, and enforcing agreement via DD is very effective.",
        "It is straightforward to incorporate an additional global consistency model into our model for further improvements.",
        "Our joint alignment and NER decoding approach is inspired by prior work on improving alignment quality through encouraging agreement between bidirectional models (Liang et al., 2006; DeNero and Macherey, 2011).",
        "Instead of enforcing agreement in the alignment space based on best sequences found by Viterbi, we could opt to encourage agreement between posterior probability distributions, which is related to the posterior regularization work by Grac?a et al. (2008).",
        "Cromie`res and Kurohashi (2009) proposed an approach that takes phrasal bracketing constraints from parsing outputs, and uses them to enforce phrasal alignments.",
        "This idea is similar to our joint alignment and NER approach, but in our case the phrasal constraints are indirectly imposed by entity spans.",
        "We also differ in the implementation details, where in their case belief propagation is used in both training and Viterbi inference.",
        "Burkett et al. (2010a) presented a supervised learning method for performing joint parsing and word alignment using log-linear models over parse trees and an ITG model over alignment.",
        "The model demonstrates performance improvements in both parsing and alignment, but shares the common limitations of other supervised work in that it requires manually annotated bilingual joint parsing and word alignment data.",
        "Chen et al. (2010) also tackled the problem of joint alignment and NER.",
        "Their method employs a set of heuristic rules to expand a candidate named entity set generated by monolingual taggers, and then rank those candidates using a bilingual named entity dictionary.",
        "Our approach differs in that we provide a probabilistic formulation of the problem and do not require pre-existing NE dictionaries."
      ]
    },
    {
      "heading": "9 Conclusion",
      "text": [
        "We introduced a graphical model that combines two HMM word aligners and two CRF NER taggers into a joint model, and presented a dual decomposition inference method for performing efficient decoding over this model.",
        "Results from NER and word alignment experiments suggest that our method gives significant improvements in both NER and word alignment.",
        "Our techniques make minimal assumptions about the underlying monolingual components, and can be adapted for many other tasks such as parsing."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors would like to thank Rob Voigt and the three anonymous reviewers for their valuable comments and suggestions.",
        "We gratefully acknowledge the support of the National Natural"
      ]
    }
  ]
}
