{
  "info": {
    "authors": [
      "Allan Ramsay"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-2150",
    "title": "Aspect and Aktionsart: Fighting or Cooperating?",
    "url": "https://aclweb.org/anthology/C96-2150",
    "year": 1996
  },
  "references": [
    "acl-C92-1037",
    "acl-J88-2003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "It is widely accepted that semantic theories should, as far as possible, be compositional.",
        "The claim that a theory is compositional, however, lacks bite if lexical and pre-lexical items arc allowed to mean different things in different contexts.",
        "The aim of the current paper is to show how to deal with a well-known phenomenon by relying on combinatorial effects to infer different consequences from the same items in different contexts without altering the contributions that these items make individually.",
        "In (1) it seems as though the present participle marker is being used to indicate that some event with a well-defined end point was in progress at some time in the past, and that it is reasonable to suppose that this end point was eventually reached - - - Henrietta did cross the road.",
        "Cases like (1) are generally taken to be prototypical: the present participle marker indicates the progressive aspect, which says that some extended event with a recognisable end point is in progress and will probably reach its conclusion.",
        "(Asher, 1992) considers the circumstances under which (1) will lead you to conclude that Henrietta did indeed reach the far side of the road, arguing that tins conclusion can only be reached by using a default inference rule which would be cancelled in cases like:",
        "I have no argument with his analysis of (1) and (3).",
        "What concerns me here is the apparent change in the contribution of the present participle marker in (2).",
        "In (2) we have a (conceptually) instantaneous event, namely a hiccup.",
        "Since hiccups are generally thought of as taking no time, it is not possible to be in the middle of a single hiccup and hence we are somehow driven to conclude that Harry was in the middle of a series of hiccups.",
        "A similar problem arises with:",
        "Here we have a homogeneous state where there is no result to be achieved - no interesting state of affairs that arises as a consequence of reaching the end point.",
        "As such the present participle cannot be taken as an indication that the culmination of my living in Bray has not been reached, since there is no such culmination to reach.",
        "In this case the present participle somehow transforms itself to an indicator of temporariness, so that you can get exchanges like the following: - Allan's living in Bray - I thought he lived in Buxton --- Yes, but he's on a visit to Ireland at the moment (Smith, 1991) deals with this phenomenon by appealing to a notion of \"derived interpretations\", though with very little discussion of how the derivations take place.",
        "(Moons and Steedman, 1988) deal with it by invoking a process of coercion which changes the meaning of the aspect markers as required by the properties of the verb to which they are attached.",
        "Much of what; I want to say below follows their analysis, with one major difference.",
        "Coercion changes the meaning of the aspectual marker ill response to the semantic properties of the marked verb.",
        "But if items are allowed to change their meanings as a consequence of the semantic properties of other items then the principle of compositionality that \"the meaning of the whole is made out of simple' combinations of the meanings of the parts\"",
        "becomes rather ineffectual.",
        "We are, after all, led to describe a word as being a homonym in exactly those cases where the meaning of what appears to be a single lexical item depends on the semantic properties of the words it is being combined with.",
        "In 5 He keeps his money tied up in the bank.",
        "6 He keeps his boat tied up by the bank.",
        "the fact that the interpretation of bank depends on the semantic properties of money and boat is what persuades us that the form bank is being used to realise two different lexical items.",
        "We do not, however, want to describe the present participle marker as being ambiguous, with different interpretations which depend on the semantic context in which it occurs, unless we are absolutely forced to.",
        "The analysis in this paper attempts to show that the effects described by Moens and Steedman can be achieved without any meaning-changing operations or unwanted ambiguities.",
        "The basic tool that I will use is the observation that O U P A can hold when neither O A nor A does, and in particular that if 1--‘ and are different then O U FTh A and O U = A' can hold where A and A' are different, or even incompatible.",
        "If we back up the labels representing lexical and pre-lexical items with appropriate sets of meaning postulates then we may well find that different things can be inferred from a single item in different semantic contexts without being forced to conclude that those items themselves mean different things.",
        "In this way the meanings of words will cooperate to convey more complex messages than each can carry alone."
      ]
    },
    {
      "heading": "2 Meaning Postulates",
      "text": [
        "Consider the following analysis of 7 Harry was hiccupping",
        "A type(D, hiccup))]) This 2 3 is all very well as far as it goes, but unless the consequences of saying that something is an event of type \"hiccup\", or that someone is the patient of an event, and so on, are spelt out in detail then it is not possible to perform any non-trivial inferences on the basis of this interpretation (and hence not possible to argue about whether or not it is right, so that the claim that a fragment of natural language should be paraphrased in a particular way becomes vacuous).",
        "You might, for instance, disagree with my decision to label the sleeper as the patient of the event.",
        "Unless I spell out what this label commits me to, there is no way for me to defend it or for you to attack it.",
        "Simply appealing to our everyday interpretation of the term will not do.",
        "We therefore need to develop a collection of meaning postulates (MPs) to specify the connections between the terms that will appear in our interpretations.",
        "This is perhaps an obvious point, but apart from a few honourable exceptions (the attempt in (Dowty, 1988) to specify the consequences of assigning an item to a thematic role is a notable case) it is too often neglected.",
        "The central claim of the current paper is that the interactions between meaning postulates can produce subtle effects which you may miss if you simply label items as belonging to classes or as being in relationships with one another and leave it at that, --- if you simply say, for instance, that some event is progressive, without spelling out the MI's for progressive."
      ]
    },
    {
      "heading": "3 Aktionsart and Aspect Revisited",
      "text": [
        "I will now look in some detail at aspect and aktion-sart.",
        "For the remainder of this section I will say that the relationship specified by an aspect marker holds between a tittle and an event type, where an event type is nothing more than an abstraction over a proposition about events.",
        "What we need are the meaning postulates that spell out the consequences of saying that a time and an event type are in the relationship specified by some aspect marker.",
        "I make the following assumptions:",
        "• The aspect of the core verb specifies a relationship between an instant and an event type.",
        "The details of these relationships are spelt out via MPs.",
        "• The tense of the core verb, together with any auxiliaries, specify a relationship between the present time now, an anaphoric reference time ref, and the time mentioned in this relationship.",
        "Nothing much in the analysis below depends on the particular properties of the time line.",
        "The only assumption that I will make any use of is that there are intervals and instants.",
        "• The MPs for the core verb specify the temporal properties of the event type.",
        "If the verb",
        "to the meanings of the parts.",
        "If this happens then the principle has no force.",
        "\"Simple\" combinations are usually taken to be things like function application and set union or intersection.",
        "2 The analyses in this paper require a combination of truth functional operators and A-abstraction.",
        "I use the notation •[x, P] rather than AxP to emphasise that I am relying (Turner, 1987)'s treatment of abstraction, where you can safely combine the two, rather than classical A-calculus where you run the risk of paradoxes if you combine them.",
        "shares temporal properties with a range of other verbs, then these are gathered together as MPs for the class as a whole, which is referred to as an aktionsart.",
        "The first MP we will consider deals with the progressive aspect, as follows:",
        "This says that the relationship pray holds between an instant 1; and an event type P if there is a set 11 of events of the appropriate type, at least one of which starts before the instant and at least, one of which does not end before it.",
        "Meaning postulates are not necessary and sufficient corn litions.",
        "They are constellations of facts which.",
        "serve to structure the conceptual space.",
        "They do not exhaust that space, and they do not necessarily bottom out in sense-data based primitives (Carnap, 1936; (uine, 1960).",
        "The most,, and least, you can say about them is that they help delineate a set of concepts and relations between concepts which can be used to point out the relations that hold among words, and at certain points between words and experiences.",
        "In (Cruse, 1986)'s phrase, they express SF:MAN:1'1C TRA statements about some of the things that typically follow from asserting that some relationship holds.",
        "There is therefore no irresolvable clash between MP prog and Asher's MPs which describe the conditions under which you would expect a telic event described using the progressive to proceed to its culmination, and 1 would expect, to supplement what I have to say in this paper with his default, treatment: of this other issue.",
        "In particular, it should be noted that MP-prog entails the existence of a start point for the reported action but not that; of an end point.",
        "The decision to talk in terms of sets of events provides extra flexibility, in the same way that; the decision to deal with NI's in terms of sets of individuals supports flexible treatments of plurals and of otherwise awkward phenomena such as generics and bare plurals(Ramsay, 1992).",
        "We can always constrain a set of events to be a singleton if we need to, so certainly nothing is, lost by talking about sets rather than individuals.",
        "Suppose we have the following MPs for aktion-sarts and thematic roles:",
        "These are all straightforward enough.",
        "Events have start, and end points, 'relic events have results, which are characterised by propositions which become true at, the end point of the event.",
        "A state is characterised by a property P that holds of the state's patient; x throughout some interval i.",
        "Actions are events with agents, where an agent is a being that; intentionally causes the result of the event to become true, and only animate beings can intend to bring things about.",
        "Patients are just animate beings.",
        "Extended events take time (there is some instant between their start and end points), instantaneous events do not (note that this may or not mean that; the start awl end points of an instantaneous event are identical, depending on whether we regard the time line as dense.",
        "As far as the current paper is concerned this is a free choice).",
        "Extended telic actions are just extended events with results which become true at their end points and agents who intend those results to be-conic true.",
        "All we need to know about eat and hiccup for the moment, is that cat denotes an extended telic action and hiccup denotes an instantaneous event:",
        "MP eat says that eating events take time, and MP hiccup says that hiccuping events don't (or rather that we don't think about the time they take).",
        "There are many other MPs dealing with these verbs, since there is a great deal more to be said about them, but we do not need this extra detail here and hence we will omit it.",
        "Compare now the following analysis of",
        "with the interpretation of (7) given earlier.",
        "MP prog says in each case that there must be an event whose start point is before now and an event which does not have an end point before now.",
        "In the case of (8) this is compatible with the possibility of there being exactly one such event.",
        "Indeed, since only one peach is involved, the remainder of the MP for eat (which would include the information that you can only eat something once) would presumably force this conclusion.",
        "It is furthermore compatible with the requirement that there should be an event whose start is before t and an event whose end is not before t, since eating events are extended -- if they have end points then these are after their start points.",
        "In the case of (7) it is not possible for there to be a single event, since the start and end points of a single hiccup are taken to occur with no intervening instant.",
        "We therefore find that (7) must denote a set of hiccups, simply by inspecting the MPs and without resorting to a process which turns hiccupping from an instantaneous act to a homogeneous sequence of acts.",
        "In both cases, the sentence reports a sequence of events.",
        "But in (8) there is nothing to say that this sequence has more than one member, and the fact that only one peach is involved suggests that it has exactly one member; whereas in (7) the temporal properties of the conceptually instantaneous act of hiccupping mean that there must be more than one such event.",
        "Returning to",
        "we get the following interpretation:",
        "A tD::{D C •[E, naine(E Bray)] A IDS =1}, in(C , D))]) Why does this carry an overtone of \"temporariness\"?",
        "Assuming that live denotes a state, we need to look at the interactions between the MP for the progressive aspect and the MP for the ak-tionsart state.",
        "MP state says that the characteristic property of the state is true of its patient throughout some interval, but unlike MP telic-event it says nothing about the start and end points of that state, not even whether or not they exist.",
        "Of course in general we know that most states do have start arid end points, but in many cases that is all we know about them.",
        "A speaker who is committed to the existence of a state, then, may not be concerned about the existence of the start or end point of that state they may not know when it started, they may not care whether it has ended, as far as they are concerned it may have been going on since the beginning of time and it may continue to the end of time.",
        "If, however, their report of tins state invokes the progressive aspect then they do become committed to knowing something about the start and end dates.",
        "If, for instance, we were considering Allan was living in Bray rather than Allan is living in Bray then we would assume that the speaker knew enough about the end of this state to place it before the reference point marked by the past tense of the auxiliary.",
        "Thus the use of the progressive aspect here commits the speaker to the existence of an end date for the state in a way in which commitment to the existence of the state does not: it is this that gives (4) its feeling of being about a temporary state of affairs4.",
        "We now turn to the simple aspect.",
        "Consider the following pair of sentences:",
        "9 Allan lives in Bray.",
        "10 Mary eats a peach for her lunch.",
        "(9) describes a simple homogeneous state of affairs.",
        "The properties of the verb live and the simple aspect seem to collude in this case, and there is no need for anything like coercion.",
        "In (10), on the other hand, there does seem to be a problem.",
        "Eating denotes an activity with a definite final state, where what was eaten ends up inside the eater's stomach.",
        "Somehow (10) conveys the message that Mary habitually eats a peach for her lunch: note in particular that it is not the same peach or the same lunch every day!",
        "We therefore need a single MP for the simple aspect which enables us to conclude different things for the two cases.",
        "For (9), where the verb denotes a homogeneous state of affairs, the simple aspect supports the conclusion that such a state of affairs does indeed hold.",
        "For (10), where the verb denotes an activity, the simple aspect supports the 4cf.",
        "(Smith, 1991)'s observation that aspect provides a spotlight on some portion of the event.",
        "conclusion that such an activity happens on a regular basis.",
        "The following meaning postulate says that the relationship simple holds between an instant t and an event type P if there is an interval I which contains t, and for any instant t' in I there is some event e of the appropriate type which starts before t' and finishes after it.",
        "Remember that the MP for live says nothing about the start and end points of the specified state.",
        "Then there is nothing.",
        "in MP simple to lead us to infer the existence of more than one such state of affairs.",
        "There is also nothing to enable us to infer that there is no more than one: I will return to this below.",
        "If, on the other hand, the MP for eat says that the start and end points of the action must be quite close together, then MP simple entails that there must be several such actions in the specified interval.",
        "Which is, after all, as much as you can infer from the simple aspect itself.",
        "Note that the wide scope of the aspect operator simple means that for (10) we are considering event types in which there is a peach, and a lunch, for every instance of the type.",
        "So unlike (8), where there was one peach and the event type we were considering dealt with eating that one peach, here there is nothing driving us to conclude that there is only one peach and hence that the set of events must be a singleton.",
        "The combination of have and a past-participle (1 will call this the PERFECTIVE different people use different terminology for this) presents similar problems.",
        "We can obtain the same kind of interpretation for such sentences, paraphrasing",
        "Part of the difference between this construction and the simple past arises from the explicit mention here of the REFERENCE TIME (Reichenbach, 1956).",
        "Sentences like (11) make reference to some anaphorically determined instant, and this gives them a slightly different flavour from simple past sentences.",
        "But there is more to it than that.",
        "The striking thing about these is that in each of (13) and (14) the obvious interpretation is that his period of living in Bray continued after the reference time, so that he probably lived there for more than five years in total; whereas it is all but impossible to read (12) as saying anything other than that his residence in Bray took no more or less than five years.",
        "This distinction becomes even clearer when we consider",
        "It seems that whereas you can have both a date and a duration with the perfective, you can have either but not both with the simple past.",
        "One way to account for this is to argue that the simple past deals with the end point of the event whereas the perfective deals with the end of some related interval.",
        "We have to be careful here.",
        "The NIP for the simple aspect given above is designed' to be open to readings where some single past event is being reported and to the possibility of a \"habitual\" reading.",
        "The perfective is also open to the same options: 18 I had read the Times for years, but had gradually comae to recognise it as a capitalist rag.",
        "We have further to acknowledge the correct intuition that for telic events the perfective focuses on the end point of the event where the simple aspect views it as a whole.",
        "My current approach takes the MP given above for simple as a basis for both,",
        "but adds an extra clause saying that for the simple case all the events in the specified set end within the interval:",
        "Omitting this extra clause from the MP for perf means that the set of events in question could include one that is not yet, complete, so that 19 I have also read the Guardian for years, but I am now becoming dissatisfied with it as well.",
        "has a past habitual reading which is open to continuation in a way that the habitual reading of the simple past cannot be.",
        "The ramifications of this require further exploration, perhaps in conjunction with a treatment of implicature like that, given in (Gazdar, 1979) to explain why examples like (19) generally give rise to the feeling that the event sequence in question is not yet over and done with."
      ]
    },
    {
      "heading": "4 Conclusions",
      "text": [
        "The analysis above of the interaction between the simple and progressive aspects and various kinds of verb shows that at least some of the phenomena dealt with by (Moons and Steedman, 1988) can be explained without appealing to actions which change the meanings of the lexical and pre-lexical items involved.",
        "In the approach outlined here, every sentence reports a set of events.",
        "Aspect, ak-tionsart and temporal modeifiers then provide information which can be used to determine the cardinality of this set and to draw other conclusions about its temporal characteristics.",
        "Each component of the report is allowed to make a very weak contribution, and then the interactions between these contributions construct a larger, and more subtle, set of conclusions.",
        "The fact that most sentences report singleton sets of events arises, in the absence of information to the contrary, by a process of implicature, though the adverb once is available to reinforce this conclusion if necessary.",
        "I have only dealt with a small subset of the relevant phenomena here.",
        "It seemed better to use the space available to explore a small number of cases in some detail than to cover a wider range without being convincing about any particular case.",
        "Similar analyses of other aspects and other aktionsarts are also easy to devise.",
        "Inventing analyses that cover specific phenomena is fairly easy.",
        "The difficult part is ensuring that all your analyses work at the same time and without introducing large numbers of spurious readings.",
        "It is important for my claim to have preserved compositionality that all the analyses in this paper have been obtained on the basis of the interpretations of the lexical items that appear in them and the semantics of the rules of combination, using a version of the system described in (Ramsay, 1992; Ramsay and Schafer, 1995)."
      ]
    }
  ]
}
