{
  "info": {
    "authors": [
      "Akihiro Shinmori",
      "Manabu Okumura",
      "Yuzo Marukawa",
      "Makoto Iwayama"
    ],
    "book": "Workshop on Patent Corpus Processing",
    "id": "acl-W03-2007",
    "title": "Patent Claim Processing for Readability - Structure Analysis and Term Explanation",
    "url": "https://aclweb.org/anthology/W03-2007",
    "year": 2003
  },
  "references": [
    "acl-J01-3004",
    "acl-W03-2003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Patent corpus processing should be centered around patent claim processing because claims are the most important part in patent specifications.",
        "It is common that claims written in Japanese are described in one sentence with peculiar style and wording and are difficult to understand for ordinary people.",
        "The peculiarity is caused by structural complexity of the sentences and many difficult terms used in the description.",
        "We have already proposed a framework to represent the structure of patent claims and a method to automatically analyze it.",
        "We are currently investigating a method to clarify terms in patent claims and to find the explanatory portions from the detailed description part of the patent specifications.",
        "Through both approaches, we believe we can improve readability of patent claims."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The importance of intellectual property, specifically patent, is being recognized more than ever.",
        "In the academia, patent is being considered as the core component for technology transfer to industry.",
        "With the upsurge of business method patents and software patents, more and more business persons are concerned about patent.",
        "Patent is described in patent specification which is a kind of legal documents.",
        "The most important part of patent specification is where the claims are written, because “the claims specify the boundaries of the legal monopoly created by the patent” (Burgun-der, 1995).",
        "Therefore, we believe that patent corpus processing should be centered around patent claim processing.",
        "It is common that Japanese patent claims are described in one sentence with peculiar style and wording and that they are difficult to read and understand for ordinary people.",
        "After surveying related literature and investigating NTCIR3 patent collection (Iwayama et al., 2003), we found the difficulty has two aspects: structural difficulty and term difficulty.",
        "In this paper, we first present the characteristics of patent claims.",
        "Next, we present our work on the structure analysis of patent claims.",
        "Third, we introduce our ongoing research on term explanation for patent claims."
      ]
    },
    {
      "heading": "2 Characteristics of Patent Claim",
      "text": [
        "Typical Japanese patent claims taken from two patents are shown in Figure 1 and 2.",
        "In general, Japanese sentences are inserted with the touten “",
        "Accept Ratio The ratio of claims accepted by the parser generated by the CFG.",
        "Processing Speed The time required to process one claim.",
        "Accuracy The accuracy of the analysis result evaluated indirectly and directly.",
        "The accept ratio was more than 99.77%.",
        "The processing speed was 0.30 second per each claim (evaluated on a Linux PC using Pentium III 1 GHz and 512MB memory).",
        "So, it is almost real-time."
      ]
    },
    {
      "heading": "3.5.1 Indirect Evaluation on Accuracy",
      "text": [
        "By specifying a command-line switch, our program can be run without utilizing the originally inserted newlines.",
        "The newline insertion positions can be predicted by the result of structure analysis and some heuristics.",
        "So, indirect evaluation was done by comparing the newline insertion positions between the originally newline-inserted claims and the automatically newline-inserted claims utilizing the result of structure analysis.",
        "The recall(R), the precision(P), and the F-measure(F) are calculated by the followings, where c is the number of correctly-inserted newlines, n is the number of newlines in the original claim, and i is the number of inserted newlines.",
        "The baseline was set in that the newlines are inserted mechanically at the end of every sequence of “(NOUN|SYMBOL)( To do so, the following actions are incorporated into the lexical analyzer and the parser.",
        "• The lexical analyzer deletes the words “ Giving appropriate explanations for these terms would help to improve readability of patent claims."
      ]
    },
    {
      "heading": "4.2 Approach",
      "text": [
        "First of all, it is necessary to recognize terms to be explained.",
        "There are many research issues in term extraction in general, but for our purpose we use the following morphological pattern to extract terms from patent claims: (Prefix)*(Noun|Unknown-Words |Symbol |Verb-Cont-Form |Verb-Compound-With-Indeclinable-Word)+ By using the above pattern, we can extract such terms as “ .",
        "“..."
      ]
    }
  ]
}
