{
  "info": {
    "authors": [
      "Uri Zernik",
      "Michael G. Dyer"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1059",
    "title": "Disambiguation and Language Acquisition Through the Phrasal Lexicon",
    "url": "https://aclweb.org/anthology/C86-1059",
    "year": 1986
  },
  "references": [
    "acl-P84-1089",
    "acl-P85-1035",
    "acl-T75-2013"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The phrasal approach to language processing emphasizes the role of the lexicon as a knowledge source.",
        "Rather than maintaining a single generic lexical entry for each word e.g., take, the lexicon contains many phrases, e.g., take on, take to the streets, take to swimming, take over, etc.",
        "Although this approach proves effective in parsing and in generation, there are two acute problems which still require solutions.",
        "First, due to the huge size of the phrasal lexicon, especially when considering subtle meanings and idiosyncratic behavior of phrases, encoding of lexical entries cannot be done manually.",
        "Thus, phrase acquisition must be employed to construct the lexicon.",
        "Second, when a set of phrases is morpho-syntactically equivalent, disambiguation must be performed by semantic means.",
        "These problems are addressed in the program RI NA."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The phrasal approach to language processing [13ecker75, Searle79, Pawley83, Fillmore86] emphasizes the role of the lexicon as a knowledge source.",
        "Rather than maintaining a single generic lexical entry for each word e.g., take, the lexicon contains many phrases, e.g., take on, take to the streets, take to swimming, take over, etc.",
        "Although this approach proves effective in parsing and in generation [Wilensky84], there are three acute problems which still require solutions.",
        "First, due to the huge size of the phrasal lexicon, especially when considering subtle meanings and idiosyncratic behavior of phrases, encoding of lexical entries cannot be done manually.",
        "Thus, phrase acquisition must be employed to construct the lexicon.",
        "Second, parsing requires phrase disambiguation (resolving ambiguity).",
        "When a set of phrases is morpho-syntactically equivalent, disambiguation must be performed by semantic means.",
        "In previous papers we have reported strategies for acquiring phrases in context, which include creating syntactic patterns [Zernik85a], and attaching semantic concepts for these patterns [Zernik85b].",
        "In this paper we discuss how acquisition and parsing processes interact with one another."
      ]
    },
    {
      "heading": "1.1 Phrasal Parsing",
      "text": [
        "Parsing involves reading clauses in text and instantiating ICharniakKII their corresponding concepts in the context.",
        "The phrasal lexicon provides the linguistic database for parsing.",
        "A lexical entry, a phrase, is a triple associating a linguistic pattern with its concept and a situation.",
        "The basic parsing cycle is demonstrated in processing the following paragraph.",
        "Sl: For years I tried to locate my high school teacher, when Irlutinto her in the street.",
        "The phrase ran into is parsed relative to the context established by the first clause.",
        "Assume that the lexicon contains a single phrase described informally as: phrase pattern: Personl run into Person2 situation: Personl did not plan to see Personl concept: Personl meets Person2 accidentally.",
        "The clause is parsed in four steps:",
        "(1) The pattern is matched successfully against the text.",
        "Consequently, Personl and Person2 are bound to the speaker and the teacher respectively.",
        "(2) The situation associated with the patient is validated using the context.",
        "After reading the first phrase the context contains two concepts: (a) the speaker has a goal to see the teacher, but (b) he has no feasible plan to accomplish the goal.",
        "(3) Since both (1) and (2) are successful, then the pattern itself is instantiated, adding to the context: the speaker met the teacher accidentally.",
        "(4) Steps (1)-(3) are repeated for each lexical entry.",
        "If more than one entry is instantiated, then the concept with the best match is selected.",
        "Phrase situation, distinguished form phrase concept, is introduced in our representation since it solves two problems: (a) in disambiguation it provides a discrimination condition for phrase selection, and (b) in acquisition it allows the incorporation of the context of the example as part of the phrase."
      ]
    },
    {
      "heading": "1.2 The Modeled Phenomenon",
      "text": [
        "The program RINA [Zernik85e] is designed to parse English sentences by reading text: and producing the corresponding concepts in the context.",
        "However, RINA's lexicon is incomplete, and unknown phrases in the text might be encountered and",
        "processed.",
        "RINA's objective is to acquire these phrases from examples in context.",
        "Thereafter, RINA's lexicon, augmented by these dynamically acquired phrases, facilitates parsing and generation of further sentences.",
        "In the scenario below, RINA encounters the new phrase to throw the book: User: The mobster eluded prosecution for years.",
        "Last month, they threw the book at him for income-tax evasion.",
        "RINA is familiar with the words throw and book; however she does not know the figurative phrase itself.",
        "RINA engages in a dialog with a user in order to acquire that phrase.",
        "PINTA:The prosecutor propelled a book at him?",
        "User: No.",
        "The judge threw the book at him.",
        "RENA:The judge threw the book at him.",
        "He found him guilty.",
        "Initially, RINA attempts to interpret the text using the literal phrase to throw an object at a person.",
        "When this interpretation fails, RINA forms a hypothesis about the new phrase.",
        "At each stage, RINA spells out her new hypothesis to let the user know her state of knowledge and provide counterexamples if necessary.",
        "As the user provides examples, RINA's hypothesis about the new phrase is upgraded.",
        "Later on, RINA is able to use this phrase in parsing further sentences: User: The dean of the school threw the book at John.",
        "RINA: He punished him.",
        "Four issues must be addressed in modeling this behavior.",
        "(1) The syntax of the new phrase.",
        "How can the program determine the scope and variability of the new phrase?",
        "For example, should the new phrase for throw the book at him accept the sentence throw a volume at him?",
        "Is the prepositional phrase for income-tax evasion incorporated as a mandatory part of the new phrase?",
        "(2) Literal interpretation.",
        "What is the contribution of senses of single words in forming the meaning of a new phrase?",
        "Would the learner come up with the same meaning if he heard the hypothetical phrase the judge threw the book to him?",
        "(3) The context.",
        "What is the contribution of the context in forming both the syntax and the meaning of the new phrase?",
        "(4) Disambiguation.",
        "Once acquired, what facilitates the selection of appropriate meanings for lexical phrases?",
        "For example, how can the program come up with two different meanings for the following pair of sentences: S2: The judge decided to throw the book at him.",
        "S3: The judge decided that Mary threw the book at him."
      ]
    },
    {
      "heading": "1.3 The Program",
      "text": [
        "The program consists of four components:",
        "(1) Phrasal lexicon: This is a list of phrases where each phrase is a declarative pattern-concept-situation triple.",
        "(2) Case-frame parser: In parsing, case-frames [Carbone1184] match the text with syntactic and semantic phrase properties.",
        "Unification [Kay79] accounts for phrase interaction.",
        "(3) Pattern Constructor: Learning of phrase patterns is accomplished by analyzing parsing failures.",
        "A pattern-modification action is associated with each failure situation.",
        "(4) Concept Constructor: Learning of phrase concepts is accomplished by a set of strategies which are selected according to the context.",
        "Schematically, the program receives as input a sequence of sentence-context pairs from which it refines its current pattern-concept-situation hypothesis.",
        "The pattern is acquired from the sentence, while the concept and the situation are derived from the context."
      ]
    },
    {
      "heading": "1.4 The Pattern Representation",
      "text": [
        "Three sample phrasal patterns as they are represented in RINA's declarative lexicon are given below.",
        "There are syntactic patterns which are not unique to one lexical entry.",
        "Therefore, phrases cannot be selected unambiguously merely through syntactic patterns.",
        "Thus, ambiguity must be resolved by semantic means.",
        "For example, for the pattern run into there are two distinct senses, as shown in the following sentences S4 and S5: S4: For years I tried to locate my high school teacher, but I could not find her address.",
        "Last week Iran into her in the street.",
        "S5: My client was driving carefully.",
        "Your client raninto his Mercedes on a red light.",
        "These senses are referred to mnemonically as fortuitous-encounter and vehicle-collision respectively.",
        "However, also a literal interpretation exists for run into as shown in S6 below: S6: Driving home, I became hungry so I ran into a McDonald's. The meaning of the clause in S6 is produced literally out of its constituents, meaning \"move-quickly to the interior of a setting\".",
        "Although ambiguity in sentences S4-S6 does not pose any problem for a human reader (who knows English phrases), a computer program (and a second language speaker) might experience difficulty in discriminating the appropriate sense in each case.",
        "Ambiguity is resolved in each case by matching phrase situations with the context.",
        "The first lexical phrase depicts fortuitous-encounter:",
        "The situation of this phrase is given in terms of plans and goals.",
        "It requires that the context satisfy three points:",
        "(1) ?x moves to the proximity of ?y.",
        "(2) As a result, ?x is able to see ?y.",
        "(3) ?x has not planned that outcome (seeing ?y is unexpected).",
        "The concept is given in terms of the act itself (concept is (act-of situation)).",
        "The second phrase depicts vehicle-collision: pattern ?x:vehicle run:verb <into ?y:thing> situation ($vehicle-collision (vehicle ?x) (thing ?If))",
        "$vehicle-collision represents the following situation:",
        "(2) ?x is involved in a moving script ($car-riding, $ice-skating, etc.)",
        "(2) ?x moves into the location of ?y.",
        "(3) As a consequence of (2), a preservation-goal of ?x (either preserve-health or preserve-social-control) is thwarted.",
        "Again, the concept itself points to a single clement within the situation."
      ]
    },
    {
      "heading": "Partial Matching of Situations",
      "text": [
        "When several lexical patterns match a sentence, the phrase whose situation matches the context is selected.",
        "However, the situation prescribed by the phrase does not always exist in the context prior to reading the text.",
        "For example, consider the way the situations of the phrases P4 and P5 above match the context in this paragraph: S4: For years I tried to locate my high school teacher, but I could not find her address.",
        "Last week I ran into her in the street.",
        "The plan/goal scenario established in the context prior to the reading of the phrase in the sentence is:",
        "(1) There is an active goal to see the teacher.",
        "(2) No plan is available to achieve this goal.",
        "This context does not match the situation of vehicle-collision since there is no indication of an accident (riding a car on the one hand, or accident repurcussions on the other hand).",
        "However, the other situation is not perfectly matched either (i.e. the outcome of the encounter is not in the context).",
        "Thus, phrase selection must be accounted for by partial matching.",
        "The best match is selected – fortuitous-encounter in this example."
      ]
    },
    {
      "heading": "3. Phrase Interaction",
      "text": [
        "Besides the surrounding context, phrase disambiguation is also influenced by phrase constituents.",
        "We describe this aspect in two cases.",
        "Interaction of a phrase with its complement and interaction of a phrase with an embedded reference."
      ]
    },
    {
      "heading": "3.1 Indirect References – the Utility of Selcetional Restrictions",
      "text": [
        "The selection of a phrase sense could rely on an embedded reference.",
        "For example, consider the sentence: S7: A yellow Mercedes ran into my car on a red light.",
        "being react relative to two lexical phrases P4 and P5 (fortuitous-encounter and vehicle-collision respectively): P4: ?x:person run into ?y:person P5: ?x:vehicle run into ?y:thing Due to the type of the reference (i.e., a yellow Mercedes is a vehicle), the phrase P5 (vehicle collision) is selected.",
        "However, the type of the reference might lead to an incorrect selection.",
        "For instance consider the sentence: S8: Your client ran into my car on a red light.",
        "Here the type of the reference your client is person.",
        "This type causes the inappropriate selection of P4 (where we know from the context that P5 is the appropriate selection).",
        "This reference is an example of the phenomenon we call indirect reference (see also [Hershkovits85] and [Fauconnier85] ) Although the speaker in S8 said your client he actually meant your client's car, which refers to an instance of a car.",
        "Thus, the referent is referred to indirectly through another object.",
        "Two pairs of examples illustrating indirect references are:",
        "In S9, the reference horses could mean any activity related to horses such as riding horses or watching horses.",
        "On the other hand, in SIO the activity is probably eating tuna fish.",
        "In Sll, the reference Mozart does not refer to the person Mozart himself, rather it refers to the sound of his music.",
        "On the other hand, in S12 my parents refers actually to my parent's advice.",
        "Thus, a reference might refer to an object which merely represents the intended referent.",
        "Therefore, categories of lexical items as they appear in the text, or selectional restrictions [Chomsky65] present a very weak method for disambiguation, and generally should not provide the only key for phrase selection.",
        "In fact, the identity of referents for indirect references must be resolved through the embedding phrase.",
        "The identity of the phrase itself is determined by the context, as shown in the previous section."
      ]
    },
    {
      "heading": "3.2 A Complement-Taking Phrase",
      "text": [
        "Ambiguity appears also in complement-taking phrases such as ask, promise, instruct, inform, etc.",
        "Consider the following set of sentences: S13: John asked her if she was having lunch .",
        "S14: The judge asked Mary to approach the bench.",
        "S15: Mary asked the judge to give tier a break.",
        "Although they all involve the word ask, in each sentence ask appears in a different sense (query, command, and appeal, respectively).",
        "What is the representation of the phrase for ask, and how are these sentences disambiguated?",
        "Two extreme approaches to lexical representation are:",
        "(1) Maintain only a single lexical entry which contains all the knowledge of the word ask and all of its possible interactions.",
        "This model is best presented by the word-expert approach [Rieger77l.",
        "In this model, general linguistic knowledge is encoded repeatedly in individual words.",
        "(2) Maintain a lexical entry for each phrase sense.",
        "Clearly this second extreme is not feasible since it is impossible to predict all possible situations in which ask might appear.",
        "In RINA, there are two lexical entries, representing two basic senses of ask.",
        "pattern: ?x ask ?y ?z:question-sentence concept: Tx inform ?y that knowing ?z is a goal of ?x pattern: ?x ask ?y ?z:infinitive-phrase concept: ?x inform ?y that ?z is a goal of ?x Accordingly, the meaning of a sentence is constructed in two steps:",
        "(a) The syntax of the complement determines whether to select P6 or P7.",
        "In S13, P6 is selected due to the question form of its complement.",
        "In S14 and S15, P7 is selected due to the infinitive form of its complement.",
        "(b) The meaning of the phrase is constructed by interpreting the concept relative to the context.",
        "The context in both S14 and S15 is the asymmetrical authority relationship.",
        "Thus, the asking act in S14 is taken as an authority-decree, while in S15 the same asking act is interpreted as authority-appeal.",
        "It is important to distinguish between these two meanings so that the parser can maintain the appropriate expectations in each case.",
        "In conclusion, the lexicon must ensure that linguistic clues (such as the syntactic form of the complement) be exploited in constructing the meaning.",
        "However, the lexicon should not contain meanings which could be inferred by general world knowledge."
      ]
    },
    {
      "heading": "5. Phrase Acquisition",
      "text": [
        "So far, we have assumed the existence of necessary phrases in the lexicon.",
        "However, in reality a program might encounter new phrases in the text.",
        "Thus, the program must accomplish two objectives: (a) parse the text in spite of the unknown element, and (b) acquire the unknown element for future encounters.",
        "Consider the situation in which the figurative phrase is first encountered.",
        "User: The mobster eluded prosecution for years.",
        "Last month, they threw the book at him for income-tax evasion.",
        "RENTA:The prosecutor propelled a book at him?",
        "User: No.",
        "A judge threw the book at him.",
        "RINA: The judge threw the book at him.",
        "He found him guilty.",
        "And later on: User: The dean of the school threw the book at John.",
        "IUNA:He punished him.",
        "There are three stages in the acquisition process:",
        "(1) Apply the literal interpretation.",
        "(2) Acquire the figurative phrase.",
        "(3) Generalize the new phrase beyond the specific context."
      ]
    },
    {
      "heading": "Literal Interpretation",
      "text": [
        "In the absence of the appropriate phrase in the lexicon, RINA utilizes other available knowledge sources, namely (a) the literal interpretation and (b) the context.",
        "The literal interpretation is given by the phrase:",
        "This phrase describes propelling an object in order to hit another person.",
        "Notice that no situation has been specified.",
        "General phrases such as take, give, catch, and throw do not have a specified situation since they can be applied in many situations.",
        "* The literal interpretation fails by plan/goal analysis.",
        "In the context laid down by the first phrase (prosecution has active-goal to punish the criminal), \"propelling a book\" does not serve the prosecution's goals.",
        "In spite of the discrepancy, RINA spells out that interpretation, The prosecutor propelled a book at him?",
        "to notify the user about her state of knowledge.",
        "The Trial Context The user's second sentence, (a judge threw the book at him), and specifically the reference a judge, brings in $trial (the trial-script).",
        "This script involves five entities: (a) Judge, (b) Prosecutor, (c) Defendant, (d) Alleged-Crime, (e) the Law regarding that crime and its punishment.",
        "The script involves a sequence of events:",
        "This script is used in forming the elements of the lexical phrase.",
        "(a) The phrase situation is taken as the script itself.",
        "(b) The pattern is extracted from the sample sentence.",
        "(c) The concept is extracted from the script.",
        "Forming the Pattern Four rules are used in extracting the linguistic pattern from the sentence: S13: Last month, they threw the book at him for income-tax evasion.",
        "(a) Initially, use an existing literal pattern.",
        "In this case, the initial pattern is:",
        "* Notice the distinction between preconditions and situation.",
        "While a precondition for \"throwing a ball\" is \"first holding it\", this is not part of the phrase situation.",
        "Conditions which are implied by common sense or world knowledge do not belong in the lexicon.",
        "(b) Examine other cases in the sample sentenece, and include in the pattern cases which could not be interpreted by general interpretation.",
        "There are two such cases: (1) Last month could be interpreted as a general time adverb (i.e.: last year he was still.",
        "enrolled at UCLA, the vacation started last week, etc.).",
        "(2) For income-tax evasion can be interpreted as a element-paid-for adverb (i.e.: he pa id dearly for his crime, he was sentenced for a murder he did not",
        "commit, etc.).",
        "Thus, both these cases are excluded, (c) Variablize references which can be instantiated in the context.",
        "In our case ?x is the Judge and ?y is the Defendant.",
        "They are maintained as variables, as opposed to the other case: (d) Freeze references which cannot be instantiated in the context.",
        "No referent is found for the reference the book.",
        "Therefore, that reference is taken as a frozen part of the pattern instead of the case ?7,:phys-obj.",
        "The resulting pattern is:",
        "Forming the Concept In selecting the concept of the phrase, there arc four possibilities, namely the events shown in Figure 4.",
        "The choice of the appropriate one among these four events is facilitated by linguistic clues.",
        "As opposed to the phrase they threw the book to him which implies cooperation between the characters, the phrase they threw the book at him implies a goal conflict between the characters.",
        "Since this property is shared among many verbs, it is encoded in the lexicon as a general phrase: pattern ?x:person ?v:verb ?y:physobj <at ?z:person> concept (act (propel (actor ?x)",
        "Notice that rather than having a specific root, the pattern of this phrase leaves out the root of the verb as a variable.",
        "Using this phrase concept as a search pattern, the \"punishment-decision\" is selected from $trial.",
        "Thus, the phrase acquired so far is:",
        "Although RINA has acquired the phrase in a specific context, she might hear the phrase in a different context.",
        "She should be able to transfer the phrase across specific contexts by generalization.",
        "RINA generalizes phrase meanings by analogical mapping.",
        "Thus, when hearing the sentence below, an analogy is found between the two contexts.",
        "S16: The third time he caught John cheating in an exam, the professor threw the hook at him.",
        "The trial-script is indexed to a general authority relationship.",
        "The actions in a trial are explained by the existence of that relationship.",
        "For example, by saying something to the Judge, the Defendant does not dictate the outcome of the situation.",
        "He merely informs the Judge with some facts in order to influence the verdict.",
        "On the other hand, by his decision, the Judge does determine the outcome of the situation since he presents an authority.",
        "Three similarities are found between the $trial and the scene involving John and the professor.",
        "(a) The authority relationship between ?x and ?y.",
        "(b) A law-violation by ?x.",
        "(c) A decision by ?x.",
        "Therefore, the phrase situation is generalized from the specific trial-script into the general authority-decree situation which encompasses both examples.",
        "6.",
        "Presuppositions as a Phrase Situation",
        "A message might be conveyed by an utterance beyond its straightforward illocution.",
        "That message, called the presupposition of the utterance, is described by Keenan (1971) as follows: (see also [Grice75:1 and [Fauconnier851 Ch.",
        "3): The presuppositions of a sentence are those conditions that the world must meet in order for the sentence to make literal sense.",
        "Thus if some such condition is not met, for sonic sentence S, then either S makes no sense at all or else it is understood in some nonliteral way, for example as a joke or metaphor.",
        "Despite this definition, presupposition has been studied as a means for generation and propagation of implications [Gazdar79, Karttunen79].",
        "In general, the effort is to compute the part of the sentence which is already given, by applying \"backward\" reasoning, i.e.: from the sentence the king of France is bald determine if indeed there is a king in France, or from the sentence it was not John who broke the glass, determine whether somebody indeed broke the glass.",
        "Rather than use presuppositions to develop further inferences, we investigate how presuppositions are actually applied according to Keenan's definition above, namely, in determining appropriate utterance interpretations.",
        "In the phrasal lexicon, we equate presupposition with phrase situation."
      ]
    },
    {
      "heading": "7. Conclusions",
      "text": [
        "Dyer (1983) on the one hand, has outlined the use of contextual expectations in disambiguation.",
        "In his model, the lexicon, and expectations in particular, were expressed procedurally rather than delaratively.",
        "Wilensky (1984) on the oilier hand, developed the notion of the declarative phrasal lexicon.",
        "However his model failed to distinguish explicitly between a phrase and its contextual expectations.",
        "In our model, within the declarative phrasal lexicon the meaning of lexical entries is separated into a concept and phrasal situation.",
        "Contextual expectations take part in learning as well as in parsing.",
        "In learning, the concept is associated with the salient element, while expectations are associated with the surrounding context.",
        "In parsing, only successful matching of expectations in the context enables the instantiation of the concept."
      ]
    }
  ]
}
