{
  "info": {
    "authors": [
      "Srinivas Bangalore",
      "Giuseppe Riccardi"
    ],
    "book": "Workshop on Embedded Machine Translation Systems",
    "id": "acl-W00-0508",
    "title": "Stochastic Finite-State Models for Spoken Language Machine Translation",
    "url": "https://aclweb.org/anthology/W00-0508",
    "year": 2000
  },
  "references": [
    "acl-J93-2003",
    "acl-J94-3001",
    "acl-J97-3002",
    "acl-P98-1006",
    "acl-W98-1122"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Stochastic finite-state models are efficiently learn-able from data, effective for decoding and are associated with a calculus for composing models which allows for tight integration of constraints from various levels of language processing.",
        "In this paper, we present a method for stochastic finite-state machine translation that is trained automatically from pairs of source and target utterances.",
        "We use this method to develop models for English-Japanese and Japanese-English translation.",
        "We have embedded the Japanese-English translation system in a call routing task of unconstrained speech utterances.",
        "We evaluate the efficacy of the translation system in the context of this application."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Finite state models have been extensively applied to many aspects of language processing including, speech recognition (Pereira and Riley, 1997; Riccardi et al., 1996), phonology (Kaplan and Kay, 1994), morphology (Koskenniemi, 1984), chunking (Abney, 1991; Srinivas, 1997) and parsing (Roche, 1999).",
        "Finite-state models are attractive mechanisms for language processing since they are (a) efficiently learnable from data (b) generally effective for decoding (c) associated with a calculus for composing models which allows for straightforward integration of constraints from various levels of language pro-cessing.' In this paper, we develop stochastic finite•state models (SFSM) for statistical machine translation (SMT) and explore the performance limits of such models in the context of translation in limited domains.",
        "We are also interested in these models since they allow for a tight integration with a speech recognizer for speech-to-speech translation.",
        "In particular we are interested in one-pass decoding and translation of speech as opposed to the more prevalent approach of translation of speech lattices.",
        "The problem of machine translation can be viewed as consisting of two phases: (a) lexical choice phase 'Furthermore, software implementing the finite-state calculus is available for research purposes.",
        "where appropriate target language lexical items are chosen for each source language lexical item and (b) reordering phase where the chosen target language lexical items are reordered to produce a meaningful target language string.",
        "In our approach, we will represent these two phases using stochastic finite-state models which can be composed together to result in a single stochastic finite-state model for SMT.",
        "Thus our method can be viewed as a direct translation approach of transducing strings of the source language to strings of the target language.",
        "There are other approaches to statistical machine translation where translation is achieved through transduction of source language structure to target language structure (Alshawi et al., 1998b; Wu, 1997).",
        "There are also large international multi-site projects such as VERBMOBIL (Verbmobil, 2000) and CSTAR (Woszczyna et al., 1998; Lavie et al., 1999) that are involved in speech-to-speech translation in limited domains.",
        "The systems developed in these projects employ various techniques ranging from example-based to interlingua-based translation methods for translation between English, French, German, Italian, Japanese, and Korean.",
        "Finite-state models for SMT have been previously suggested in the literature (Vilar et al., 1999; Knight and Al-Onaizan, 1998).",
        "In (Vilar et al., 1999), a deterministic transducer is used to implement an English-Spanish speech translation system.",
        "In (Knight and Al-Onaizan, 1998), finite-state machine translation is based on (Brown et al., 1993) and is used for decoding the target language string.",
        "However, no experimental results are reported using this approach.",
        "Our approach differs from the previous approaches in both the lexical choice and the reordering phases.",
        "Unlike the previous approaches, the lexical choice phase in our approach is decomposed into phrase-level and sentence-level translation models.",
        "The phrase-level translation is learned based on joint entropy reduction of the source and target languages and a variable length n-gram model (VNSA) (Riccardi et al., 1995; Riccardi et al., 1996) is learned for the sentence-level translation.",
        "For the construc",
        "tion of the bilingual lexicon needed for lexical choice, we use the alignment algorithm presented in (Al-shawi et al., 1998b) which takes advantage of hierarchical decomposition of strings and thus performs a structure-based alignment.",
        "In the previous approaches, a bilingual lexicon is constructed using a string-based alignment.",
        "Another difference between our approach and the previous approaches is in the reordering of the target language lexical items.",
        "In (Knight and Al-Onaizan, 1998), an FSM that represents all strings resulting from the permutations of the lexical items produced by lexical choice is constructed and the most likely translation is retrieved using a target language model.",
        "In (Vilar et al., 1999), the lexical items are associated with markers that allow for reconstruction of the target language string.",
        "Our reordering step is similar to that proposed in (Knight and Al-Onaizan, 1998) but does not incur the expense of creating a permutation lattice.",
        "We use a phrase-based VNSA target language model to retrieve the most likely translation from the lattice.",
        "In addition, we have used the resulting finite-state translation method to implement an English-Japanese speech and text translation system and a Japanese-English text translation system.",
        "We present evaluation results for these systems and discuss their limitations.",
        "We also evaluate the efficacy of this translation model in the context of a telecom application such as call routing.",
        "The layout of the paper is as follows.",
        "In Section 2 we discuss the architecture of the finite-state translation system.",
        "We discuss the algorithm for learning lexical and phrasal translation in Section 3.",
        "The details of the translation model are presented in Section 4 and our method for reordering the output is presented in Section 5.",
        "In Section 6 we discuss the call classification application and present motivations for embedding translation in such an application.",
        "In Section 6.1 we present the experiments and evaluation results for the various translation systems on text input."
      ]
    },
    {
      "heading": "2 Stochastic Machine Translation",
      "text": [
        "In machine translation, the objective is to map a source symbol sequence Ws = w1, • • • , wNs (wi E"
      ]
    },
    {
      "heading": "Ls) into a target sequence WT = • • • ,x1sIT (xi E",
      "text": [
        "LT).",
        "The statistical machine translation approach is based on the noisy channel paradigm and the Maximum-A-Posteriori decoding algorithm (Brown et al., 1993).",
        "The sequence Ws is thought as a noisy version of WT and the best guess 1/174', is then computed as",
        "In (Brown et al., 1993) they propose a method for maximizing P(WT I Ws) by estimating P(WT) and P(WSIWT) and solving the problem in equation 1.",
        "Our approach to statistical machine translation differs from the model proposed in (Brown et al., 1993) in that: • We compute the joint model P(Ws, WT) from the bilanguage corpus to account for the direct mapping of the source sentence Ws into the target sentence WT that is ordered according to the source language word order.",
        "The target string Wi\", is then chosen from all possible reorderings2",
        "where AT is the target language model and A Wr are the different reorderings of WT.",
        "• We decompose the translation problem into local (phrase-level) and global (sentence-level) source-target string transduction.",
        "• We automatically learn stochastic automata and transducers to perform the sentence-level and phrase-level translation.",
        "As shown in Figure 1, the stochastic machine translation system consists of two phases, the lexical choice phase and the reordering phase.",
        "In the next sections we describe the finite-state machine components and the operation cascade that implements this translation algorithm."
      ]
    },
    {
      "heading": "3 Acquiring Lexical Translations",
      "text": [
        "In the problem of speech recognition the alignment between the words and their acoustics is relatively straightforward since the words appear in the same order as their corresponding acoustic events.",
        "In contrast, in machine' translation, the linear order of words in the source language, in general is not maintained in the target language.",
        "The first stage in the process of bilingual phrase acquisition is obtaining an alignment function that given a pair of source and target language sentences, maps source language word subsequences into target language word subsequences.",
        "For this purpose, we use the alignment algorithm described in (Alshawi et 2 Note that computing the exact set of all possible reorderings is computationally expensive.",
        "In Section 5 we discuss an approximation for the set of all possible reorderings that serves for our application.",
        "al., 1998a).",
        "The result of the alignment procedure is shown in Table 1.3 Although the search for bilingual phrases of length more than two words can be incorporated in a straightforward manner in the alignment module, we find that doing so is computationally prohibitive.",
        "We first transform the output of the alignment into a representation conducive for further manipulation.",
        "We call this a bilanguage TB.",
        ".",
        "A string",
        "where wi E LB U e, E LT U c, e is the empty string and wi_xi is the symbol pair (colons are the delimiters) drawn from the source and target language.",
        "A string in a bilanguage corpus consists of sequences of tokens where each token (wi_xi) is represented with two components: a source word (possibly an empty word) as the first component and the target word (possibly an empty word) that is the translation of the source word as the second component.",
        "Note that the tokens of a bilanguage could be either ordered according to the word order of the source language or ordered according to the word order of the target language.",
        "Thus an alignment of a pair of source and target language sentences will result in two bilanguage strings.",
        "Table 2 shows 3 The Japanese string was translated and segmented so that a token boundary in Japanese corresponds to some token boundary in English.",
        "an example alignment and the source-word-ordered bilanguage strings corresponding to the alignment shown in Table 1.",
        "Having transformed the alignment for each sentence pair into a bilanguage string (source word-ordered or target word-ordered), we proceed to segment the corpus into bilingual phrases which can be acquired from the corpus TB by minimizing the joint entropy H (Ls , LT) c – 1/M log P (TB) .",
        "The probability P (W s , WT) = P(R) is computed in the same way as n-gram model:",
        "Using the phrase segmented corpus, we construct a phrase-based variable n-gram translation model as discussed in the following section."
      ]
    },
    {
      "heading": "4 Learning Phrase-based Variable N-gram Translation Models",
      "text": [
        "Our approach to stochastic language modeling is based on the Variable Ngram Stochastic Automaton (VNSA) representation and learning algorithms introduced in (Riccardi et al., 1995; Riccardi et al., 1996).",
        "A VNSA is a non-deterministic Stochastic Finite-State Machine (SFSM) that allows for parsing any possible sequence of words drawn from a given vocabulary V. In its simplest implementation the state q in the VNSA encapsulates the lexical (word sequence) history of a word sequence.",
        "Each",
        "state recognizes a symbol w, E VU {e}, where e is the empty string.",
        "The probability of going from state qi to qj (and recognizing the symbol associated to qj) is given by the state transition probability, P(qjlqi).",
        "Stochastic finite-state machines represent in a compact way the probability distribution over all possible word sequences.",
        "The probability of a word sequence W can be associated to a state sequence = qi, , qj and to the probability P4).",
        "For a non-deterministic finite-state machine the probability of W is then given by P(W) = P4).",
        "Moreover, by appropriately defining the state space to incorporate lexical and extra-lexical information, the VNSA formalism can generate a wide class of probability distribution (i.e., standard word n-gram, class-based, phrase-based, etc.)",
        "(Riccardi et al., 1996; Riccardi et al., 1997; Riccardi and Bangalore, 1998).",
        "In Fig. 2, we plot a fragment of a VNSA trained with word classes and phrases.",
        "State 0 is the initial state and final states are double circled.",
        "The e transition from state 0 to state 1 carries the membership probability P(C), where the class C contains the two elements {collect, calling card}.",
        "The e transition from state 4 to state 6 is a back-off transition to a lower order n-gram probability.",
        "State 2 carries the information about the phrase calling card.",
        "The state transition function, the transition probabilities and state space are learned via the self-organizing algorithms presented in (Riccardi et al., 1996)."
      ]
    },
    {
      "heading": "4.1 Extending VNSAs to Stochastic Transducers",
      "text": [
        "Given the monolingual corpus T, the VNSA learning algorithm provides an automaton that recognizes an input string W (W E VN) and computes P(W) 0 for each W. Learning VNSAs from the bilingual corpus TB leads to the notion of stochastic transducers rsT.",
        "Stochastic transducers TST : Ls x LT [0,1] map the string WS E Ls into WT E LT and assign a probability to the transduction WS 74 WT.",
        "In our case, the VNSA's model will estimate P(Ws WT) = P(Ws, WT) and the symbol pair w, : xi will be associated to each transducer state q with input label wi and output label xi.",
        "The model rsT provides a sentence-level transduction from Ws into WT.",
        "The integrated sentence and phrase-level transduction is then trained directly on the phrase-segmented corpus n described in section 3."
      ]
    },
    {
      "heading": "5 Reordering the output",
      "text": [
        "The stochastic transducers rsT takes as input a sentence Ws and outputs a set of candidate strings in the target language with source language word order.",
        "Recall that the one-to-many mapping comes from the non-determinism of rsT .",
        "The maximization step in equation 2 is carried out with Viterbi algorithm over the hypothesized strings in LT and WT is selected.",
        "The last step to complete the translation process is to apply the monolingual target language model AT to reorder the sentence WT to produce W. The reorder operation is crucial especially in the case the bilanguage phrases in Tr, are not sorted in the target language.",
        "For the reordering operation, the exact approach would be to search through all possible permutations of the words in WT and select the most likely.",
        "However, that operation is computationally very expensive.",
        "To overcome this problem, we approximate the set of the permutations with the word lattice 4, representing (x1 I x2 I ... xN)N, where xi are the words in WT.",
        "The most likely string W,2*., in the word lattice is then decoded as follows:",
        "where o is the composition operation defined for weighted finite-state machines (Pereira and Riley, 1997).",
        "The complete operation cascade for the machine translation process is shown in Figure 3."
      ]
    },
    {
      "heading": "6 Embedding Translation in an Application",
      "text": [
        "In this section, we describe an application in which we have embedded our translation model and present some of the motivations for doing so.",
        "The application that we are interested in is a call type classification task called How May I Help You (Gorin et al., 1997).",
        "The goal is to sufficiently understand",
        "caller's responses to the open-ended prompt How May I Help You?",
        "and route such a call based on the meaning of the response.",
        "Thus we aim at extracting a relatively small number of semantic actions from the utterances of a very large set of users who are not trained to the system's capabilities and limitations.",
        "The first utterance of each transaction has been transcribed and marked with a call-type by labelers.",
        "There are 14 call-types plus a class other for the complement class.",
        "In particular, we focused our study on the classification of the caller's first utterance in these dialogs.",
        "The spoken sentences vary widely in duration, with a distribution distinctively skewed around a mean value of 5.3 seconds corresponding to 19 words per utterance.",
        "Some examples of the first utterances are given below:",
        "• Yes ma'am where is area code two zero one?",
        "• I'm tryn'a call and I can't get it to go through I wondered if you could try it for me please?",
        "• Hello",
        "We trained a classifer on the training set of English sentences each of which was annotated with a call type.",
        "The classifier searches for phrases that are strongly associated with one of the call types (Gorin et al., 1997) and in the test phase the classifier extracts these phrases from the output of the speech recognizer and classifies the user utterance.",
        "This is how the system works when the user speaks English.",
        "However, if the user does not speak the language that the classifier is trained on, English, in our case, the system is unusable.",
        "We propose to solve this problem by translating the user's utterance, Japanese, in our case, to English.",
        "This extends the usability of the system to new user groups.",
        "An alternate approach could be to retrain the classifier on Japanese text.",
        "However, this approach would result in replicating the system for each possible input language, a very expensive proposition considering, in general, that the system could have sophisticated natural language understanding and dialog components which would have to be replicated also."
      ]
    },
    {
      "heading": "6.1 Experiments and Evaluation",
      "text": [
        "In this section, we discuss issues concerning evaluation of the translation system.",
        "The data for the experiments reported in this section were obtained from the customer side of operator-customer conversations, with the customer-care application described above and detailed in (Riccardi and Gorin, January 2000; Gorin et al., 1997).",
        "Each of the customer's utterance transcriptions were then manually translated into Japanese.",
        "A total of 15,457 English-Japanese sentence pairs was split into 12,204 training sentence pairs and 3,253 test sentence pairs.",
        "The objective of this experiment is to measure the performance of a translation system in the context of an application.",
        "In an automated call router there are two important performance measures.",
        "The first is the probability of false rejection, where a call is falsely rejected.",
        "Since such calls would be transferred to a human agent, this corresponds to a missed opportunity for automation.",
        "The second",
        "measure is the probability of correct classification.",
        "Errors in this dimension lead to misinterpretations that must be resolved by a dialog manager (Abella and Gorin, 1997).",
        "Using our approach described in the previous sections, we have trained a unigram, bigram and trigram VNSA based translation models with and without phrases.",
        "Table 3 shows lexical choice (bag-of-tokens) accuracy for these different translation models measured in terms of recall, precision and F-measure.",
        "In order to measure the effectiveness of our translation models for this task we classify Japanese utterances based on their English translations.",
        "Figure 4 plots the false rejection rate against the correct classification rate of the classifier on the English generated by three different Japanese to English translation models for the set of Japanese test sentences.",
        "The figure also shows the performance of the classifier using the correct English text as input.",
        "There are a few interesting observations to be made from the Figure 4.",
        "Firstly, the task performance on the text data is asymptotically similar to the task performance on the translation output.",
        "In other words, the system performance is not significantly affected by the translation process; a Japanese transcription would most often be associated with the same call type after translation as if the original were English.",
        "This result is particularly interesting inspite of the impoverished reordering phase of the target language words.",
        "We believe that this result is due to the nature of the application where the classifier is mostly relying on the existence of certain key words and phrases, not necessarily in any particular order.",
        "The task performance improved from the unigram-based translation model to phrase unigram-based translation model corresponding to the improvement in the lexical choice accuracy in Table 3.",
        "Also, at higher false rejection rates, the task performance is better for trigram-based translation model than the phrase trigram-based translation model since the precision of lexical choice is better than that of the phrase trigram-based model as shown in Table 3.",
        "This difference narrows at lower false rejection rate.",
        "We are currently working on evaluating the translation system in an application independent method and developing improved models of reordering needed for better translation system."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "We have presented an architecture for speech translation in limited domains based on the simple machinery of stochastic finite-state transducers.",
        "We have implemented stochastic finite-state models for English-Japanese and Japanese-English translation in limited domains.",
        "These models have been trained automatically from source-target utterance pairs.",
        "We have evaluated the effectiveness of such a translation model in the context of a call-type classification task."
      ]
    }
  ]
}
