{
  "info": {
    "authors": [
      "Laura Kataja",
      "Kimmo Koskenniemi"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-1064",
    "title": "Finite-State Description of Semitic Morphology: A Case Study of Ancient Accadian",
    "url": "https://aclweb.org/anthology/C88-1064",
    "year": 1988
  },
  "references": [
    "acl-C86-1016"
  ],
  "sections": [
    {
      "text": [
        "Laura ICA.TAJA University of Helsinki Department of Asian and African Studies Hallituskatu 11 SF-00100 Helsinki Finland Mostmet: This paper discusses the problems of description and computational implementation of phonology and morphology in Semitic languages, using Ancient Akkadian as an example.",
        "Phonological and morphophono-logical variations are described using standard finite-state two-level morphological rules.",
        "Interdigitation, prefixation and suffixation are described by using an intersection of two lexicons which effectively defines lexical representations of words, introdii etio int Word-fwmation in Semitic languges poses several challenges to computational morphology.",
        "One obvious difficulty is its nonconcatenative nature ie.",
        "the fact that inflections not just adding prefixes and suffixes, but also includes interdigitation where the phonological sequence symbolizing a verbal root is interrupted by individual and short sequences of phonemes denoting various derivational and inflectional stems.",
        "In addition to this, there are numerous phonological and morphophonological processes of a more conventional character.",
        "Two-level phonology assumes a framework for word-formation where there is an underlying lexical representation of the word-form and a surface representation which are related to each other with two-level rules [Kosken-nienai 1983].",
        "These rules compare the representations directly and they operate in parallel.",
        "The lexicon component defines what lexical representations are permissible and how they correspond to sequences of morphemes, see figure 1."
      ]
    },
    {
      "heading": "MORPHEMES Lexicon Component LEXICAL REPRESENTATION 'Iwo-level Rules SURFACE REPRESENTATION",
      "text": [
        "Kimmo KOSKENNIEMI University of Helsinki Research Unit for Computational Linguistics Hallituskatu 11 SF-00100 Helsinki Finland Interdigitation entails more requirements for the lexicon which defines feasible lexical representations and relates them to underlying morphemes.",
        ",The task for the lexicon component is more or less universal, even if some languages can do with simpler lexicons while others require more sophisticated structures.",
        "This paper discusses a solution which involves using two separate lexicons, one for word roots, and the other for prefixes, flexional elements and suffixes.",
        "Entries for roots leave flexional elements unspecified and vice versa.",
        "The intersection of these two lexicons effectively defines lexical representations of word-forms.",
        "2.",
        "Morphotactic structure of word-forms.",
        "Akkadian verbs have the following overall pattern: [pers.]",
        "[root & flection] [gender & numb.]",
        "(opt.",
        "subjunctive etc.]",
        "[opt.",
        "obj.]",
        "An example of a full fledged verbal form would be '(that) they caught him': lexical representation: 1 X t a B A T u \\ n sh u surface representation: i x x a b t u u n i sh A dash '-' denotes morpheme boundary, and backslash '\\' a morphophoneme for vowel lengthening.",
        "The above word-form is divided into its parts according to the pattern as follows:",
        "Capital letters are used in order to distinguish radical consonants and vowels from segments in other morphs.",
        "Thus, the root & flection part is XtaBAT where capital letters are components of the root, with lower case letters representing flectional elements.",
        "Nouns, in turn, have an overall structure : Fig. 1 [stem] [case & number] [opt.",
        "possessive] *s paper describes a fairly comprehensive two-level systoto for phonological and morphophonological alternatior,e in Akkadian word inflection and regular verbal derivation.",
        "The rule component proves to be similar to two-level rule systems for other languages.",
        "An example of a maximal nominal word-form is their kings"
      ]
    },
    {
      "heading": "lexical representation: Shaft\\ a ni-shunti",
      "text": [
        "surface representation: sh a r r a an i sh u n u",
        "parts to fill the corresponding two gaps in the verbal root.",
        "\"suffix assimilation of sh\" The overall pattern is roughly ...(((c)c)v)...(v or \\)... sh:s <=> :s There is at most one verbal prefix and it indicates person (and partly modus).",
        "Its overalll pattern is (C)V. Some alternations caused by laryngeals: There are at most three verbal suffixes attached to the stem, The first suffix indicates gender and number (and 'lord' Il partly person).",
        "They have the form v\\ or they are empty.",
        "e \\ E l u to e e The second suffix indicates either the subjunctive (u, \"umlaut\" empty, or n ) or the ventive (am or aim).",
        "The third suffix a:e E: :* denotes the object or the dative case and conforms to a * E e pattern C v( C v(\\ C v)) Nominal stems are given as derived complete stems 'he enters ' containing three radical consonants which can be EaR\\UB identified, but no attempt has been made to generate them i r r LI b from plain radical consonants and flectional elements because stems are idiosyncratic and better described as \"elision of a\" a:0 <=> :Vowel Laryngeal: :Consonant \\: lexicalized whole units.",
        "Nominal suffixes indicate gender, number and case.",
        "Gender is part of the stem for nouns whereas adjectives have an explicit feminine suffix (a)), (the masculine has no Examples of deletion of short vowels: marking).",
        "Number and case are represented by portmanteau morphs.",
        "After these endings there may be a 'good' Pi i Q u possessive ending according to one of two patterns: V \\ or Cl a d a m q u",
        "Examples of vowel contractions.",
        "°they said to me' Akkadian, like many other Semitic languages, has a considerable number of phonological and morphophono- i q b u u nin n 1 logical processes.",
        "This paper describes a fairly complete \"Vowel contraction\" and tested system of some 30 rules written in two-level Vowel:0 <=> (La:) :Vo (La:) :Vo formalism and compiled with the TWOL rule compiler I Karttunen, Koskenniemi and Kaplan, 1987].",
        "A number of",
        "(she is given below accompanied by rules that ZaKUJ-at correspond to the processes.",
        "In each example the lexical z a k o a t representation is given (in bold face) above the surface representation (in normal face).",
        "Examples of morphological alternation of root vowels: There are several assimilations word internally and at 'he decides' morpheme boundaries, eg.",
        "an N in the root is assimilated if'ah‘OS iparras",
        "8trateip 4'0 lexicon Le..,Licur,;t are Oft,CD.",
        "understood as lists of entries or as nmle kind of tree striletAlrVU having branches with letters as their hibels (tries).",
        "A tree is, of course, a special case of a finite-state transition diagram or a finite-state automaton.",
        "Specifically, trees have no loops or cycles.",
        "The obvious generaliza ion of lexicons would, then, he to use transition diagrams instead of trees.",
        "Au entry for a verbal stern 'decide.'",
        "as a regular expression could be:",
        "where >;7 denotes the alphabet for prefixes, flectional elements rand suffixes, Correspondingly, an entry for a pro:“ini; immix stem (C stem) could be: >:11 \\ Y,1 .\"1,' where ?_;1 emotes the alphabet for radical consonants and vowels.",
        "Intersections of such root entries and flectional elements give exactly the lexical representations of verbal sterns.",
        "(The number of different entries needed for ffectional parts is in, the order of 70.)",
        "The inflectional part of the lexicon could be expressed as a concatenation of the prefix, flexion and the suffix sub-lexicons.",
        "The intersection of this and the root lexicon contains all feasible lexical representations (which was the task of the lexicon component).",
        "This intersection need riot be carried out in advance because the process of recognition can perform simultaneous searches in these two components and simulate the intersection.",
        "The result of arm actual intersection would be inconvenient because of its size (roughly, the product of the sizes of its components).",
        "(There is 11.",
        "(i operational implementation of this part of the system yet, although facilities to build it are avails ble..) bo COrillbillatiOnS of Morphemes The structure of lexicon that was sketched above greatly overgenen;es, because many combinations of prefixes, flectional elements and suffixes are not valid.",
        "Restrictions are needed for the cooccurrence of these morphemes.",
        "One obvious way to cope with such combinatorics is to use unification-based features as in D-PATR [Karttunen 1986].",
        "Unification features have the additional benefit of also providing effective morphosyntactic features for word-forms, it seems that the ability of using negation and disjunction in unification would simplify the description.",
        "Inn the following we assume these to be available.",
        "Effective :restrictions for prefixes could be eg.",
        ": rr ( riotPers2 singular noffemin) or ( person3 plural nut-Comm ) ( person3 singular masculine) or ( person3 plural rtotColuni) 'where Comm refers to a gender which is used in some forms to cover both feminine and masculine (feminine, masculine and Comm are mutually exclusive).",
        "Descriptions for suffixes could be eg.",
        ": a notPersl plural notMasc i person2 singular feminine U person3 plural masculine null morph notPers2SgFem or persons plural comm The templates can be defined in a straight forward manner to result in combinations eg.",
        ": a a person3 plural feminine u u person3 plural masculine personl singular masculine, or person3 singular masculine The combinatorics of Akkadian prefixes and suffixes seems to be fairly complicated, but a feature calculus seems to be sufficient for handling it so that it lets only valid combinations through and gives correct morphosyntactic features to word-forms.",
        "(This part of the work is still in progress.)"
      ]
    }
  ]
}
