{
  "info": {
    "authors": [
      "Hyunjung Son"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics – Student Research Workshop",
    "id": "acl-P03-2010",
    "title": "A Computational Treatment of Korean Temporal Markers, OE and DONGAN",
    "url": "https://aclweb.org/anthology/P03-2010",
    "year": 2003
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we elucidate how Korean temporal markers, OE and DONGAN contribute to specifying the event time and formalize it in terms of typed lambda calculus.",
        "We also present a computational method for constructing temporal representation of Korean sentences on the basis of G grammar proposed by [Renaud, 1992;1996]."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Associated to a NP, Korean temporal markers OE and DONGAN build time adverbials.",
        "(1) ach’im ilgopshiOE",
        "morning/seven o’clock-OE at seven o’clock in the morning",
        "(2) han shigan DONGAN one/hour/DONGAN",
        "for an hour As it is widely known, time adverbials play important roles in sentence meaning processing.",
        "Meanwhile, there is a significant divergence in opinions whether time adverbials or tense/aspect is a more efficient indicator leading to a correct temporal representation of sentences.",
        "To some [Kim, 1981], [Jo, 2000], [Vet, 1980], [Verkyul, 1989], tense or aspect is the only credible index to consult in establishing temporal interpretation, and the time adverbials are complementary.",
        "To others [Renaud, 1996], [Vlach, 1993], time adverbials are regarded as much more reliable than tense/aspect which is too ambiguous to provide coherent instructions about how to locate the event in time.",
        "We agree with the second point of view, as we observed that Korean tense markers fail to provide a solid and coherent way to capture the relevant time span.",
        "For example, the verbal infix ‘-at-’, generally considered as a typical past tense marker in Korean, brings about several time interpretation possibilities such as simple past (3), completion (4), resultant state (5) and progressiveness (6).",
        "(3) shiwidaega ôje hanshiOE shich’ôngul dulrôssatta",
        "demonstrators-NOM / yesterday /one o’clock-OE/ the city hall-ACC/ surround-PA-DEC1 The demonstrators surrounded the city hall at one o’clock yesterday.",
        "(4) shiwidaega mach’imnae shich’ôngul dulrôssatta",
        "demonstrators-NOM / at last / the city hall-ACC /surround-PA-DEC At last, the demonstrators surrounded (succeeded in surrounding) the city hall.",
        "(5) shiwidaega harudongan shich’ôngul dulrôssatta",
        "demonstrators-NOM/one day-DUR/the city hall-ACC/surround-PA-DEC The demonstrators have surrounded the city hall for one day.",
        "(6) ônjebutô shiwidaega shich’ôngul dulrôssatssumnikka?",
        "since when/ demonstrators-NOM/ the city hall-ACC/ surround-PA-INT Since when have the demonstrators been surrounding the city hall?",
        "Moreover, what triggers these interpretation possibilities is still being discussed among Korean linguists2.",
        "In the following, we attempt to show how time adverbials can remedy this shortcoming and specify the event time."
      ]
    },
    {
      "heading": "2 Semantic description",
      "text": [
        "The assumption underlying our temporal description is that the linguistic time is ordered, discrete, infinite and consisting of instants corresponding to the natural numbers.",
        "The linguistic time can be expressed with one of these three notions: instant, extended interval and duration.",
        "Instants are unitary constituents of linguistic time and noted by a quintuplet of natural numbers [x1,x2,x3,x4,x5] of which x1 stands for year, x2 for month, x3 for day, x4 for hour and x5 for minute.",
        "(ex) at 3 o’clock on April 5th 2003: instant [2003,4,5,3,0] An extended interval is a set of consecutive instants determined by a beginning instant and an ending instant.",
        "(ex) on April 5th, 2003: interval [[2003, 4,5,0,0], [2003,4,5,23,59]] A duration refers to a temporal distance between two distinct instants.",
        "calculus3.",
        "The symbol λ stands for abstraction and • stands for application4."
      ]
    },
    {
      "heading": "Definitions of types",
      "text": [
        "i : type symbol denoting the type of individuals p : type symbol denoting the type of propositions e : type symbol denoting the type of events ent: type symbol denoting the type of natural numbers inst : type symbol denoting the type of instants inter : type symbol denoting the type of extended intervals dur: type symbol denoting the type of durations Type symbols may be omitted when no ambiguity is introduced."
      ]
    },
    {
      "heading": "Definitions of functional terms",
      "text": [
        "(λe.",
        "moment•e): e→inst Applying this function to any argument of type e, we obtain the moment of e of type inst.",
        "(λe.",
        "interv•e): e→inter Applying this function to any argument of type e, we obtain the interval of e of type inter.",
        "Applying these functions to any argument x of type e, we obtain the beginning/ending instant of x of type inst.",
        "(λx.",
        "duration•x): e→dur Applying this function to any argument x of type e, we obtain the duration of x of type dur.",
        "Applying this function to any argument x of type inter, we obtain the beginning/ending instant of x of type inst.",
        "By definition, beg• [A,B] = A and end• [A,B] = B (ex) for 5 years: duration [5,_,_,_,_] For the purpose of temporal description of a sentential event, we defined the following types and functional terms on the basis of typed lambda",
        "Applying this function to any argument x of type inter, we obtain the length of x of type dur.",
        "By definition, length• [A,B]= |B-A| (λxλy.",
        "x <«t» y): inst→inst→p It denotes that x of type inst is anterior to y of the same type.",
        "When no ambiguity is introduced, «t» will be omitted.",
        "(λxλy.",
        "x =«t» y): inst→inst→p It denotes that x and y of type inst are simultaneous.",
        "(λxλy.",
        "x ≤«t» y): inst→inst→p It denotes that λxλy.",
        "(x <«t»y ∨ x =«t»y).",
        "(λxλy.",
        "x ∈ «t» y): inst→inter→p It denotes that x of type inst is a member of y of type inter.",
        "By definition, λxλy.",
        "(beg• y ≤ x ≤",
        "It denotes that x of type inter is included by y of the same type.",
        "By definition, λxλy.",
        "(beg•y < beg•x ∧ end•x < end•y).",
        "(λxλy.",
        "x =«t » y): inter→inter→p x and y of type inter are simultaneous.",
        "By definition, λxλy.",
        "(beg•x=beg•y ∧ end•x=end•y).",
        "(λxλy.",
        "x ⊆«t » y): inter→inter→p It denotes that λxλy.",
        "(beg•y ≤ beg•x ∧ end•x ≤ end•y).",
        "The temporal adverbials with OE or DONGAN do not bring the same semantic constraints in all the sentences.",
        "It can be illustrated by the following examples of OE (7-10) and DONGAN (11-14).",
        "(7) ach’im ilgopshiOE nurôngoiga chugôtta.",
        "the morning /seven o’clock-OE / Nurôngoi-NOM /die-PA-DEC At seven o’clock in the morning, Nurôngoi died.",
        "The OE adverbial of this example indicates the moment when the event described by the nuclear sentence5 happened.",
        "But in (8) and (9), OE adverbials indicate an interval of which an instant is identified with the moment of the event.",
        "(8) samwol shiboirOE nurôngoiga chugôtta.",
        "March/the fifteenth-OE /Nurôngoi-NOM/die-PADEC",
        "On the fifteenth of March, Nurôngoi died.",
        "(sr 8) ∃e∃I die•e•nurôngi ∧ moment•e<pt_speech ∧ I=(the 15th of March) ∧ moment•e∈ I",
        "(9) chinan yôrumOE nurôngoiga chugôtta the last summer-OE/ Nurôngoi-NOM/die-PA-DEC Last summer, Nurôngoi died.",
        "(sr 9) ∃e∃I die•e•nurôngi ∧ moment•e<pt_speech ∧ interval• I ∧ summer• I ∧ moment• e∈ I Moreover, OE adverbials can introduce a period of recurrent events as in (10).",
        "(10) iljuirOE so dasôt mariga chugôtta",
        "a week-OE/cow/five/classifier-NOM/die-PA-DEC Five cows died every week.",
        "5 We call the independent sentences without modifiers such as temporal adverbials ‘nuclear sentence’.",
        "where ∪•R ≡ λx.",
        "∃R (R•P ∧ P•x) As for DONGAN adverbials, they present the maximal duration of the described event as in (11).",
        "(11) hanshigan DONGAN kwanghoe bihaenggiga naratta",
        "an hour /DONGAN /of Kwangho /airplane-NOM /fly-PA-DEC Kwangho’s airplane flew for an hour.",
        "(sr 11) ∃x∃e airplane•x ∧ of•kwangho•x ∧ fly•e•x ∧ ending•e<pt_speech ∧ duration•e=(1 hour) In (12), the interval denoted by the DONGAN adverbial is included by that of the sentential event.",
        "In other words, it is not clear, for the moment, whether the described event reached its end or not.",
        "(12) kyôul banghak DONGAN ukyunun mokgongsoesô ilhaetta",
        "winter vacation /DONGAN /Ukyu-TOP/carpenter’s shop-LOC/work-PA-DEC During the winter vacation, Ukyu worked at the carpenter’s shop.",
        "DONGAN adverbials also indicate the interval to which the moment of the event belongs, as (13) shows.",
        "(13) kyôul banghak DONGAN nanun shine daehae saenggak’agi chijak’aetta",
        "winter vacation / DONGAN / I-TOP/ about God/ think /begin-PA-DEC During the winter vacation, I began to think about God.",
        "(sr 13) ∃I∃e interval•I ∧ winter_vacation•I ∧ begin•e•(λe1λx.",
        "think _about•e1•god•x)•speaker ∧ moment•e<pt_speech ∧ moment•e∈ I The following example (14) denotes that fishing of Yunsôk has been repeated in a regular way during the interval indicated by the DONGAN adverbial.",
        "(14) shimnyôn DONGAN yunsôkun môn badaesô kokijabirul haetta 10 years /DONGAN /Yunsôk-TOP /far ocean-LOC /fishing-ACC/do-PA-DEC",
        "For ten years, Yunsôk fished in the far ocean.",
        "Such a distributional pattern of events disappears when the nuclear sentence is modified by quantification, which is illustrated by (15).",
        "(15) shimnyôn DONGAN yunsôkun môn badaesô kokijabirul se bôn haetta 10 years /DONGAN /Yunsôk-TOP /far ocean-LOC /fishing-ACC/three times/do-PA-DEC",
        "For ten years, Yunsôk had fished in the far ocean three times.",
        "(sr 15) ∃I interval•I ∧ length•I=(10 years) ∧ |λe.",
        "fish•e•yunsôk ∧ in•e•the_ far _ocean ∧ ending•e<pt v•e _speech n inter⊆I|=3 To find a strategy to solve such a multiple ambiguity, we investigated three thousand sentences for each temporal marker 9 and discovered the following facts:",
        "1.",
        "The semantic and syntactic properties of the phrase accompanying the temporal markers play an important role to locate the event in time.",
        "2.",
        "It is necessary to distinguish mono-occurrent sentences concerning a single event from multi-occurrent sentences concerning a set of different events10.",
        "The multi-occurrent nature is very often",
        "signaled by bare plurals in nominal phrases, adverb like ch’arero ‘in turn’, and quantification modifiers.",
        "3.",
        "When it comes to the multi-occurrent sentences, DONGAN adverbials impose constraints on the distribution of events in some cases (see (14)).",
        "4.",
        "The quantification negates the distributional meaning brought by DONGAN adverbials and gets them to indicate the temporal scope of this semantic operation (see (14) and (15)).",
        "5.",
        "As for the verbal infix ‘-at-’, its common semantic value is to denote the fact that the beginning of the event is anterior to the point of speech11 ; λe.",
        "beginning•e < pt_speech.",
        "6.",
        "The information relevant to the time",
        "interpretation is scattered over the whole sentence; in the verbal phrase, quantification modifiers ranging over individuals or events, determiners in the nominal phrases and time adverbials.",
        "Therefore, the temporal interpretation of a sentence should be constructed in a compositional way.",
        "7.",
        "For the same reason, the aspectual value should be attributed to the nuclear sentence and not to the verbal phrase."
      ]
    },
    {
      "heading": "3 Computational implementation",
      "text": [
        "We discovered that Renaud’s G Grammar is suitable for the purpose of computational implementation of these facts.",
        "This grammar loads information on word definitions as little as possible and charges the rules with detailed description.",
        "This principle contributes to gathering the pieces of information scattered throughout a sentence and to establishing a semantic representation of the sentence in a compositional way.",
        "Moreover, it enables us to deal with all the other linguistic phenomena in the same way as with the temporal problems.",
        "This grammar has been applied to French [Renaud, 1996; 2000; 2002] and Japanese [Blin, 1997] as well.",
        "This grammar is divided into word definitions called ‘dico’ and composition rules.",
        "Each of them consists of syntactic constraint, unification-based feature constraint and semantic constraint written in lambda-terms.",
        "In composition rules, the symbol ‘→’ stands for syntactic rewriting and ‘<<=’ stands for β - reduction.",
        "We present here an example process establishing the temporal interpretation of a Korean sentence extended by a DONGAN adverbial.",
        "(11) hanshigan DONGAN kwanghoe bihaenggiga naratta an hour/ DONGAN/ of Kwangho/ airplane-NOM/ fly-PA-DEC Kwangho’s airplane flew for an hour.",
        "We determine the semantic term of a DONGAN adverbial, according to the semantic and syntactic properties of the phrase preceding the temporal marker.",
        "The time adverbial hanshigan DONGAN in (11) includes a NP denoting duration and conforms to the syntactic condition E 12 .",
        "Thus, the semantic term of type t5 is assigned to this time adverbial.",
        "We also calculate the semantic term of the nuclear sentence relying on criteria such as quantification modification, mono/multi-occurrent and aspect 13, which get involved in the feature constraint at the levels of both dico and of rules.",
        "Since the nuclear sentence of (11) is not modified by quantification, and since it concerns a single event of activity, it receives a semantic term of type c3 in the following figure.",
        "At last, the semantic term of the time adverbial and that of the nuclear sentence are joined together by the following rule to put the final semantic representation of (11)14:",
        "As we mentioned above, one of the most important advantages of G Grammar consists of its capacity to establish semantic interpretations in a compositional way.",
        "Even if we presented only the final step of semantic processing, our Korean parser constructs a semantic representation at each step15.",
        "The sentences extended by an OE adverbial are represented in the same way as those by a DONGAN adverbial, as will be seen in the"
      ]
    },
    {
      "heading": "On the fifteenth of March, Nurôngoi died.",
      "text": [
        "Relying on the semantic and syntactic constraints of the phrase preceding OE at the same time, we determine the semantic term of the OE adverbial.",
        "Since samwol shiboirOE of (8) denotes an extended interval and it conforms to the syntactic condition C, this adverbial is attributed the semantic term of type t3.",
        "The semantic representation of the nuclear sentence of (8) is established in the same way as explained above in Figure 3.",
        "At last, taking the semantic terms of the OE adverbial and of the nuclear sentence, the following rule serves to construct the final representation of the whole sentence17."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "In this paper, we showed how OE adverbials and DONGAN adverbials contribute to constructing the temporal interpretation of Korean sentences.",
        "We also formalized the semantic properties of these temporal markers with typed lambda calculus before we integrated them into the Korean parser that we built on the basis of Renaud’s G Grammar.",
        "We showed the effectiveness of this grammar in representing compositionally semantic interpretations of Korean sentences.",
        "In the future, we will study the Korean time adverbials with MANE and zero particle.",
        "The first temporal marker is believed to signal the telicity of the event and the second appears very frequently in informal discourses."
      ]
    },
    {
      "heading": "Acknowledgement",
      "text": [
        "We are deeply grateful to Francis Renaud and Irène Tamba, without whom this work would not have happened.",
        "This research is supported by the Pasteur scholarship from the French government."
      ]
    }
  ]
}
