{
  "info": {
    "authors": [
      "Jahna C. Otterbacher",
      "Dragomir R. Radev",
      "Airong Luo"
    ],
    "book": "Workshop on Automatic Summarization",
    "id": "acl-W02-0404",
    "title": "Revisions That Improve Cohesion in Multi-Document Summaries: A Preliminary Study",
    "url": "https://aclweb.org/anthology/W02-0404",
    "year": 2002
  },
  "references": [
    "acl-A00-2024",
    "acl-H01-1065",
    "acl-P99-1072",
    "acl-W00-0403",
    "acl-W00-1009",
    "acl-W01-1313",
    "acl-W97-0713"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Extractive summaries produced from multiple source documents suffer from an array of problems with respect to text cohesion.",
        "In this preliminary study, we seek to understand what problems occur in such summaries and how often.",
        "We present an analysis of a small corpus of manually revised summaries and discuss the feasibility of making such repairs automatically.",
        "Additionally, we present a taxonomy of the problems that occur in the corpus, as well as the operators which, when applied to the summaries, can address these concerns.",
        "This study represents a first step toward identifying and automating revision operators that could work with current summarization systems in order to repair cohesion problems in multi-document summaries."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "With the increasing availability of online news sources, interest in automatic summarization has continued to grow in recent years.",
        "Many systems have been developed for this purpose, including those that can produce summaries based on several documents (Multi-document summarization, or MDS).",
        "Generally speaking, most of these systems work by extracting sentences from the original texts.",
        "Although significant improvements continue to be made to such summarizers, they still cannot produce summaries that resemble those written manually by humans.",
        "One area in particular in which the automatically produced summaries differ markedly is text cohesion.",
        "Whether a summary is produced from one or more documents, important context may be excluded from the summary that disrupts its readability.",
        "A text is not a random collection of sentences, but rather, each sentence plays a role in conveying the ideas the author wants to express.",
        "Selecting sentences from multiple texts one at a time disregards this interdependence between sentences.",
        "As a result, summaries often suffer from problems of cohesion."
      ]
    },
    {
      "heading": "1.1 Text cohesion and coherence",
      "text": [
        "[Halliday & Hasan, 1976] offer a clear definition for text cohesion: [The concept of cohesion] refers to relations of meaning that exist within the text, and that define it as a text.",
        "Cohesion occurs where the interpretation of some element in the discourse is dependent on that of another (p.2).",
        "It is this property of cohesion that allows the reader to comprehend the overall meaning of a text, and to understand the author’s intentions.",
        "Therefore, in automatically produced summaries, cohesion problems should be resolved.",
        "Otherwise, the resulting text may be unintelligible, or worse, misleading."
      ]
    },
    {
      "heading": "1.2 Problems of cohesion in automatically produced summaries",
      "text": [
        "The following is an example of a summary produced automatically from one source document.",
        "[1] More than 130 bodies are reported to have been recovered after a Gulf Air jet carrying 143 people crashed into the Gulf off Bahrain on Wednesday.",
        "[2] Distraught relatives also gathered at Cairo airport, demanding information.",
        "[3] He also declared three days of national mourning.",
        "[4] He said the jet fell “sharply, like an arrow.” The most obvious problem with this summary is that in the last two sentences, the pronouns have no antecedents; as a result, the reader does not know who the subjects of the sentences are.",
        "In addition, the adverb ‘also,’ used in both the second and third sentences, makes reference to previous events not described in the summary.",
        "Another concern is that there seems to be no transition between the sentences.",
        "The context from the source article necessary to make the text cohesive is missing from the summary.",
        "As a result, the summary is unintelligible."
      ]
    },
    {
      "heading": "1.3 Text cohesion in MDS",
      "text": [
        "Using multiple documents to generate a summary further complicates the situation.",
        "As contended by [Goldstein et al., 2000] a multi-document summary may contain redundant messages, since a cluster of news articles tends to cover the same main point and shared background.",
        "In addition, articles from various sources could contradict one another, as to how or when an event developed.",
        "Finally, since the source articles are not all written simultaneously, they may describe different stages of the development of an event.",
        "Not only do news stories come to different conclusions at various stages in an event, but also the attitudes of writers may change.",
        "Multi-document summaries may suffer further from problems of cohesion since their source articles may be written by different authors.",
        "Not only do writers have their own styles, they have the overarching structure of the article in mind when producing it.",
        "As a result, in MDS we are more likely to encounter text that is not cohesive.",
        "Previous research has addressed revision in single-document summaries [Jing & McKeown, 2000] [Mani et al., 1999] and has suggested that revising summaries can make them more informative and correct errors.",
        "We believe that a generate-and-revise strategy might also be used in creating better multiple-document summaries, within the framework of current extractive summarization systems.",
        "However, as mentioned previously, there is reason to believe that multi-document summaries suffer from many different coherence problems and that such problems occur more often than in single-document summaries.",
        "Therefore, an important preliminary step in determining how we might revise such summaries is to closely examine the cohesion problems that occur in multi-document summaries.",
        "In the current paper we analyze a small corpus of manually revised multi-document summaries.",
        "We present a taxonomy of pragmatic concerns with respect to cohesion in the summaries, as well as the operators that can address them.",
        "Finally, we will discuss the feasibility of implementing such revisions automatically, which we hope to address in our future work."
      ]
    },
    {
      "heading": "2 Background and previous work",
      "text": [
        "Rhetorical Structure Theory (RST) [Mann & Thompson, 1988] has contributed a great deal to the understanding of the discourse of written documents.",
        "RST describes the coherence nature of a text and is based on the assumption that the elementary textual units are non-overlapping text spans.",
        "The central concept of RST is the rhetorical relation, which indicates the relationship between two spans.",
        "RST can be used in sentence selection for single document summarization [Marcu, 1997].",
        "However, it cannot be applied to MDS.",
        "In RST, text coherence is achieved because the writer intentionally establishes relationships between the phrases in the text.",
        "This is not the case in MDS, where sentences are extracted from different source articles, written by various authors.",
        "Inspired by RST, [Radev, 2000] endeavored to establish a Cross-document Structure Theory (CST) that is more appropriate for MDS.",
        "CST focuses on the relationships between sentences that come from multiple documents, which vary substantially from those between sentences in the same text.",
        "Such relationships include identity, paraphrase and subsumption (one sentence contains more information than the other)."
      ]
    },
    {
      "heading": "2.2 Computational models of text coherence",
      "text": [
        "Based on RST, [Marcu, 2000] established a Rhetorical Parser.",
        "The parser exploits cue phrases in an algorithm that discovers discourse relationships between phrases in a text.",
        "This parser can be used to extract sentences in single-document summarization.",
        "To contrast, [Harabagiu, 1999] concentrated on the derivation of a model that can establish coherence relations in a text without relying on cue phrases.",
        "She made use of large lexical databases, such as Wordnet, and of path finding algorithms that generate the algorithms that generate the cohesion structure of texts represented by a lexical path.",
        "[Hovy, 1993] summarized previous work that focused on the automated planning and generation of multi-sentence texts using discourse relationships.",
        "Text generation is relevant to MDS, as we can view MDS as an attempt to generate a new text by reusing sentences from different sources.",
        "The systems discussed in [Hovy, 1993] relied on a knowledge base and a representation of discourse structure.",
        "The dependency of text generation on knowledge of discourse structure was emphasized."
      ]
    },
    {
      "heading": "2.3 Revision of single-document summaries",
      "text": [
        "[Mani et al., 1999] focused on the revision of single-document summaries in order to improve their informativeness.",
        "They noted that such revision might also fix ‘coherence errors.’ Three types of revision operators were identified: sentence compaction, sentence aggregation and sentence smoothing.",
        "To contrast, [Jing & McKeown, 2000] concentrated on analyzing human-written summaries in order to determine how professionals construct summaries.",
        "They found that most sentences could be traced back to specific cut-and-paste operations applied to the source document.",
        "They identified six operations and used them to implement an automatic revision module."
      ]
    },
    {
      "heading": "2.4 Temporal ordering of events",
      "text": [
        "[Filatova & Hovy, 2001] addressed the issue of resolving temporal references in news stories.",
        "Although events in articles are not always presented in chronological order, readers must be able to reconstruct the timeline of events in order to comprehend the story.",
        "They endeavored to develop a module that could automatically assign a time stamp to each clause in a document.",
        "Using a syntactic parser, patterns were discovered as to which syntactic phrases tend to indicate the occurrence of a new event.",
        "In MDS, the correct temporal relationships between events described in the extracted sentences often needs to be reestablished, since they may be incorrect or unclear.",
        "[Barzilay et al., 2001] evaluated three algorithms for sentence ordering in multi-document summaries.",
        "One algorithm implemented was the Chronological Ordering algorithm.",
        "However, the resulting summaries often suffered from abrupt changes in topic.",
        "After conducting an experiment in which they studied how humans manually ordered sentences in a summary, they concluded that topically related sentences should be grouped together.",
        "The Chronological Ordering algorithm was augmented by introducing a cohesion constraint.",
        "The evaluation of the output summaries demonstrated a significant improvement in quality."
      ]
    },
    {
      "heading": "3 Revision-based system architecture",
      "text": [
        "The proposed architecture of our system, which would implement the generate-and-revise approach to summarization, is depicted in Figure 1.",
        "Input to this system is a cluster of source documents related to the same topic.",
        "Next, sentence extraction takes place, in which important sentences in the articles are identified.",
        "The output of this module is an extract, which lists the sentences to be included in the summary.",
        "In the next stage, Cross-document Structure Theory (CST) relationships are established.",
        "Specific relationships between sentences are identified.",
        "Here, a CST-enhancement procedure [Zhang et al., 2002] may take place, ensuring that interdependent sentences appear together in a summary.",
        "Sentences may also be reordered in the summary with respect to their temporal relations, topic, or other criteria.",
        "The next stage in the process is the revision module.",
        "First, high level revision operators are chosen, with respect to the cohesion problems that need repair.",
        "Afterwards, the specific lexical items to be added, deleted or modified are chosen.",
        "The output of this module is the revised, enhanced summary."
      ]
    },
    {
      "heading": "3.1 The MEAD summarizer",
      "text": [
        "The MEAD summarizer [Radev et al., 2000] [Radev et al. 2002] is based on sentence extraction and uses a linear combination of three features to rank the sentences in the source documents.",
        "The first of the three features is the centroid score, which quantifies the centrality of a sentence to the overall cluster of documents.",
        "The second is the position score, which assigns higher scores to sentences that are closer to the beginning of the document.",
        "The third feature, length, gives a higher score to longer sentences.",
        "Using a linear combination of the three features, sentences are ranked by score and added to the summary until the desired length is attained.",
        "Obviously, a module that makes revisions automatically would be much more restricted in its set of revision operators.",
        "However, since a major goal for this paper was to establish a taxonomy of problems specific to multi-document summarization and to consider the complexities involved in making repairs in MDS, we did not place such restrictions on the reviser.",
        "Rather, she applied corrections to the summaries as to make them as intelligible as possible, given the sentences chosen by the summarizer.",
        "Letters denote documents; numbers denote sentence numbers (within documents)"
      ]
    },
    {
      "heading": "4 Data and procedure",
      "text": [
        "We generated a corpus of summaries using the MEAD summarizer.",
        "The original documents come from three sources – DUC 2001, the Hong Kong News corpus, and the GA3-11 data set.",
        "One cluster of related news articles was chosen from each source.",
        "The DUC 2001 articles describe the 1991 eruption of Mount Pinatubo in the Philippines.",
        "This cluster, which is not typical of the DUC data, focuses on this single event and its subevents over a 2-week time period.",
        "Those taken from the HK corpus are about government initiatives surrounding the problem of drug rehabilitation.",
        "Due to the expense and labor involved in the generation and revision of multi-document summaries, we have used a subset of 15 summaries from our corpus in order to develop our revision taxonomy and to present some initial findings.",
        "Our future revision studies will employ a much larger set of data.",
        "The summaries were revised manually by the first author.",
        "This was a three-step process that involved identifying each problem, choosing an operator that could address the problem and then selecting the lexical items to which the operator should be applied.",
        "It is important to note that multiple lexical choices are possible in some cases.",
        "Since we were interested in identifying all types of cohesion problems as well as considering all possibilities for addressing these problems, the reviser was permitted to make any revision necessary in order to correct problems in the summaries."
      ]
    },
    {
      "heading": "4.1 Revision example",
      "text": [
        "<DELETE-place stamp> Cairo, Egypt – </DELETE> The crash of a Gulf Air flight that killed 143 people in Bahrain <ADD-time exp-day>Wednesday </ADD> is a disturbing déjà vu for Egyptians: It is the second plane crash within a year to devastate this Arab country.",
        "Egypt, which lacks the oil wealth of the Gulf and has an economy struggling to revive from decades of socialist stagnation, has a long tradition of sending workers to the Gulf to fill everything from skilled to menial jobs.",
        "<DELETE-place stamp> Manama, Bahrain (AP) – </DELETE> <ADD-time exp-day> On Friday, </ADD> three bodies wrapped in cloth, one the size of a small child, were lain before the faithful in the Grand Mosque during a special prayer for the dead in honor of the <DELETE-redundancy> 143 </DELETE> victims of the <DELETE-overspecified entity> Gulf Air </DELETE> crash.",
        "Bahrain’s Prime Minister Sheik Khalifa bin Salman Al Khalifa and other top officials stood side-by-side with 2,000 Muslins reciting funeral prayers before the bodies, <DELETE-redundancy> which were among the 107 adults and 36 children killed in Wednesday’s air disaster, </DELETE> said Information Ministry spokesman Syed el-Bably.",
        "The above figure shows an example of a revised summary that was produced from three source arti",
        "cles from the GA3-11 corpus.",
        "The news stories were collected live from the web, and come from two different sources www.foxnews.com and www.abcnews.com.",
        "The revision operator used and the corresponding pragmatic concern precede the modified text in pointed brackets.",
        "This type of markup scheme was used because it enables us to use simple Perl scripts to move between the original and revised versions of the summaries."
      ]
    },
    {
      "heading": "5 Taxonomy of revision strategies",
      "text": [
        "Based on our corpus of revised summaries, we have identified five major categories of pragmatic concerns related to text cohesion in multi-document summaries:",
        "1) Discourse – Concerns the relationships between the sentences in a summary, as well as those between individual sentences and the overall summary.",
        "2) Identification of entities – Involves the resolution of referential expressions such that each entity mentioned in a summary can easily be identified by the reader.",
        "3) Temporal – Concerns the establishment of the correct temporal relationships between events.",
        "4) Grammar – Concerns the correction of grammatical problems, which may be the result of juxtaposing sentences from different sources, or due to the previous revisions that were made.",
        "5) Location/setting – Involves establishing",
        "where each event in a summary takes place.",
        "Explanations of the specific pragmatic concerns in each category, as well as their corresponding operator(s), are detailed in the appendix.",
        "Overall, 160 revisions were made across the 15 summaries.",
        "The majority (82%) of the revisions fall into the first three categories.",
        "This is not surprising, as in MDS, we expect to find many problems relating to discourse – such as abrupt topic shifts or redundant messages.",
        "Additionally, concerns relating to the identification of entities in the text are likely to occur when the sentence from the original document that introduced an entity is not included in the resulting summary, but sentences that make reference to the entity are included.",
        "Finally, it may not be clear when events described in a summary occurred.",
        "This could be because sentences which stated when the event occurred were left out of the summary or because the sentences include relative time expressions such as ‘today’ even though the stories were written at different times or on different days.",
        "Revisions relating to grammar or to establishing where an event occurred were less frequently used, accounting for only 12% and 6% of the total repairs, respectively.",
        "Sentences extracted from the original news stories are usually grammatical.",
        "However, problems related to grammar may arise from previous revisions.",
        "In our corpus, the place or setting of an event was typically obvious in the summary and rarely required repair.",
        "Next, we present the analysis of revisions within each of the five categories.",
        "We are interested in revising our summaries to be as coherent as possible, without having to implement complicated and knowledge-intensive discourse models.",
        "Therefore, we will discuss the feasibility of implementing the revisions in our taxonomy automatically."
      ]
    },
    {
      "heading": "5.1 Discourse-related concerns in MDS",
      "text": [
        "It is intuitive that problems relating to discourse are abundant in our summaries and, at the same time, that such repairs would be the most difficult to make.",
        "The first obstacle is the detection of each of these concerns, which requires knowledge of the rhetorical relations of the sentences in the summary.",
        "In all the instances of topic shift and lack of purpose in our corpus, a phrase or an entire sentence was added to provide a transition or motivation for the troublesome sentence.",
        "Therefore, our module would require the ability to generate text, in order to repair these problems, which occur often in our summaries."
      ]
    },
    {
      "heading": "5.2 Identification of entities in MDS",
      "text": [
        "Nine specific problems were found that concern the reader’s ability to identify each entity mentioned in a summary.",
        "Most of these revisions could be made using rewrite rules.",
        "For example, if it can be determined that a definite article is used when a (non-proper noun) entity is mentioned for the first time, the misused definite article could be replaced with the corresponding indefinite article.",
        "The most frequent problem, underspecified entity, is the most difficult one to correct.",
        "This dis-fluency typically occurs where an entity is referred to by a proper noun or other noun phrase, such as the name of a person or organization, but has no title or further description.",
        "In such cases, the missing information may be found in the source document only.",
        "Therefore, to correct the underspecified entity problem, a revision module might require a knowledge source for the profiles of entities mentioned in a summary.",
        "When an entity is introduced for the first time in a summary, it should be associated with its description (such as a title and full name for a person).",
        "Discourse information would be useful for solving problems such as a bare anaphor or missing subject.",
        "In revising single-document summaries, [Mani et al., 1999] employed rules such as the referencing of pronouns with the most recently mentioned noun phrase.",
        "However, this might be inappropriate in MDS, where the use of multiple documents increases the number of possible entities with which an anaphor could be referenced."
      ]
    },
    {
      "heading": "5.3 Temporal relationships in MDS",
      "text": [
        "An important aspect of revision in MDS is the establishment of the correct temporal relationships between the events described in a summary.",
        "We have identified five types of problems that fall into this category.",
        "The most frequent revision in this category for our multi-document summaries was temporal ordering.",
        "This is an important consideration for the summarization of news articles, which typically describe several events or a series of events in a given news story.",
        "A revision module might use metadata, including the time stamps of source documents, in addition to surface properties of sentences in addressing this problem.",
        "Temporal relations were typically established by adding a time expression to one or more sentences in a summary.",
        "Therefore, our module will require a dictionary of such expressions as well as a set of rules for assigning an appropriate expression to a given sentence.",
        "For example, if the time stamps of two source documents from which two adjacent summary sentences come indicate that they were written one day apart, an appropriate way to order them might be: add a time expression indicating the day to the first sentence, and a relative time expression such as ‘the following day’ to the second sentence.",
        "Our dictionary will require both relative and absolute time expressions at different levels of granularity (hour, day, etc.).",
        "Most of the temporal revisions in our corpus were made at points where sentences from different sources followed one another or when sentences from the same source were far apart in the original document.",
        "By using such clues, it is hoped that temporal relations problems in summaries can be corrected without knowledge of the discourse."
      ]
    },
    {
      "heading": "5.4 Grammatical concerns in MDS",
      "text": [
        "The majority of grammatical problems in our corpus resulted from previous revisions performed on the text.",
        "For example, the addition of information to a sentence can result in it becoming too long.",
        "Such concerns can also occur because the grammar of one sentence, such as verb tense, does not match that of the next sentence.",
        "A revision module should be able to correct the above concerns using rules applied after other revisions are made and without any discourse knowledge."
      ]
    },
    {
      "heading": "5.5 Location/setting concerns",
      "text": [
        "The least frequent type of revision made in our corpus related to establishing the correct locations of events in a summary.",
        "Occasionally, a sentence in a summary retains the place/source stamp that appears at the beginning of a news article.",
        "This appears ungrammatical unless the sentence is the first in the summary.",
        "In addition, such stamps might be inappropriate for a summary, since not all the sentences may share the same location.",
        "In order to promote cohesion in the summary, our module could move the stamp information into the body of the summary.",
        "Sentences could be missing location information altogether.",
        "In such cases, the revision module might require information from the source documents in order to repair this problem.",
        "Overall, the revisions related to establishing the location of events should not require knowledge of discourse in the summary.",
        "Adding location information can usually be performed with the addition of a prepositional phrase, usually at the beginning of the sentence."
      ]
    },
    {
      "heading": "6 Conclusions and future work",
      "text": [
        "This paper represents preliminary work in our efforts to address problems of text cohesion and coherence in multi-document summaries via revision.",
        "As a first step, we need to identify the specific problems that occur in MDS and consider how we might address such concerns.",
        "To this end, we have investigated the optimal revisions that were performed on a small set of summaries.",
        "From this analysis, we have formulated a taxonomy of pragmatic concerns and their operators for repairing multi-document summaries.",
        "There is a scale of revision operations that can be performed (as shown in Figure 3), ranging from concrete repairs that require only knowledge of the surface structures of sentences, to knowledge-intensive repairs that cannot be implemented without a discourse model.",
        "In the future, we plan to formalize our framework so that we might be able to implement such revision strategies automatically.",
        "Of course, such an automatic process will be much more constrained in the revisions it can apply, unlike the human reviser in our current study.",
        "For example, in automating the repair process we will be restricted to using only material from the source documents.",
        "In addition, we may expand our taxonomy as necessary in exploring additional data.",
        "We will need to relate revision in MDS to",
        "CST since revision required in a given summary depends on the relationships between sentences.",
        "Finally, we would like use the corpus of data we have collected to learn revision automatically."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors would like to thank Naomi Daniel, Hong Qi, Adam Winkel, Zhu Zhang and three anonymous reviewers for their helpful comments and feedback on this paper.",
        "This work was partially supported by the National Science Foundation’s Information Technology Research program (ITR) under grant IIS-0082884.",
        "The version of MEAD that we used was developed at the Johns Hopkins summer workshop in 2001 under the direction of Dragomir Radev.",
        "We want to thank the following individuals for their work on MEAD: Sasha Blair-Goldensohn, John Blitzer, Arda Celebi, Elliott Drabek, Wai Lam, Danyu Liu, Hong Qi, Horacio Saggion and Simone Teufel."
      ]
    },
    {
      "heading": "References",
      "text": [
        "[Barzilay et al., 2001] Regina Barzilay, Noemie Elhadad, and Kathleen R. McKeown.",
        "Sentence ordering in multi-document summarization.",
        "In Proceedings of HLT, San Diego, CA, 2001.",
        "[Filatova & Hovy, 2001] Elena Filatova and Eduard Hovy.",
        "Assigning timestamps to event-clauses.",
        "In Proceedings, ACL Workshop on Temporal and Spatial Information Processing, Toulouse, France, July 2001.",
        "[Goldstein et al., 2000] Jade Goldstein, Mark Kan-trowitz, Vibhu Mittal, and Jamie Carbonell.",
        "Summarizing text documents: sentence selection and evaluation metrics.",
        "In Proceedings of the 22nd ACM SIGIR Conference on Research and Development in Information Retrieval, Berkeley, CA, 1999.",
        "[Halliday & Hasan, 1976] M. Halliday and R. Hasan.",
        "Cohesion in English.",
        "London: Longman, 1976.",
        "[Harabagiu, 1999] Sanda M. Harabagiu.",
        "From lexical cohesion to textual coherence: a data driven perspective.",
        "Journal of Pattern Recognition and Artificial Intelligence, 13(2): 247-265, 1999.",
        "[Hovy, 1993] Eduard Hovy.",
        "Automated discourse generation using discourse structure relations.",
        "Artificial Intelligence 63, Special Issue on Natural Language Processing, 1993.",
        "[Jing & McKeown, 2000] Hongyan Jing and Kathleen R. McKeown.",
        "Cut and paste based text summarization.",
        "In Proceedings of the 1st Conference of the North American Chapter of the Association for Computational Linguistics (NAACL'00), Seattle, WA, May 2000.",
        "[Mani et al., 1999] Inderjeet Mani, Barbara Gates, and Eric Bloedorn.",
        "Improving summaries by revising them.",
        "In Proceedings of the 37th Annual Meeting of the ACL ’99, pages 558-565, Maryland, 1999.",
        "[Mann & Thompson, 1988] William C. Mann and Sandra A. Thompson.",
        "Rhetorical structure theory: toward a functional theory of text organization.",
        "Text, 8(3), 1988.",
        "[Marcu, 1997] Daniel Marcu.",
        "From discourse structure to text summaries.",
        "In Proceedings of the ACL ’97 EACL ’97 Workshop on Intelligent Scalable Text Summarization, pages 82-88, Madrid, Spain, July 1997.",
        "[Marcu, 2000] Daniel Marcu.",
        "The theory and practice of discourse parsing and summarization, The MIT Press, November 2000.",
        "[Radev, 2000] Dragomir Radev.",
        "A common theory of information fusion from multiple text sources, step one: cross-document structure.",
        "In Proceedings, 1st ACL SIGDIAL Workshop on Discourse and Dialogue, Hong Kong, October 2000.",
        "[Radev et al., 2000] Dragomir R. Radev, Hongyan Jing and Malgorzata Budzikowska.",
        "Centroid-based summarization of multiple documents: sentence, extraction, utility-based evaluation, and user studies.",
        "In ANLP/NAACL Workshop on Summarization, Seattle, WA, April 2000.",
        "[Radev et al., 2002] Dragomir Radev, Simone Teufel, Horacio Saggion, Wai Lam, John Blitzer, Arda Celebi, Hong Qi, Daniu Liu and Elliot Drabek.",
        "Evaluation challenges in large-scale multi-document summarization: the MEAD project.",
        "Submitted to SIGIR 2002, Tampere, Finland, August 2002.",
        "[Zhang et al., 2002] Zhu Zhang, Sasha Blair-Goldensohn, and Dragomir Radev.",
        "Towards CST-enhanced summarization.",
        "To appear in AAAI 2002, August 2002.",
        "ADD transitional sentence or phrase In a related story, the government of Hong Kong announced a proposal to require all drug rehabilitation centers.... ADD a sentence or phrase that motivates the problematic segment In order to assist the ongoing investigation as to the cause of the crash, the U.S. team from the National Transportation Safety Board will join experts..."
      ]
    },
    {
      "heading": "2) Purpose",
      "text": [
        "Sentence lacks purpose in the context of the summary Information in a given sentence contrasts with that in one or more previous sentences ADD a discourse marker such as ‘however’ or ‘to contrast’ MODIFY existing discourse marker However, according to reports on CNN, the control tower was concerned with the velocity and altitude of the plane, and had discussed these concerns with the pilot.",
        "A newly mentioned entity has no description or title; acronym is used with no name ADD full name, description or title for new entity; MODIFY acronym by expanding Mrs. Clarie Lo, the Commissioner of Narcotics, said the proposal would be introduced for non-medical drug treatment centers.",
        "A noun phrase referring to an entity contains redundant information (full name and title, etc.)",
        "A noun phrase describing an entity occurs too often in a given context.",
        "3) Repeated entity MODIFY replace NP with a pronoun; MODIFY use acronym In April 2000, Mrs.",
        "Lo announced that the number of young people abusing drugs fell in 1999.",
        "She said, “The number of drug abusers aged below 21...” ...the 28,000 Americans, who work at nearby naval bases.",
        "They crowded into Subic Bay Naval Base as a bizarre tropical blizzard...",
        "Sentence is missing subject/agent (perhaps as result of previous revision) 4) Missing entity ADD noun phrase or pronoun 5) Misused indefinite article An indefinite article is used with a previously introduced entity MODIFY change indefinite article to definite.",
        "The government of announced a proposal ... One year later, it announced that it intends to implement the proposed scheme.",
        "6) Misused definite article A definite article is used with a new entity MODIFY change definite article to indefinite article if entity is new.",
        "On Thursday, a second eruption appeared to be smaller than anticipate."
      ]
    },
    {
      "heading": "7) Missing article",
      "text": []
    }
  ]
}
