{
  "info": {
    "authors": [
      "Steven Abney",
      "Robert E. Schapire",
      "Yoram Singer"
    ],
    "book": "Joint SIGDAT Conference on Empirical Methods in Natural Language Processing and Very Large Corpora",
    "id": "acl-W99-0606",
    "title": "Boosting Applied to Tagging and PP Attachment",
    "url": "https://aclweb.org/anthology/W99-0606",
    "year": 1999
  },
  "references": [
    "acl-C94-2195",
    "acl-H94-1048",
    "acl-J93-2004",
    "acl-J93-2006",
    "acl-P95-1037",
    "acl-P98-1029",
    "acl-W95-0103",
    "acl-W96-0213"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Boosting is a machine learning algorithm that is not well known in computational linguistics.",
        "We apply it to part-of-speech tagging and prepositional phrase attachment.",
        "Performance is very encouraging.",
        "We also show how to improve data quality by using boosting to identify annotation errors."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Boosting is a machine learning algorithm that has been applied successfully to a variety of problems, but is almost unknown in computational linguistics.",
        "We describe experiments in which we apply boosting to part-of-speech tagging and prepositional phrase attachment.",
        "Results on both PP-attachment and tagging are within sampling error of the best previous results.",
        "The current best technique for PP-attachment (backed-off density estimation) does not perform well for tagging, and the current best technique for tagging (maxent) is below state-of-the-art on PP-attachment.",
        "Boosting achieves state-of-the-art performance on both tasks simultaneously.",
        "The idea of boosting is to combine many simple \"rules of thumb,\" such as \"the current word is a noun if the previous word is the.\"",
        "Such rules often give incorrect classifications.",
        "The main idea of boosting is to combine many such rules in a principled manner to produce a single highly accurate classification rule.",
        "There are similarities between boosting and transformation-based learning (Brill, 1993): both build classifiers by combining simple rules, and both are noted for their resistance to overfitting.",
        "But boosting, unlike transformation-based learning, rests on firm theoretical foundations; and it outperforms transformation-based learning in our experiments.",
        "There are also superficial similarities between boosting and maxent.",
        "In both, the parameters are weights in a log-linear function.",
        "But in maxent, the log-linear function defines a probability, and the objective is to maximize likelihood, which may not minimize classification error.",
        "In boosting, the log-linear function defines a hyperplane dividing examples into (binary) classes, and boosting minimizes classification error directly.",
        "Hence boosting is usually more appropriate when the objective is classification rather than density estimation.",
        "A notable property of boosting is that it maintains an explicit measure of how difficult it finds particular training examples to be.",
        "The most difficult examples are very often mislabelled examples.",
        "Hence, boosting can contribute to improving data quality by identifying annotation errors."
      ]
    },
    {
      "heading": "2 The boosting algorithm AdaBoost",
      "text": [
        "In this section, we describe the boosting algorithm AdaBoost that we used in our experiments.",
        "AdaBoost was first introduced by Freund and Schapire (1997); the version described here is a (slightly simplified) version of the one given by Schapire and Singer (1998).",
        "A formal description of AdaBoost is shown in Figure 1.",
        "AdaBoost takes as input a training set of m labeled examples ((xi , yi), , (x,„ yin)) where xi is an example (say, as described by a vector of attribute values), and yi E – 1, -1-11 is the label associated with x2.",
        "For now, we focus on the binary case, in which only two labels (positive or negative) are possible.",
        "Multiclass problems are discussed later.",
        "Formally, the rules of thumb mentioned in the introduction are called weak hypotheses.",
        "Boosting assumes access to an algorithm or subroutine for generating weak hypotheses called the weak learner.",
        "Boosting can be combined with any suitable weak learner; the one that we used will be described below.",
        "AdaBoost calls the weak learner repeatedly in a series of rounds.",
        "On round t, AdaBoost provides the weak learner with a set of importance weights over the training set.",
        "In response, the weak learner corn",
        "where xi E X, yi E – 1, +1} Initialize D1(i) = 1/m.",
        "For t 1, .",
        ".",
        ".",
        ", T:",
        "• Train weak learner using distribution D. • Get weak hypothesis ht : X – > R. • Update:",
        "where Zt is a normalization factor (chosen so that Dt+1 will be a distribution).",
        "Output the final hypothesis:",
        "putes a weak hypothesis ht that maps each example x to a real number ht(x).",
        "The sign of this number is interpreted as the predicted class (-1 or +1) of example x, while the magnitude I ht (x)1 is interpreted as the level of confidence in the prediction, with larger values corresponding to more confident predictions.",
        "The importance weights are maintained formally as a distribution over the training set.",
        "We write D(i) to denote the weight of the ith training example (xi, yi) on the tth round of boosting.",
        "Initially, the distribution is uniform.",
        "Having obtained a hypothesis ht from the weak learner, AdaBoost updates the weights by multiplying the weight of each example i byl If ht incorrectly classified example i so that ht(xt) and yi disagree in sign, then this has the effect of increasing the weight on this example, and conversely the weights of correctly classified examples are decreased.",
        "Moreover, the greater the confidence of the prediction (that is, the greater the magnitude of ht(si)), the more drastic will be the effect of the update.",
        "The weights are then renormalized, resulting in the update rule shown in the figure.",
        "In our experiments, we used cross validation to choose the number of rounds T. After T rounds, ISchapire and Singer (1998) multiply instead by exp( – mat ht(xj)) where at E R is a parameter that needs to be set.",
        "In the description presented here, we fold cxt into ht.",
        "AdaBoost outputs a final hypothesis which makes predictions using a simple vote of the weak hy-potheses' predictions, taking into account the varying confidences of the different predictions.",
        "A new example x is classified using",
        "where the label predicted for x is sign( f (x))."
      ]
    },
    {
      "heading": "2.1 Finding weak hypotheses",
      "text": [
        "In this section, we describe the weak learner used in our experiments.",
        "Since we now focus on what happens on a single round of boosting, we will drop t subscripts where possible.",
        "Schapire and Singer (1998) prove that the training error of the final hypothesis is at most n"
      ]
    },
    {
      "heading": "..Tt-1 Z.",
      "text": [
        "This suggests that the training error can be greedily driven down by designing a weak learner which, on round t of boosting, attempts to find a weak hypothesis h that minimizes",
        "This is the principle behind the weak learner used in our experiments.",
        "In all our experiments, we use very simple weak hypotheses that test the value of a Boolean predicate and make a prediction based on that value.",
        "The predicates used are of the form \"a = v\", for a an attribute and v a value; for example, \"PreviousWord = the\".",
        "In the PP-attachment experiments, we also considered conjunctions of such predicates.",
        "If, on a given example x, the predicate holds, the weak hypothesis outputs prediction Th., otherwise Po, where P1 and po are determined by the training data in a way we describe shortly.",
        "In this setting, weak hypotheses can be identified with predicates, which in turn can be thought of as features of the examples; thus, in this setting, boosting can be viewed as a feature-selection method.",
        "Let 0(x) E {0, 1} denote the value of the predicate 0 on the example x, and for b E 10,11, let Pb E R be the prediction of the weak hypothesis when 0(x) = b.",
        "Then we can write simply h(x) po(x).",
        "Given a predicate 0, we choose po and pi.",
        "to minimize Z. Schapire and Singer (1998) show that Z is minimized when we let",
        "in the literature.",
        "B = (Brill and Wu, 1998); M = (Magerman, 1995); 0 = our data; R = (Ratna-parkhi, 1996); W = (Weischedel and others, 1993).",
        "for b E {0, 1} where VI/ is the sum of D(i) for examples i such that yi = s and 0 (xj) = b.",
        "This choice of Pb implies that",
        "This expression can now be minimized over all choices of 0.",
        "Thus, our weak learner works by searching for the predicate 0 that minimizes Z of Eq.",
        "(2), and the resulting weak hypothesis h(x) predicts P(x) of Eq.",
        "(1) on example x.",
        "In practice, very large values of po and pi can cause numerical problems and may also lead to overfitting.",
        "Therefore, we usually \"smooth\" these values using the following alternate choice of Pb given by Schapire and Singer (1998):"
      ]
    },
    {
      "heading": "2.2 Multiclass problems",
      "text": [
        "So far, we have only discussed binary classification problems.",
        "In the multiclass case (in which more than two labels are possible), there are many possible extensions of AdaBoost (Freund and Schapire, 1997; Schapire, 1997; Schapire and Singer, 1998).",
        "Our default approach to multiclass problems is to use Schapire and Singer's (1998) AdaBoost.MH algorithm.",
        "The main idea of this algorithm is to regard each example with its multiclass label as several binary-labeled examples.",
        "More precisely, suppose that the possible classes are 1, , k. We map each original example x with label y to k binary labeled derived examples (x , 1), .",
        ".",
        ".",
        ", (x, k) where example (x, c) is labeled +1 if c = y and – 1 otherwise.",
        "We then essentially apply binary AdaBoost to this derived problem.",
        "We maintain a distribution over pairs (x, c), treating each such as a separate example.",
        "Weak hypotheses are identified with predicates over (x, c) pairs, though they now ignore c, so that we can continue to use the same space of predicates as before.",
        "The prediction weights p(cp, however, are chosen separately for each class c; we have ht(x , c) = Kqx).",
        "Given a new example x, the final hypothesis makes confidence-weighted predictions",
        "for each of the discrimination questions (c 1?",
        "c = 2?",
        "etc.",
        "); the class is predicted to be the value of c that maximizes f (x, c).",
        "For more detail, see the original paper (Schapire and Singer, 1998).",
        "When memory limitations prevent the use of Ad-aBoost.MH, an alternative we have pursued is to use binary AdaBoost to train separate discriminators (binary classifiers) for each class, and combine their output by choosing the class c that maximizes fc(x), where f(x) is the final confidence-weighted prediction of the discriminator for class c. Let us call this algorithm AdaBoost.MI (multiclass, independent discriminators).",
        "It differs from AdaBoost.MH in that predicates are selected independently for each class; we do not require that the weak hypothesis at round t be the same for all classes.",
        "The number of rounds may also differ from discriminator to discriminator."
      ]
    },
    {
      "heading": "3 Tagging",
      "text": []
    },
    {
      "heading": "3.1 Corpus",
      "text": [
        "To facilitate comparison with previous results, we used the UPenn Treebank corpus (Marcus et al., 1993).",
        "The corpus uses 80 labels, which comprise 45 parts of speech properly so-called, and 35 indeterminate tags, representing annotator uncertainty.",
        "We introduce an 81st label, ##, for paragraph separators.",
        "An example of an indeterminate tag is NNIJJ, which indicates that the annotator could not decide between NN and JJ.",
        "The \"right\" thing to do with indeterminate tags would either be to eliminate them or to count the tagger's output as correct if it agrees with any of the alternatives.",
        "Previous work appears to treat them as separate tags, however, and we have followed that precedent.",
        "We partitioned the corpus into three samples: a test sample consisting of 1000 randomly selected",
        "paragraphs (54,194 tokens), a development sample, also of 1000 paragraphs (52,087 tokens), and a training sample (1,207,870 tokens).",
        "Some previously reported results on the Treebank corpus are summarized in Table 1.",
        "These results are all based on the Treebank corpus, but it appears that they do not all use the same training-test split, nor the same preprocessing, hence there may be differences in details of examples and labels.",
        "The \"MF tag\" method simply uses the most-frequent tag from training as the predicted label.",
        "The voting scheme combines the outputs of four other taggers."
      ]
    },
    {
      "heading": "3.2 Applying Boosting to Tagging",
      "text": [
        "The straightforward way of applying boosting to tagging is to use AdaBoost.MH.",
        "Each word token represents an example, and the classes are the 81 part-of-speech tags.",
        "Weak hypotheses are identified with \"attribute=value\" predicates.",
        "We use a rather spare attribute set, encoding less context than is usual.",
        "The attributes we use are:",
        "• Lexical attributes: The current word as a downcased string (S); its capitalization (C); and its most-frequent tag in training (T).",
        "T is unknown for unknown words.",
        "• Contextual attributes: the string (LS), capitalization (LC), and most-frequent tag (LT) of the preceding word; and similarly for the following word (RS, RC, RT).",
        "• Morphological attributes: the inflectional suffix (I) of the current word, as provided by",
        "an automatic stemmer; also the last two (S2) and last three (S3) letters of the current word.",
        "We note in passing that the single attribute T is a good predictor of the correct label; using T as the predicted label gives a 7.7% error rate (see Table 1).",
        "Experiment 1.",
        "Because of memory limitations, we could not apply AdaBoost.MH to the entire training sample.",
        "We examined several approximations.",
        "The simplest approximation (experiment 1) is to run AdaBoost.MH on 400K training examples,",
        "instead of the full training set.",
        "Doing so yields a test error of 3.68%, which is actually as good as using Markov 3-grams (Table 1).",
        "Experiment 2.",
        "In experiment 2, we divided the training data into four quarters, trained a classifier using AdaBoost.MH on each quarter, and combined the four classifiers using (loosely speaking) a final round of boosting.",
        "This improved test error significantly, to 3.32%.",
        "In fact, this tagger performs as well as any single tagger in Table 1 except the Maxent tagger.",
        "Experiment 3.",
        "In experiment 3, we reduced the training sample by eliminating unambiguous words (multiple tags attested in training) and indefinite tags.",
        "We examined all indefinite-tagged examples and made a forced choice among the alternatives.",
        "The result is not strictly comparable to results on the larger tagset, but since only 5 out of 54K test examples are affected, the difference is negligible.",
        "This yielded a multiclass problem with 648K examples and 39 classes.",
        "We constructed a separate classifier for unknown words, using AdaBoost.MH.",
        "We used hapax legomena (words appearing once) from our training sample to train it.",
        "The error rate on unknown words was 19.1%.",
        "The overall test error rate was 3.59%, intermediate between the error rates in the two previous experiments.",
        "Experiment 4.",
        "One obvious way of reducing the training data would be to train a separate classifier for each word.",
        "However, that approach would result in extreme data fragmentation.",
        "An alternative is to cut the data in the other direction, and build a separate discriminator for each part of speech, and",
        "function of the number of rounds of boosting for the PP-attachment problem.",
        "combine them by choosing the part of speech whose discriminator predicts 'Yes' with the most confidence (or 'No' with the least confidence).",
        "We took this approach – algorithm AdaBoost.MI – in experiment 4.",
        "To choose the appropriate number of rounds for each discriminator, we did an initial run, and chose the point at which error on the development sample flattened out.",
        "To handle unknown words, we used the same unknown-word classifier as in experiment 3.",
        "The result was the best for any of our experiments: a test error rate of 3.28%, slightly better than experiment 2.",
        "The 3.28% error rate is not significantly different (at p = 0.05) from the error rate of the best-known single tagger, Ratnaparkhi's Maxent tagger, which achieves 3.11% error on our data.",
        "Our results are not as good as those achieved by Brill and Wu's voting scheme.",
        "The experiments we describe here use very simple features, like those used in the Maxent or transformation-based taggers; hence the results are not comparable to the multiple-tagger voting scheme.",
        "We are optimistic that boosting would do well with tagger predictions as input features, but those experiments remain to be done.",
        "Table 2 breaks out the error sources for experiment 4.",
        "Table 3 sums up the results of all four experiments.",
        "Experiment 5 (Sequential model).",
        "To this point, tagging decisions are made based on local context only.",
        "One would expect performance to improve if we consider a Viterbi-style optimization to choose a globally best sequence of labels.",
        "Using decision sequences also permits one to use true tags, rather than most-frequent tags, on context tokens.",
        "We did a fixed 500 rounds of boosting, testing against the development sample.",
        "Surprisingly, the sequential model performed much less well than the local-decision models.",
        "The results are summarized in Table 4."
      ]
    },
    {
      "heading": "4 Prepositional phrase attachment",
      "text": [
        "In this section, we discuss the use of boosting for prepositional phrase (PP) attachment.",
        "The cases of PP-attachment that we address define a binary classification problem.",
        "For example, the sentence Congress accused the president of peccadillos is classified according to the attachment site of the prepositional phrase: attachment to N: accused [the president of peccadillos]",
        "accused [the president] [of peccadillos] The UPenn Treebank-II Parsed Wall Street Journal corpus includes PP-attachment information, and PP-attachment classifiers based on this data have been previously described in Ratnaparkhi, Reynar, Roukos (1994), Brill and Resnik (1994), and Collins and Brooks (1995).",
        "We consider how to apply boosting to this classification task.",
        "We used the same training and test data as Collins and Brooks (1995).",
        "The instances of PP-attachment considered are those involving a verb immediately followed by a simple noun phrase (the direct object) and a prepositional phrase (whose attachment is at issue).",
        "Each PP-attachment example is represented by its value for four attributes: the main verb (V), the head word of the direct object (N1), the preposition (P), and the head word of the object of the preposition (N2).",
        "For instance, in example 4 above, V = accused, N1 = president, P = of, and N2 = peccadillos.",
        "Examples have binary labels: positive represents attachment to noun, and negative represents attachment to verb.",
        "The training set comprises 20,801 examples and the test set contains 3, 097 examples; there is also a separate development set of 4, 039 examples.",
        "The weak hypotheses we used correspond to \"attribute=value\" predicates and conjunctions thereof.",
        "That is, there are 16 predicates that are considered for each example.",
        "For example 4, three of these 16 predicates are (V = accused A N1 = president A N2 = peccadillos), (P = with), and (V = accused A P = of).",
        "As described in section 2.1, a weak hypothesis produces one of two real-valued predictions mph depending on the value of",
        "its predicate.",
        "We found that little information was conveyed by knowing that a predicate is false.",
        "We therefore forced each weak hypothesis to abstain if its predicate is not satisfied – that is, we set po to 0 for all weak hypotheses.",
        "Two free parameters in boosting are the number of rounds T and the smoothing parameter 6 for the confidence values (see Eq.",
        "(3)).",
        "Although there are theoretical analyses of the number of rounds needed for boosting (Freund and Schapire, 1997; Schapire et al., 1997) and for smoothing (Schapire and Singer, 1998), these tend not to give practical answers.",
        "We therefore used the development sample to set these parameters, and chose T = 20,000 and E = 0.001.",
        "On each round of boosting, we consider every predicate relevant to any example, and choose the one that minimizes Z as given by Eq.",
        "(2).",
        "In Table 5 we list the weak hypotheses chosen on the first five rounds of boosting, together with their assigned confidence 731.",
        "Recall that a positive value means that noun attachment is predicted.",
        "Note that all the weak hypotheses chosen on the first rounds test the value of a single attribute: boosting starts with general tendencies and moves toward less widely applicable but higher-precision tests as it proceeds.",
        "In 20, 000 rounds of boosting, single-attribute tests were chosen 4,615 times, two-attribute tests were chosen 4,146 limes, three-attribute tests were chosen 2,779 times, and four-attribute tests were chosen 8,460 times.",
        "It is possible for the same predicate to be chosen in multiple rounds; in fact, predicates were chosen about twice on average.",
        "The final hypothesis considers 9, 677 distinct predicates.",
        "We can define the total weight of a predicate to be the sum of pi 's over the rounds in which it is chosen; this represents how big a vote the predicate has on examples it applies to.",
        "We expect more-specific hypotheses to have more weight – otherwise they would not be able to overrule more-general hypotheses, and there would be no point in having them.",
        "This is confirmed by examining the predicates with the greatest weight (in absolute value) after 20,000 rounds of boosting, as shown in Table 6.",
        "After 20, 000 rounds of boosting the test error was down to 14.6 ± 0.6%.",
        "This is indistinguishable from the best known results for this problem, namely, 14.5± 0.6%, reported by Collins and Brook on exactly the same data.",
        "In Figure 2, we show the training and test error as a function of the number of rounds of boosting.",
        "The boosted classifier has the advantage of being much more compact than the large decision list built by Collins and Brooks using a back-off method.",
        "We also did not take into account the linguistic knowledge used by Collins and Brooks who, for instance, disallowed tests that ignore the preposition.",
        "Compared to maximum entropy methods (Ratnaparkhi et al., 1994), although the methods share a similar structure, the boosted classifier achieves an error rate which is significantly lower."
      ]
    },
    {
      "heading": "5 Using boosting to improve data quality",
      "text": [
        "The importance weights that boosting assigns to training examples are very useful for improving data quality.",
        "Mislabelled examples resulting from annotator errors tend to be hard examples to classify correctly; hence they tend to have large weight in the",
        "prey word tagged word next word corpus label correct label To be NN TO with the Big JJ DT 44 the only NN DT – and at JJ CC for most of JJ JJS We have some VBN VBP – and JJ CC – a new IN DT by A 's NNP DT <13> But in IN CC and what NN CC were out VB VBP n't make the VBP VB have thought by VBD VBN will have to VBP VB the first big RB JJ be involved in JJ VBN A 's NNP POS including as much JJ RB Half the DT PDT were out VB VBP in both gold CC (DT) said to VBN to one 's NN PRP to one 's NN PRP the only NN PRP to long-term NN (RB) have called for VBD VBN have called for VBD VBN with the Big JJ DT was his before PRP PRP$ have thought by VBD VBN 30 more JJ NN of have and JJ",
        "final distribution DT±i(i).",
        "If we rank examples by their weight in the final distribution, mislabelled examples tend to cluster near the top.",
        "Table 7 shows the training examples with the greatest weight in tagging experiment 4.",
        "All but two represent annotator errors, and one of the two non-errors is a highly unusual construction (\"a lot of have and have-not markets\").",
        "Table 8 similarly illustrates the highest-weight examples from the PP-attachment data.",
        "Many of these are errors, though others are genuinely difficult to judge."
      ]
    }
  ]
}
