{
  "info": {
    "authors": [
      "Marta Recasens",
      "Marie-Catherine de Marneffe",
      "Christopher Potts"
    ],
    "book": "NAACL",
    "id": "acl-N13-1071",
    "title": "The Life and Death of Discourse Entities: Identifying Singleton Mentions",
    "url": "https://aclweb.org/anthology/N13-1071",
    "year": 2013
  },
  "references": [
    "acl-H05-1004",
    "acl-J12-2003",
    "acl-J95-2003",
    "acl-M95-1005",
    "acl-N06-2015",
    "acl-W10-4305",
    "acl-W11-1902",
    "acl-W12-4501",
    "acl-W12-4502"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "A discourse typically involves numerous entities, but few are mentioned more than once.",
        "Distinguishing discourse entities that die out after just one mention (singletons) from those that lead longer lives (coreferent) would benefit NLP applications such as coreference resolution, protagonist identification, topic mod-eling, and discourse coherence.",
        "We build a logistic regression model for predicting the singleton/coreferent distinction, drawing on linguistic insights about how discourse entity lifespans are affected by syntactic and semantic features.",
        "The model is effective in its own right (78% accuracy), and incorporating it into a state-of-the-art coreference resolution system yields a significant improvement."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Not all discourse entities are created equal.",
        "Some lead long lives and appear in a variety of discourse contexts (coreferent), whereas others never escape their birthplaces, dying out after just one mention (singletons).",
        "The ability to make this distinction based on properties of the NPs used to identify these referents (mentions) would benefit not only coreference resolution, but also topic analysis, textual entailment, and discourse coherence.",
        "The existing literature provides numerous generalizations relevant to answering the question of whether a given discourse entity will be singleton or coreferent.",
        "These involve the internal syntax and morphology of the target NP (Prince, 1981a; Prince, 1981b; Wang et al., 2006), the grammatical function and discourse role of that NP (Chafe, 1976; Hobbs, 1979; Walker et al., 1997; Beaver, 2004), and the interaction of all of those features with semantic operators like negation, modals, and attitude predicates (Karttunen, 1973; Karttunen, 1976; Kamp, 1981; Heim, 1982; Heim, 1992; Roberts, 1990; Groe-nendijk and Stokhof, 1991; Bittner, 2001).",
        "The first step in our analysis is to bring these insights together into a single logistic regression model ?",
        "the lifespan model ?",
        "and assess their predictive power on real data.",
        "We show that the features generally behave as the existing literature leads us to expect, and that the model itself is highly effective at predicting whether a given mention is singleton or coreferent.",
        "We then provide an initial assessment of the engineering value of making the singleton/coreferent distinction by incorporating our lifespan model into the Stanford coreference resolution system (Lee et al., 2011).",
        "This addition results in a significant improvement on the CoNLL-2012 Shared Task data, across the MUC, B3, CEAF, and CoNLL scoring algorithms."
      ]
    },
    {
      "heading": "2 Data",
      "text": [
        "All the data used throughout the paper come from the CoNLL-2012 Shared Task (Pradhan et al., 2012), which included the 1.6M English words from OntoNotes v5.0 (Hovy et al., 2006) that have been annotated with different layers of annotation (coreference, parse trees, etc.).",
        "We used the training, development (dev), and test splits as defined in the shared task (Table 1).",
        "Since the OntoNotes coreference annotations do not contain singleton mentions, we automatically marked as singletons all the NPs",
        "added singletons (NPs not annotated as coreferent).",
        "not annotated as coreferent.",
        "Thus, our singletons include non-referential NPs but not verbal mentions."
      ]
    },
    {
      "heading": "3 Predicting lifespans",
      "text": [
        "Our lifespan model makes a binary distinction between discourse referents that are not part of a coreference chain (singletons) and items that are part of one (coreferent).",
        "The distribution of lifespans in our data (Figure 1) suggests that this is a natural division.",
        "The propensity of singletons also highlights the relevance of detecting singletons for a coreference system.",
        "We fit a binary logistic regression model in R (R Core Team, 2012) on the training data, coding singletons as ?0?",
        "and coreferent mentions as ?1?.",
        "Throughout the following tables of coefficient estimates, positive values favor coreferents and negative ones favor singletons.",
        "We turn now to describing and motivating the features of this model.",
        "tons account for 56% of the data.",
        "Internal morphosyntax of the mention Table 2 summarizes the features from our model that concern the internal morphology and syntactic structure of the mention.",
        "Many are common in coreference systems (Recasens and Hovy, 2009), but our model highlights their influence on lifespans.",
        "The picture is expected on the taxonomy of given and new defined by Prince (1981b) and assumed throughout dynamic semantics (Kamp, 1981; Heim, 1982): pronouns depend on anaphoric connections to previous mentions for disambiguation and thus are very likely to be coreferent.",
        "This is corroborated by the positive coefficient estimate for ?Type = pronoun?",
        "in Table 2.",
        "Few quantified phrases easily participate in discourse anaphora (Partee, 1987; Wang et al., 2006), accounting for the association between quantifiers and singletons (negative coefficient estimate for ?Quantifier = quantified?",
        "in Table 2).",
        "The one surprise is the negative coefficient for indefinites.",
        "In theories stretching back to Karttunen (1976), indefinites function primarily to establish new discourse entities, and should be able to participate in coreference chains, but here the association with such chains is negative.",
        "However, interactions explain this fact (see Table 4 and our discussion of it).",
        "The person, number, and animacy values suggest that singular animates are excellent coreferent NPs, a previous finding of Centering Theory (Grosz et al., 1995; Walker et al., 1998) and of cross-linguistic work on obviative case-marking (Aissen, 1997).",
        "Our model also includes named-entity features for all of the eighteen OntoNotes entity-types (omitted from Table 2 for space and clarity reasons).",
        "As a rule, they behave like ?Type = proper noun?",
        "in associating with coreferents.",
        "The exceptions are ORDINAL, PERCENT, and QUANTITY, which seem intuitively unlikely to participate in coreference chains.",
        "Grammatical role of the mention Synthesizing much work in Centering Theory and information structuring, we conclude that coreferent mentions are likely to appear as core verbal arguments and will favor sentence-initial (topic-tracking) positions (Ward and Birner, 2004).",
        "The coefficient estimates",
        "in Table 3 corroborate these conclusions.",
        "To define the ?Relation?",
        "and ?In coordination?",
        "features, we used the Stanford dependencies (de Marneffe et al., 2006) on the gold constituents.",
        "Semantic environment of the mention Table 4 highlights the complex interactions between discourse anaphora and semantic operators.",
        "These interactions have been a focus of logical semantics since Karttunen (1976), whose guiding observation is semantic: an indefinite interpreted inside the scope of a negation, modal, or attitude predicate is generally unavailable for anaphoric reference outside of the scope of that operator, as in Kim didn't understand [an exam question]i.",
        "#Iti was too hard.",
        "Of course, such discourses cohere if the indefinite is interpreted as taking wide scope (?there is a question Kim didn't understand?).",
        "Such readings are often disfavored, but they become more salient when modifiers like certain are included (Schwarzschild, 2002) or when the determiner is sensitive to the polarity or intensionality of its environment (Baker, 1970; Ladusaw, 1980; van der Wouden, 1997; Israel, 1996; Israel, 2001; Giannakidou, 1999).",
        "Subsequent research identified many other factors that further extend or restrict the anaphoric potential of an indefinite (Roberts, 1996).",
        "We do not have direct access to semantic scope, but we expect syntactic scope to correlate strongly with semantic scope, so we used dependency representations to define features capturing syntactic scope for negation, modal auxiliaries, and a broad range of attitude predicates.",
        "These features tend to bias in favor of singletons because they so radically restrict the possibilities for intersentential anaphora.",
        "Interacting these features with those for the internal syntax of mentions is also informative.",
        "Since proper names and pronouns are not scope-taking, they are largely unaffected by the environment features, whereas indefinites emerge as even more restricted, just as Karttunen and others would predict.",
        "Attitude predicates seem initially anomalous, though.",
        "They share the relevant semantic properties with negation and modals, and yet they seem to facilitate coreference.",
        "Here, the findings of de Marneffe et al. (2012) seem informative.",
        "Those authors find that, in texts of the sort we are studying, attitude predicates are used predominantly to mark the source of information that is effectively asserted despite being embedded (Rooryck, 2001; Simons, 2007).",
        "That is, though X said p does not semantically entail p, it is often interpreted as a commitment to p, which correspondingly elevates mentions in p to main-clause status (Harris and Potts, 2009).",
        "Results The model successfully learns to tease singletons and coreferent mentions apart.",
        "Table 5 summarizes its performance on the dev set.",
        "The STANDARD model uses 0.5 as the decision boundary, with 78% accuracy.",
        "The CONFIDENT model predicts singleton if Pr < .2 and coreferent if Pr > .8, which increases precision (P) at a cost to recall (R)."
      ]
    },
    {
      "heading": "STANDARD CONFIDENT",
      "text": []
    },
    {
      "heading": "4 Application to coreference resolution",
      "text": [
        "To assess the usefulness of the lifespan model in an NLP application, we incorporate it into the Stanford coreference resolution system (Lee et al., 2011), which we take as our baseline.",
        "This was the highest-scoring system in the CoNLL-2011 Shared Task, and was also part of the highest-scoring system in the CoNLL-2012 Shared Task (Fernandes et al., 2012).",
        "It is a rule-based system that includes a total of ten rules (or ?sieves?)",
        "for entity coreference, such as exact string match and pronominal resolution.",
        "The sieves are applied from highest to lowest precision, each rule adding coreference links.",
        "Incorporating the lifespan model The lifespan model can improve coreference resolution in two different ways: (i) mentions classified as singletons should not be considered as either antecedents or coreferent, and (ii) mentions classified as coreferent should be linked with another mention(s).",
        "By successfully predicting singletons (i), we can enhance the system's precision; by successfully predicting coreferent mentions (ii), we can improve the system's recall.",
        "Here we focus on (i) and use the lifespan model for detecting singletons.",
        "This decision is motivated by two factors.",
        "First, given the large number of singletons (Figure 1), we are more likely to see a gain in performance from discarding singletons.",
        "Second, the multi-sieve nature of the Stanford coreference system does not make it straightforward to decide which antecedent a mention should be linked to even if we know that it is coreferent.",
        "We leave the incorporation of coreferent predictions for future work.",
        "To integrate the singleton model into the Stanford coreference system, we let a sieve consider whether a pair of mentions is coreferent only if neither of the two mentions are classified as singletons by our CONFIDENT model.",
        "Experiments on the dev set showed that the model often made wrong predictions for NEs.",
        "We do not trust the model for NE mentions.",
        "Performance on coreference (on the dev set) was higher with the CONFIDENT model than with the STANDARD model.",
        "Results and discussion To evaluate the coreference system with and without the lifespan model, we used the English dev and test sets from the CoNLL2012 Shared Task, presented in Section 2.",
        "Although the CoNLL shared task evaluated systems on only multi-mention (i.e., non-singleton) entities, by stopping singletons from being linked to multi-mention entities, we expected the lifespan model to increase the system's precision.",
        "Our evaluation uses five of the measures given by the CoNLL-2012 scorer: MUC (Vilain et al., 1995), B3 (Bagga and Baldwin, 1998), CEAF-?3 and CEAF-?4 (Luo, 2005), and the CoNLL official score (Denis and Baldridge, 2009).",
        "We do not include BLANC (Recasens and Hovy, 2011) because it assumes gold mentions and so is not suited for the scenario considered in this paper, which uses automatically predicted mentions.",
        "Table 6 summarizes the test set performance.",
        "All the scores are on automatically predicted mentions.",
        "We use gold POS, parse trees, and NEs.",
        "The base",
        "line is the Stanford system, and ?w/ Lifespan?",
        "is the same system extended with our lifespan model to discard singletons, as explained above.",
        "As expected, the lifespan model increases precision but decreases recall.",
        "Overall, however, we obtain a significant improvement of 0.5?1 points in the F1 score of MUC, CEAF-?3, CEAF-?4 and CoNLL.",
        "The drop in B3 traces to a bug in the CoNLL scorer's implementation of Cai and Strube (2010)'s algorithm for aligning gold and automatically predicted mentions, which affects the computation of B3 and CEAF-?3.1 Table 7 presents the results after modifying the CoNLL-2012 scorer to compute B3 and CEAF-?3 according to Cai and Strube (2010).2 We do see an improvement in the precision and F1 scores of B3, and the overall CoNLL score remains significant.",
        "The CEAF-?3 F1 score is no longer significant, but is still in the expected direction."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "We built a model to predict the lifespan of discourse referents, teasing apart singletons from coreferent mentions.",
        "The model validates existing linguistic insights and performs well in its own right.",
        "This alone has ramifications for tracking topics, identifying protagonists, and modeling coreference and discourse coherence.",
        "We applied the lifespan model to coreference resolution, showing how to incorporate it effectively into a state-of-the-art rule-based coreference system.",
        "We expect similar improvements with machine-learning-based coreference systems, where incorporating all the power of the lifespan model would be easier.",
        "Our lifespan model has been integrated into the latest version of the Stanford coreference resolution system.3 1At present, if the system links two mentions that do not exist in the gold standard, the scorer adds two singletons to the gold standard.",
        "This results in a higher B3 F1 score (when it should be lower) because recall increases instead of staying the same (precision goes up)."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We thank Emili Sapena for modifying the CoNLL2012 scorer to follow Cai and Strube (2010).",
        "This research was supported in part by ONR grant No.",
        "N00014-10-1-0109 and ARO grant No.",
        "W911NF-07-1-0216.",
        "The first author was supported by a Beatriu de Pino's postdoctoral scholarship (2010 BP-A 00149) from Generalitat de Catalunya."
      ]
    }
  ]
}
