{
  "info": {
    "authors": [
      "Jill Burstein",
      "Jane Shore",
      "John Sabatini",
      "Yong-Won Lee",
      "Matthew Ventura"
    ],
    "book": "Human Language Technologies: the Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL-HLT)",
    "id": "acl-N07-4002",
    "title": "The Automated Text Adaptation Tool",
    "url": "https://aclweb.org/anthology/N07-4002",
    "year": 2007
  },
  "references": [
    "acl-P05-1065",
    "acl-P98-2127"
  ],
  "sections": [
    {
      "text": [
        "Jill Bui stein, Jane Shore, John Sabatini, Yong-Won Lee & Matthew Ventura",
        "Educational Testing Service",
        "Rosedale Road MS 12R Princeton, New Jersey 08541 {jburstein, jshore, jsabatini , ylee, mventura}@ets.org",
        "1.",
        "Introduction",
        "Text adaptation is a teacher practice used to help with reading comprehension and English language skills development for English language learners (ELLs) (Carlo, August, McLaughlin, Snow, Dressler, Lippman, Lively, & White, 2004; Echevarria, Vogt and Short, 2004; Yano, Long and Ross, 1994).",
        "The practice of text adaptation involves a teacher's modification of texts to make them more understandable, given a student's reading level.",
        "Teacher adaptations include text summaries, vocabulary support (e.g., providing synonyms), and translation.",
        "It is a time-consuming, but critical practice for K-12 teachers who teach ELLs, since reading-level appropriate texts are often hard to find.",
        "To this end, we have implemented the Automated Text Adaptation Tool v.1.0 (ATA v.1.0): an innovative, educational tool that automatically generates text adaptations similar to those teachers might create.",
        "We have also completed a teacher pilot study.",
        "Schwarm and Ostendorf (2005), and Heilman, Collins-Thompson, Callan, and Eskenazi (2006) describe related research addressing the development of NLP-based reading support tools.",
        "During our interactive demonstration, conference participants can (a) login to the Internet-accessible tool, (b) import text files, and (c) experiment with adaptation features.",
        "We are currently interested in feedback from the computational linguistics community to inform tool development related to (a) feature enhancement, and (b) ideas for new NLP-based features.",
        "Until now, our primary source of feedback has been from teachers toward tool development from an educational perspective."
      ]
    },
    {
      "heading": "2.. The Automated Text Adaptation Tool",
      "text": [
        "NLP-based text adaptation capabilities in the tool are described in this section (also see Figure 1.)",
        "These adaptation features were selected for implementation since they resemble teacher-based adaptation methods.",
        "Pedagogically, marginal notes are a kind of text summary.",
        "The Rhext automatic summarization tool (Marcu, 2000) is used to produce marginal notes in English.",
        "The amount of marginal notes generated can be increased or decreased based on students' needs.",
        "Using Language Weaver'sEnglish-to-Spanish machine translation system, English marginal notes can be translated into Spanish.",
        "Synonyms for lower frequency (more difficult) words are output using a statistically-generated word similarity matrix (Lin, 1998).",
        "ATA v.1.0 generates antonyms for vocabulary in the text using WordNet®.",
        "Cognates are words which have the same spelling and meaning in two languages (e.g., animal in English and Spanish).",
        "The tool generates these using an ETS English/Spanish cognate lexicon.",
        "The tool offers English and Spanish text-to-speech (TTS).",
        "English TTS may be useful for pronunciation support, while Spanish TTS provides access to the Spanish texts for Spanish-speaking ELLs who are not literate in Spanish.",
        "juagr I Notes",
        "in the right column and Synonyms for \"enjoyable\" (entertaining, enjoyable, pleasant.)"
      ]
    },
    {
      "heading": "3.. Pilot Study with Teachers",
      "text": [
        "The survey feedback indicated that the 12 teachers were positive about the tool's potential.",
        "Overall, the vocabulary and English marginal notes were the most favorite features, while the text-to-speech was the least favorite.",
        "Teachers commented that they would like to see an editing capability added that would allow them to make changes to the automatically generated outputs (i.e., vocabulary support, and English and Spanish marginal notes.)",
        "Teachers viewed the tool either as lesson planning support, or as a student tool for independent work."
      ]
    },
    {
      "heading": "4.. Future Research",
      "text": [
        "ATA v.1.0 is a young application that uses NLP methods to create text adaptations.",
        "The teacher pilot evaluation suggested that it produces adaptations with potentially effective support for ELLs.",
        "It could also save teachers lesson planning time.",
        "We are currently implementing teacher-suggested modifications, and planning a larger, school-based pilot.",
        "The pilot will evaluate the tool's effectiveness in terms of measurable learning gains in reading comprehension and English language skills."
      ]
    }
  ]
}
