{
  "info": {
    "authors": [
      "Fumiyo Fukumoto",
      "Yoshimi Suzuki"
    ],
    "book": "Workshop on Automatic Summarization",
    "id": "acl-W00-0404",
    "title": "Extracting Key Paragraph Based on Topic and Event Detection Towards Multi-Document Summarization",
    "url": "https://aclweb.org/anthology/W00-0404",
    "year": 2000
  },
  "references": [
    "acl-A92-1021",
    "acl-A97-1043",
    "acl-C96-2166",
    "acl-E99-1011",
    "acl-J98-3005",
    "acl-P99-1071",
    "acl-W97-0702",
    "acl-W97-0703",
    "acl-W97-0710",
    "acl-W97-0713",
    "acl-X98-1028"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper proposes a method for extracting key paragraph for multi-document summarization based on distinction between a topic and an event.",
        "A topic and an event are identified using a simple criterion called domain dependency of words.",
        "The method was tested on the TDT1 corpus which has been developed by the TDT Pilot Study and the result can be regarded as promising the idea of domain dependency of words effectively employed."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "As the volume of online documents has drastically increased, summarization techniques have become very important in IR and NLP studies.",
        "Most of the summarization work has focused on a single document.",
        "This paper focuses on multi-document summarization: broadcast news documents about the same topic.",
        "One of the major problems in the multi-document summarization task is how to identify differences and similarities across documents.",
        "This can be interpreted as a question of how to make a clear distinction between an event and a topic in docu,.",
        "ments.",
        "Here, an event is the subject of a document itself, i.e. a writer wants to express, in other words, notions of who, what, where, when, why and how in a document.",
        "On the other hand, a topic in this paper is some unique thing that happens at some specific time and place, and the unavoidable consequences.",
        "It'-becomes background among documents.",
        "For example, in the documents of 'Kobe Japan quake', the event includes early reports of damage, location and nature of quake, rescue efforts, consequences of the quake, and on-site reports, while the topic is Kobe Japan quake.",
        "The well-known past experience from IR; that notions of who, what, where, when, why and how may not make a great contribution to the topic detection and tracking task (Allan and Papka, 1998) causes this fact, i.e. a topic and an event are different from each other' .",
        "In this paper, we propose a. method for extracting key paragraph for multi-document summarization based on distinction between a topic and an event.",
        "We use a simple criterion called domain dependency of words as a solution and present how the idea of domain dependency of words can be utilized effectively to identify a topic and an event, and thus allow multi-document summarization.",
        "The basic idea of our approach is that whether a word appeared in a document is a topic (an event) or not, depends on the domain to which the document belongs.",
        "Let us take a look at the following document from the TDT1 corpus.",
        "(1-2) Two Americans known dead in Japan quake 1.",
        "The number of [Americans] known to have been killed in Tuesday's earthquake in Japan has risen to two, the [State] [Department] said Thursday.",
        "2.",
        "The first was named Wednesday as Voni Lynn Wong, a teacher from California.",
        "[State] [Department] spokswoman Christine Shelly declined to name the second, saying formalities of notifying the family had not been completed.",
        "3.",
        "With the death toll still mounting, at least 4,000 people were killed in the earthquake which devastated the Japanese city of Kobe.",
        "4.",
        "[U.S.] diplomats were trying to locate the several thousand-strong [U.S.] community in the area, and some [Americans] who had been made homeless were found shelter in the [U.S.] consulate there, which was only lightly damaged in the quake.",
        "5.",
        "Shelly said an emergency [State] [Department] telephone number in Washington to provide information about private [American] citizens in Japan had received over 6,000 calls, more than half ofihni seeking direct assistance.",
        "6.",
        "The Pentagon has agreed to send 57,000 blankets to Japan and [U.S.] ambassador to Tokyo Walter Mondale has donated a $25,000 discretionary fund for emergencies to the Japanese Red Cross, Shelly said.",
        "7.",
        "Japan has also agreed to a visit by a team of [U.S.]",
        "experts headed by Richard Witt, national director of the Federal Emergency Management Agency.",
        "words) is 'Two Americans known dead in Japan quake'.",
        "Underlined words denote a topic, and the words marked with '[ ]' are events.",
        "of Figure 1 is paragraph id.",
        "Like Lulm's technique of keyword extraction, our method assumes that an event associated with a document appears throughout paragraphs (Luhn.",
        "1958), but a topic does not: This is because an event is the subject of a document.",
        "itself, while a topic is an event, along with all directly related events.",
        "In Figure 1, event words 'Americans' and 'U.S.",
        "', for instance, appears across paragraphs, while a topic word, for example, 'Kobe' appears only the third paragraph.",
        "Let us consider further a broad coverage domain which consists of a small number of sample news documents about the same topic, 'Kobe Japan quake'.",
        "Figure 2 and 3 are documents with `Kobe Japan quake'.",
        "(1-1) Quake collapses buildings in central Japan 1.",
        "At least two people died and dozens were injured when a powerful earthquake rolled through central Japan Tuesday morning, collapsing buildings and setting off fires in the cities of Kobe and Osaka.",
        "2.",
        "The Japan Meteorological Agency said the earthquake, which measured 7.2 on the open-ended Richter scale, rumbled across Honshu Island from the Pacific Ocean to the Japan Sea.",
        "(1-3) Kobe quake leaves questions about medical system 1.",
        "The earthquake that devastated Kobe in January raised serious questions about the efficiency of Japan's emergency medical system, a government report released on Tuesday said.",
        "2.",
        "'The earthquake exposed many issues in terms of quantity, quality, promptness and efficiency of Japan's medical care in time of disaster,' the report",
        "onThalth and welfare said.",
        ".....................",
        "Underlined words in Figure 2 and 3 show the topic of these documents.",
        "In these two documents, 'Kobe' which is a topic appears in every document, while 'Americans' and 'U.S.'",
        "which are events of the document shown in Figure 1, does not appear.",
        "Our technique for making the distinction between a topic and an event explicitly exploits this feature of the domain dependency of words: how strongly a word features a given set of data.",
        "The rest of the paper is organized as follows.",
        "The next section provides domain dependency of words which is used to identify a topic and an event for broadcast news documents.",
        "We then present a method for extracting topic and event words, and describe a paragraph-based summarization algorithm using the result of topic and event extraction.",
        "Finally, we report some experiments using the TDT1 corpus which has been developed by the TDT (Topic Detection and Tracking) Pilot Study (Allan and Carbonell, 1998) with a discussion of evaluation."
      ]
    },
    {
      "heading": "2 Domain Dependency of Words",
      "text": [
        "The domain dependency of words that how strongly a word features a given set of data (documents) contributes to event extraction, as we previously reported (Fukumoto et al., 1997).",
        "In the study, we hypothesised that the articles from the Wall Street Journal corpus can be structured by three levels, i.e. Domain, Article and Paragraph.",
        "If a word is an event in a given article, it satisfies the two conditions: (1) The dispersion value of the word in the Paragraph level is smaller than that of the Article, since the word appears throughout paragraphs in the Paragraph level rather than articles in the Article level.",
        "(2) The dispersion value of the word in the Article is smaller than that of the Domain, as the word appears across articles rather than domains.",
        "However, there are two problems to adapt it to multi-document summarization task.",
        "The .first is that the method extracts only events in the document.",
        "Because the goal of the study is to summarize a single document, and thus there is no answer to the question of how to identify differences and similarities across documents.",
        "The second is that the performance of the method greatly depends on the structure of a given data itself.",
        "Like the Wall Street Journal corpus, (i) if a given data can be structured by three levels, Paragraph, Article and Domain, each of which consists of several paragraphs, articles and domains, respectively, and (ii) if Domain consists of different subject domains, such as 'aerospace', 'environment' and 'stock market', the method can be done with satisfactory accuracy.",
        "However, there is no guarantee to make such an appropriate structure from a given set of documents in the multi-document summarization task.",
        "• The purpose of this paper is to define domain dependency of words for a number of sample documents about the same topic, and thus for multi-document summarization task.",
        "Figure 4 illustrates the structure of broadcast news documents which have been developed by the TDT (Topic Detection and Tracking) Pilot Study (Allan and Carbonell, 1998).",
        "It consists of two levels, Paragraph and Document.",
        "In Document level, there is a small number of sample news documents about the same topic.",
        "These documents are arranged in chronological order such as, '(1-1) Quake collapses buildings in central Japan (Figure 2)', '(1-2) Two Americans known dead in Japan quake (Figure 1)' and '(1-3) Kobe quake leaves questions about medical system (Figure 3)'.",
        "A particular document consists of several",
        "paragraphs.",
        "We call it Paragraph level.",
        "Let words within a document be an event, a topic, or among others (We call it a general word).",
        "Given the structure shown in Figure 4, how can we identify every word in document (1-2) with an event, a topic or a general word?",
        "Our method assumes that an event associated with a document appears across paragraphs, but a topic word does not.",
        "Then, we use domain dependency of words to extract event and topic words in document (1-2).",
        "Domain dependency of words is a measure showing how greatly each word features a given set of data.",
        "In Figure 4, let `(:)', 'A' and ' x' denote a topic, an event and a general word in document (1-2), respectively.",
        "We recall the example shown in Figure 1.",
        "• 'A', for instance, 'U.S.'",
        "appears across paragraphs.",
        "' However, in the Document level, 'A' frequently appears in document, (1-2) itself.",
        "On the basis of this example, we hypothesize that if word i is an event, it'satisfies the following condition: [1] Word i greatly depends on a particular document in the Document level rather than a particular paragraph in the Paragraph.",
        "Next, we turn to identify the remains (words) with a topic, or a general word.",
        "In Figure 5, a topic of documents (1-1) \", (1-3), for instance, 'Kobe' appears in a particular paragraph in each level of Para-graph', Paragraph2 and Paragraph3.",
        "Here, (1-1), (1- 2) and (1-3) corresponds to Paragraph', Paragraph2 and Paragraph3, respectively.",
        "On the other hand, in Document level, a topic frequently appears across documents.",
        "Then, we hypothesize that if word i is a",
        "topic, it satisfies the following condition: [2] Word i greatly depends on a particu-.",
        "lar paragraph in each Paragraph level rather than a particular document in Document."
      ]
    },
    {
      "heading": "3 Topic and Event Extraction",
      "text": [
        "We hypothesized that the domain dependency of words is a key clue to make a distinction between a topic and an event.",
        "This can be broken down into two observations: (1) whether a word appears across paragraphs (documents), (ii) whether or not a word appears frequently.",
        "We represented the former by using dispersion value, and the latter by deviation value.",
        "Topic and event words are extracted by using these values.",
        "The first step to extract topic and event words is to assign weight to the individual word in a document.",
        "We applied TF*IDF to each level of the Document and Paragraph, i.e. Paragraph', Paragraph2 and Paragraph3.",
        "Wdit in formula (1) is TF*IDF of term t in the i-th document.",
        "In a similar way, Wpit denotes TF*IDF of the term t in the i-th paragraph.",
        "T Fdit in (1) denotes term frequency of t in the i-th document.",
        "N is the number of documents and Ndt is the number of documents where t occurs.",
        "The second step is to calculate domain dependency of words.",
        "We defined it by using formula (2) and (3).",
        "Formula (2) is dispersion value of term t in the level of Document which consists of m documents, and denotes how frequently t appears across documents.",
        "hi a similar way, DispPt denotes dispersion of term I in the level of Paragraph.",
        "Formula (3) is the deviation value of t in the i-th document and denotes how frequently it appears in a particular document, the i-th document.",
        "Devpit is deviation of term t in the i-th paragraph.",
        "In (2) and (3), meant is the mean of the total TF*IDF values of term t in the level of Document.",
        "The last step is to extract a topic and an event using formula (2) and (3).",
        "We recall that if t is an event, it satisfies [1] described in section 2.",
        "This is shown by using formula (4) and (5).",
        "DispPt < DispDt (4) for all pi E di Devpit < Devclit (5) Formula (4) shows that.",
        "t frequently appears across paragraphs rather than documents.",
        "In formula (5), di is the i-th document and consists of the number of n paragraphs (see Figure 4).",
        "pi is an element of di.",
        "(5) shows that t frequently appears in the i-th document di rather than paragraphs pi ( 1 < j < n).",
        "On the other hand, if t satisfies formula (6) and (7), then propose t as a topic.",
        "DispPt > DispDt (6) for all di E D, pit exists such that Devpit > Devdit (7) In formula (7), D consists of the number of rn documents (see Figure 5).",
        "(7) denotes that t frequently appears in the particular paragraph pi rather than the document di which includes pi."
      ]
    },
    {
      "heading": "4 Key Paragraph Extraction",
      "text": [
        "The summarization task in this paper is paragraph-based extraction (Stein et al., 1999).",
        "Basically, paragraphs which include not only event words but also topic words are considered to be significant .paragraphs.",
        "The basic algorithm works as follows:",
        "1.",
        "For each document, extract topic and event words.",
        "2.",
        "Determine the paragraph weights for all paragraphs in the documents: (a) Compute the sum of topic weights over the total number of topic words for each paragraph.",
        "(b) Compute the sum of event weights over the total number of event words for each path-graph.",
        "A topic and an event weights are calculated by using Detidit in formula (3).",
        "Here, t is a topic or an event and i is the i-th document in the documents.",
        "(c) Compute the sum of (a) and (h) for each paragraph.",
        "3.",
        "Sort the paragraphs according to their weights and extract the N highest weighted paragraphs in documents in order to yield summarization of the documents.",
        "4.",
        "When their weights are the same, Compute the sum of all the topic and event word weights.",
        "Select a paragraph whose weight is higher than the others."
      ]
    },
    {
      "heading": "5 Experiments",
      "text": [
        "Evaluation of extracting key paragraph based on multi-document is difficult.",
        "First, we have not found an existing collection of summaries of multiple documents.",
        "Second, the manual effort needed to judge system output is far more extensive than for single document summarization.",
        "Consequently, we focused on the TDT1 corpus.",
        "This is because (i) events have been defined to support the TDT study effort, (ii) it was completely annotated with respect to these events (Allan and Carbonell, 1997).",
        "Therefore, we do not need the manual effort to collect documents which discuss about the target event.",
        "We report the results of three experiments.",
        "The first experiment, Event Extraction, is concerned with event extraction technique.",
        "In the second experiment, Tracking Task, we applied the extracted topics to tracking task (Allan and Carbonell, 1998).",
        "The third experiment, Key Paragraph Extraction is conducted to evaluate how the extracted topic and event words can be used effectively to extract key paragraph."
      ]
    },
    {
      "heading": "5.1 Data",
      "text": [
        "The TDT1 corpus comprises a set of documents (.15,863) that includes both newswire (Reuters) 7,965 and a manual transcription of the broadcast news speech (CNN) 7,898 documents.",
        "A set of 25 target events were defined 2 .",
        "All documents were tagged by the tagger (Brill, 1992).",
        "We used nouns in the documents."
      ]
    },
    {
      "heading": "2 littp://morphidc.upenn.edu/TDT",
      "text": []
    },
    {
      "heading": "5.2 Event Extraction",
      "text": [
        "We collected 300 documents from the TDT1 corpus, each of which is annotated with respect to one of 25 events.",
        "The result is shown in Table 1.",
        "In Table 1, 'Event type' illustrates the target events defined by the TDT Pilot Study.",
        "'Doc' denotes the number of documents.",
        "'Rec' (Recall) is the number of correct events divided by the total number of events which are selected by a human, and 'Prec' (Precision) stands for the number of correct events divided by the number of events which are selected by our method.",
        "The denominator 'Rec' is made by a human judge.",
        "'Accuracy' in Table 1 is the total average ratio.",
        "In Table 1, recall and precision values range from 55.0/47.0 to 83.3/84.2, the average being 71.0/72.2.",
        "The worst result of recall and precision was when event type was 'Serbs violate Bihac' (55.0/59.3).",
        "We currently hypothesize that this drop of accuracy is due to the fact that some documents are against our assumption of an event.",
        "Examining the documents whose event type is 'Serbs violate Bihac', 3 ( one from CNN and two from Reuters) .out of 16 documents has discussed the same event, i.e. 'Bosnian Muslim enclave hit by heavy shelling'.",
        "As a result, the event appears across these three documents.",
        "Future research will shed more light on that."
      ]
    },
    {
      "heading": "5.3 Tracking Task",
      "text": [
        "Tracking task in the TDT project is starting from a few sample documents and finding all subsequent documents that discuss the same event (Allan and Carbonell, 1998), (Carbonell et al., 1999).",
        "The corpus is divided into two parts: training set and test set.",
        "Each of the documents is flagged as to whether it discusses the target event, and these flags (`ITES', 'NO') are the only information used for training the ,system to correctly classify the target event.",
        "We applied the extracted topic to the tracking task under these conditions.",
        "The basic algorithm used in the experiment is as follows:",
        "1.",
        "Create a single document Stp and represent it as a term vector",
        "For the results of topic extraction, all the documents that belong to the same topic are bundled into a single document Stp and represent it by a term vector as follows:",
        "St,, = .",
        "SA.",
        "ttpj = 0 of St, • otherwise ttpn 1(w) denotes term frequency of word w. 2.",
        "Represent other training and test documents as term vectors",
        "Let Si, • • • , S,„ be all the other training documents (where 7o is the number of training documents which does not belong to the target event) and Sz be a test document which should be classified as to whether or not it discusses the target event.",
        "Si, • • S,,, and Sx are represented by term vectors as follows:",
        "3.",
        "Compute the similarity between a training document and a test document Given a vector representation of documents Si, • • S,,,, Sip and Sz, a similarity between two documents Si (1 < i < in, tp) and the test document Si would be obtained by using formula (8), i.e. the inner product of their normalized vectors.",
        "The greater the value of Siin(Si,Sx) is, the more similar Si and S. are.",
        "If the similarity value between the test document Sz and the document Stp is largest among all the other pairs of documents, i.e. (S1, Sr), - - (ST,„ Sr), S. is judged to be a document that discusses the target event.",
        "and 16.",
        "'Miss' means Miss rate, which is the ratio of the documents that were judged as YES but were not evaluated as YES for the run in question.",
        "'F/A' shows false alarm rate and T1' is a measure that balances recall and precision.",
        "Tee' denotes the ratio of the documents judged YES that were also evaluated as YES, and 'Prec' is the percent of the documents that were evaluated as YES which correspond to documents actually judged as YES.",
        "Table 2 shows that more training data helps the performance, as the best result was when we used Art = 16.",
        "Table 3 illustrates the extracted topic and event words in a sample document.",
        "The topic is 'Kobe Japan quake' and the number of positive training documents is 4.",
        "`Dev pit', 'Devdit', `DispPt' and `DispDt' denote values calculated by using formula (2) and (3).",
        "Overall, the curves also show that more training helps the performance, while there is no significant difference among Nt = 2, 4 and 8."
      ]
    },
    {
      "heading": "5.4 Key Paragraph Extraction",
      "text": [
        "We used 4 different sets as a test data.",
        "Each set consists of 2, 4, 8 and 16 documents.",
        "For each set, we"
      ]
    },
    {
      "heading": "5.2 Event Extraction",
      "text": [
        "We collected 300 documents from the TDT1 corpus, each of which is annotated with respect to one of 25 events.'",
        "The result is shown in Table 1.",
        "In Table 1, 'Event type' illustrates the target events defined by the TDT Pilot Study.",
        "'Doc' denotes the number of documents.",
        "'Rec' (Recall) is the number of correct events divided by the total number of events which are selected by a human, and 'Pre& (Precision) stands for the number of correct events divided by the number of events which are selected by our method.",
        "The denominator 'Re& is made by a human judge.",
        "'Accuracy' in Table 1 is the total average ratio.",
        "In Table 1, recall and precision values range from 55.0/47.0 to 83.3/84.2, the average being 71.0/72.2.",
        "The worst result of recall and precision was when event type was 'Serbs violate Bihac' (55.0/59.3).",
        "We currently hypothesize that this drop of accuracy is due to the fact that some documents are against our ' assumption of an event.",
        "Examining the documents whose event type is 'Serbs violate Bihac', 3 ( one from CNN and two from Reuters) out of 16 documents has discussed the same event, i.e. 'Bosnian Muslim enclave hit by heavy shelling'.",
        "As a result, the event appears across these three documents.",
        "Future research will shed more light on that."
      ]
    },
    {
      "heading": "5.3 Tracking Task",
      "text": [
        "Tracking task in the TDT project is starting from a few sample documents and finding all subsequent documents that discuss the same event (Allan and Carbonell, 1998), (Carbonell et al., 1999).",
        "The corpus is divided into two parts: training set and test set.",
        "Each of the documents is flagged as to whether it discusses the target event, and these flags (`YES', `NO') are the only information used for training the system to correctly classify the target event.",
        "We applied the extracted topic to the tracking task under .",
        "these conditions.",
        "The basic algorithm used in the experiment is as follows:",
        "1.",
        "Create a single document SO and represent it as a term vector",
        "For the results of topic extraction, all the documents that belong to the same topic are bundled into a single document Stp and represent it by a term vector as follows:",
        "ttptt f (w) denotes term frequency of word w.",
        "2.",
        "Represent other training and test documents as term vectors",
        "Let Si, S,,, be all the other training documents (where in is the number of training documents which does not belong to the target event) and S. be a test document which should be classified as to whether or not it discusses the target event.",
        "Si, • • S,„ and Sr are represented by term vectors as follows:",
        "3.",
        "Compute the similarity between a training document and a test document Given a vector representation of documents Si, • • S„,, Stp and S. a similarity between two documents Si (1 < i < 7n, tp) and the test document Sr would be obtained by using formula (8); i.e. the inner product of their normalized vectors.",
        "The greater the value of Sim(Sz,S.)",
        "is, the more similar Si and Sr are.",
        "If the similarity value between the test document Sr and the document Sip is largest among all the other pairs of documents, i.e. (Si, Sr), • • (S.:, Sr), Sr is judged to be a document that discusses the target event.",
        "We used the standard TDT evaluation measure 3 .",
        "Table 2 illustrates the result.",
        "In Table 2, 'Art ' denotes the number of positive training documents where Nt takes on values 1, 2, 4, 8",
        "and 16.",
        "'Miss' means Miss rate; which is the ratio of the documents that were.",
        "judged as YES but were not evaluated as YES for the run in question.",
        "`F/A' shows false alarm rate and T1' is a measure that balances recall and precision.",
        "'Rec' denotes the ratio of the documents judged YES that were also evaluated as YES, and 'Prec' is the percent of the documents that were evaluated as YES which correspond to documents actually judged as YES.",
        "Table 2 shows that more training data helps the performance, as the best result was when we used Art = 16.",
        "Table 3 illustrates the extracted topic and event words in a sample document.",
        "The topic is 'Kobe Japan quake' and the number of positive training documents is 4.",
        "`Devpit', Devdit' , `DispPt' and 9' `DispDt' denote values calculated by using formula (2) and (3).",
        "I",
        "Overall, the curves also show that more training helps the performance, while there is no significant difference among IV, = 2, 4 and 8."
      ]
    },
    {
      "heading": "5.4 Key Paragraph Extraction",
      "text": [
        "We used 4 different sets as a test data.",
        "Each set consists of 2, 4, 8 and 16 documents.",
        "For each set, we",
        "extracted 10% and 20% of the full-documents paragraph length Ping et al., 1998).",
        "Table 4 illustrates the result.",
        "In Table 4, 'Num' denotes the number of documents in a set.",
        "10 and 20% indicate the extraction ratio.",
        "`Para' denotes the number of paragraphs extracted by a human judge, and 'Correct' shows the accuracy of the method.",
        "The best result was 77.7% (the extraction ratio is 20% and the number of documents is 2).",
        "We now turn our attention to the main question: how was the contribution of making the distinction between a topic and an event for summarization task?",
        "Figure 7 illustrates the results of the methods which used (i) the extracted topic and event words, i.e. our method, and (ii) only the extracted event-words.",
        "In Figure 7, '(10%)' and '(20%)' denote the ex: tracted paragraph ratio.",
        "'Event' is the result when we used only the extracted event words.",
        "Figure 7 shows that our method consistently outperforms the method which used only the extracted events.",
        "To summarize the evaluation: t. Event extraction effectively employed when each document discusses different subject about the same topic.",
        "This shows that the method will be applicable to other genres of corpora which consist of different subjects.",
        "2.",
        "The result of tracking task (79.0% average recall and 86.6% average precision) is comparable to the existing tracking techniques which tested on the TDT1 corpus (Allan and Carbonell, 1998).",
        "3.",
        "Distinction between a topic and an event improved the results of key paragraph extraction, as our method consistently outperforms the method which used only the extracted event words (see Figure 7)."
      ]
    },
    {
      "heading": "6 Related Work",
      "text": [
        "The majority of techniques for summarization fall within two broad categories: Those that rely on template instantiation and those that rely on passage extraction.",
        "Work in the former approach is the DARPA-sponsored TIPSTER program and, in particular, the message understanding conferences has provided fertile ground for such work, by placing the emphasis of document analysis to the identification and extraction of certain core entities and facts in a document, while work on template-driven, knowledge-based summarization to date is hardly domain or genre-independent (Boguraev and Kennedy, 1997).",
        "The alternative approach largely escapes this constraint, by viewing the task as one of identifying certain passages(typically sentences) which, by some metric, are deemed to be the most representative of the document's content.",
        "A variety of approaches exist for determining the salient sentences in the text: statistical techniques based on word distribution (Kupiec et al., 1995), (Zechner, 1996), (Salton et al., 1991), (Teufell and Moens, 1997), symbolic techniques based on discourse structure (Marcu, 1997) and semantic relations between words (Barzilay and Elhadad, 1997).",
        "All of their results demonstrate that passage extraction techniques are a useful first step in document summarization, although most of them have focused on a single document.",
        "Some researchers have started to apply a single-document summarization technique to multi-document.",
        "Stein et.",
        "al.",
        "proposed a method for summarizing multi-document using single-document summarizer (Stralkowsik et al., 1998), (Stralkowski et al., 1999).",
        "Their method first summarizes each document of multi-document, then groups the summaries in clusters and finally, orders these summaries in a logical way (Stein et al., 1999).",
        "Their technique seems sensible.",
        "However, as she admits, (i) the order the information should not only depend on topic covered, (ii) background information that helps clarify related information should be placed first.",
        "More seriously, as Barzilay and Mani claim, summarization of multiple documents requires information about similarities and differences across documents.",
        "Therefore it is difficult to identify these information using a single-document summarizer technique (Mani and Bloedorn, 1997), (Barzilay et al., 1999).",
        "A method proposed by Mani et.",
        "al.",
        "deal with the problem, i.e. they tried to detect the similarities and differences in information content among documents (Mani and Bloedorn, 1997).",
        "They used a spreading activation algorithm and graph matching in order to identify similarities and differences across documents.",
        "The output is presented as a set of paragraphs with similar and unique words highlighted.",
        "However, if the same information is men",
        "-tioned several times in different documents, much of the summary will be redundant.",
        "Allan et.",
        "al.",
        "also address the problem and proposed a method for event tracking using cornmoTz words and surprising features by supplementing the corpus statistics (Allan and Papka, 1998) (Papka et al.. 1999).",
        "One of the purpose of this study is to make a distinction between an event and an event class using surprising features.",
        "Here event class features are broad news areas such as politics, death, destruction and warfare.",
        "The idea is considered to be necessary to obtain high accuracy, while Allan claims that the surprising words do not provide a broad enough coverage to capture all documents on the event.",
        "A more recent approach dealing with this problem is Barzilay et.",
        "al's approach (Barzilay et al., 1999).",
        "They used paraphrasing rules which are manually derived from the result of syntactic analysis to identify theme intersection and used language generation to reformulate them as a coherent summary.",
        "While promising to obtain high accuracy, the result of summarization task has not been reported.",
        "Like Mani and Barzilay's techniques, our approach focuses on the problem that how to identify differences and similarities across documents, rather than the problem that how to form the actual suin-mary (Sparck, 1993), (McKeown and Radev, 1995), (Radev and McKeown, 1998).",
        "However, while Barzi-lay's approach used paraphrasing rules to eliminate redundancy in a summary, we proposed domain dependency of words to address robustness of the technique."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "In this paper, we proposed a method for extracting key paragraph for summarization based on distinction between a topic and an event.",
        "The results showed that the average accuracy was 68.1% when we used the TDT1 corpus.",
        "TIPSTER Text Summarization Evaluation (SUMMAC) proposed various methods for evaluating document summarization and tasks (Mani et al., 1999).",
        "Of these, participants submitted two summaries: a fixed-length summary limited to 10% of the length of the source, and a summary which was not limited in length.",
        "Future work includes quantitative and qualitative evaluation.",
        "In addition, our method used single words rather than phrases.",
        "These phrases, however, would be helpful to resolve ambiguity and reduce a lot of noise, i.e. yield much better accuracy.",
        "We plan to apply our method to phrase-based topic and event extraction, then turn to focus on the problem that how to form the actual summary."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors would like to thank the reviewers for their valuable comments.",
        "This work was supported by the Grant-in-aid for the Japan Society for the Promotion of Science(JSPS, No.11780258) and Tateisi Science and Technology Foundation."
      ]
    }
  ]
}
