{
  "info": {
    "authors": [
      "Elliott Franco Drabek",
      "David Yarowsky"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics – Interactive Poster and Demonstration Sessions",
    "id": "acl-P04-3014",
    "title": "Improving Bitext Word Alignments Via Syntax-Based Reordering of English",
    "url": "https://aclweb.org/anthology/P04-3014",
    "year": 2004
  },
  "references": [
    "acl-C00-2163",
    "acl-C02-1002",
    "acl-H01-1035",
    "acl-J93-2003",
    "acl-P01-1067",
    "acl-W03-0301"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present an improved method for automated word alignment of parallel texts which takes advantage of knowledge of syntactic divergences, while avoiding the need for syntactic analysis of the less resource rich language, and retaining the robustness of syntactically agnostic approaches such as the IBM word alignment models.",
        "We achieve this by using simple, easily-elicited knowledge to produce syntax-based heuristics which transform the target language (e.g. English) into a form more closely resembling the source language, and then by using standard alignment methods to align the transformed bitext.",
        "We present experimental results under variable resource conditions.",
        "The method improves word alignment performance for language pairs such as English-Korean and English-Hindi, which exhibit longer-distance syntactic divergences."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Word-level alignment is a key infrastructural technology for multilingual processing.",
        "It is crucial for the development of translation models and translation lexica (Tufi¸s, 2002; Melamed, 1998), as well as for translingual projection (Yarowsky et al., 2001; Lopez et al., 2002).",
        "It has increasingly attracted attention as a task worthy of study in its own right (Mihalcea and Pedersen, 2003; Och and Ney, 2000).",
        "Syntax-light alignment models such as the five IBM models (Brown et al., 1993) and their relatives have proved to be very successful and robust at producing word-level alignments, especially for closely related languages with similar word order and mostly local reorderings, which can be captured via simple models of relative word distortion.",
        "However, these models have been less successful at modeling syntactic distortions with longer distance movement.",
        "In contrast, more syntactically informed approaches have been constrained by the often weak syntactic correspondences typical of real-world parallel texts, and by the difficulty of finding or inducing syntactic parsers for any but a few of the world’s most studied languages.",
        "Our approach uses simple, easily-elicited knowledge of divergences to produce heuristic syntax-based transformations from English to a form (English') more closely resembling the source lan",
        "guage, and then using standard alignment methods to align the transformed version to the target language.",
        "This approach retains the robustness of syntactically agnostic models, while taking advantage of syntactic knowledge.",
        "Because the approach relies only on syntactic analysis of English, it can avoid the difficulty of developing a full parser for a new low-resource language.",
        "Our method is rapid and low cost.",
        "It requires only coarse-grained knowledge of basic word order, knowledge which can be rapidly found in even the briefest grammatical sketches.",
        "Because basic word order changes very slowly with time, word order of related languages tends to be very similar.",
        "For example, even if we only know that a language is of the Northern-Indian/Sanskrit family, we can easily guess with high confidence that it is systematically head-final.",
        "Because our method can be restricted to only bi-text preprocessing and post-processing, it can be used as a wrapper around any existing word-alignment tool, without modification, to provide improved performance by minimizing alignment distortion.",
        "linguistic structural divergences, such as the DUSTer system (Dorr et al., 2002).",
        "While the focus on major classes of structural variation such as manner-of-motion verb-phrase transformations have facilitated both transfer and generation in machine translation, these divergences have not been integrated into a system that produces automatic word alignments and have tended to focus on more local phrasal variation rather than more comprehensive sentential syntactic reordering.",
        "Complementary prior work (e.g. Wu, 1995) has also addressed syntactic transduction for bilingual parsing, translation, and word-alignment.",
        "Much of this work depends on high-quality parsing of both target and source sentences, which may be unavailable for many “lower density” languages of interest.",
        "Tree-to-string models, such as (Yamada and Knight, 2001) remove this dependency, and such models are well suited for situations with large, cleanly translated training corpora.",
        "By contrast, our method retains the robustness of the underlying aligner towards loose translations, and can if necessary use knowledge of syntactic divergences even in the absence of any training corpora whatsoever, using only a translation lexicon."
      ]
    },
    {
      "heading": "3 System",
      "text": [
        "Figure 1 shows the system architecture.",
        "We start by running the Collins parser (Collins, 1999) on the English side of both training and testing data, and apply our source-language-specific heuristics to the",
        "types – VP: verb phrases with Verb and Object, AP: appositional (prepositional or postpositional) phrases with Apposition and Object, and NP: noun phrases with Noun and Adjective or Relative clause.",
        "Chinese has both prepositions and postpositions.",
        "resulting trees.",
        "This yields English' text, along with traces recording correspondences between English' words and the English originals.",
        "We use GIZA++ (Och and Ney, 2000) to align the English' with the source language text, yielding alignments in terms of the English'.",
        "Finally, we use the traces to map these alignments to the original English words.",
        "Figure 2 shows an illustrative Hindi-English sentence pair, with true word alignments, and parse-tree over the English sentence.",
        "Although it is only a short sentence, the large number of crossing alignments clearly show the high-degree of reordering, and especially long-distance motion, caused by the syntactic divergences between Hindi and English.",
        "are marked by a subtended arc.",
        "Crossings have been eliminated, and the alignment is now monotonic.",
        "Table 1 shows the basic word order of three major phrase types for each of the languages we treated.",
        "In each case, our heuristics transform the English trees to achieve these same word orders.",
        "For the Chinese case, we apply several more language-specific transformations.",
        "Because Chinese has both prepositions and postpositions, we retain the original preposition and add an additional bracketing postposition.",
        "We also move verb modifiers other than noun phrases to the left of the head verb."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "For each language we treated, we assembled sentence-aligned, tokenized training and test corpora, with hand-annotated gold-standard word alignments for the latter'.",
        "We did not apply any sort of morphological analysis beyond basic word to-kenization.",
        "We measured system performance with waevalalign.pl, provided by Rada Mihalcea and Ted Pedersen.",
        "Each training set provides the aligner with information about lexical affinities and reordering patterns.",
        "For Hindi, Korean and Chinese, we also tested our system under the more difficult situation of having only a bilingual word list but no bitext available.",
        "This is a plausible low-resource language scenario",
        "of sentence pairs, mean length of English sentences, and correlation r2 between English and source-language normalized word positions in gold-standard data, for direct and English' situations.",
        "and a test of the ability of the system to take sole responsibility for knowledge of reordering.",
        "Table 3 describes the test sets and shows the correlation in gold standard aligned word pairs between the position of the English word in the English sentence and the position of the source-language word in the source-language sentence (normalizing the positions to fall between 0 and 1).",
        "The baseline (direct) correlations give quantitative evidence of differing degrees of syntactic divergence with English, and the English' correlations demonstrate that our heuristics do have the effect of better fitting source language word order."
      ]
    },
    {
      "heading": "5 Results",
      "text": [
        "Figures 4, 5, 6 and 7 show learning curves for systems trained on parallel sentences with and without the English' transforms.",
        "Table 2 provides further detail, and also shows the performance of systems trained without any bitext, but only with access to a bilingual translation lexicon.",
        "Our system achieves consistent, substantial performance improvement under all situations for English-Hindi and English-Korean language pairs, which exhibit longer distance SOV->SVO syntactic divergence.",
        "For English-Romanian and English-Chinese, neither significant improvement nor degradation is seen, but these are language pairs with quite similar sentential word order to English, and hence have less opportunity to benefit from our syntactic transformations."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "We have developed a system to improve the performance of bitext word alignment between English and a source language by first reordering parsed English into an order more closely resembling that 'Hindi training: news text from the LDC for the 2003 DARPA TIDES Surprise Language exercise; Hindi testing: news text from Rebecca Hwa, then at the University of Maryland; Hindi dictionary: The Hindi-English Dictionary, v. 2.0 from IIIT (Hyderabad) LTRC; Korean training: Unbound Bible; Korean testing: half from Penn Korean Treebank and half from Universal declaration of Human Rights, aligned by Woosung Kim at the Johns Hopkins University; Korean dictionary: EngDic v. 4; Chinese training: news text from FBIS; Chinese testing: Penn Chinese Treebank news text aligned by Rebecca Hwa, then at the University of Maryland; Chinese dictionary: from the LDC; Romanian training and testing: (Mihalcea and Pedersen, 2003).",
        "of the source language, based only on knowledge of the coarse basic word order of the source language, such as can be obtained from any cross-linguistic survey of languages, and requiring no parsing of the source language.",
        "We applied the system to the task of aligning English with Hindi, Korean, Chinese and Romanian.",
        "Performance improvement is greatest for Hindi and Korean, which exhibit longer-distance constituent reordering with respect to English.",
        "These properties suggest the proposed English' word alignment method can be an effective approach for word alignment to languages with both greater cross-linguistic word-order divergence and an absence of available parsers."
      ]
    }
  ]
}
