{
  "info": {
    "authors": [
      "Eyal Beigman",
      "Beata Beigman Klebanov"
    ],
    "book": "ACL-IJCNLP",
    "id": "acl-P09-1032",
    "title": "Learning with Annotation Noise",
    "url": "https://aclweb.org/anthology/P09-1032",
    "year": 2009
  },
  "references": [
    "acl-D08-1027",
    "acl-H05-1102",
    "acl-J08-3001",
    "acl-J09-4005",
    "acl-L08-1329",
    "acl-P02-1034",
    "acl-P02-1062",
    "acl-P04-1015",
    "acl-P05-1023",
    "acl-W02-1001",
    "acl-W03-1022",
    "acl-W04-3240"
  ],
  "sections": [
    {
      "text": [
        "Olin Business School Washington University in St. Louis",
        "It is usually assumed that the kind of noise existing in annotated data is random classification noise.",
        "Yet there is evidence that differences between annotators are not always random attention slips but could result from different biases towards the classification categories, at least for the harder-to-decide cases.",
        "Under an annotation generation model that takes this into account, there is a hazard that some of the training instances are actually hard cases with unreliable annotations.",
        "We show that these are relatively unproblematic for an algorithm operating under the 0-1 loss model, whereas for the commonly used voted perceptron algorithm, hard training cases could result in incorrect prediction on the uncontroversial cases at test time."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "It is assumed, often tacitly, that the kind of noise existing in human-annotated datasets used in computational linguistics is random classification noise (Kearns, 1993; Angluin and Laird, 1988), resulting from annotator attention slips randomly distributed across instances.",
        "For example, Osborne (2002) evaluates noise tolerance of shallow parsers, with random classification noise taken to be \"crudely approximating annotation errors.\"",
        "It has been shown, both theoretically and empirically, that this type of noise is tolerated well by the commonly used machine learning algorithms (Cohen, 1997; Blum et al., 1996; Osborne, 2002; Reidsma and Carletta, 2008).",
        "Yet this might be overly optimistic.",
        "Reidsma and op den Akker (2008) show that apparent differences between annotators are not random slips of attention but rather result from different biases annotators might have towards the classification",
        "Beata Beigman Klebanov",
        "Kellogg School of Management Northwestern University categories.",
        "When training data comes from one annotator and test data from another, the first annotator's biases are sometimes systematic enough for a machine learner to pick them up, with detrimental results for the algorithm's performance on the test data.",
        "A small subset of doubly annotated data (for inter-annotator agreement check) and large chunks of singly annotated data (for training algorithms) is not uncommon in computational linguistics datasets; such a setup is prone to problems if annotators are differently biased.",
        "Annotator bias is consistent with a number of noise models.",
        "For example, it could be that an annotator's bias is exercised on each and every instance, making his preferred category likelier for any instance than in another person's annotations.",
        "Another possibility, recently explored by Beigman Klebanov and Beigman (2009), is that some items are really quite clear-cut for an annotator with any bias, belonging squarely within one particular category.",
        "However, some instances - termed hard cases therein - are harder to decide upon, and this is where various preferences and biases come into play.",
        "In a metaphor annotation study reported by Beigman Klebanov et al.",
        "(2008), certain markups received overwhelming annotator support when people were asked to validate annotations after a certain time delay.",
        "Other instances saw opinions split; moreover, Beigman Klebanov et al.",
        "(2008) observed cases where people retracted their own earlier annotations.",
        "To start accounting for such annotator behavior, Beigman Klebanov and Beigman (2009) proposed a model where instances are either easy, and then all annotators agree on them, or hard, and then each annotator flips his or her own coin to decide on a label (each annotator can have a different \"coin\" reflecting his or her biases).",
        "For annotations generated under such a model, there is a danger of hard instances posing as easy - an observed agreement between annotators being a result of all coins coming up heads by chance.",
        "They therefore define the expected proportion of hard instances in agreed items as annotation noise.",
        "They provide an example from the literature where an annotation noise rate of about 15% is likely.",
        "The question addressed in this article is: How problematic is learning from training data with annotation noise?",
        "Specifically, we are interested in estimating the degree to which performance on easy instances at test time can be hurt by the presence of hard instances in training data.",
        "Definition 1 The hard case bias, t, is the portion of easy instances in the test data that are misclassified as a result of hard instances in the training data.",
        "This article proceeds as follows.",
        "First, we show that a machine learner operating under a 0-1 loss minimization principle could sustain a hard case bias of 6( ) in the worst case.",
        "Thus, while annotation noise is hazardous for small datasets, it is better tolerated in larger ones.",
        "However, 0-1 loss minimization is computationally intractable for large datasets (Feldman et al., 2006; Guruswami and Raghavendra, 2006); substitute loss functions are often used in practice.",
        "While their tolerance to random classification noise is as good as for 0-1 loss, their tolerance to annotation noise is worse.",
        "For example, the perceptron family of algorithms handle random classification noise well (Cohen, 1997).",
        "We show in section 3.4 that the widely used Freund and Schapire (1999) voted percep-tron algorithm could face a constant hard case bias when confronted with annotation noise in training data, irrespective of the size of the dataset.",
        "Finally, we discuss the implications of our findings for the practice of annotation studies and for data utilization in machine learning.",
        "Let a sample be a sequence xi,..., x= drawn uniformly from the d-dimensional discrete cube Id = { – 1, 1}d with corresponding labels yi,... ,y= £ { – 1,1}.",
        "Suppose further that the learning algorithm operates by finding a hyperplane (w,ip), w £ Rd,ip £ R, that minimizes the empirical erip)].",
        "Let there be H hard cases, such that the annotation noise is 7 = H .",
        "Theorem 1 In the worst case configuration of instances a hard case bias of t = 6( ^7=) cannot be ruled out with constant confidence.",
        "Idea of the proof: We prove by explicit construction of an adversarial case.",
        "Suppose there is a plane that perfectly separates the easy instances.",
        "The 9(N) hard instances will be concentrated in a band parallel to the separating plane, that is near enough to the plane so as to trap only about 6(y/N) easy instances between the plane and the band (see figure 1 for an illustration).",
        "For a random labeling of the hard instances, the central limit theorem shows there is positive probability that there would be an imbalance between +1 and – 1 labels in favor of – 1s on the scale of y/N, which, with appropriate constants, would lead to the movement of the empirically minimal separation plane to the right of the hard case band, misclassifying the trapped easy cases.",
        "Proof: Let v = v(x) = Yi=i d x% denote the sum of the coordinates of an instance in Id and take Xe = yfd • F-i(^7 • 2\"d + ) and Xh =",
        "Vd • F-i(7 + ^7 • 2\"d + 2), where F(t) is the cumulative distribution function of the normal distribution.",
        "Suppose further that instances xj such that Xe < Vj < Xh are all and only hard instances; their labels are coinflips.",
        "All other instances are easy, and labeled y = y(x) = sgn(v).",
        "In this case, the hyperplane (1... 1) is the true separation plane for the easy instances, with ip = 0.",
        "Figure 1 shows this configuration.",
        "According to the central limit theorem, for d, N large, the distribution of v is well approximated by N(0, y/d).",
        "If N = ci • 2d, for some 0 < ci < 4, the second application of the central limit theorem ensures that, with high probability, about 7N = ci72d items would fall between Xe and Xh(all hard), and ^7 • 2\"dN = cxyfYfi^ would fall between 0 and Xe (all easy, all labeled +1).",
        "Let Z be the sum of labels of the hard cases, Z = Y^,i=i h y».",
        "Applying the central limit theorem a third time, for large N, Z will, with a high probability, be distributed approximately as",
        "Figure 1: The adversarial case for 0-1 loss.",
        "Squares correspond to easy instances, circles - to hard ones.",
        "Filled squares and circles are labeled – 1, empty ones are labeled +1.",
        "N(0,^/yN).",
        "This implies that a value as low as – 2a cannot be ruled out with high (say 95%) confidence.",
        "Thus, an imbalance of up to 2yJ7N, or of 2y/ci72d, in favor of – 1s is possible.",
        "There are between 0 and Xh about 2^[ci\\f7{2dmore – 1 hard instances than +1 hard instances, as opposed to c9y/72d easy instances that are all +1.",
        "As long as ci < i.e. ci < 4, the empirically minimal threshold would move to Xh, resulting in a hard case bias of t = X-, – ^ = 6(- – =).",
        "To see that this is the worst case scenario, we note that 0-1 loss sustained on 9(N) hard cases is the order of magnitude of the possible imbalance between – 1 and +1 random labels, which is 6(y/N).",
        "For hard case loss to outweigh the loss on the misclassified easy instances, there cannot be more than 6(y/N) of the latter □",
        "Note that the proof requires that N = 6(2d) namely, that asymptotically the sample includes a fixed portion of the instances.",
        "If the sample is asymptotically smaller, then Xe will have to be adjusted such that Xe = yfd • F-i(6( – =) + ).",
        "According to theorem 1, for a 10K dataset with 15% hard case rate, a hard case bias of about 1% cannot be ruled out with 95% confidence.",
        "Theorem 1 suggests that annotation noise as defined here is qualitatively different from more malicious types of noise analyzed in the agnostic learning framework (Kearns and Li, 1988; Haussler, 1992; Kearns et al., 1994), where an adversary can not only choose the placement of the hard cases, but also their labels.",
        "In worst case, the 0-1 loss model would sustain a constant rate of error due to malicious noise, whereas annotation noise is tolerated quite well in large datasets."
      ]
    },
    {
      "heading": "3. Voted Perceptron",
      "text": [
        "Freund and Schapire (1999) describe the voted perceptron.",
        "This algorithm and its many variants are widely used in the computational linguistics community (Collins, 2002a; Collins and Duffy, 2002; Collins, 2002b; Collins and Roark, 2004; Henderson and Titov, 2005; Viola and Narasimhan, 2005; Cohen et al., 2004; Carreras et al., 2005; Shen and Joshi, 2005; Ciaramita and Johnson, 2003).",
        "In this section, we show that the voted perceptron can be vulnerable to annotation noise.",
        "The algorithm is shown below.",
        "Algorithm 1 Voted Perceptron Training",
        "Input: a labeled training set (x1,y1),..., (xN ,yN) Output: a list of perceptrons w1,..., wN end for Forecasting Input: a list of perceptrons w1,..., wN",
        "an unlabeled instance x Output: A forecasted label y",
        "The voted perceptron algorithm is a refinement of the perceptron algorithm (Rosenblatt, 1962; Minsky and Papert, 1969).",
        "Perceptron is a dynamic algorithm; starting with an initial hyperplane w0, it passes repeatedly through the labeled sample.",
        "Whenever an instance is misclassified by wt, the hyperplane is modified to adapt to the instance.",
        "The algorithm terminates once it has passed through the sample without making any classification mistakes.",
        "The algorithm terminates iff the sample can be separated by a hyperplane, and in this case the algorithm finds a separating hyperplane.",
        "Novikoff (1962) gives a bound on the number of iterations the algorithm goes through before termination, when the sample is separable by a margin.",
        "The perceptron algorithm is vulnerable to noise, as even a little noise could make the sample inseparable.",
        "In this case the algorithm would cycle indefinitely never meeting termination conditions, wt would obtain values within a certain dynamic range but would not converge.",
        "In such setting, imposing a stopping time would be equivalent to drawing a random vector from the dynamic range.",
        "Freund and Schapire (1999) extend the percep-tron to inseparable samples with their voted per-ceptron algorithm and give theoretical generalization bounds for its performance.",
        "The basic idea underlying the algorithm is that if the dynamic range of the perceptron is not too large then wtwould classify most instances correctly most of the time (for most values of t).",
        "Thus, for a sample xi , .",
        ".",
        ".",
        ", x= the new algorithm would keep track of w0,... ,w=, and for an unlabeled instance x it would forecast the classification most prominent amongst these hyperplanes.",
        "The bounds given by Freund and Schapire (1999) depend on the hinge loss of the dataset.",
        "In section 3.2 we construct a difficult setting for this algorithm.",
        "To prove that voted perceptron would suffer from a constant hard case bias in this setting using the exact dynamics of the perceptron is beyond the scope of this article.",
        "Instead, in section 3.3 we provide a lower bound on the hinge loss for a simplified model of the perceptron algorithm dynamics, which we argue would be a good approximation to the true dynamics in the setting we constructed.",
        "For this simplified model, we show that the hinge loss is large, and the bounds in Freund and Schapire (1999) cannot rule out a constant level of error regardless of the size of the dataset.",
        "In section 3.4 we study the dynamics of the model and prove that t = 6(1) for the adversarial setting.",
        "Definition 2 The hinge loss of a labeled instance ( x, y) with respect to hyperplane ( w, p ) and margin 5 > 0 is given by ( = ((ip, 5) = max(0,5 – y • ((w,x) – ip)).",
        "( measures the distance of an instance from being classified correctly with a 5 margin.",
        "Figure 2 shows examples of hinge loss for various data points.",
        "After one pass on the sample, the probability that the voted perceptron algorithm does not predict correctly the label of a test instance x=+i is bounded by =+9[d+D] where",
        "This result is used to explain the convergence of weighted or voted perceptron algorithms (Collins, 2002a).",
        "It is useful as long as the expected value of D is not too large.",
        "We show that in an adversarial setting of the annotation noise D is large, hence these bounds are trivial.",
        "Let a sample be a sequence xi , .",
        ".",
        ".",
        ", x= drawn uniformly from Id with yi,... ,y= £ { – 1,1}.",
        "Easy cases are labeled y = y(x) = sgn(v) as before, with v = v(x) = Yi=i d xi.",
        "The true separation plane for the easy instances is w* = – d(1... 1), ip* = 0.",
        "Suppose hard cases are those where v(x) > ci\\fd, where ci is chosen so that the hard instances account for 7N of all instances.Figure 3 shows this setting.",
        "In the simplified case, we assume that the algorithm starts training with the hyperplane wo = w* = – d(1... 1), and keeps it throughout the training, only updating p .",
        "In reality, each hard instance can be decomposed into a component that is parallel to w*, and a component that is orthogonal to it.",
        "The expected contribution of the orthogonal misclassified easy instances dominate the loss:",
        "component to the algorithm's update will be positive due to the systematic positioning of the hard cases, while the contributions of the parallel components are expected to cancel out due to the symmetry of the hard cases around the main diagonal that is orthogonal to w* .",
        "Thus, while wt will not necessarily parallel w*, it will be close to parallel for most t > 0.",
        "The simplified case is thus a good approximation of the real case, and the bound we obtain is expected to hold for the real case as well.",
        "For any initial value ip0 < 0 all misclassified instances are labeled – 1 and classified as +1, hence the update will increase p0, and reach 0 soon enough.",
        "We can therefore assume that ipt > 0 for any t > t0 where t0 <C N.",
        "Lemma 3 For any t > t0, there exist a = a(7, T) > 0 such that E(() > a • 5.",
        "Proof: For ip > 0 there are two main sources of hinge loss: easy +1 instances that are classified as – 1, and hard 1 instances classified as +1.",
        "These correspond to the two components of the following sum (the inequality is due to disregarding the loss incurred by a correct classification with too wide a margin):",
        "The last inequality follows from a normal approximation of the binomial distribution (see, for example, Feller (1968)).",
        "For O < p < T\\[d, misclassified hard cases dominate:",
        "where §-i(7) is the inverse of the normal distribution density.",
        "Corollary 4 The bound in theorem 2 does not converge to zero for large N.",
        "We recall that Freund and Schapire (1999) bound is proportional to D = Y ==i C. It follows from lemma 3 that D = 6(N), hence the bound is ineffective.",
        "3.4 Lower Bound on t for Voted Perceptron Under Simplified Dynamics",
        "Corollary 4 does not give an estimate on the hard case bias.",
        "Indeed, it could be that wt = w* for almost every t. There would still be significant hinge in this case, but the hard case bias for the voted forecast would be zero.",
        "To assess the hard case bias we need a model of perceptron dynamics that would account for the history of hyperplanes w0, .",
        ".",
        ".",
        ", w= the perceptron goes throughon a sample xi,... ,x=.",
        "The key simplification in our model is assuming that wt parallels w* for all t, hence the next hyperplane depends only on the offset p t. This is a one dimensional Markov random walk governed by the distribution",
        "In general – d < ipt < d but as mentioned before lemma 3, we may assume p t > 0.",
        "Lemma 5 There exists c > 0 such that with a high probability ipt > c • Vd for most 0 < t < N.",
        "Proof: Let c0 = F-i(\\ + \\); ci = F-i(1 – 7).",
        "We designate the intervals I0 = [0,c0 • Vd]; Ii = [c0 • Vd, ci • Vd] and I2 = [ci • Vd, d] and define Ai = {x : v(x) £ Ii} for i = 0,1, 2.",
        "Note that the constants c0 and ci are chosen so that P(A0) = 22 and P(A2) = 7.",
        "It follows from the construction in section 3.2 that A0 and Ai are easy instances and A2 are hard.",
        "Given a sample xi , .",
        ".",
        ".",
        ", x=, a misclassification of xt £ A0 by ipt could only happen when an easy +1 instance is classified as – 1.",
        "Thus the algorithm would shift p t to the left by no more than |vt – pt| since vt = (w*, xt).",
        "This shows that ipt £ I0 implies pt+i £ I0.",
        "In the same manner, it is easy to verify that if p t £ Ij and xt £ Ak then pt+i £ Ik, unless j = 0 and k = 1, in which case pt+i £ I0 because xt £ Aiwould be classified correctly by ipt £ I0.",
        "We construct a Markov chain with three states a0 = 0, ai = c0 • Vd and a2 = ci • Vd governed by the following transition distribution:",
        "Let Xt be the state at time t. The principal eigenvector of the transition matrix (|, |, |) gives the stationary probability distribution of Xt.",
        "Thus Xt £ {ai, a2} with probability |.",
        "Since the transition distribution of Xt mirrors that of p t, and since aj are at the leftmost borders of Ij, respectively, it follows that Xt < p t for all t, thus Xt £ {ai ,a2} implies ipt £ Ii UI2.",
        "It follows that ipt > c0 • Vd with probability |, and the lemma follows from the law of large numbers □ Corollary 6 With high probability t = 6(1).",
        "Proof: Lemma 5 shows that for a sample xi , .",
        ".",
        ".",
        ", x= with high probability p t is most of the time to the right of c ■ Vd.",
        "Consequently for any x in the band 0 < v < c ■ Vd we get sign((w*, x) + ipt) = – 1 for most t hence by definition, the voted perceptron would classify such an instance as – 1, although it is in fact a +1 easy instance.",
        "Since there are 0(N) misclassified easy instances, t = 9(1) □"
      ]
    },
    {
      "heading": "4. Discussion",
      "text": [
        "In this article we show that training with annotation noise can be detrimental for test-time results on easy, uncontroversial instances; we termed this phenomenon hard case bias.",
        "Although under the 0-1 loss model annotation noise can be tolerated for larger datasets (theorem 1), minimizing such loss becomes intractable for larger datasets.",
        "Freund and Schapire (1999) voted perceptron algorithm and its variants are widely used in computational linguistics practice; our results show that it could suffer a constant rate of hard case bias irrespective of the size of the dataset (section 3.4).",
        "How can hard case bias be reduced?",
        "One possibility is removing as many hard cases as one can not only from the test data, as suggested in Beigman Klebanov and Beigman (2009), but from the training data as well.",
        "Adding the second annotator is expected to detect about half the hard cases, as they would surface as disagreements between the annotators.",
        "Subsequently, a machine learner can be told to ignore those cases during training, reducing the risk of hard case bias.",
        "While this is certainly a daunting task, it is possible that for annotation studies that do not require expert annotators and extensive annotator training, the newly available access to a large pool of inexpensive annotators, such as the Amazon Mechanical Turk scheme (Snow et al., 2008), or embedding the task in an online game played by volunteers (Poesio et al., 2008; von Ahn, 2006) could provide some solutions.",
        "Reidsma and op den Akker (2008) suggest a different option.",
        "When non-overlapping parts of the dataset are annotated by different annotators, each classifier can be trained to reflect the opinion (albeit biased) of a specific annotator, using different parts of the datasets.",
        "Such \"subjective machines\" can be applied to a new set of data; an item that causes disagreement between classifiers is then extrapolated to be a case of potential disagreement between the humans they replicate, i.e.",
        "a hard case.",
        "Our results suggest that, regardless of the success of such an extrapolation scheme in detecting hard cases, it could erroneously invalidate easy cases: Each classifier would presumably suffer from a certain hard case bias, i.e. classify incorrectly things that are in fact uncontroversial for any human annotator.",
        "If each such classifier has a different hard case bias, some inter-classifier disagreements would occur on easy cases.",
        "Depending on the distribution of those easy cases in the feature space, this could invalidate valuable cases.",
        "If the situation depicted in figure 1 corresponds to the pattern learned by one of the classifiers, it would lead to marking the easy cases closest to the real separation boundary (those between 0 and Xe) as hard, and hence unsuitable for learning, eliminating the most informative material from the training data.",
        "Reidsma and Carletta (2008) recently showed by simulation that different types of annotator behavior have different impact on the outcomes of machine learning from the annotated data.",
        "Our results provide a theoretical analysis that points in the same direction: While random classification noise is tolerable, other types of noise - such as annotation noise handled here - are more problematic.",
        "It is therefore important to develop models of annotator behavior and of the resulting imperfections of the annotated datasets, in order to diagnose the potential learning problem and suggest mitigation strategies."
      ]
    }
  ]
}
