{
  "info": {
    "authors": [
      "Samuel S. Epstein"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C90-3020",
    "title": "Linear Encodings of Linguistic Analyses",
    "url": "https://aclweb.org/anthology/C90-3020",
    "year": 1990
  },
  "references": [
    "acl-J82-3004",
    "acl-J87-1004"
  ],
  "sections": [
    {
      "heading": "I. Introduction",
      "text": [
        "Natural languages contain families of expressions such that the number of readings of an expression is an exponential function of the length of the expression.",
        "Two well-known cases involve prepositional phrase attachment and coordination.",
        "Other cases discussed below involve anaphora and relative operator scope.",
        "For example, in (1) John said that Bill said that ... that Harry said that he thinks that he thinks that ... that he thinks that it is raining.",
        "each he can refer to any of John, Bill, ..., Harry.'",
        "Thus if (1) contains n names and m occurrences of he, this sentence has nm readings (assuming that all anaphoric relationships are intrasentential).",
        "We discuss below families of expressions whose ambiguities grow as various exponential functions (factorial, Fibonacci, Catalan) of expression length.",
        "It appears, then, that exhaustive linear-time processing of natural language is impossible.",
        "An exponentially long answer cannot be produced in linear time.2 On the other hand, human processing of natural language seems to be at least linearly fast.",
        "The ready explanation for this is that people do not recover all readings of ambiguous expressions.",
        "This is clearly correct, as far as it goes.",
        "This paper shows how to encode in linear space the exponentially large numbers of readings associated with various families of expressions.",
        "The availability of these encodings removes an apparent obstacle to exhaustive analyses of these expressions in linear time.",
        "The eneodings may thus be useful for practical computational purposes.",
        "They may also provide a better",
        "1.",
        "(1) is of course highly unnatural in a sense.",
        "However, it effectively isolates for study a phenomenon that is intrinsic to natural language.",
        "Similar observations apply to the examples below.",
        "2.",
        "It is of course also the case that an exponentially long answer cannot be produced in polynomial time.",
        "If the problem cannot be reformulated so that answers are not exponentially long, the question of tractability does not arise.",
        "See [Garey and Johnson 79] and [Barton, Berwick, and Ristad 87] for related discussions.",
        "basis than exponential-space encodings for explanations of how humans process language.",
        "For each of the linguistic constructions discussed in this paper, there is a simple program that generates analyses of the construction.",
        "If there are no constraints on what counts as a linguistic analysis, then a specification of a program, which requires constant space, together with a specification of an input expression, which requires linear space, could count as a linear encoding of an analysis of the input.",
        "Intuitively, there is a vast qualitative divide between a (program,input) pair on one hand, and, for instance, a forest of constituent structure trees on the other hand.",
        "More generally, a question arises of how to distinguish analyses from procedures that yield analyses.",
        "This paper will not attempt to answer this question definitively.",
        "The analyses presented in Sections 2 - 4 all satisfy a notion of \"legal\" analysis that excludes (program,input) pairs.",
        "Sections 2 and 3 discuss polynomial space analyses.",
        "Section 4 adds a representational device to the repertory of Sections 2 and 3, so that linear space analyses are possible.",
        "Section 5 informally discusses a variety of issues, including the distinction between analysis and procedure.",
        "2.",
        "Analyses in Conjunctive Normal Form Assume that example (1) involves no ambiguities except for antecedents of pronouns.",
        "Assume further that the length of the analysis of (1), aside from the specification of antecedents of pronouns, grows linearly.3 Let the proposition q comprise all aspects of the analysis of (1), aside from specifications of antecedents of pronouns.",
        "Let the proposition p. comprise the specification that the j-th name in CO is the antecedent of the i-th occurrence of he.",
        "(For example, p1,2 comprises the 3.",
        "These assumptions, and similar assumptions for other examples below, permit a briefer discussion than would otherwise be possible.",
        "Reservations about these assumptions do not affect the substance of the discussion.",
        "Our concern with (1) focuses on exponentially growing possibilities for assigning antecedents to pronouns.",
        "specification that Bill is the antecedent of the most shallowly embedded he.)",
        "Let n be the number of names in (1) and let m be the number of occurrences of he.",
        "Then an exhaustive analysis of (1) can take the following form:",
        "(pm,1 v p v v p ) m,n (1-b) contains m+1 conjuncts.",
        "The length of an exhaustive analysis of (I) is exponential in the number of pronouns in (1) when the analysis is given in DNF, but linear in the number of pronouns when the analysis is given in CNF.",
        "However, (1-b) is not linear in the Jength of ( 1), because each of in conjuncts contains n tlisjuncts, so that a total of mxn literals is required to specify anaphoric possibilities.",
        "The following example has an analysis in UNE that grows as the factorial of the length of the input: (2) John told Bill that Tom told him that Fred told him that ... that Jim told him that Harry told him that it is raining.",
        "The first occurrence of him can have John or Bill as antecedent.",
        "The second occurrence of him can have John or Bill or Tom as antecedent, and so on.",
        "(2) has an obvious analysis in CNF whose length is a quadratic function of the length of the input, namely",
        "(Z-A) q & (p1,1 vpi,2) & (p2,1 v p2,2 v P2,3) & (3) the block in the box on the table ... in the kitchen As [Church and Pahl 82] discuss, examples like (3) are similar to other structures with systematic attachment ambiguities, such as coordination structures.",
        "While the number of readings of (3) is thus exponential in the length of (3), (3) has an 0(n11) length analysis in CNIF as follows:",
        "where the notation follows the same conventions as in (1-a,b).",
        "The number of readings for the following noun phrase grows as the Catalan of the number of prepositional phrases: In (3-a), p. .",
        "comprises the specification that constituent i attaches to constituent j, where the block is constituent 0, in the box is constituent 1, on the table is constituent 2, and so on.",
        "Constituent k must attach to some constituent that lies to its left.",
        "If constituent k attaches to",
        "constituent m, then the constituents between constituent in and constituent k cannot attach to constituents to the left of constituent m.4 For each pair (k,m), the number of atoms in (3-ak,m) is f (k,m) ='xi.",
        "ft(k,m) is quadratic in k. For each k, then, the number of atoms in (3-a-k) is f2(k) = k+ f i(k ,i), a cubic function in k. The number of i= atoms in (3-a) (excluding atoms hidden in q) is thus f 2(i ), a quartic function in n. (3-a) is certainly not the most compressed CNF analysis of (3).",
        "It is, however, easy to describe.",
        "Given an exhaustive analysis in DNF, choosing a global interpretation requires exactly one operation of selecting a disjunct.",
        "For (1-b) and (2-a), choosing a global interpretation requires a number of selections that is linear in the length of the input.",
        "I am aware of no other reason for preferring DNF to CNF for analyses of examples like (1) and (2).",
        "In favor of preferring CNF there is the practical advantage of polynomial-space output, with its implications for speed of processing.",
        "There is also the possibility of more accurate psycholinguistic modeling.",
        "It seems likely that people make decisions on antecedents for pronouns in examples like (1) and (2) locally, on a pronoun-by-pronoun basis, and that they do not choose among global analyses.5 In contrast, the conjuncts of (3-a) clearly do not correspond one-to-one with processing decisions.",
        "Section 4 discusses an analysis of (3) whose components may correspond to local decisions on attachment sites.",
        "3.",
        "Encodings with non-atomic propositional constants It is possible to get a cubic length analysis of (3) by introducing constants for non-atomic propositions.",
        "For m<k, let rk,m be (pk-1,m+1Pk- 1, m+2 VV Pk-1 ,k-2)'",
        "Of course, the space required to define the rkmi must figure in the space required to encode an analysis of (3) along the lines of (3-b-k,m).",
        "rk,rn-1 (pk-1 v rk,rn), so",
        "it requires quadratic space to define all the rk m. A revised version of (3) with (3-b-k,m) in place of (3-ak,m) throughout requires cubic space.6 Tree representations of single readings for examples like (3) may be viewed as follows: edges correspond to atomic propositions that comprise specifications like \"constituent i attaches to constituent j\" or \"constituent i projects to constituent j.\"7 A non-terminal node A corresponds to a constituent, but also corresponds to the conjunction of the atomic propositions that correspond to edges that A dominates.",
        "Thus the root node of the tree corresponds to a proposition that comprises a full specification of constituent structure.",
        "The situation is essentially the same for shared forests.",
        "({Tomita 87] discusses shared forests and packed shared forests.)",
        "Edges in shared forests correspond to atomic propositions, and non-terminal nodes correspond to non-atomic propositions.",
        "To extend this perspective, shared forests compress the information in non-shared forests by exploiting the introduction of constants for non-atomic propositions.",
        "In a shared forest, the subtree that a node dominates is written only once.",
        "In effect, then, a constant is introduced that represents the conjunction that corresponds to the node.",
        "This constant is a constituent of the formulas that correspond to superior nodes.",
        "While shared forests are more compressed than unshared forests, the number of nodes in the shared forest representation of (3) is still exponential in the length of (3).",
        "In a packed shared forest, a packed node that does not dominate any packed nodes corresponds to a disjunction of conjunctions of atomic propositions.",
        "Packed nodes that dominate other packed nodes correspond to disjunctions of conjunctions of atomic and non-atomic propositions.",
        "In effect, for each node (packed or non-packed), a constant is introduced that abbreviates the formula that corresponds to the node.",
        "Exploitation of constants for non-atomic propositions permits more significant compression for packed shared forests than for shared forests.",
        "The packed root node of a packed shared forest for (3) corresponds to a disjunction of conjunctions whose size in atoms is exponential in the length of (3).",
        "However, the number of nodes of a packed shared forest for (3) goes up as the square of the length of (3).",
        "The number of edges of the packed shared forest (a more authentic measure of the size of the forest) goes up as the cube of the length.",
        "6.",
        "Further compression is possible if we allow quantification over subscript indices.",
        "However, quantification over artifacts of representation may uncontroversially involve crossing the divide between analysis and procedure.",
        "7.",
        "Details of constituent structure are not relevant to the discussion here.",
        "For example, we will not distinguish \"X attaches to V\" from \"X attaches to VP.\"",
        "Here q represents aspects of the analysis of (3) aside from the specification of attachment points for the prepositional phrases.",
        "The desired solutions consist of specifications of attachment possibilities, stated in the form \"ap(PPk) E X\" (\"attachment point of the k-th PP is one of the dements of X\") in (3-c).",
        "The APk and REI, are introduced constants.",
        "APk is the attachment point oi PPIc*I REk represents the right edge of a constituent structure tree for the string consisting of the block and the first k PP's.",
        "(3-c) is in a sort of relaxed CNF, as discussed above in connection with (4-a), and in Section 5 below.",
        "\"T\" in (3-c) is defined so that RE I AP = (API o[ X e RE I X precedes AP).",
        "(WhenPPk to the right of PP.",
        "attaches above PP., PP, is not in the right edge of the resulting structure, and is unavailable for attachment by material to the right of PPk.)",
        "As for (3), the number of readings of the following example (from [Church and Patil 82]) grows as the Catalan of the number of prepositional phrases: (5) Put the block in the box on the table ... in the kitchen.",
        "However, there is an important difference between (3) and (5).",
        "In (3), any number of PP's can attach to the block, any number of PP's can attach to the box, and so on.",
        "No NP in (3) requires complements.",
        "(In the box must attach to the block, but only because the block is the only NP that lies to the left of in the box.)",
        "In (5), on the other hand, put requires one NP argument and one PP argument, and cannot accept any other complements.\" An analysis of (5) along the lines of (3- c) would incorrectly include readings where more than one PP attaches to put, and readings where no PP attaches to put.",
        "A linear analysis of (5) is as follows: 10.",
        "\"PPi attaches to PPk\" really means that PPI attaches to the object of the preposition head of PPk.",
        "This usage permits a briefer discussion than would otherwise be possible.",
        "11.",
        "This characterization of put is not strictly speaking correct, but the necessary qualifications are irrelevant to the discussion here.",
        "(5-a) is similar to (3-c), but includes the additional constants ()Gk.",
        "OGk is the open (theta-)grid for the substructure corresponding to put the block followed by the first k PP's.",
        "OGk is either (VP), if none of the first k PP's is attached to V, or is empty.",
        "Non-empty OGk indicates that for each constituent X in OGv, some PP., k<i5.n, must attach to X.",
        "\"Er in (5-a) is denned so that A 0 B is equal to A if A is non-empty, and is otherwise equal to B.",
        "The final conjunct in (5-a) captures the requirement that if none of the first ri-1 PP's attaches to put, then the final PP must attach to this verb."
      ]
    },
    {
      "heading": "5. Issues",
      "text": [
        "The example constructions presented above illustrate a variety of abstract cases.",
        "In (1), local ambiguities are independent of each other.",
        "The assignment of an antecedent to a pronoun in (1) does not affect the possibilities of antecedent assignment for other pronouns in (1).",
        "An analysis of (1) in CNF need not include more than one appearance of any literal.",
        "(2) is similar to (1) in this respect.",
        "In (4), local ambiguities are interdependent, but local ambiguity possibilities depend only on ambiguity possibilities in neighboring clauses.",
        "There is thus a bound on how many ambiguities can interact.",
        "In (3), on the other hand, there is no such bound.",
        "Choosing an attachment site for PP.",
        "affects the attachment possibilities for P13.41, no matter how large k is.",
        "(5) is similar to (3), but also involves a global filter associated with the verb put.",
        "(3-c) and (5-a) employ a richer repertory of operators on structural constants (-, 0, 1') than is found in (1-c), (2-b), (2-c), and (4-a).",
        "(1-b) may qualify relatively easily as an exhaustive analysis of (1), according to a common conception of what constitutes an analysis.",
        "(3-c), on the other hand, appears to have some of the earmarks of a procedure.",
        "The similarity of introduced constants to local variables is obvious.",
        "In particular, the constants AP, and RE, of",
        "(3-c) could be replaced with two local variables AP and RE that receive destructive assigmnent.",
        "(3-c) also employs the operators \"T\" and \"u\", which might be regarded as corresponding to procedures.",
        "Whether (3-c) is an analysis or a procedure for computing analyses is ultimately a matter of selecting a definition for \"linguistic analysis.\" Criteria for a successful definition of \"linguistic analysis\" might appeal to psychological reality.",
        "One possible requirement is that components of analyses correspond to partial analyses built during human processing.",
        "When definitions of constants (assignments to local variables) are blended into what is otherwise a CM', formula, as in (2-c), (3-c), (4-a), and (5-a), the result might be called \"relaxed CNE\" Somewhat more precisely, suppose that a formula in \"relaxed CNF\" is a conjunction of \"relaxed disjunctions,\" where a \"relaxed disjunction\" is the conjunction of a \"generalized disjunction\" with an \"assignment formula.\" A \"generalized disjunction\" may be either a disjunction of atoms, or a statement of the form \"x e A.\" An \"assignment formula\" is a conjunction of statements that assign values to constants.",
        "Given such a relaxed CNF formula as an exhaustive analysis, obtaining an analysis of a single reading requires for each generalized disjunction the choice of a disjunct or the selection of an element.",
        "Such single-reading analyses may be produced by deterministic variants of non-deterministic processing models that produce exhaustive analyses in relaxed CNE Relaxed CNF is compatible with a variety of processing models.",
        "For example, a component of the form \"x c A\" might be produced before components that specify the contents of A.",
        "Recent work on Kolmogorov complexity might provide alternative criteria for the definition of \"linguistic analysis.\" ([Li and Vitifnyi 891 is a recent survey of work on Kolmogorov complexity.)",
        "In particular, notions of time-bounded algorithmic complexity, such as the \"logical depth'' of [Bennett 88], may be relevant.",
        "Following a third alternative, a satisfactory definition of \"analysis\" may involve a correspondence principle, along the following lines: every component of a \"legal\" analysis specifically mentions one or more components of the input.",
        "For this to work, \"component\" and \"mention\" themselves require appropriate definitions.",
        "Arbitrary fragments of analyses cannot count as \"components.\" \"Mention\" should be transitive.",
        "Analyses in relaxed CNF may be more compatible with principle-based grammars than are tree-based analyses.",
        "([Chomsky 81] is the seminal work on principle-based grammars.)",
        "Constituent structure does not occupy as central a place in the principle-based paradigm as in other grammatical paradigms.",
        "Each generalized disjunction (or its deterministic counterpart) supplies a piece of information about the analyzed expression.",
        "Assignment formulas capture logical dependencies among these pieces.",
        "Each of the examples in this Dauer illustrates a single Phenomenon.",
        "Relaxed CNE can also capture interactions among phenomena.",
        "Analyses like (3-c) are probably less easily readable than packed shared forests.",
        "Full analyses that specify constituent structure information together with relative operator scope information, information on anaphora, and so on, will be even less readable.",
        "It may be possible to devise a more graphically oriented notation for linear encodings of linguistic analyses.",
        "Whatever conception of \"linguistic analysis\" may ultimately prove most useful, it seems clear that working with relaxed Conjunctive Normal Form has advantages over working with Disjunctive Normal Form for computational applications.",
        "Relaxed CNF also appears to have advantages over DNF for psycholinguistic modeling.",
        "Introduced constants (local variables) have obvious utility in implementations.",
        "They may also play a role in human processing of language.",
        "In particular, as human processing proceeds, explicit details of previously encountered structure may recede into the background yet remain accessible."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "I am indebted for comments and discussions to Steven Abney, Yves Caseau, and Andrew Ogielski.",
        "Responsibility for errors is entirely mine."
      ]
    }
  ]
}
