{
  "info": {
    "authors": [
      "Philip Blunsom",
      "Trevor Cohn",
      "Sharon Goldwater",
      "Mark Johnson"
    ],
    "book": "ACL-IJCNLP: Short Papers",
    "id": "acl-P09-2085",
    "title": "A Note on the Implementation of Hierarchical Dirichlet Processes",
    "url": "https://aclweb.org/anthology/P09-2085",
    "year": 2009
  },
  "references": [
    "acl-D07-1072",
    "acl-D08-1033",
    "acl-P06-1085",
    "acl-P07-1035"
  ],
  "sections": [
    {
      "text": [
        "Phil Blunsom*",
        "Sharon Goldwater*",
        "Trevor Cohn*",
        "Mark Johnson^",
        "*Department of Informatics University of Edinburgh Edinburgh, EH8 9AB, UK",
        "^Department of Cognitive and Linguistic Sciences Brown University Providence, RI, USA",
        "The implementation of collapsed Gibbs samplers for non-parametric Bayesian models is non-trivial, requiring considerable book-keeping.",
        "Goldwater et al.",
        "(2006a) presented an approximation which significantly reduces the storage and computation overhead, but we show here that their formulation was incorrect and, even after correction, is grossly inaccurate.",
        "We present an alternative formulation which is exact and can be computed easily.",
        "However this approach does not work for hierarchical models, for which case we present an efficient data structure which has a better space complexity than the naive approach."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Unsupervised learning of natural language is one of the most challenging areas in NLP.",
        "Recently, methods from nonparametric Bayesian statistics have been gaining popularity as a way to approach unsupervised learning for a variety of tasks, including language modeling, word and morpheme segmentation, parsing, and machine translation (Teh et al., 2006; Goldwater et al., 2006a; Goldwater et al., 2006b; Liang et al., 2007; Pinkel et al., 2007; DeNero et al., 2008).",
        "Lhese models are often based on the Dirichlet process (DP) (Perguson, 1973) or hierarchical Dirichlet process (HDP) (Leh et al., 2006), with Gibbs sampling as a method of inference.",
        "Exact implementation of such sampling methods requires considerable bookkeeping of various counts, which motivated Goldwater et al.",
        "(2006a) (henceforth, GGJ06) to develop an approximation using expected counts.",
        "However, we show here that their approximation is flawed in two respects: 1) It omits an important factor in the expectation, and 2) Even after correction, the approximation is poor for hierarchical models, which are commonly used for NLP applications.",
        "We derive an improved 0(1) formula that gives exact values for the expected counts in non-hierarchical models.",
        "For hierarchical models, where our formula is not exact, we present an efficient method for sampling from the HDP (and related models, such as the hierarchical Pitman-Yor process) that considerably decreases the memory footprint of such models as compared to the naive implementation.",
        "As we have noted, the issues described in this paper apply to models for various kinds of NLP tasks; for concreteness, we will focus on n-gram language modeling for the remainder of the paper, closely following the presentation in GGI06."
      ]
    },
    {
      "heading": "2. The Chinese Restaurant Process",
      "text": [
        "GGI06 present two nonparametric Bayesian language models: a DP unigram model and an HDP bigram model.",
        "Under the DP model, words in a corpus w = w\\... wn are generated as follows:",
        "where G is a distribution over an infinite set of possible words, Po (the base distribution of the DP) determines the probability that an item will be in the support of G, and cto (the concentration parameter) determines the variance of G.",
        "One way of understanding the predictions that the DP model makes is through the Chinese restaurant process (CRP) (Aldous, 1985).",
        "In the CRP, customers (word tokens Wi) enter a restaurant with an infinite number of tables and choose a seat.",
        "The table chosen by the ith customer, Zi, follows the distribution:",
        "/cäts\\ /frieoviX",
        "Figure 1.",
        "A seating assignment describing the state of a unigram CRP.",
        "Letters and numbers uniquely identify customers and tables.",
        "Note that multiple tables may share a label.",
        "where z_» = z\\... Zi-\\ are the table assignments of the previous customers, n^ is the number of customers at table k in z_», and K(z_j) is the total number of occupied tables.",
        "If we further assume that table k is labeled with a word type £k drawn from Pq, then the assignment of tokens to tables defines a distribution over words, with Wi = £Zi.",
        "See Figure 1 for an example seating arrangement.",
        "Using this model, the predictive probability of Wi, conditioned on the previous words, can be found by summing over possible seating assignments for Wi, and is given by",
        "This prediction turns out to be exactly that of the DP model after integrating out the distribution G. Note that as long as the base distribution Pn is fixed, predictions do not depend on the seating arrangement z_j, only on the count of word w in the previously observed words However, in many situations, we may wish to estimate the base distribution itself, creating a hierarchical model.",
        "Since the base distribution generates table labels, estimates of this distribution are based on the counts of those labels, i.e., the number of tables associated with each word type.",
        "An example of such a hierarchical model is the HDP bigram model of GGI06, in which each word type w is associated with its own restaurant, where customers in that restaurant correspond to words that follow w in the corpus.",
        "All the bigram restaurants share a common base distribution Pi over unigrams, which must be inferred.",
        "Predictions in this model are as follows:",
        "where h_j = (w_j,z_j), tWi is the number of tables labelled with Wi, and i* _1 is the total number of occupied tables.",
        "Of particular note for our discussion is that in order to calculate these conditional distributions we must know the table assignments z-i for each of the words in w_j.",
        "Moreover, in the Gibbs samplers often used for inference in",
        " – Expectation",
        "Antoniak approx.",
        "* Empirical, fixed base ° Empirical, interred base",
        "Figure 2.",
        "Comparison of several methods of approximating the number of tables occupied by words of different frequencies.",
        "For each method, results using a = {100,1000,10000,100000} are shown (from bottom to top).",
        "Solid lines show the expected number of tables, computed using (3) and assuming Pi is a fixed uniform distribution over a finite vocabulary (values computed using the Digamma formulation (7) are the same).",
        "Dashed lines show the values given by the Antoniak approximation (4) (the line for a = 100 falls below the bottom of the graph).",
        "Stars show the mean of empirical table counts as computed over 1000 samples from an MCMC sampler in which P1 is a fixed uniform distribution, as in the unigram LM.",
        "Circles show the mean of empirical table counts when Pi is inferred, as in the bigram LM.",
        "Standard errors in both cases are no larger than the marker size.",
        "All plots are based on the 30114-word vocabulary and frequencies found in sections 0-20 of the WSJ corpus.",
        "these kinds of models, the counts are constantly changing over multiple samples, with tables going in and out of existence frequently.",
        "This can create significant bookkeeping issues in implementation, and motivated GGI06 to present a method of computing approximate table counts based on word frequencies only."
      ]
    },
    {
      "heading": "3. Approximating Table Counts",
      "text": [
        "Rather than explicitly tracking the number of tables tw associated with each word w in their bigram model, GGI06 approximate the table counts using the expectation E[tw].",
        "Expected counts are used in place of t^T and in (2).",
        "The exact expectation, due to Antoniak (1974), is",
        "Antoniak also gives an approximation to this expectation:",
        "but provides no derivation.",
        "Due to a misinterpretation of Antoniak (1974), GGJ06 use an approximation that leaves out all the P\\ (w) terms from (4).",
        "Figure 2 compares the approximation to the exact expectation when the base distribution is fixed.",
        "The approximation is fairly good when etP\\{w) > 1 (the scenario assumed by Antoniak); however, in most NLP applications, etP\\{w) < 1 in order to effect a sparse prior.",
        "(We return to the case of non-fixed based distributions in a moment.)",
        "As an extreme case of the paucity of this approximation consider a\\P\\{w) = 1 and nw = 1 (i.e. only one customer has entered the restaurant): clearly E[tw] should equal 1, but the approximation gives log{2).",
        "We now provide a derivation for (4), which will allow us to obtain an 0(1) formula for the expectation in (3).",
        "First, we rewrite the summation in (3) as a difference of fractional harmonic numbers:",
        "Using the recurrence for harmonic numbers:",
        "E[tw] w aiPi(w)",
        "We then use the asymptotic expansion, Hp Ki log F + 7 + , omiting trailing terms which are 0{F~) and smaller powers of F:",
        "Omitting the trailing term leads to the approximation in Antoniak (1974).",
        "However, we can obtain an exact formula for the expectation by utilising the relationship between the Digamma function and the harmonic numbers: ip(ri) = Hn_i – 7/ Thus we can rewrite (5) as:",
        "lrThe authors of GGJ06 realized this error, and current implementations of their models no longer use these approximations, instead tracking table counts explicitly.",
        "fractional harmonic numbers between 0 and 1 are given by Hp = Jo 1i*x dx.",
        "All harmonic numbers follow the recurrence Hf = Hf-i + -4.",
        "Here, 7 is the Euler-Mascheroni constant.",
        "Explicit table tracking:",
        "Histogram:",
        "word type – > j table occupancy – > frequency j",
        "Figure 3.",
        "The explicit table tracking and histogram representations for Figure 1.",
        "A significant caveat here is that the expected table counts given by (3) and (7) are only valid when the base distribution is a constant.",
        "However, in hierarchical models such as GGJ06's bigram model and HDP models, the base distribution is not constant and instead must be inferred.",
        "As can be seen in Figure 2, table counts can diverge considerably from the expectations based on fixed P\\ when P\\ is in fact not fixed.",
        "Thus, (7) can be viewed as an approximation in this case, but not necessarily an accurate one.",
        "Since knowing the table counts is only necessary for inference in hierarchical models, but the table counts cannot be approximated well by any of the formulas presented here, we must conclude that the best inference method is still to keep track of the actual table counts.",
        "The naive method of doing so is to store which table each customer in the restaurant is seated at, incrementing and decrementing these counts as needed during the sampling process.",
        "In the following section, we describe an alternative method that reduces the amount of memory necessary for implementing HDPs.",
        "This method is also appropriate for hierarchical Pitman-Yor processes, for which no closed-form approximations to the table counts have been proposed."
      ]
    },
    {
      "heading": "4. Efficient Implementation of HDPs",
      "text": [
        "As we do not have an efficient expected table count approximation for hierarchical models we could fall back to explicitly tracking which table each customer that enters the restaurant sits at.",
        "However, here we describe a more compact representation for the state of the restaurant that doesn't require explicit table tracking.",
        "Instead we maintain a histogram for each dish Wi of the frequency of a table having a particular number of customers.",
        "Figure 3 depicts the histogram and explicit representations for the CRP state in Figure 1.",
        "Our alternative method of inference for hierarchical Bayesian models takes advantage of their Algorithm 1A new customer enters the restaurant 5 Conclusion",
        "w: word type",
        "Pq : Base probability for w HDTO: Seating Histogram for w procedure INCREMENT^, P$, HDro)",
        "> share an existing table > open a new table > Sample from the histogram of customers at tables",
        "for c e HDTO do > c: customer count",
        "HDro[c] =HDro[c] + l Break",
        "Algorithm 2 A customer leaves the restaurant",
        "HDW: Seating histogram for w procedure DECREMENT^, P$ r < – random(0,nZ) for c e HDTO do",
        "> c: customer count",
        "> Update token count",
        "exchangeability, which makes it unnecessary to know exactly which table each customer is seated at.",
        "The only important information is how many tables exist with different numbers of customers, and what their labels are.",
        "We simply maintain a histogram for each word type w, which stores, for each number of customers m, the number of tables labeled with w that have m customers.",
        "Figure 3 depicts the explicit representation and histogram for the CRP state in Figure 1.",
        "Algorithms 1 and 2 describe the two operations required to maintain the state of a CRP.",
        "When a customer enters the restaurant (Alogrithm 1)), we sample whether or not to open a new table.",
        "If not, we sample an old table proportional to the counts of how many customers are seated there and update the histogram.",
        "When a customer leaves the restaurant (Algorithm 2), we decrement one of the tables at random according to the number of customers seated there.",
        "By exchangeability, it doesn't actually matter which table the customer was \"really\" sitting at.",
        "We've shown that the HDP approximation presented in GGJ06 contained errors and inappropriate assumptions such that it significantly diverges from the true expectations for the most common scenarios encountered in NLP As such we emphasise that that formulation should not be used.",
        "Although (7) allows E[tw] to be calculated exactly for constant base distributions, for hierarchical models this is not valid and no accurate calculation of the expectations has been proposed.",
        "As a remedy we've presented an algorithm that efficiently implements the true HDP without the need for explicitly tracking customer to table assignments, while remaining simple to implement."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The authors would like to thank Tom Griffiths for providing the code used to produce Figure 2 and acknowledge the support of the EPSRC (Blunsom, grant EP/D074959/1; Cohn, grant GR/T04557/01)."
      ]
    }
  ]
}
