{
  "info": {
    "authors": [
      "Craig A. Struble",
      "Chitti Dharmanolla"
    ],
    "book": "Workshop on Linking Biological Literature, Ontologies and Databases",
    "id": "acl-W04-3106",
    "title": "Clustering MeSH Representations of Biomedical Literature",
    "url": "https://aclweb.org/anthology/W04-3106",
    "year": 2004
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Biomedical literature contains vital information for the analysis and interpretation of experiments in the biological sciences.",
        "Human reasoning is the primary method for extracting, synthesizing, and interpreting the results contained in the literature, yet the rate at which publications are produced is exponential.",
        "With the advent of digital, full-text publication and increasing computational power, automated techniques for knowledge discovery and synthesis are being developed to assist humans in making sense of growing literature databases.",
        "We investigate the use of ontological information provided by the Medical Subject Headings (MeSH) project to discover groupings within a collection of medical literature stored in PubMed.",
        "Vector representations of documents based on MeSH terms are presented.",
        "Results of agglomerative hierachical clustering on two collections ofbiomedical literature, the Rat Genome Database and Tourette’s Syndrome related research, suggest novel and understandable groupings are obtainable."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In recent years the amount of online documents has grown tremendously that poses challenges for information retrieval from this vast collection.",
        "Text mining is the application of techniques of machine learning in conjunction with natural language processing, information extraction and algebraic/mathematical approaches to computational information retrieval (Berry and Pottenger, 2003).",
        "Two major subfields of text mining are document classification and document clustering.",
        "Document classification is the automated assignment of textual data to groups or classes.",
        "Supervised machine learning techniques, such as neural networks or nearest neighbor classifiers, are often employed in document classification.",
        "Document clustering identifies groups of similar documents based on shared features, typically words contained in the documents.",
        "This differs from document classification in that topic areas are unknown before clustering.",
        "An important consideration for document classification and document clustering is the representation of the documents for analysis.",
        "Traditional approaches represent documents by extracting features from the full-text contents of each document.",
        "These features may undergo transformations such as weighting or dimension reduction with the goal of improving classification accuracy, improving clustering quality, or data reduction.",
        "Our goal is to explore Medical Subject Headings (MeSH), a controlled vocabulary for describing medical literature (National Library of Medicine, 2003), as features for document representation.",
        "Exploring this use of MeSH is important for two reasons.",
        "First, MeSH terms are assigned to papers by trained indexers, thus many issues involved with natural language processing may be avoided.",
        "Second, insights gained with MeSH based representations may be applied to other ontologies under development such as the Gene Ontology (The Gene Ontology Consortium, 2000).",
        "In this paper, we focus on the interplay between MeSH based representations and document clustering.",
        "Our application of document clustering is to identify and summarize potential topics within collections of medical literature.",
        "The outline of the rest of the paper is as follows.",
        "Section 2 discusses methods for obtaining document collections.",
        "Representations of documents, including our proposed MeSH representations are described in Section 3.",
        "Section 4 outlines the document clustering approach used in our study.",
        "Results from a comparative study and an exploratory study are presented in Section 5.",
        "Section 6 contains a survey of related work.",
        "Conclusions and future opportunities are discussed in Section 7."
      ]
    },
    {
      "heading": "2 Document Collections Given T, a document d E D is represented as a vector",
      "text": [
        "Collections of documents can be obtained by several means.",
        "In the simplest situation, any sample of documents contained in PubMed can be obtained for the purposes of document clustering.",
        "Such a sampling may provide insight into the whole of PubMed, but is most likely not useful for specific text mining tasks.",
        "A more useful approach for targeted text mining is to build a query or collection of queries centered around a concept.",
        "For example, in studying prostate cancer, the query string prostate cancer is given to PubMed.",
        "The documents matching the query for prostate cancer are retrieved and processed for document clustering.",
        "The identified clusters represent potential topics contained in prostate cancer research.",
        "This approach has been used to build concept profiles for several text mining tasks (Srini-vasan and Wedemeyer, 2003; Srinivasan, to appear).",
        "Other possible methods for obtaining document collections exist as well.",
        "In obtaining documents for a genome database, such as the Rat Genome Database (RGD) (Twigger et al., 2002), human curators combine queries of PubMed with an exhaustive reading of a limited number of journals.",
        "This may be viewed as another form of a concept-based collection.",
        "In this case, however, the collection captures several ill defined concepts; ones that cannot be specified with a small number of PubMed queries.",
        "This investigation considers both methods of obtaining document collections."
      ]
    },
    {
      "heading": "3 Document Representations",
      "text": [
        "Representing documents for clustering and other text mining tasks is a fundamental step in the knowledge discovery process.",
        "The ability to derive useful information from a document collection may be entirely determined by the attributes used to describe the documents.",
        "A commonly used representation in text mining and information retrieval is the vector representation.",
        "A summary of vector representations is presented below and refer the reader to a text on information retrieval (Korfhage, 1997) for a more detailed description.",
        "Suppose D is a collection of documents and T = {t1, t2, ... , tn} is the collection of unique terms appearing in at least one document in D. Obtaining T is typically accomplished by extracting individual words (e.g., characters between spaces) from the text (e.g. titles, abstracts, and body) of each paper, although more sophisticated parsing may occur.",
        "Individual words may be further processed by stop word removal, the removal of words without inherent meaning such as articles or pronouns, and stemming, the removal of suffixes to extract only root words.",
        "This term processing often generates better classification and information retrieval results.",
        "where wi is called the weight of term ti within document d. Weights are defined based on specific application needs.",
        "Two examples of commonly used weighting schemes are term frequency (TF) and term frequency inverse document frequency (TFIDF).",
        "Let I tiI be the number of times ti appears in a document d, I D I be the number of documents in the document collection, and ni be the number of documents in D containing ti.",
        "The TF scheme is defined by wi = I ti I.",
        "The TFIDF scheme is defined by wi = ItiI/log2(IDI/ni).",
        "Consider a document collection D with term collection T = {cancer, diagnosis, medical, viral}.",
        "If a document d contains three occurences of the term cancer, one occurence of the term diagnosis, four occurences of the term medical, and no occurences of the term viral.",
        "The representation of d using TF weighting is"
      ]
    },
    {
      "heading": "3.1 MeSH Representations",
      "text": [
        "This investigation builds on the vector space representation of documents described above.",
        "Instead of obtaining a term collection T from the full text of titles, abstracts, or content of a paper, T is built from the MeSH assignments for each document.",
        "A summary of MeSH is given below.",
        "Medical literature is indexed by MeSH terms by the National Library of Medicine (NLM) for the purpose of subject indexing and searching of journal articles in PubMed (an online literature database that contains citations from more than 4,600 biomedical journals).",
        "MeSH terms are assigned to medical literature by human indexers.",
        "MeSH consists of two ontologies: descriptors or headings are a collection of terms for primary themes or topics contained in the literature; and qualifiers or subheadings are terms combined with descriptors to indicate the specific aspect of a descriptor.",
        "Formally, a MeSH term is a tuple (d, q) where d is a descriptor and q is a qualifier (q may be empty if d is unqualified).",
        "There exist 21975 descriptors and 83 qualifiers in the 2003 MeSH ontology, which was used in this study.",
        "Both descriptors and qualifiers are organized in directed acyclic graphs (DAGs), where the parent of a descriptor or qualifier is considered more general than the term itself.",
        "A descriptor (or qualifier) may have multiple parents, representing that the descriptor (or qualifier) includes multiple concepts in the MeSH ontology simultaneously.",
        "For example, in the 2003 MeSH ontology, descriptors have an average of approximately 1.8 parents.",
        "Portions of the descriptor and qualifier ontologies are displayed in Figures 1 and 2.",
        "In MeSH representations, weights are derived from the structure of MeSH.",
        "Documents are represented as vectors where the term collection T consists of descriptors only, qualifiers only, or combined descriptors and qualifiers (this will be further referred to as the combined representation).",
        "Weights are defined by 0 if term ti is not assigned 1 if term ti is inferred 2 if term ti is assigned A term is inferred if one of its descendants in the MeSH hierarchy is assigned, but the term itself is not assigned.",
        "Consider d with the term Viremia assigned.",
        "The descriptors only representation is",
        "where the columns correspond to Animal Diseases, Bacterial Infections and Mycoses, Diseases, Infection, Parasitic Diseases, Sepsis, Septicemia, Viral Diseases, Viremia, and Zoonoses respectively.",
        "The relationship between the MeSH hierarchy and the values assigned is demonstrated in Figure 1.",
        "In essence, the DAG structure is flattened, but allowable vectors for document representation are restricted to the structure imposed by MeSH."
      ]
    },
    {
      "heading": "4 Document Clustering",
      "text": [
        "Many clustering algorithms have been proposed for document clustering.",
        "In this study, AGNES (Kaufman and Rousseeuw, 1990), an agglomerative hierarchical clustering algorithm, with average linking was employed.",
        "Using this algorithm has two advantages for this study.",
        "First, dendrograms, a visualization of the substructures contained in a document collection, are produced.",
        "Second, AGNES computes an agglomerative coefficient a.",
        "Let and be the height at which d is first merged, and M is the height of the final merge, then",
        "Intuitively, the agglomerative coefficient measures the average similarity of d to the members of the first cluster containing d, normalized to a [0, 1] range.",
        "For document collections of approximately equal size, a larger a indicates better clustering quality (Kaufman and Rousseeuw, 1990)."
      ]
    },
    {
      "heading": "4.1 Dimension Reduction",
      "text": [
        "The number of unique terms in document collection is typically large (> 1000), resulting in very high dimensional data.",
        "Dimension reduction is commonly employed in text mining before further analysis.",
        "Principal components analysis (PCA) and related approaches are methods for dimension reduction (Jolliffe, 1986).",
        "A full discussion of PCA is beyond the scope of this paper.",
        "Several guidelines exist for PCA to determine the number of dimensions to use.",
        "In this study, principal components are selected in descending order until 25% of the variation in the data is captured."
      ]
    },
    {
      "heading": "4.2 Document Similarity",
      "text": [
        "Many clustering algorithms require a measure of similarity between two documents be defined.",
        "Euclidean distance is one measure used in clustering applications.",
        "Another measure, used in information retrieval, is the cosine measure (Korfhage, 1997), which measures similarity by calculating the cosine of the angle between the vector representation of two documents.",
        "Cosine distance is used in this paper."
      ]
    },
    {
      "heading": "4.3 Cluster Identification and Summarization",
      "text": [
        "For MeSH representations, clusters are identified and summarized to find interesting groups in the document collection.",
        "Individual clusters are identified by cutting the dendrogram at different heights.",
        "The clusters are then summarized by computing the cluster center, a vector consisting of the mean term weights across constituent documents, using the full dimensional representation.",
        "Terms are ranked in descending order according to the resulting mean weight."
      ]
    },
    {
      "heading": "5 Experiments and Results",
      "text": [
        "Two document collections were analyzed using document clustering: documents in RGD (Twigger et al., 2002), and documents retrieved by the PubMed query “Tourette’s Syndrome.” Each data set is described in more detail below.",
        "The following procedure was employed for each collection.",
        "1.",
        "Documents are encoded in a vector representation.",
        "The term collection T is derived from terms in abstracts and titles, MeSH descriptors, MeSH qualifiers, or a combination of MeSH descriptors and qualifiers.",
        "For full-text, terms from abstracts and titles were obtained using rainbow with stop word removal and stemming options (McCallum, 1996).",
        "TF weighting was used.",
        "For the MeSH descriptors and qualifiers, the assignments were obtained from PubMed XML entries, and inferring was determined by the 2003 MeSH.",
        "2.",
        "PCA was performed on the represented documents, and principal components capturing 25% of the data variance were selected.",
        "The documents were projected onto the selected components.",
        "3.",
        "The reduced dimension representation was clustered by AGNES using average linking.",
        "The cosine distance measure was used for document similarity.",
        "4.",
        "Clusters were identified and summarized.",
        "Computations were performed using R version 1.7.1 (R Development Core Team, 2003).",
        "Clustering was accomplished using the agne s function in the cluster package.",
        "PCA calculations used the prcomp function in the mva package."
      ]
    },
    {
      "heading": "5.1 Rat Genome Database",
      "text": [
        "The Rat Genome Database (RGD) is a NIH (National Institutes of Health) project developed at Medical College of Wisconsin (MCW) whose main objective is to collect, consolidate and integrate data generated from rat research (Twigger et al., 2002).",
        "Rat is the dominant preclinical model organism used to study human diseases involving heart, lung, kidney, blood and vasculature, such as hypertension and renal failure.",
        "Researchers at MCW curate approximately 200 articles from 30 journals every month.",
        "This is a small portion of the 1200 articles published on rat research every month.",
        "The concepts embodied by this document collection are ill defined.",
        "Several conversations with the RGD curators resulted in no clear specification of interests or search terms.",
        "A comparative study of full text (abstracts and titles), MeSH descriptors, MeSH qualifiers, and a combined MeSH descriptors and qualifiers representation was performed.",
        "The document collection consists of 2713 papers.",
        "The term collection T for the full-text representation contained 17177 unique terms after stemming and stop word removal; and for the MeSH representations, T contained 5013 descriptors and 64 qualifiers.",
        "After PCA, the number of principal components used for the descriptors, qualifiers, combined, and full-text representations are 16, 2, 62, and 37 respectively.",
        "The clustering quality of each representation was evaluated using 20 bootstrap samples (i.e., sampling with replacement) of size 2713 from the 2713 documents.",
        "Each sample was represented and clustered.",
        "The resulting agglomerative coefficients were tabulated (Table 1).",
        "To show a significant difference in the agglomerative coefficients obtained between MeSH representations and the full-text representation, the Wilcoxon rank sum test, a non-parametric version of the paired t-test, was applied.",
        "The p-values in Table 2 indicate that each of the MeSH representations are significantly different than the full-text representation.",
        "By observing that larger agglomerative coefficients indicate higher quality clustering, we conclude that MeSH representations offer higher quality clustering than the full-text representation.",
        "The full text and combined MeSH representations are further explored.",
        "Dendrograms for the full text representation (Figure 4) and combined representation (Figure 3) show the structure of the document collection.",
        "The combined representation results in two clearly distinct clus",
        "ters identified at height 1.0.",
        "Furthermore, the tree contains several small and tight clusters at a low height, indicating the existence of possible subconcepts.",
        "In contrast, the resulting tree for the full text representation does not reveal the same structure, suggesting subconcepts are not clearly identified.",
        "Depicted in Figures 5 and 6 are two dimensional scat-terplots of the documents projected on the first two principal components of the combined representation and full-text representation respectively.",
        "These plots also show a structure with the descriptors and qualifiers representation, there are two distinguished clusters with few outliers.",
        "The two clusters in the dendrogram of the combined representation correspond to the left and right groups seen in the scatterplot.",
        "Table 3 presents summary description of the clusters found for the combined representation.",
        "Terms with a weight > 0.5 are included.",
        "The summary describes the two major groups of papers: one related to sequence and molecular techniques; the other related to metabolism, biochemical phenomena and physiology."
      ]
    },
    {
      "heading": "5.2 Tourette’s Syndrome",
      "text": [
        "A second, exploratory study was performed on a document collection about the disease Tourette’s Syndrome.",
        "Only the results of using the combined representation are presented here.",
        "terized by motor and vocal tics and associated behavioral abnormalities.",
        "Chromosomes 2, 7, 11, and 18 have been implicated in causal effects of the disease (OMIM, 2003).",
        "The collection was obtained using the query “Tourette’s Syndrome” on PubMed, resulting in 2241 papers.",
        "The term collection for the combined representation consists of 6524 MeSH descriptors and 76 MeSH qualifiers.",
        "Only 8 principal components were required to capture 25% of the variance in the data set.",
        "Figure 7 contains the resulting dendrogram.",
        "Three distinct clusters of documents exist at a height of 1.0.",
        "The leftmost cluster in the tree could be split again at a height of approximately 0.9.",
        "The clusters at lower heights are not as tightly defined as those in the RGD study, indicating more diversity in the document contents.",
        "Summaries of the three clusters are given in Table 4.",
        "In all three clusters, terms associated with Tourettes Syndrome appear with a weight > 0.5 in the cluster center.",
        "Documents in the left cluster appear to focus on the psychology and diagnosis associated with the disease, discussing all age groups and genders.",
        "The middle cluster consists of papers associated with the genetics and physiopathological diagnosis of Tourette’s Syndrome.",
        "Of particular interest is the lack of age and gender terms, meaning the papers do not represent consistent themes in ages or genders.",
        "Papers associated with drug therapy and pharmacological studies comprise the right cluster, again spanning all age groups and genders.",
        "It should be noted that Tourette’s Syndrome patients show a therapeutic response to Haloperidol (OMIM, 2003).",
        "The three identified clusters are represented by 1, 2 (in the bottom center of the plot), and 3 in Figure 8, a scatterplot projected onto the first two principal components.",
        "The scatterplot along the first two principal components show a correspondence to the dendrogram: 1’s",
        "ing the combined MeSHd y axes are the first two principal components.",
        "correspond to the left cluster in the tree; 2’s3’serplot suggests the existence of smaller clusters, which agrees with the hierarchical clustering results."
      ]
    },
    {
      "heading": "6 Related Work",
      "text": [
        "Srinivasan has extensively investigated the use of MeSHAsz´odi,MeSH,MeSHMeSHMeSHMeSHnt-child relationships.",
        "Adapting this work to MeSH may be inter-ignore MeSH, arguing that it is not updated or may not capture the document contents.",
        "In our study, we found",
        "ing the full-text representation.",
        "The x and y axes are the first two principal components.",
        "ing the full-text representation.",
        "The x and y axes are",
        "1.0 of the agglomerative clustering results for the RGD document collection in terms of descriptors (capitalized) an d qualifiers (lower-case).",
        "esting.",
        "A distance measure using MeSH has been introduced as part of an algorithm to assign MeSH terms (Ontrup et al., 2003).",
        "The distance measure considers a tree based representation; the tree induced by assigned MeSH terms.",
        "To overcome combinatorial issues, representative subtrees are constructed.",
        "Distance is measured via complements and overlaps of representative subtrees.",
        "Transitive relationships between genes and disease with MeSH terms have also been explored (Hristovski and Peterlin, 2002; Perez-Iratxeta et al., 2002), using association rules and fuzzy logic models, respectively."
      ]
    },
    {
      "heading": "7 Conclusions and Future Work",
      "text": [
        "The presented results indicate that MeSH representations are useful for document clustering.",
        "MeSH representations provide better quality AGNES clustering than full text representations using TF weighting.",
        "Furthermore, clusters are easily summarized and the summaries can be readily interpreted in the context of the document collection.",
        "It is quite surprising that using principal components covering only 25% of the variance provides such obvious structure.",
        "Even the first two principal components elicits structure in the two document collections tested here.",
        "Many directions exist for improving MeSH representation.",
        "The representations may lose information embedded in the DAGs, since relationship between descriptors (or qualifiers) and their parents are not strictly maintained.",
        "Explicit associations between qualifiers and descriptors were removed to simplify representation; these should be reintroduced.",
        "MeSH “major themes”, an annotation indicating emphasis on a term, remains to be incor",
        "porated.",
        "The summarization approach is straightforward, but presents terms that are not insightful.",
        "For example, Rats is frequently a term with high ranking, bus is not informative in the RGD context.",
        "Similar observations have been previously made (Kankar et al., 2002).",
        "Term weighting and more flexibility in summarization should help.",
        "MeSH representations have disadvantages compared to full text.",
        "The manual curation process requires several weeks for indexing.",
        "Yearly revision of MeSH implies systems must adapt to changes.",
        "Full text in abstracts and papers contain more precise information.",
        "We feel, however, that combining ontology and full text representations should be beneficial."
      ]
    },
    {
      "heading": "8 Acknowledgements",
      "text": [
        "We would like to thank Susan Bromberg and the Rat Genome Database team for document information, discussions of curation tasks, and visitation space."
      ]
    }
  ]
}
