{
  "info": {
    "authors": [
      "Lei Cui",
      "Xilun Chen",
      "Dongdong Zhang",
      "Shujie Liu",
      "Mu Li",
      "Ming Zhou"
    ],
    "book": "EMNLP",
    "id": "acl-D13-1107",
    "title": "Multi-Domain Adaptation for SMT Using Multi-Task Learning",
    "url": "https://aclweb.org/anthology/D13-1107",
    "year": 2013
  },
  "references": [
    "acl-D07-1036",
    "acl-D08-1072",
    "acl-D10-1044",
    "acl-D11-1033",
    "acl-E12-1055",
    "acl-J03-1002",
    "acl-J07-2003",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P06-1096",
    "acl-P07-1004",
    "acl-P09-1098",
    "acl-P10-2041",
    "acl-P12-1002",
    "acl-P12-1099",
    "acl-P13-2061",
    "acl-W04-3250",
    "acl-W06-1607",
    "acl-W06-1615",
    "acl-W07-0717",
    "acl-W07-0733",
    "acl-W10-1757"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Domain adaptation for SMT usually adapts models to an individual specific domain.",
        "However, it often lacks some correlation among different domains where common knowledge could be shared to improve the overall translation quality.",
        "In this paper, we propose a novel multi-domain adaptation approach for SMT using Multi-Task Learning (MTL), with in-domain models tailored for each specific domain and a general-domain model shared by different domains.",
        "The parameters of these models are tuned jointly via MTL so that they can learn general knowledge more accurately and exploit domain knowledge better.",
        "Our experiments on a large-scale English-to-Chinese translation task validate that the MTL-based adaptation approach significantly and consistently improves the translation quality compared to a non-adapted baseline.",
        "Furthermore, it also outperforms the individual adaptation of each specific domain."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Domain adaptation is an active topic in statistical machine learning and aims to alleviate the domain mismatch between training and testing data.",
        "Like many machine learning tasks, Statistical Machine Translation (SMT) assumes that the data distributions of training and testing domains are similar.",
        "However, this assumption does not hold for real world SMT systems since training data for SMT models may come from a variety of domains.",
        "The translation quality is often unsatisfactory when ?This work was done while the first and second authors were visiting Microsoft Research Asia.",
        "translating texts from a specific domain using a general model that is trained over a hotchpotch of bilingual corpora.",
        "Therefore, domain adaptation is crucial for SMT systems to achieve better performance.",
        "Previous research on domain adaptation for SMT includes data selection and weighting (Eck et al., 2004; Lu?",
        "et al, 2007; Foster et al., 2010; Moore and Lewis, 2010; Axelrod et al., 2011), mixture models (Foster and Kuhn, 2007; Koehn and Schroeder, 2007; Sennrich, 2012; Razmara et al., 2012), and semi-supervised transductive learning (Ueffing et al., 2007), etc.",
        "Most of these methods adapt SMT models to a specific domain according to testing data and have achieved good performance.",
        "It is natural that real world SMT systems should adapt the models to multiple domains because the input may be heterogeneous, so that the overall translation quality can be improved.",
        "Although we can easily apply these methods to multiple domains individually, it is difficult to use the common knowledge across different domains.",
        "To leverage the common knowledge, we need to devise a multi-domain adaptation approach that jointly adapts the SMT models.",
        "Multi-domain adaptation has been proved quite effective in sentiment analysis (Dredze and Crammer, 2008) and web ranking (Chapelle et al., 2011), where the commonalities and differences across multiple domains are explicitly addressed by Multi-task Learning (MTL).",
        "MTL is an approach that learns one target problem with other related problems at the same time, using a shared feature representation.",
        "The key advantage of MTL is to enable implicit data sharing and regularization.",
        "Therefore, it often leads to a better model for each task.",
        "Analogously, we expect that the overall translation quality can be further improved by using an MTL-based",
        "data for the i-th domain selected from T using the bilingual cross-entropy based method (Axelrod et al., 2011).",
        "The in-domain TMi and LMi are trained using the in-domain training data Ti.",
        "The general-domain models TM-G and LM-G are trained using the entire training corpus T .",
        "Si is the domain-specific SMT system for the i-th domain, leveraging the in-domain models and the general-domain models as features.",
        "multi-domain adaptation approach.",
        "In this paper, we use MTL to jointly adapt SMT models to multiple domains.",
        "Specifically, we develop multiple SMT systems based on mixture models, where each system is tailored for one specific domain with an in-domain Translation Model (TM) and an in-domain Language Model (LM).",
        "Meanwhile, all the systems share a same general-domain TM and LM.",
        "These SMT systems are considered as several related tasks with a shared feature representation, which fits well into a unified MTL framework.",
        "With the MTL-based joint tuning, general knowledge can be better learned by the general-domain models, while domain knowledge can be better exploited by the in-domain models as well.",
        "By using a distributed stochastic learning approach (Simianer et al., 2012), we can estimate the feature weights of multiple SMT systems at the same time.",
        "Furthermore, we modify the algorithm to treat in-domain and general-domain features separately, which brings regularization to multiple SMT systems in an efficient way.",
        "Experimental results have shown that our method can significantly improve the translation quality on multiple domains over a non-adapted baseline.",
        "Moreover, the MTL-based adaptation also outperforms the conventional individual adaptation approach towards each domain.",
        "The rest of the paper is organized as follows: The proposed approach is explained in Section 2.",
        "Experimental results are presented in Section 3.",
        "Section 4 introduces some related work.",
        "Section 5 concludes the paper and suggests future research directions."
      ]
    },
    {
      "heading": "2 The Proposed Approach",
      "text": [
        "Figure 1 gives an example with N predefined domains to illustrate the main idea.",
        "There are three steps in the training phase.",
        "First, in-domain training data is selected according to the predefined domains (Section 2.1).",
        "Second, in-domain models and general-domain models are trained to develop the domain-specific SMT systems (Section 2.2).",
        "Third, multiple domain-specific SMT systems are tuned jointly by using an MTL-based approach (Section 2.3)."
      ]
    },
    {
      "heading": "2.1 In-domain Data Selection",
      "text": [
        "In the first step, in-domain bilingual data is selected from all the bilingual data to train in-domain TMs.",
        "We use the bilingual cross-entropy based approach (Axelrod et al., 2011) to obtain the in-domain data:",
        "where {s,t} is a bilingual sentence pair in the entire bilingual corpus.",
        "HI?xxx(?)",
        "and HG?xxx(?)",
        "represent the cross-entropy of a string according to an in-domain LM and a general-domain LM, respectively.",
        "?xxx?",
        "denotes either the source language (src) or the target language (tgt).",
        "HI?src(s)?HG?src(s) is the cross-entropy difference of string s between the in-domain and general-domain source-side LMs, and HI?tgt(t) ?",
        "HG?tgt(t) is the cross-entropy difference of string t between the in-domain and general-domain target-side LMs.",
        "This criterion biases towards sentence pairs that are like the in-domain corpus but unlike the general-domain corpus.",
        "Therefore, the sentence pairs with lower scores (larger differences) are presumed to be better.",
        "Now, the question is how to find sufficient monolingual data to train in-domain LMs.",
        "A straightforward solution is to collect the data from the internet.",
        "There are a large number of monolingual webpages with domain information from web portal sites1, which can be collected to train in-domain LMs.",
        "In large-scale real world SMT systems, practical domain adaptation techniques should target more domains rather than just one due to heterogeneous input.",
        "Therefore, we use a web crawler to collect monolingual webpages ofN domains from web portal sites, for both the source language and the target language.",
        "The statistics of web-crawled data is given in Section 3.1.",
        "We use the web-crawled monolingual documents to train N in-domain source-side LMs and N in-domain target-side LMs.",
        "Additionally, we also train the source-side and target-side general-domain LMs with all the web-crawled documents from different domains.",
        "Finally, these in-domain and general-domain LMs are used to select in-domain bilingual data for different domains according to Formula (1)."
      ]
    },
    {
      "heading": "2.2 SMT Systems with Mixture Models",
      "text": [
        "In the second step, with the selected in-domain training data, we develop SMT systems based on mixture models.",
        "In particular, we use the mixture model based approach proposed by Koehn and Schroeder 1Many web portal sites contain domain information for webpages, such as ?www.yahoo.com?",
        "in English and ?www.sina.com.cn?",
        "in Chinese and etc.",
        "The webpages are often categorized by human editors into different domains, such as politics, sports, business, etc.",
        "(2007).",
        "Specifically, we have developed N SMT systems for N domains respectively, where each system is a typical log-linear model.",
        "For each system, the best translation candidate f?",
        "is given by:",
        "where the translation probability P (f |e) is given by:",
        "where ?j(f, e) is the in-domain feature function and wj is the corresponding feature weight.",
        "?k(f, e) is the general-domain feature function and wk is the feature weight.",
        "The detailed feature description is as follows: In-domain features",
        "?",
        "An in-domain TM, including phrase translation probabilities and lexical weights for both directions (4 features) ?",
        "An in-domain target-side LM (1 feature) ?",
        "word count (1 feature) ?",
        "phrase count (1 feature) ?",
        "NULL penalty (1 feature) ?",
        "Number of hierarchical rules used (1 feature) General-domain features ?",
        "A general-domain TM, including phrase translation probabilities and lexical weights for both directions (4 features) ?",
        "A general-domain target-side LM (1 feature)",
        "The feature description indicates that each SMT system contains two TMs and two LMs.",
        "The in-domain TMs are trained using the selected bilingual training data according to Formula (1), and the general-domain TM is trained using the entire bilingual training data.",
        "For the LMs, we reuse the target-side in-domain LMs and general-domain LM trained",
        "for data selection (Section 2.1).",
        "Compared with a normal single-model system, the system with mixture models can balance the contributions from the general-domain and in-domain knowledge.",
        "Hence it potentially benefits from both."
      ]
    },
    {
      "heading": "2.3 MTL-based Tuning",
      "text": [
        "In the third step, the feature weights in multiple domain-specific SMT systems are estimated.",
        "Instead of tuning each domain-specific system separately, we treat different systems as related tasks and tune them jointly in an MTL framework.",
        "There are two main reasons for MTL-based tuning:",
        "1.",
        "Domain-specific translation tasks share the same general-domain LM and TM.",
        "MTL often",
        "leads to better performance by leveraging commonalities among different tasks.",
        "2.",
        "By enforcing that the general-domain LM and TM perform equally across different domains, MTL provides a kind of regularization to prevent over-fitting.",
        "Formally, the objective function of the proposed MTL-based approach is described as follows:",
        "where N is the number of predefined domains.",
        "{Fi,Ei} is the in-domain development dataset for the i-th domain.",
        "Fi denotes the source sentences and Ei denotes the reference translations.",
        "wi is a D-length feature weight column vector for the i-th domain, where D is the dimension of the feature space.",
        "W is a N -by-D matrix, representing [w1|w2 |.",
        ".",
        ".",
        "|wN ]T .",
        "e?",
        "(Fi,wi) are the best translations obtained for Fi with parameters wi.",
        "Loss(?, ?)",
        "denotes the loss between the system's output and the reference translations.",
        "The basic idea of the objective function is to minimize the sum of loss functions for all the domains, rather than one domain at a time.",
        "Therefore, by adjusting the in-domain and general-domain feature weights, the translation quality is expected to be good across different domains.",
        "To effectively tune SMT systems jointly, we modify the asynchronous Stochastic Gradient Descend (SGD) Algorithm (Simianer et al., 2012) to optimize objective function (4).",
        "We follow the pairwise ranking approach with the perceptron algorithm (Shen and Joshi, 2005) to update feature weights.",
        "Let a translation candidate be denoted by its feature vector v ?",
        "RD, the pairwise preference for training is constructed by ranking two candidates according to the smoothed sentence-level BLEU (Liang et al., 2006).",
        "For a preference pair v[j]=(v(1), v(2)) where v(1) is preferred, a hinge loss is used:",
        "where (x)+ = max(0, x) and ?",
        "?, ??",
        "denotes the inner product of two vectors.",
        "With the perceptron algorithm (Shen and Joshi, 2005), the gradient of the hinge loss is:",
        "The training instances for the discriminative learning in pairwise ranking are made by comparing the N-best list of the translation candidates scored by the smoothed sentence-level BLEU (Liang et al., 2006).",
        "Following Simianer et al. (2012), the N-best list is divided into three bins: the top 10% (High), the middle 80% (Middle), and the last 10% (Low).",
        "These bins are used for pairwise ranking where the translation preference pairs are built between the candidates in High-Middle, Middle-Low, and High-Low, but not the candidates within the same bin, which is shown in Figure 2.",
        "The idea is to guarantee that the ranker is more discriminative to prefer the good translations to the bad ones.",
        "1: Distribute N domain-specific decoders to N machines 2: Initialize w1,w2, .",
        ".",
        ".",
        ",wN ?",
        "0 3: for epochs t?",
        "0 .",
        ".",
        ".",
        "T ?",
        "1 do 4: for all domains d ?",
        "{1 .",
        ".",
        ".",
        "N}: parallel do 5: ud,t,0,0 = wd 6: S = |Fd| 7: for all i ?",
        "{0 .",
        ".",
        ".",
        "S ?",
        "1} do 8: Decode i-th sentence with ud,t,i,0 9: P = No.",
        "of pairs built from the N-best list 10: for all pairs v[j], j ?",
        "{0 .",
        ".",
        ".",
        "P ?",
        "1} do 11: ud,t,i,j+1 ?",
        "ud,t,i,j ?",
        "?",
        "?L(ud,t,i,j) 12: end for 13: ud,t,i+1,0 ?",
        "ud,t,i,P 14: end for 15: end for 16: for all domains d ?",
        "{1 .",
        ".",
        ".",
        "N} do 17: wd = ud,t,S,0 18: end for 19: WG ?",
        "[wG1 |.",
        ".",
        ".",
        "|w",
        "General-domain feature weights respectively.",
        "In Algorithm 1, we first distribute the domain-specific SMT decoders to different machines and initialize the feature weights (line 1-2).",
        "Typically, the SGD algorithm runs in several iterations (In this study, we set the number of epochs T to 20) (line 3).",
        "Multiple SMT decoders run in parallel and each decoder updates its feature weights individually using its in-domain development data (line 4-15).",
        "For each domain, the domain-specific decoder translates each in-domain development sentence and determines the N-best translations (line 4-8).",
        "The preference pairs are built and used to update the parameters by gradient descent with ?",
        "= 0.0001 (line 9-13).",
        "Each domain-specific decoder translates its in-domain development data multiple times.",
        "After each iteration, feature weights from all decoders are collected (line 16-19).",
        "In contrast to the original algorithm (Simianer et al., 2012), we only average the general-domain feature weights wG1 , .",
        ".",
        ".",
        ",w G N , but do not average the in-domain feature weights (line 20-25).",
        "The reason is we hope to leverage the commonalities among these systems.",
        "Meanwhile, general knowledge is enforced to be conveyed equally across different domains.",
        "Finally, the algorithm returns all the domain-specific feature weights w1,w2, .",
        ".",
        ".",
        ",wN that are used for testing (line 27).",
        "After the joint MTL-based tuning, the feature weights tailored for domain-specific SMT systems are used to translate the testing data.",
        "We collect in-domain testing data for each domain to evaluate the domain-specific systems.",
        "Although this is not always the case in real applications where the testing domain is known, this study mainly focuses on the effectiveness of the MTL-based tuning approach."
      ]
    },
    {
      "heading": "3 Experiments",
      "text": []
    },
    {
      "heading": "3.1 Data",
      "text": [
        "We evaluated our MTL-based domain adaptation approach on a large-scale English-to-Chinese machine translation task.",
        "The training data consisted of two parts: monolingual data and bilingual data.",
        "The monolingual data was used to train the source-side and target-side LMs, both of which were used for data selection in Section 2.1.",
        "In addition, the target-side LMs were reused in the SMT systems as features.",
        "As mentioned in Section 2.1, we built a web crawler to collect a large number of webpages from web portal sites in English and Chinese respectively.",
        "In the experiments, we mainly focused on six popular domains, namely Business, Entertainment, Health, Science & Technology, Sports, and Politics.",
        "For both English and Chinese webpages, the HTML tags were removed and the main content was extracted.",
        "The data statistics are shown in Table 1.",
        "The bilingual data we used was mainly mined from the web using the method proposed by Jiang et al. (2009), with a post-processing step using our bilingual data cleaning method (Cui et al., 2013).",
        "Therefore, the data quality is pretty good.",
        "In addition, we also used the English-Chinese parallel corpus released by LDC2.",
        "In total, the bilingual data 2LDC2003E07, LDC2003E14, LDC2004E12, LDC2005T06, LDC2005T10, LDC2005E83, LDC2006E26,",
        "numbers of documents and words (main content).",
        "?M?",
        "refers to million and ?B?",
        "refers to billion.",
        "contained around 30 million sentence pairs, with 404M words in English and 329M words in Chinese.",
        "For each domain, we used the cross-entropy based method in Section 2.1 to rank the entire bilingual data, and the top 10% sentence pairs from the ranked bilingual data were selected as the in-domain data to train the in-domain TM.",
        "Moreover, we prepared 2,000 in-domain sentences for development and 1,000 in-domain sentences for testing in each domain.",
        "The details are shown in Table 2.",
        "and testing data, in number of words."
      ]
    },
    {
      "heading": "3.2 Setup",
      "text": [
        "An in-house hierarchical phrase-based SMT decoder was implemented for our experiments.",
        "The CKY decoding algorithm was used and cube pruning was performed with the same default parameter settings as in Chiang (2007).",
        "We used a 100-best list from the decoder for the pairwise ranking algorithm.",
        "Translation models were trained over the bilingual data that was automatically word-aligned using GIZA++ (Och and Ney, 2003) in both directions, and the diag-grow-final heuristic was used to LDC2006E34, LDC2006E85, LDC2006E92.",
        "refine the symmetric word alignment.",
        "The phrase tables were filtered to retain top-20 translation candidates for each source phrase for efficiency.",
        "An in-house language modeling toolkit was used to train the 4-gram language models with modified Kneser-Ney smoothing (Kneser and Ney, 1995) over the web-crawled data.",
        "The evaluation metric for the overall translation quality was case-insensitive BLEU4 (Papineni et al., 2002).",
        "A statistical significance test was performed using the bootstrap re-sampling method (Koehn, 2004)."
      ]
    },
    {
      "heading": "3.3 Baseline",
      "text": [
        "We have two baselines.",
        "The first baseline is a non-adapted Hiero using our implementation.",
        "It contained the general-domain TM and LM, as well as other standard features.",
        "In addition, the fix-discount method (Foster et al., 2006) for phrase table smoothing was also used.",
        "The system was general-domain oriented and it was tuned by using MERT (Och, 2003) with a combination of six in-domain development datasets.",
        "The second baseline is Google Online Translation Service3.",
        "We obtained the English-to-Chinese translations of the testing data from Google Translation to have a more solid comparison.",
        "Moreover, we also compared our method with the adapted systems towards each domain individually (Koehn and Schroeder, 2007).",
        "This is to demonstrate the superiority of our MTL-based tuning approach across different domains."
      ]
    },
    {
      "heading": "3.4 Results",
      "text": [
        "performance to Google Translation, with certain domains performed even better (Business, Sci&Tech, Sports, Politics).",
        "This demonstrates that the translation quality of our baseline is state-of-the-art.",
        "Moreover, we can answer three questions according to the experimental results as follow: First, is domain mismatch a significant problem for a real world SMT system?",
        "We used the same system only with general-domain TM and LM, but tuned towards each domain individually using in-domain dev data.",
        "Table 3 shows that the setting",
        "is non-adapted and tuned using MERT on general-domain dev data.",
        "?[A]?",
        "denotes that the system is adapted towards each domain individually using MERT on in-domain dev data.",
        "?[A,MTL]?",
        "indicates that the system was tuned using our MTL-based approach on in-domain dev data.",
        "?I-TM?",
        "and ?G-TM?",
        "denote the in-domain and general-domain translation model.",
        "?I-LM?",
        "and ?G-LM?",
        "denote the in-domain and general-domain language model.",
        "We also obtained translations of the testing data using Google Translation for comparison.",
        "the non-adapted baseline across all domains with at least 1.2 BLEU points.",
        "In addition, the setting ?",
        "[A] G-TM + G-LM?",
        "also outperforms Google Translation on all domains.",
        "Analogous to previous research, this confirms that the domain mismatch indeed exists and the parameter estimation using in-domain dev data is quite useful.",
        "Second, does the mixture models based adaptation work for a variety of domains?",
        "We experimented with different settings with multiple TMs or LMs, or both.",
        "It is interesting to note that for large-scale SMT systems, using in-domain models alone is inferior to using the general models alone.",
        "The setting ?",
        "[A] G-TM + G-LM?",
        "is better than the setting ?",
        "[A] I-TM + I-LM?",
        "across different domains.",
        "The reason is the data for general models has already included the in-domain data and the data coverage is much larger, thus the probability estimation is more reliable and the translation quality is much better.",
        "For the LM, the in-domain LM performs better than the general-domain LM because our monolingual data (Table 1) for each domain is already sufficient for training an in-domain LM with good performance.",
        "From Table 3, we observed that the setting ?",
        "[A] (G+I)-TM + I-LM?",
        "outperforms ?",
        "[A] (G+I)-TM + G-LM?, with the ?Sports?",
        "domain being the most significant.",
        "For the TM, the performance of the in-domain TM is inferior to the general-domain TM.",
        "The results show that the setting ?",
        "[A] (G+I)-LM + G-TM?",
        "is significantly better than ?",
        "[A] (G+I)-LM + I-TM?.",
        "The main reason is the data coverage for in-domain TM is much smaller than the general model.",
        "When each system uses two TMs and two LMs, it consistently results in better performance, indicating that mixture models are crucial for domain adaptation in SMT.",
        "Third, can MTL further improve the translation quality?",
        "We used the MTL-based approach to jointly tune multiple domain-specific systems, leveraging the commonalities among different but related tasks.",
        "From Table 3, the MTL-based approach significantly improve the translation quality over the non-adapted baseline, and also outperforms conventional mixture models based methods.",
        "In particular, the ?Sports?",
        "domain benefits the most from the in-domain knowledge, which confirms that domain discrepancy should be addressed and may bring large improvements on certain domains."
      ]
    },
    {
      "heading": "3.5 Discussion",
      "text": [
        "According to our experiments, only averaging over the out-of-domain feature weights returned robust and converged results.",
        "We do not have theoretically grounded guarantee.",
        "However, we observed that the BLEU score of our method on DEV data was slightly lower than that in the baseline system, which indicates the out-of-domain features are less over-fitting on the domain-specific DEV data since",
        "SOURSE A point begins with a player serving the ball.",
        "This means one player hits the ball towards the other player.",
        "(The serve must be played from behind the baseline and must :::: land in the service box .",
        "Players get two attempts to make",
        "phrases with the same symbols (e.g., underline, wavy-line, and box).",
        "The details are explained in Section 3.5. we enforced them to play the same role across different domains.",
        "It seems that averaging the out-of-domain feature weights can be considered as a kind of regularization.",
        "An example sentence from the Sports domain with translations from different methods is shown in Table 4.",
        "In this sentence, the baseline always translates ?player?",
        "to ????",
        "(game player), which should be ????",
        "(ball player).",
        "And, the baseline translates ?serve?",
        "to ????",
        "(work for), which should be ????",
        "(put the ball into play).",
        "The phrase ?service box?",
        "here means ????",
        "?, which denotes the zone where the ball is to be served.",
        "However, the baseline incorrectly splits them into two words, then translates ?service?",
        "to ????",
        "and ?box?",
        "to ???.",
        "In contrast, the approaches with adapted models are able to translate these words very well.",
        "Both our MTL-based approach and the conventional adaptation methods leverage the mixture models.",
        "A natural question is why our MTL-based approach performs better than the individual adaptation.",
        "To answer this question, we looked into the details of the tuning and decoding procedures in the MTL-based approach.",
        "We observed that the BLEU score on the development data for each system was lower than the score when conducting individual adaptation.",
        "Considering that the algorithm enforcing the general features play the same role across different domains, we suspect that MTL-based approach introduces a kind of regularization for each domain-specific system.",
        "The regularization prevents the general features from biasing towards certain domains to the extreme.",
        "This property is quite important for real world SMT systems.",
        "Usually, a sentence is composed of some domain-specific words and some general words, so it is often improper to translate every word in the sentence using the in-domain knowledge.",
        "For the example in Table 4, the individual adaptation method ?",
        "[A] (G+I)-TM + (G+I)-LM?",
        "translates ?land?",
        "to ????",
        "(zone) improperly, because ????",
        "appears more often in the Sports text than the general-domain text.",
        "This shows that the individual adaptation methods tend to over-fit the in-domain development data.",
        "In contrast, the MTL-based approach ?",
        "[A,MTL](G+I)-TM + (G+I)LM?",
        "just translates ?land?",
        "to ?????",
        "(fall on), which is more appropriate."
      ]
    },
    {
      "heading": "4 Related Work",
      "text": []
    },
    {
      "heading": "4.1 Domain Adaptation",
      "text": [
        "One direction of domain adaptation explored the data selection and weighting approach to improve the performance of SMT on specific domains.",
        "Eck",
        "et al (2004) first decoded the testing data with a general TM, and then used the translation results to train an adapted LM, which was in turn used to re-decode the testing data.",
        "Lu?",
        "et al (2007) tried to weight the training data according to the similarity with test data using information retrieval models, while Foster et al. (2010) trained a discriminative model to estimate a weight for each sentence in the training corpus.",
        "Other methods conducted data selection based on cross-entropy (Moore and Lewis, 2010), and Axelrod et al. (2011) further extended their cross-entropy based method to the selection of bilingual corpus in the hope that more relevant corpus to the target domain could yield smaller models with better performance.",
        "Other methods included using semi-supervised transductive learning techniques to exploit the monolingual in-domain data (Ueffing et al., 2007).",
        "Adaptation methods also involved the utilization of mixture models.",
        "Foster and Kuhn (2007) explored a number of variants of utilizing multiple TMs and LMs by interpolation.",
        "Koehn and Schroeder (2007) used MERT to simultaneously tune two TMs or LMs.",
        "Sennrich (2012) investigated the TM perplexity minimization as a method to set model weights in mixture modeling.",
        "In addition, inspired by system combination approaches, Razmara et al. (2012) used the ensemble decoding method to mix multiple translation models, which outperformed a variety of strong baselines.",
        "Generally, most previous methods merely conducted domain adaption for a single domain, rather than multiple domains at the same time.",
        "One could also simply build multiple SMT systems that were adapted to multiple domains, but they were often separated and not tuned together.",
        "So far, there has been little research into the multi-domain adaptation problem over mixture models for SMT systems, as proposed in this paper."
      ]
    },
    {
      "heading": "4.2 Multi-task Learning",
      "text": [
        "In machine learning, MTL is an approach to learn one target problem with other related problems at the same time.",
        "This often leads to a better model for the main task because it allows the learner to use the commonality among the tasks.",
        "MTL is performed by learning tasks in parallel while using a shared representation.",
        "Therefore, what is learned for each task can help other tasks be learned better.",
        "MTL was successfully applied in some Natural Language Processing (NLP) tasks.",
        "For example, Blitzer et al. (2006) extended the MTL approach (Ando and Zhang, 2005) to domain adaptation tasks in part-of-speech tagging.",
        "Collobert and Weston (2008) proposed using deep neural networks to train a set of tasks, including part-of-speech tagging, chunking, named entity recognition, and semantic roles labeling.",
        "They reported that jointly learning these tasks led to superior performance.",
        "MTL was also applied in sentiment analysis (Dredze and Crammer, 2008) and web ranking (Chapelle et al., 2011) to address the multi-domain learning and adaptation.",
        "In SMT, Duh et al. (2010) proposed using MTL for N-best re-ranking on sparse feature sets, where each N-best list corresponded to a distinct task.",
        "Simianer et al. (2012) proposed distributed stochastic learning with feature selection inspired by MTL.",
        "The distributed learning approach outperformed several other training methods including MIRA and SGD.",
        "Inspired by these methods, we used MTL to tune multiple SMT systems at the same time, where each system was composed of in-domain and general-domain models.",
        "Through a shared feature representation, the commonalities among the SMT systems were better learned by the general models.",
        "In addition, domain-specific translation knowledge was also better characterized by the in-domain models."
      ]
    },
    {
      "heading": "5 Conclusion and Future Work",
      "text": [
        "In this paper, we propose an MTL-based approach to address multi-domain adaptation for SMT.",
        "We first use the cross-entropy based data selection method to obtain in-domain bilingual data.",
        "After that, in-domain TMs and LMs are trained for each domain-specific SMT system.",
        "In addition, the general-domain TM and LM are also trained and shared across different systems.",
        "Finally, MTL is leveraged to tune multiple systems jointly.",
        "Experimental results have shown that our approach is quite promising for the multi-domain adaptation problem, and it brings significant improvement over both the non-adapted baselines and the conventional domain adaptation methods with mixture models.",
        "We assume the domain information for testing",
        "data is known beforehand in this study.",
        "However, this is not always the case for real world SMT systems.",
        "Therefore, to apply our approach in real applications, the domain information needs to be identified automatically.",
        "In the future, we will predefine more popular domains and develop automatic domain classifiers.",
        "For those domains that are identified with high confidence, we use the domain-specific system to translate the texts.",
        "For other texts, we use the general system to translate them.",
        "Furthermore, since our approach is a general training method, we may also combine this approach with other domain adaptation methods to get more performance improvement."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We are especially grateful to Nan Yang, Yajuan Duan, Hong Sun and Danran Chen for the helpful discussions.",
        "We also thank the anonymous reviewers for their insightful comments."
      ]
    }
  ]
}
