{
  "info": {
    "authors": [
      "Samir Gupta",
      "Sivaji Bandyopadhyay"
    ],
    "book": "Proceedings of the 2009 Workshop on Language Generation and Summarisation (UCNLG+Sum 2009)",
    "id": "acl-W09-2820",
    "title": "JUNLG-MSR: A Machine Learning Approach of Main Subject Reference Selection with Rule Based Improvement",
    "url": "https://aclweb.org/anthology/W09-2820",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Kolkata-700032, India.",
        "Sivaji Bandopadhyay",
        "Kolkata-700032, India.",
        "The GREC-MSR task is to generate appropriate references to an entity in the context of a piece of discourse longer than a sentence.",
        "In MSR '09 run of this task, the main aim is to select the actual main subject reference (MSR) from a list of given referential expressions that is appropriate in context.",
        "We used a machine learning approach augmented with some rules to select the most appropriate referential expression.",
        "Our approach uses the training set for learning and then combines some of the rules found by observation to improve the system."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In this paper we provide a description of our system for the GREC MSR task of Generation Challenges 2009.",
        "GREC-2.0 Corpus of 2,000 Wikipedia introduction sections in which references to the main subject of the Wikipedia article have been annotated was provided to us by the organizers.",
        "The corpus was divided into five different domains like cities, countries, mountains, people and rivers.",
        "The basic approach we used was to develop a baseline system first by training the system on the training set.",
        "This system then selects the most frequent referential expression based on a number of parameters of the corresponding reference.",
        "After evaluation on the development set we used the development set to deduce certain rules based on observation and iteratively added these rules to the system and evaluated resulting performance.",
        "Thus the system development can be divided into two phases which are discussed in sections 2 and 3."
      ]
    },
    {
      "heading": "2. Baseline System: Training and Classification",
      "text": [
        "The machine learning approach we used for the baseline system was domain independent and hence was build by populating a single database with the training set data.",
        "First we parsed the contents of the XML files of the training sets using a Java DOM XML Parser.",
        "Then we inserted the training set data into the database named grec which had two tables: parsed_ref and possi-ble_refex.",
        "There is a one to many mapping from possible_refex to parsed_ref.",
        "The possible_refex contains all possible REFEX elements i.e. referential expressions possible while parsed_ref contains all the parsed references of the training set with attributes such as syncat, semcat, paragraph number, reference number (with respect to a paragraph), sentence number and a foreign key refex id referring to the possible_refex table.",
        "The prediction of the referential expression was done based on features such as the semantic category, syntactic category, paragraph number, reference number with respect to a paragraph and sentence number of the referent.",
        "One example from the database is, if the semcat of the reference is cities, syncat is np-subj, paragraph number is 2, ref number is 1 and sentence number equals 1 then in 74% of the cases of the training set the referential expression was with refex id=1 (i.e. type=common, emphatic=no, head=nominal and case= plain) and refex id = 4 (i.e. type=name, em-phatic=no, head=nominal and case= plain) had the second highest count (19.6%).",
        "Thus we selected the most frequent refex from the possible referential expressions corresponding to the feature set of the reference, based on their count in the training set populated database.",
        "These decision rules with their associated probabilities are stored in a table which served as our model for classification.",
        "When a number of referential expressions from the alt_refex match from the list of the given refexes then we select the refex with the longest surface form.",
        "In certain case when the refex was not in the alt_refex element we select the second best case from our decision model.",
        "Results of this intermediate baseline system are given in Table 1.",
        "Cities Countr.",
        "Mount.",
        "People Rivers"
      ]
    },
    {
      "heading": "3. Rule based Improvement",
      "text": [
        "After the baseline system was evaluated on the development set we iteratively added some rules to optimize the system output.",
        "These rules are applied only when a reference matches the below stated condition, otherwise the result from the baseline system was used.",
        "The different rules that we deduced are as follows:",
        "• The referential expression is empty if its immediate preceding word is a conjunction and the referent's syncat is np-subj.",
        "Thus the surface form of the refex is null.",
        "• In the people domain if the best case output from the baseline results in Reg-type = \"name\" and if earlier in the paragraph the person's full name has been referred to, then subsequent references will have a shorter version of the referential expression i.e. shorter surface form (example: Zinn's instead of Howard Zinn's)",
        "• If the same sentence spans two or more references then generally a pronoun form is used if a noun has been used earlier.",
        "• Generally common form of the noun is used instead of the baseline pronoun output if words like in, for, to, of, in precedes the reference (maximum distance 3 words).",
        "This rule is applied to all domains except people.",
        "The first and the last rules had some effect to the system but the improvement from the other rules was very negligible.",
        "Final results are tabulated in Table 2."
      ]
    },
    {
      "heading": "4. Results",
      "text": [
        "We provide final results of our system in Table 2 Script geval.pl was provided by the organizers for this purpose.",
        "We see that inclusion of the above rules in the system increased it's accuracy by almost 4-5%.",
        "More rules can be added to system by studying cases of the training set which do not get classified correctly by the best case baseline system.",
        "Overall reg08 accuracy, precision and recall were 66.4 %.",
        "Cities Countr.",
        "Mount.",
        "Domain",
        "String",
        "Reg",
        "Mean",
        "Norm.",
        "Acc.",
        "08",
        "Edit",
        "mean",
        "type",
        "Dis-",
        "edit dis-",
        "Acc.",
        "tance",
        "tance",
        "Domain",
        "String",
        "Reg",
        "Mean",
        "Norm.",
        "Acc.",
        "08",
        "Edit",
        "mean",
        "type",
        "Dist.",
        "edit",
        "Acc.",
        "Dist."
      ]
    }
  ]
}
