{
  "info": {
    "authors": [
      "Yves Lepage"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1102",
    "title": "Non-Directionality and Self-Assessment in an Example-Based System Using Genetic Algorithms",
    "url": "https://aclweb.org/anthology/C94-1102",
    "year": 1994
  },
  "references": [
    "acl-C88-1013",
    "acl-C90-3044",
    "acl-C90-3101"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We show the application of an optimisation technique to natural language processing: genetic algorithms, thanks to the definition of a data structure called board and a formal distance.",
        "The system has two interesting features: non-directionality, which is more than bi-directionality, and self-assessment, independently of the inner knowledge.",
        "Results of experiments are presented and discussed.",
        "Topical paper: Software for NLP"
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "The purpose of this article is to show that an engine based on an optimisation technique, namely genetic algorithms, can perform NLP tasks: analysis and generation in the frame of example-based approaches.",
        "But more than that, the system we have built has interesting properties:",
        "• it is truly non-directional, i.e. it performs more than bidirectional tasks; • it evaluates its results relatively to the input, and not relatively to its internal knowledge.",
        "Two original facts make this possible:",
        "• the definition of a data structure, called board which is in essence bidirectional.",
        "It is the association of a sentence pattern and its linguistic structure; • the definition of a distance on this data structure."
      ]
    },
    {
      "heading": "1 Motivations",
      "text": []
    },
    {
      "heading": "1.1. Non-directionality",
      "text": [
        "Our main motivation was to design a system where not only the formalism but also the system engine is bidirectional.",
        "In [Lepage 91], we sketched such an engine for a rule-based approach.",
        "From a theoretical point of view, such a system is also more interesting than a system where, although the formalism would be bi-directional, analysis and generation would be separate modules resulting from different compilations.",
        "In our sketch, a more general property than bi-directionality ,Ifierged• iron-directionality, Ili-di•ectionality is just the property of executing analysis and generation with the same set of specifications, whereas non-directionality allows more: a complete sentence and its complete analysis can be built from a partial specification of the sentence and a partial description of the associated structure."
      ]
    },
    {
      "heading": "1.2 Self-assessment",
      "text": [
        "A second motivation lies in a flaw of rule-based systems using context-free parsers, which is that they often fail to deliver a solution for trivial reasons such as a word missing in a dictionary.",
        "On the contrary, our system always delivers an output for any input, would the solution be \"bad\".",
        "Of course, this would be of no meaning if the quality of outputs would not be evaluated.",
        "Hence, when delivering a solution, the system scores it.",
        "Some machine translation systems viewed as expert systems may return an evaluation of their work in terms of their knowledge (grammar) [Tong 89], some other may evaluate the result according to thesaurus classification and statistical frequencies [Furuse and Iida 92b], but all these methods are specific.",
        "Here, on the contrary, the system delivers a score which is a formal distance between the input and the output.",
        "Thus, it is independent of the linguistic representation chosen (dependency or constituency).",
        "'This is not the case of a proposal such as [Harrison et at 91].",
        "This score is a possible answer to the serious lack of assessment in natural language processing, as it may apply to any other system, leading to reliable comparisons of intrinsic performances"
      ]
    },
    {
      "heading": "2 Realisation",
      "text": [
        "Genetic algorithms constitute a possible answer to the previous motivations.",
        "They are a collection of techniques for approaching the solution of optimisation problems [Goldberg 89].",
        "On the contrary to usual programming techniques which Handle only one object et a time, genetic algorithms deal with a collection of individuals, called a population.",
        "For each individual, one can compute a function, called the fitness function, Those individuals for which the fitness function is optic/min:are the best individuals.",
        "From two individuals, one can derive two new individuals by cutting there into two pieces and gluing the",
        "pieces back in the way illustrated in Figure 1.",
        "This is crossover.",
        "Some random modification of the children may occur, accounting for initiation to complete the genetic metaphor.",
        "The previous operation can be repeated over a population a number of times so that populations follow one another.",
        "In the last generation, the best individuals are hopefully solutions of the optimisation problem at hand.",
        "In order to apply genetic algorithms to natural language processing, one has to determine:",
        "• which data has to play the role of individuals; • consequently, what a population will be; • for an individual, what its fitness is; • in a population, how individuals are selected for crossover and how it is performed; • how analysis and generation can be viewed as optimisation problems on a population.",
        "The meeting of our research interests with genetic algorithms is a consequence of various available results.",
        "Firstly, the need for linguistic specification of computer grammars led to the proposal of an original data structure called board.",
        "This data structure is neutral with respect to analysis and generation.",
        "It will play the role of individuals.",
        "Boards rely on the data structure of forests, for which it is possible to define a crossover method.",
        "Secondly, the stream of example-based machine translation is now well-established and justifies considering a collection of already parsed sentences as a population [Sadler and Vendelmans 90], [Sato and Nagao 90].",
        "Finally, our recent work on distances, and especially on distances between uncompletely specified boards, led 'us to the idea of looking in a data base for boards with the closest distance to a given board.",
        "This is an optimisation problem and the fitness of any board will simply be a function of its distance to the given board.",
        "In the following we will first describe the data structures used.",
        "Then we will define the functions working on these data structures."
      ]
    },
    {
      "heading": "2.1 Data structures",
      "text": [
        "The board data structure [Vauquois and Chappuy 85] was introduced as an answer to the problem of specification of real-size grammars.",
        "A board is the association of a text with its corresponding linguistic structure.",
        "Moreover, constraints express the linguistic validity of the fine-grained correspondences between different parts of the texts and of the structure [Iloitet and Zaharin 88], [Zaharin and Lepage 92].",
        "A!-; a particular case, projective constituency boards such as Figure 2 verify these constraints.",
        "Boards would be of httle use if they would not allow the description of patterns.",
        "Hence, Figure 3 is also a",
        "valid board.",
        "It is similar to Figure 2, except that portions of the string and the tree have been, replaced by variables (prefixed by a $ sign).",
        "These variables stand for forests, not only for trees -- the point is important.",
        "Because it is always better to look for a unified view of",
        "objects, the string part and the tree part are considered to he of the same data type, that of forest.",
        "As a matter of fact, a string is a forest with only one level, and a tree is a forest with only one node on the highest level.",
        "Now, as forests are the underlying data type, variables stand naturally for subforests.",
        "On the string side, considering Variables as forests is by far more interesting than if they would instantiate with one word only.",
        "An interesting property about the board data structure, and it is exactly why it has been devised, is that, because it is the association of a string (the text) and a (linguistic) tree, it is neutral with respect to the main natural language processing operations:",
        "• analysis (input: string, output: tree); • generation (input: tree, output: string).",
        "2.1.2 Population Data base of boards",
        "Our database of sentences is that of ATP, telephone conversations.",
        "These dialogues are telephone conversations for a scenario where somebody calls a secretari, to get information about a coming conference he would tike to attend.",
        "Figure 4 is an excerpt from these dialogues.",
        " – This is the Conference Office.",
        "We kept I() of these dialogues in English.",
        "'Fills represents 255 sentences of Which 150 are different..",
        "The linguistic structures corresponding to the previous sentences have been drawn by hand and scrupulously reviewed to ensure consistency.",
        "They are syntactic constituency trees and are exactly projective, which means that each leaf in the tree corresponds to a word in the sentence in the same order.",
        "As for illustration, all the trees and sentences in this paper are extracted from our data base of boards.",
        "Some representational choices have been made to limit the number of morpho-syntactic categories to 14 (and phrase types to 7) and to keep projectivity by all means."
      ]
    },
    {
      "heading": "2.2 Functions 2.2.1 Fitness = Distance between forests",
      "text": [
        "We define the fitness of an element in a population (set of boards) as the distance to a given input (a board) to the system.",
        "In other words, we have to define a distance between boards.",
        "A simple idea is to take the sum of the distances between the strings on the one hand, and the trees on the other hand.",
        "As strings and trees are forests, a distance on forests is required.",
        "The definition of a distance on forests is given below, with a, b being nodes, u', a, a' being forests and .",
        "denoting concatenation of forests.",
        "It is a direct generalisation of two classical distances on strings [Wagner Fischer 74] and trees [Selkow 77].",
        "Both distances answer the correction problem: what is the minimal number of typing operations needed to transform one object into the other one?",
        "In both distances and their generalisation to forests, the typing operations are insertion, deletion and replacement An extension of the previous distance to forest patterns (i.e. forests containing variables) has been presented in [Lepage et al.",
        "92].",
        "It is no longer a metric, so We call it a proximity score.",
        "With this score, the distance between a variable and a constant object is zero by definition.",
        "Figure 5 gives an illustration (the unit is a one word or node difference).",
        "We turn now to crossover.",
        "The first question is how .ds ak.e selected in a population for crossover.",
        "It seems reasonable that those individuals with better fitness value should intervene more in the production of the next generation.",
        "Along this line, the simple following law gives the probability of a board i with fitness fi (some reciprocal of distance) to be selected for crossover:",
        "As for crossover itself, it has to be defined on strings and on trees.",
        "On strings, be they chromosomes or sequences of bits, crossover is generally performed as illustrated in Figure I.",
        "We could crossover sentences following this simple iqinciple (see Figure 6).",
        "But we insist on keeping the unity of data structure between strings and trees.",
        "So, we translate string crossover into forest terms: it is the exchange of the sister forests of the crossover points.",
        "This can be applied directly to trees, see Figure 7.",
        "This technique is different from the exchange of subtrees as proposed in [Koza 92].",
        "Now, by keeping projectivity during crossover, only corresponding parts of strings and trees will be exchanged.",
        "As a consequence, string crossover will allow exchange of inner substrings.",
        "To sum up, a board obtained by crossover will give a partially valid description of a possibly ungrammatical sentence (see Figure 8).",
        "2.2.3 Optimisation problem = Closest board in database The system built for the experiment implements a simple genetic algorithm.",
        "'The starting population is a set, of example boards, i, e. complete sentences with their complete associated linguistic structures,",
        "If an input board is given to the system, each board in the data base of examples can be assigned a fitness score: its distance to the input board.",
        "• When the input is a board where the linguistic tree is unknown (a variable), the output will be the closest board containing the closest sentence with its associated tree.",
        "This is a kind of analysis.",
        "output is a board, built from pieces of' the data base boards, and minimising the distance to the input.",
        "It is important to stress the point that the input never enters the data hose of boards.",
        "It is only used to compute the fitness of each board in the data base in each generation.",
        "h'igure 9 summarises the system and its functioning.",
        "• When the input is a board where both the sentence and the linguistic tree are partially specified (they contain variables), the output will be the closest, board containing a complete sentence and its complete associated linguistic structure.",
        "We call the last operation non-directional comple-lion.",
        "In fact, analysis and generation are only particular cases of this operation.",
        "For instance, analysis is non-directional completion for a board with no variable in the string part, and a variable as the tree part.. For each operation above, the external behaviour of the system may be considered different, tilthougli the internal behaviour is exactly the same.",
        "In zwy ca.,.e, the"
      ]
    },
    {
      "heading": "3 Experirneritation",
      "text": []
    },
    {
      "heading": "3.1 Experiments",
      "text": [
        "We tested the performance of the system for analysis, generation and non-directional completion.",
        "loor analysis, a hoard is ext,ricted front the data base (call it reference board).",
        "A new board is built by associating the string part of the reference board with a variable as its tree part.",
        "It, becomes the input to the system.",
        "Of course, the reference board is eliminated front the database.",
        "A first, measure is given by the system itself: it is the fitness of the output, which is the distance between the output and the input.",
        "A second measure is the distance between the output and the reference board, which reflects the absolute quality of the output.",
        "Moreover, run-times have been measured.",
        "This procedure was carried out for each board of the data base so that.",
        "average values could be computed.",
        "There were 225 boards in the data base",
        "For generation, the same procedure was applied, but, of course, the tree part is kept in building the input board.",
        "For non-directional completion, an uncomplete board is automatically built by inserting variables at random positions in the string and tree parts of the reference board."
      ]
    },
    {
      "heading": "3.2 Results",
      "text": [
        "Analysis Analysis gives an average error of about 9.2 elements relatively to the exact output after thirty generations.",
        "The average number of elements (nodes and words) in a board is 24.5, hence, the error rate is 38%, not a very good result.",
        "The fitness gives the average number of words wrong in the average string output by the system: around 3.2 words for a 8.5 word-long sentence.",
        "Generation Generation is performed with better results than analysis.",
        "The average error in the tree only is 1.1 node for 16 node-heavy trees and the absolute error rate falls to 12%.",
        "However, as expected, generation is slower than analysis because more tree distance computations are performed.",
        "Non-directional completion The following results must be considered as purely illustrative, because the form of boards for non-directional completio unrestricted.",
        "As could be expected, because no complete in the input, quality is worse than for analysis and generation, although fitness appears to be quite good."
      ]
    },
    {
      "heading": "3.3 Discussion",
      "text": [
        "We will now discuss the advantages and drawbacks or our system.",
        "3.3.1 Non-directionality The general function of the system is to build a corn-Mete sentence and its complete associated syntactic tree from a partially specified sentence and a partially specified tree.",
        "Hence, analysis and generation turn out to be only particular cases of this general operation.",
        "This feature is what we called non-directionality.",
        "It is more general than hi-directionality.",
        "Until now, we are not aware of any natural language processing system having this property.",
        "From the applications point of view, non-directionality allows one to envisage linguistically founded editing operations.",
        "For example, suppose we would like to replace refund the fee by pay the fee hack all over a text.",
        "We would like the operation to apply for any tense of the verb.",
        "The following board could be used to retrieve all possible candidates.",
        "It says that we want a verbal phrase (structural constraint) and that the substring fee must appear (string constraint).",
        "Of course, to perform such an operation, we would not advise the use of genetic algorithms ,",
        "Because parts of the input may be modified in the output, assessment is necessary.",
        "The system delivers a score which is not directly connected to the knowledge of the system.",
        "It is the distance between the input and the output.",
        "Minimising this distance is precisely the task of the system.",
        "As this score is a theoretical metric between structures, it is not stuck to a particular representation.",
        "It could be applied to evaluate similar systems using different representations, for example dependency structures.",
        "Despite the previous points, important criticisms can still be addressed to the current system.",
        "Experiments carried out with input sentences from outside the data base have shown that the system has a normalising effect: outputs are cast to resemble sentences and trees from the database, This is a negati-e effect if a free-input,system is wanted.",
        "But, if a lacte enough data base is built and if standardisation is required, as is the case with technical documents in many companies, this may be seen as a positive feature.",
        "A classical criticism of genetic algorithm concerns heavy computation time, Here, it is proportional to the number of examples in the data base!",
        "This prevents us froin using a big enough data base for any reasonable-size application.",
        "As for space, our implementation of the system reties on a toolbox which makes extensive use of dynamic prograinntHg (storing intermediate results to increase speed).",
        "N1...Joiy size limits are rapidly reached.",
        "In t his",
        "implementation, the space-time trade-off is a sensitive issue.",
        "To remedy both these problems we are envisaging porting our programs on a parallel machine.",
        "This does not add anything from the theoretical point of view, but genetic algorithms are obvious candidates for paralleli-sation."
      ]
    },
    {
      "heading": "Conclusion",
      "text": [
        "This paper has described the application of an optinlisa-Lion technique to natural language processing tasks, i.e. analysis and generation.",
        "The system has been shown to have two interesting properties: non-directionality, which is more than hi-directionality and self-assessment, independently of its internal knowledge."
      ]
    }
  ]
}
