{
  "info": {
    "authors": [
      "Antonio Zampolli"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-1004",
    "title": "The Scientific Programme of COLING-92",
    "url": "https://aclweb.org/anthology/C92-1004",
    "year": 1992
  },
  "references": [],
  "sections": [
    {
      "text": [
        "The scientific programme of COLING-92 In my capacity as Chairman of the Scientific Programme Committee of COLING-92, I wish to express my gratitude to all my colleagues who have conributed to the reading and selection of about 420 papers submitted for COLING-92.",
        "The work of the Programme Committee has been organized at two levels.",
        "In consultation with the members of the International Committee on Computational Linguistics, I have identified nine major areas of interest, and for each area I have appointed a coordinator.",
        "Each of the nine coordinators, which together formed the Programme Committee, has set up a subcommittee, selecting a number of reviewers.",
        "The task of the coordinator was to distribute the papers to the reviewers, to collect and summarize their evaluations, and to express an overall recommendation: to accept a paper as topical, to accept the paper as a project note, or to reject the paper.",
        "I have always followed the recommendations of the coordinators.",
        "The few papers which, in each area, were classified as \"uncertain\", i.e. left without a specific recommendation, were ranked in descending order of acceptability by the coordinator.",
        "In these cases, I have used the following criteria for acceptance: i) within each area, the ranking of the coordinator has been respected, ii) across areas, preference has been given to papers accompanied by a demonstration, and to topics less represented in the overall programme.",
        "I also wish to express my appreciation to my colleagues N Calzolari, A. Capelli, P. Orsolini, and S. Rossi of the Istituto di Linguistica Computazionale of the CNR of Pisa for their generous support in the task of classifying and distributing the papers, collecting the judgements, and setting the final programme.",
        "My deepest gratitude must go to Ch.",
        "Boitet and F. Peccoud for their contribution to the work of the Programme Committee, and for the enthusiasm and the energy they have given in organizing the Conference.",
        "I can fully appreciate the quantity of work required for die organization of a COLING Conference, since I have already been involved in the organization of the Conference twice before: in 1978 (Bergen) as Chairman of the Programme Committee, and in 1973 (Pisa) as local organizer.",
        "Recollecting these two COLING Conferences, two considerations regarding developments in our field come to mind.",
        "In my Introduction to the proceedings of COLING-73 (A. Zarnpolli, N. Calzolari, eds., Computational and Mathematical Linguistics, Firenze, 1977, 4 volumes), I advocated the complementarity between the then dominant \"puristic\" approach to computational linguistics (represented, for example, in the Foreword of Hans Karlgren to the same Proceedings), focusing on computation and on the derivation of results according to rules, and a more \"pragmatic\" approach, focusing on practical, applicable results and on the ability to process large collections of real linguistic data.",
        "In particular, I stressed the need to promote corpus-based studies, statistical methods, robust morphosyntactic taggers and parsers, adequate large machine dictionaries, cooperation with descriptive linguists, lexicographers, humanists using computers, etc.",
        "Today, particularly due to the pressing requests of the \"language industry\" sector for robust NLP components capable of dealing with real language uses, the process of convergence between the two approaches is underway, and can be recognized as a major feature characterizing the present stage of development.",
        "Programmes and actions promoted by the major international and national Funding Agencies have been of paramount importance in shaping the evolution of our field in this direction.",
        "The Commission of the European Communities began to promote large scale activities in natural language processing more or less around the time of the Bergen COLING Conference in 1978.",
        "I still remember the endless conversations and discussions taking place during the Conference cruise along the magnificent Norwegian fjords, stimulated by the rumours that the Commission intended to launch programmes in machine translation and documentation.",
        "The role and influence of the Funding Agencies has, since then, dramatically increased.",
        "Furthermore, to respond to the pressing needs of our multilingual society in producing, distributing, accessing, and retrieving information encoded in natural language, international cooperation is crucial.",
        "Specifically, common policies, adequate linguistic infrastructures, standards for resources and product development must be established if we want an effective language technology and a real language industry.",
        "For these reasons, we felt it was appropriate to organize, for the first time wthin COLING, a panel of the representatives from European (CEC, EUREKA), American (DARPA, NSF) and Japanese Funding Agencies to discuss needs, priorities, policies, and perspectives, and to set up a session dedicated to the presentation of representative large-scale, publicly funded projects.",
        "The global amount of resources made available to natural language processing activities and the awareness of the stategic relevance of possible industrial applications has increased in the last few years.",
        "We have arrived at a very crucial stage: interest in our field and the anticipation of valid results are great.",
        "We must carefully evaluate he state-of-the-art in relation to the various tasks and applications, identify priorities in research and development, and seriously promote the integration of various approaches.",
        "We hope that tins COLING will provide a significant contribution towards these goals.",
        "Pisa, May 11th, 1992."
      ]
    }
  ]
}
