{
  "info": {
    "authors": [
      "Stephen Tratz",
      "Antonio Sanfilippo",
      "Michelle L. Gregory",
      "Alan Chappell",
      "Christian Posse",
      "Paul Whitney"
    ],
    "book": "Fourth International Workshop on Semantic Evaluations (SemEval-2007)",
    "id": "acl-W07-2057",
    "title": "PNNL: A Supervised Maximum Entropy Approach to Word Sense Disambiguation",
    "url": "https://aclweb.org/anthology/W07-2057",
    "year": 2007
  },
  "references": [
    "acl-A97-1011",
    "acl-J96-1002",
    "acl-P05-1005",
    "acl-P05-1006",
    "acl-W02-0817",
    "acl-W04-0807",
    "acl-W04-0811",
    "acl-W04-0827",
    "acl-W04-0838"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 4th International Workshop on Semantic Evaluations (SemEval-2007), pages 264?267, Prague, June 2007. c?2007 Association for Computational Linguistics"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we described the PNNL Word Sense Disambiguation system as applied to the English all-word task in SemEval 2007.",
        "We use a supervised learning approach, employing a large number of features and using Information Gain for dimension reduction.",
        "The rich feature set combined with a Maximum Entropy classifier produces results that are significantly better than baseline and are the highest F-score for the fined-grained English all-words subtask of SemEval."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Accurate word sense disambiguation (WSD) can support many natural language processing and knowledge management tasks.",
        "The main goal of the PNNL WSD system is to support Semantic Web applications, such as semantic-driven search and navigation, through a reliable mapping of words in naturally occurring text to ontological classes.",
        "As described in Sanfilippo et al.",
        "(2006), this goal is achieved by defining a WordNet-based (Fellbaum, 1998) ontology that offers a manageable set of concept classes, provides an extensive characterization of concept class in terms of lexical instances, and integrates an automated class recognition algorithm.",
        "We found that the same features that are useful for predicting word classes are also useful in distinguishing individual word senses.",
        "Our main objective in this paper is to predict individual word senses using a large combination of features including contextual, semantic, and syntactic information.",
        "In our earlier paper (Sanfilippo et al., 2006), we reported that the PNNL WSD system exceeded the performance of the best performers for verbs in the SENSEVAL-3 English all-words task dataset.",
        "SemEval 2007 is our first opportunity to enter a word sense disambiguation competition."
      ]
    },
    {
      "heading": "2 Approach",
      "text": [
        "While many unsupervised word sense disambiguation systems have been created, supervised systems have generally produced superior results (Snyder and Palmer, 2004; Mihalcea et al., 2004).",
        "Our system is based on a supervised WSD approach that uses a Maximum Entropy classifier to predict WordNet senses.",
        "We use SemCor1, OMWE 1.0 (Chklovski and Mihalcea, 2002), and example sentences in WordNet as the training corpus.",
        "We utilize the OpenNLP MaxEnt implementation2 of the maximum entropy classification algorithm (Berger et al., 1996) to train classification models for each lemma and part-of-speech combination in the training corpus.",
        "These models are used to predict WordNet senses for words found in natural text.",
        "For lemma and part-of-speech combinations that are not present in the training corpus, the PNNL WSD system defaults to the most frequent WordNet sense."
      ]
    },
    {
      "heading": "2.1 Features",
      "text": [
        "We use a rich set of features to predict individual word senses.",
        "A large number of features are extracted for each word sense instance in the training data.",
        "Following Dang & Palmer (2005) and Ko-homban & Lee (2005), we use contextual, syntactic and semantic information to inform our word",
        "sense disambiguation system.",
        "However, there are significant differences between the specific types of contextual, syntactic and semantic information we use in our system and those proposed by Dang & Palmer (2005) and Kohomban & Lee (2005).",
        "More specifically, we employ novel features and feature combinations, as described below.",
        "?",
        "Contextual information.",
        "The contextual information we use includes the word under analysis plus the three tokens found on each side of the word, within sentence boundaries.",
        "Tokens include both words and punctuation.",
        "?",
        "Syntactic information.",
        "We include grammatical dependencies (e.g. subject, object) and mor-pho-syntactic features such as part of speech, case, number and tense.",
        "We use the Connexor parser3 (Tapanainen and J?rvinen, 1997) to extract lemma information, parts of speech, syntactic dependencies, tense, case, and number information.",
        "A sample output of a Connexor parse is given in Table 1.",
        "Features are extracted for all tokens that are related through no more than 3 levels of dependency to the word to be disambiguated.",
        "?",
        "Semantic information.",
        "The semantic information we incorporate includes named entity types (e.g.",
        "PERSON, LOCATION, ORGANIZATION) and hypernyms.",
        "We use OpenNLP4 and LingPipe5 to identify named entities, replacing the strings identified as named entities (e.g., Joe Smith) with the corresponding entity type (PERSON).",
        "We also substitute personal pronouns that unambiguously denote people with the entity type PERSON.",
        "Numbers in the text are replaced with type label NUMBER.",
        "Hypernyms are retrieved from WordNet and added to the feature set for all noun tokens selected by the contextual and syntactic rules.",
        "In contrast to Dang & Palmer (2005), we only include the hypernyms of the most frequent sense, and we include the entire hypernym chain (e.g. motor, machine, device, instrumentality, artifact, object, whole, entity).",
        "To address feature extraction processes specific to noun and verbs, we add the following conditions.",
        "http://www.alias-i.com/lingpipe/.",
        "?",
        "Syntactic information for verbs.",
        "If the verb does not have a subject, the subject of the closest ancestor verb in the syntax tree is used instead.",
        "?",
        "Syntactic information for nouns.",
        "The first verb ancestor in the syntax tree is also used to generate features.",
        "?",
        "Semantic information for nouns.",
        "A feature indicating whether a token is capitalized for each of the tokens used to generate features.",
        "A sample of the resulting feature vectors that are used by the PNNL word sense disambiguation system is presented in Table 2.",
        "?The engine throbbed into life?.",
        "the pre:2:the, pre:2:pos:DET, det:the, det:pos:DET, hassubj:det: engine pre:1:instrumentality, pre:1:object, pre:1:artifact, pre:1:device, pre:1:engine, pre:1:motor, pre:1:whole, pre:1:entity, pre:1:machine, pre:1:pos:N,",
        "tence ?The engine throbbed into life?.",
        "As the example in Table 2 indicates, the combination of contextual, syntactic, and semantic information types results in a large number of features.",
        "Inspection of the training data reveals that some features may be more important than others in establishing word sense assignment for each choice of word lemma.",
        "We use a feature selection proce",
        "dure to reduce the full set of features to the feature subset that is most relevant to word sense assignment for each lemma.",
        "This practice improves the efficiency of our word sense disambiguation algorithm.",
        "The feature selection procedure we adopted consists of scoring each potential feature according to a particular feature selection metric, and then taking the best k features.",
        "We choose Information Gain as our feature selection metric.",
        "Information Gain measures the decrease in entropy when the feature is given versus when it is absent.",
        "Yang and Pederson (1997) report that Information Gain outperformed other feature selection approaches in their multi-class benchmarks, and Foreman (2003) showed that it performed amongst the best for his 2-class problems."
      ]
    },
    {
      "heading": "3 Evaluation",
      "text": [
        "To evaluate our approach and feature set, we ran our model on the SENSEVAL-3 English all-words task test data.",
        "Using data provided by the SENSEVAL website6, we were able to compare our results for verbs to the top performers on verbs alone.",
        "Upali S. Kohomban and Wee Sun Lee provided us with the results file for the Simil-Prime system (Kohomban and Lee, 2005).",
        "As reported in Sanfilippo et al. (2006) and shown in table 3, our results for verbs rival those of top performers.",
        "We had a significant improvement (p-value<0.05) over the baseline of 52.9%, a marginal improvement over the second best performer (SenseLearner) (Mihalcea and Faruque, 2004), and we were as good as the top performer (GAMBL) (Decadt et al., 2004).7"
      ]
    },
    {
      "heading": "System Precision Fraction of Recall",
      "text": [
        "SENSEVAL-3 data, adapted from Sanfilippo et al. (2006).",
        "Since then, we have expanded our evaluation to all parts of speech.",
        "Table 4 provides the evaluation",
        "http://www.senseval.org/.",
        "The 2% improvement in precision which our system showed as compared to GAMBL was not statistically significant (p=0.21).",
        "of our system as compared to the three top performers on the SENSEVAL-3 data and the baseline.",
        "The baseline of 0.631 F-score8 was computed using the most frequent WordNet sense.",
        "The PNNL WSD system performs significantly better than the baseline (p-value<0.05) and rivals the top performers.",
        "The performance of the PNNL WSD system relative to the other three systems and the baseline remains unchanged when the unknown sense answers (denoted by a ?U?)",
        "are excluded from the evaluation."
      ]
    },
    {
      "heading": "4 Experimental results on SemEval all",
      "text": [
        "words subtask This was our first opportunity to test our model in a WSD competition.",
        "For this competition, we focused our efforts on the fine-grained English all-words task because our system was set up to perform fine-grained WordNet sense prediction.",
        "We are pleased that our system achieved the highest score for this subtask.",
        "Our results for the SemEval dataset as compared to baseline are reported in Table 6.",
        "The PNNL WSD system did not assign the unknown sense, ?U?, to any word instances in the SemEval dataset.",
        "This baseline is slightly higher than that reported by others (Snyder and Palmer 2004)."
      ]
    },
    {
      "heading": "5 Discussion",
      "text": [
        "Although these results are promising, there is still much work to be done.",
        "For example, we need to investigate the contribution of each feature to the overall performance of the system in terms of precision and recall.",
        "Such a feature sensitivity analysis will provide us with a better understanding of how the algorithm can be further improved and/or made more efficient by leaving out features whose contribution is negligible.",
        "Another important point to make is that, while our system shows the best precision/recall results overall, we can only claim statistical relevance with reference to the baseline and results worse than baseline.",
        "The size of the SemEval data set (N=465) is too small to establish whether the difference in precision/recall results with the other top systems is statistically significant."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We would like to thank Upali S. Kohomban and Wee Sun Lee for providing us with their SENSE-VAL-3 English all-words task results file for Simil-Prime.",
        "Many thanks also to Patrick Paulson, Bob Baddeley, Ryan Hohimer, and Amanda White for their help in developing the word class disambiguation system on which the work presented in this paper is based."
      ]
    }
  ]
}
