{
  "info": {
    "authors": [
      "James Pustejovsky",
      "Pierrette Bouillon"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2112",
    "title": "On the Proper Role of Coercion in Semantic Typing",
    "url": "https://aclweb.org/anthology/C94-2112",
    "year": 1994
  },
  "references": [
    "acl-C88-2110",
    "acl-E93-1021",
    "acl-J91-4003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we discuss the phenomenon of logical polysemy in natural language as addressed by Generative Lexicon Theory.",
        "We discuss generally the role of type and sortal coercion operations in the semantics, and specifically the conditions on the application of coercion in aspectual predicates and other contexts.",
        "We reply to some recent discussion regarding the use of coercion in the grammar, and show that type changing operations are both useful and explanatory mechanisms for capturing linguistic and computational generalizations."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Recently, work in computational semantics and lexical semantics has made an interesting shift.",
        "Motivated by a concern for lexical organization and global coherence in the structure of the language lexicon, some researchers have moved towards more expressive semantic descriptions ([16, 1, 5, 10]), as well as more powerful methods of composition ([22, 3]).",
        "Some, however, have expressed reservations as to the general applicability of type-changing operations such as coercion, as well as the notion of a generative lexicon itself ([7]).",
        "In this paper, we address these criticisms directly, and show that, upon closer examination of the data, these critiques either miss the point or are not substantiated by the data.",
        "Still, without a proper notion of constraints on coercion, there can indeed be overgeneration of forms and interpretations in the semantics, and in fact, the notion of conditions on coercion has always been integral to the basic spirit of Generative Lexicon Theory (cf. [19]).",
        "The empirical study of the range and limits of type change and cocom.position operations in natural language is an essential part of the research in formal.",
        "semantics.",
        "The advantages accompanying generative mechanisms and the characterization of languages as polymorphic in well-defined ways far outweight the explanatory inadequacies inherent in traditional approaches to lexical design and semantic projection, what [22] have called word sense enumeration approaches."
      ]
    },
    {
      "heading": "2 Polymorphic Languages and Semantic Expressiveness",
      "text": [
        "We will assume some general familiarity with the framework of generative lexicon theory, as outlined in [16, 18, 1].",
        "We feel it is important, however, to clarify the motivating principles and general methodology behind such work, since these points seem to be overlooked or misunderstood by some authors ([7]).",
        "In order to help characterize the generative power of natural languages in terms of semantic expressiveness, it is natural to think in terms of semantic systems with increasing functional power.",
        "Furthermore, a natural way of capturing this might be in terms of the type system which the grammar refers to for its interpretation.",
        "It has been argued elsewhere ([19, 20]), that there are reasons for describing how semantic systems fall on a hierarchy of increasing expressive power.",
        "It seems clear at this point that the current enumerative techniques for lexical description are too impoverished to adequately describe the richness of semantic data, much less to explain either how word senses relate to one another or the creative use of words in novel contexts ([16]).",
        "Briefly, a generative lexicon can be characterized as a system involving at least the following four levels of representations: Argument Structure, Event Structure, Qualia Structure, and Lexical Inheritance Structure.",
        "A set of generative devices connects these four levels, providing for the compositional interpretation of words in context.",
        "The exact nature of these devices will determine",
        "the polymorphic expressiveness of the semantics in fairly definite ways.",
        "best studied illustration of this is the phenomenon of time coelrion, but it is by no means the only one."
      ]
    },
    {
      "heading": "2.1 Linguistic Evidence for Coercion",
      "text": [
        "As mentioned in [18], the phenomenon of multi-pie subtategorizalion has motivated much of the type changing literature.",
        "The approach taken in generative lexicon theory builds on the ideas developed iu [13] and [9], while attempting to derive the syntactic expression of a verb's comidement on the basis of a deep semantic type assignment, together with syntactic constraints.",
        "For example, in the well-studied case of aspectual verb complementation in (1) and (2) below, the verbs beg in and commencer carry a deep type selecting for an event in contplement position.",
        "( I) a. John began to read the book.",
        "(vP[TINt']) b. John began reading the book.",
        "(GP) c. ;John began the book.",
        "(NP) (2) a. Jean a commence a lire le livre.",
        "b. Jean a commence le livre.",
        "This deep type is able to project to one of three possible surface forms, depending oil which coercion rule applies ([18]).",
        "There is, however, only one semantic type being selected for, and the clustering of the particular syntactic forms appearing as surface complement types in ( ) are systematically projected by virtue of this semantic type.",
        "That is, any verb, like begin, selecting for an \"unsaturated event'', will paradigmatically allow for the expression of the three.",
        "grammatical forms shown above, assuming surface syntactic constraints are satisfied.",
        "For this reason, the structuring of this kind of knowledge, where this event type has syntactic expression as any one of the surface types in (1), is called a lexical uoncep-tool paradigm (lcp).",
        "In this view, the NP, a. book, is coerced to the appropriate type required by its governing verb.",
        "-What makes coercion possible in this case is the availability of the required type, given as part of the NP's qualia structure, indicating, for example, that the 'runic role for book is the activity of reading, while the AGENTIVE role is the act of writing.",
        "The result of applying this coercion operator to an NP is effectively to create an extension of the N1' meaning, called a .rnelonymic reconstruction.",
        "In the case of the NP, a book, for example, the operator produces unsaturated event denotations.",
        "There are several phenomena, discussed in Godard and Jayez lib which they claim illustrate that coercion is not a viable interpretive strategy for linguistic semantics.",
        "Although none of these apparent connterexamples is in fact a problem for Generative Lexicon Theory, it is important to discuss each briefly to show why they are false problems.",
        "We will concentrate, however, on the selectional properties of aspectual verbs such as commencer and begin, in order to show very clearly that sense enumerative approaches such as Godard and Jayez's are missing the point of linguistic and computational generalizations, as regards to how the lexicon contributes to the compositional semantics.",
        "The hrst apparent counterexamples, discussed in Godard and ,layez ([7]), to the general application of type changing operations show that commencer does not universally allow NP coin-'dements with a. coerced interpretation.",
        "for example, the N Ps in (3) below do not have the expected event readings that one would predict, were there no constraints on the application of type coercion operations.",
        "(3) a.",
        "1Jean a. commence, tine symphonic,.",
        "([7]).",
        "\"John began [to listen to] a symphony\".",
        "h. *Marie a commence ('autoroute.",
        "\"glary began [to drive on] the highway.\" c. *John began the dictionary ([16]).",
        "\"John began [to consult/reference] the dictionary.\"",
        "But, as already pointed out in [?",
        "], the acceptability of coercion with aspectual predicates such as commencer and begin is conditioned by the telic-ity of the event taken as its complement.",
        "Briefly, these verbs select for an event of the sort TRAN-HTION, ruling out the coerced interpretations of listen to for (3a), drily: On for (3b), and consult for (3c), which are all mocEss events.",
        "Furthermore, constraints due to \"boundeduess\" of the predicate ((4a) vs. (41)) are entirely consistent with conditions on coercion in Generative Lexicon Theory (cf. [16, 17]).",
        "(4) a. Jean a commence he fromage byre.",
        "\"John began the cheese (eating) / the book",
        "(reading).",
        "b.",
        "*Jean a, commenc6 du fromage / Iles livres.",
        "\"John began cheese (eating) / books (reading).",
        "Namely, the homomorphic relation between the NP type (mass vs. count) gives rise to process and transition interpretations of event structures (corresponding roughly to the amorphous and bounded readings respectively, of Godard and Jayez's analysis).",
        "If it is truly an explanatory and productive operation, coercion should be not just a property of object phrases, but affect the semantic interpretation of subjects and other positions as well (cf. [17]).",
        "For example, the interpretation of psychological predicates such as in (5) involves a metonymic reconstruction of the subject as an experiencing event.",
        "(5) a.",
        "Books bore me.",
        "h. The movie frightened Mary.",
        "c. Mary's face / her chatter / listening to Mary bores me (cf. [7]).",
        "Contrary to Godard and Jayez's (Jahn, all of the above examples indicate very clearly a subject event reading; i.e., reading books, watching the movie, seeing Mary's face, and listening to her chatter, as argued in [16].",
        "With examples such as *The book began last week, however, coercion is not possible for rather trivial reasons; namely, as a. violation of control.",
        "it is, by the way, not surprising to find a,symmetries between argument positions.",
        "Anaphora, control, and extraction from subject position all behave differently from argument positions within VP.",
        "The point is that linguistic evidence supports an underlying semantic type, directly explaining what the connection between the subject and object of the experiencing relation is.",
        "In [17], the underlying semantics of psychological predicates such as bore, anger, and frighten is a causative structure where the surface subject is the logical object of an experiencing relation.",
        "For example, the event structure for the verb anger has the following form:",
        "The qualia structure projected by the NP contributes relational information as to just what manner of experiencing is involved.",
        "Short of general world knowledge, how are we to infer the particular manlier in which Mary became bored in (db)?",
        "By knowing what a movie is, we know how to use it and experience it; this is the defining role of the qualia structure.",
        "And yet, to claim that the qualia are a useful representation (which Godard and Jayez admit), without exploiting them through type reconstruction operations (e.g. coercion), is to fail to see the logical relations between lexical senses and derived senses in the language.",
        "It is as though we were to permit traces in our grammatical formalism without having a statement of binding, or otherwise knowing what to do with them.",
        "The third argument against coercive operations involves examples such as a long novel and a bright bulb.",
        "These are to be contrasted with a red book and an opaque bulb.",
        "As pointed out in [2.1], the adjectives here modify a distinguished event predicate (i.e. a quale) associated with the head, read for book, and illuminate for bulb.",
        "Godard and Jayez seem to think that because the NP can appear in an environment typed for an individual, such as (6) below,",
        "(6) Jean a acitete un long roman.",
        "\"john bought a long novel.\"",
        "that this is a, counterexample to type coercion.",
        "But this surely misinterprets what role the adjective is playing in the semantics.",
        "As already argued very explicitly in [22], the modification by an adjective such as long, ropide (fast), or brillant (bright), is a submodification on the appropriate (walla, of the head.",
        "The resulting compositional structure is still the type of the whole NP, and has no effect whatsoever on selection by an outside governor such as acheter (buy) as in (6).",
        "The final significant argument Godard and Jayez present, against coercion operations involves the apparent lexically idiosyncratic nature of coercion.",
        "Why should commencer and finir allow coercion while cesser and anreter do not?",
        "There is no space to detail the distinction here,",
        "but it is apparent that this is due to a semantic type distinction between these classes of predicates.",
        "In what follows, we demonstrate how the apparent violations of the coercive behavior of begin-predicates actually reveal a much deeper semantic distinction between two logically related senses of the verb, in all the complement forms they take, and not just NP complement.",
        "cases.",
        "This can be applied mutatis mutandis to commencer."
      ]
    },
    {
      "heading": "3 The Semantics of begin",
      "text": [
        "As argued in Section 2 above, the weRformedness of object complement coercion with aspectital predicates such as begin is conditioned by the event sort of the qualia associated with the NP itself.",
        "Thus, only N Ps having associated transition events will allow coercion and control.",
        "This is not to say, however, that begin selects only for transition events.",
        "There are, of course, perfectly grammatical examples of process complements, as shown in (8) below:",
        "(8) a.",
        "The snow began to fall at midnight.",
        "b. John began to feel ill.",
        "c. The war began to reach into Bosnia.",
        "These examples illustrate the use of begin as a. raising verb.",
        "We will follow Perlmutter [Id], iii distinguishing between two senses of the verb begin, distinguishable not by the selectional properties given in Godard and Jayez, but rather, conforming to the distinction that [I 1] made; namely, as either a Raising or a.",
        "Control verb.",
        "The analysis is as follows.",
        "There are indeed two grammatical expressions of the verb begin, as Raising and Subject-Control forms: A S a control verb, the event sort specified as t he complement is a TRANSITION.",
        "As a.",
        "Raising verb, however, the event may be any sort.",
        "This follows the typing assignments below: Control: (e Raising: 'Fite examples above and in (9a) and (9b) below illustrate the raising interpretation of begin:",
        "(9) a.",
        "The acid began to corrode the marble.",
        "b.",
        "It began to rain.",
        "We will assume that raising is accomplished by function composition, in the manner of [8].",
        "The manner in which Raising is treated as function composition (EC) is as follows: begin is cT, to corrode the 'marble in the example above is e el'.",
        "Then, FC(begin,V P) = AP[begini(corrode(P,the-marble)].",
        "As pointed out in [`l], VP ellipsis can be used as a, diagnostic for determining whether a complement is part of a raising or control construction.",
        "Some predicates permit both a control and non-control reading, such as (10) below, where John may be intentionally dieting or he may be ill.",
        "(10) John began to lose weight.",
        "Notice however, that in English the sentence in (El ) has only the intentional inchoative reading, and not the raising version.",
        "What this indicates is that there are indeed two constructions at play here, as teased apart by certain diagnostics.",
        "Further evidence conies from imperative structures ( I 2) and force-coin (dement constructions, which require the control sense of the verb.",
        "(12) a.",
        "*Begin looking for a job, you lousy bunt!",
        "b.",
        "Start looking for a job, you lousy bum!",
        "These data indicate that begin, in the control interpretation, strongly prefers a telic (transition) event complement.",
        "We have argued that there are two senses of the verb begin, corresponding to raising and control predicates.",
        "'fliese senses, however, are not arbitrary types but are logically related to one another in the same way that the different senses of unaccusative/causative verbs, such as break, and sink are related.",
        "In [23] it is shown that verbs such as .,-;ink and alfondare are logically polyse-mous in predictable ways, and don't need to be assigned multiple lexical entries.",
        "The same generalization holds for verb such as begin: begin is the lexical version of an unaccusative marker, but for propositions rather than for entities.",
        "In [22] and [23], a general mechanism is defined which makes the appropriate type available for a coercion operation.",
        "As discussed in [16],",
        "the ((Italia can be seen as partial functions, returning the value of a particular quale for an NP.",
        "The combined set of qualm provide a set of type aliases for the expression containing them (cf. [18]).",
        "One particular mechanism, type pumping, has been explored as a means to generating the alias set ([20]).",
        "Let C be the typing ‘judgements with respect to a grammar.",
        "Then, by convention, G I a : r represents a type assignment of r to the expression a.]",
        "Thus for example, the type available to an expression a with (wale Qi of type r, can be seen as the following type inference:2",
        "This says that, given an expression a of type a, there is a coercion possible between a and r, which changes the type of a in this composition, from a to T. We will illustrate the further application of this coercion operation below, as used in the begin examples.",
        "In (13a), we see how the aspectual verb COrraneneer selects the complement VP, and how in (13b), an NP is coerced into an event interpretation.",
        "(13) a. Marie a commence a lire le livre.",
        "(VP) b. Marie a commence le livre.",
        "(NP)",
        "Following [20], we can view the basic composition of the sentence in (13a) as type inference in Figure 1.",
        "'See ,[6] for explanation of formal mechanisms of type inference within the A-calculus, and [10, 2], and [22, 19] for its application to lexical representation.",
        "For the derivation of (13b), coercion applies to the complement NP, resulting in the appropriate type selected by the verb, as illustrated below in Figure 2.3 In the case of begin with NP complements such as the symphony or the motorway, the coercion is not possible, given the type mismatch in the intended (walla relation (i.e. listening and driving are PROCESS events).",
        "Notice, however, since the AGENTivE for each has an event of sort TRANSITION, these are possible coercive interpretations; i.e. perform the symphony, or build the highway.",
        "Notice that one might expect there to be raising constructions involving coerced NP complements.",
        "But these do not exist, as the [Ingram-maticality of *John began his nap (non-control reading) illustrates.",
        "This is due to the fact that coercion is governed by the type of the controller, in this case of type e' ('.",
        "This coercion will be successful if such a type exists in the alias set of the complement.",
        "Since function composition is an operation at the level of the VP, there is no point in the derivation such that the appropriate type is available for the rule to apply.",
        "As a final observation, it should be obvious now why verbs such as enjoy allow a much broader range of complement coercions (cf. [16] for details).",
        "l'hey are typed for taking an event of any sort, thereby allowing the PitocEss events of the TEttc roles in enjoy the symphony / the movie.",
        "2N]Ve ignore for now the type distinction between individuals, e, and generalized quantifiers, <<e,t>,t>.",
        "In the full version of the paper, we show the type shift taking this distinction lido account."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "We have attempted to respond to specific criticisms regarding coercion operations in the semantic interpretation of natural languages.",
        "The problems pointed out by Godard and Jayez do illustrate that conditions on coercion are a. necessary part of the semantics, but as we demonstrated, these are already an integral component of Generative Lexicon Theory.",
        "In the process of this discussion, we have reiterated the advantages of a generative lexicon in the context of the larger theoretical and methodological issues.",
        "More specifically, we showed how begin and cam-mencer exhibit both raising and control behavior, and that this is an instance of the larger alterna.-lion class between causative and inchoative verbs, itself an example of logical polysemy."
      ]
    }
  ]
}
