{
  "info": {
    "authors": [
      "Maryvonne Abraham",
      "Jean Pierre Descles"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-3163",
    "title": "Interaction Between Lexicon and Image: Linguistic Specifications of Animation",
    "url": "https://aclweb.org/anthology/C92-3163",
    "year": 1992
  },
  "references": [],
  "sections": [
    {
      "heading": "INTERACTION BETWEEN LEXICON AND IMAGE: LINGUISTIC SPECIFICATIONS OF ANIMATION",
      "text": []
    },
    {
      "heading": "ABSTRACT",
      "text": [
        "Ceasing textes d'une langue peuvent etre consider& comme des specifications linguistiques capables d'engendrer des animations qui simu-lent la comprehension des textes d'entree.",
        "Pour realiser un tel programme, it nous semble indispensable de construire des representations in-termediaires compatibles, d'un cote avec lee descriptions semantiques d'unites linguistiques, et d'un autre cote avec des specifications d'animation d'images.",
        "Comprendre un texte relatif A des mouvements spatiaux revient: representer semantique-ment le texte; h engendrer une animation mettant en jeu des images; cette animation vise I reproduire ce qui eat compris lore de la lecture du texte.",
        "Ce programme ambitieux suppose qu'au prealable cheque verbe ait des representations que nous appelons schemes se-mantico-cognitifs (SSC), correspondent aux differentes significations du verbe.",
        "Tout schema de mouvement associe I la signification d'un verbe represente trois types de connaissances: i) des declarations et des relations invariantes pendant le mouvement; ii) la description cine-matique du mouvement qui fait passer d'une phase initiale (Sits) I tine phase finale (Sits); iii) les conditions dynamiques eventuelles qui rendent possibles ou qui contrOlent le mouvement cinematique.",
        "None reprenons l'approche de R.Schank ou de J.Sowa qui remet en cause une association directe mot-concept pour adopter tine decomposition de la signification des unites linguistiques en elements de \"seas\" plus petite.",
        "Notre forma-lisme a pour but d'une part, de miens traiter les problemes de temps, et d'autre part, de fonder notre choix de primitives, dana le cadre d'une theorie qui articule les niveaux de representation linguistiques et cognitifs.",
        "lntroduisons quelques distinctions:",
        "1- le verbe eat une entite lexicale qui pent etre polysemique.",
        "ex: eireuter.",
        "2- le verbe syntaxique entre dane une construction syntaxique.",
        "ex: N1 circuler prep Nioc• 3 le predicat logique n-aire eat associe au verbe syntaxique.",
        "ex: CIRCULER est l'expression du predicat 1-sire CIRCULERI.",
        "4- A un predicat correspondent un ou plusieurs lens, designee par iverbeV, represent& cha, cun par un SSC.",
        "Un SSC est organise I par-tir de primitives cognitives; it conduit I une representation cognitive des qu'il est instancie.",
        "5- l'archetype cognitif note /verbe/, existe, se presente alors comme 9e Bens abstrait\" corn-mun h tousles SSC d'une méme entree lexicale polysemique.",
        "La construction de Parchetype repose sur une organisation des SSC en reseau.",
        "Elle utilise tine description analogue h celle de J.Picoche.",
        "A partir de l'exemple d'un texte francais qui represente des mouvements spatio-temporels, nous donnerons pour quelques verbe du texte les SSC et lee animations correspondantes.",
        "L'animation complete declendiee par la comprehension de texte necessite cette premiere phase de recherche.",
        "Les schemes que nous proposons sont integrables dane un dictionnaire semantique du francais.",
        "Notre ètude presenters I partir de l'exemple choisi la methodologie appuyee par une realisation.",
        "mote-tees: { comprehension de texte, representation des connaissances dynamiques, lexique cereal, mithodo-logic, choix de primitives semantico-cognitives, verbes de mouvement, analyse d'un texte, dictionnaire semen-tique, specification linguistique et animation •Departement Math6matiques et Syetêmes de Communication, LIASC, Telecom Bretagne, BP 832, 29285 Brest cedex, tel: 98 00 11 11 - FAX: 98 00 10 98 e-mail: ABRAHAMObrest.enet-bretagnejr tC.A.M.S., unite mixte CNRS - EHESS Universite Paris-Sorbonne, 96 Boulevard Raspail, 75006 Paris tel (16-1) 45 48 08 04 - FAX : (16-1) 40 49 07 98 - email : ishaafrciti51.tritnel Aura DE COLING-92, NANTEs, 23-28 min.",
        "1992 I 0 4 3 PRoc.",
        "OF COL1NG-92, NANTES, AuG. 23-28, 1992 key-words: understanding a text, dynamic knowledge representation, lexicon of verbs, methodology, choice of semantico-cognitive primitives, verbs of motion, text analysis, semantic dictionary, linguistic specification and animation.",
        "1 understanding a text and a moving picture Certain texts of a given langage can be considered as linguistic specifications able to produce motion pictures simulating the understanding of entry texts.",
        "To achieve such a program, we think that it is necessary to build intermediate representations which are compatible, on the one hand with the semantic description of linguistic units, and on the other hand, with specifications for the moving of pictures.",
        "other approaches contest this direct association word concept, and start from a breakdown of the signification of the linguistic units', following R.Schank in the 1975's. The meaning of the words is no longer considered as primitive but can be split up into smaller signification units.",
        "More recently, Sowa has presented a formalism of representation based on graphs with two sorts of nodes representing concepts and relations.",
        "However, many researchers feel that the choice of the primitives looks arbitrary ([SAB88], pp.241-243).",
        "We propose a formalism similar to Sowa's graphs [SOW84], but we try to process time better and establish our choice of primitives2, using a theory which arranges links between the levels of linguistic and cognitive representations.",
        "Understanding a text relative to spatial motion consists of: i) a semantic representation of this text; ii) movement with pictures; this animation aims to reproduce what is understood during the reading of the text.",
        "As a first step, this ambitious program requires that each verb should have representations which we call semantico-cognitive schemes (SCS).",
        "These representations correspond to the different meanings of the verbs.",
        "Each scheme of motion associated with the meaning of a verb represents three kinds of knowledge: i) declarations and relations which are invariant during the motion; ii) the cinematic description of the motion from an initial phase (Sit') to a final phase (Sit2); iii) the dynamic conditions which make or control kinetic motion."
      ]
    },
    {
      "heading": "1.1 semantico-cognitive representations",
      "text": [
        "Although several formalisms of knowledge rep. resentations (e.g. semantic networks) suppose that the word is the elementary semantic unit,",
        "The cognitive archetypes (or semantico-cognitive schemes, written SCS, see figure 2), were introduced in 1985 [DES85] in order to represent the verbal knowledge underlying the language.",
        "Our method to discover them is to collect linguistic data which allows us to characterize prototypic schemes of meanings from which an abstract invariant may appear, in some cases.",
        "The following levels can be taken into consideration: 1 The verb, written verb, is a lexical entity; it can be polysemic (e.g., sortir).",
        "2- The syntactic verb written verb; is a part 'See IKAY89] about the notion of variable depth.",
        "of a syntactic construction (e.g., N1 sortir prep N/„).",
        "3- The nary predicate is associated with the syntactic verb (e.g., SORTIR1)3.",
        "4- With a predicate, one or several meanings are associated, written /verb'/ 4.",
        "A SCS is organised from cognitive primitives.",
        "It produces a cognitive representation the moment it is in-stanciated.",
        "5- Then, if it exists, the cognitive archetype (written /verb/) appears as the \"abstract mean-ing\" common to each of the SCS of one lexical polysemic entry.",
        "Its construction is organised from SCSs.",
        "It uses a description similar to the one in J.Picoche's method [1108615.",
        "From a sample text representing spatio-temporal motion, we give the semantico-cognitive schemes and the corresponding motions for each verb of the text.",
        "This first step is required in order for an understanding of the text to trigger complete animation.",
        "2 A few verbs to represent a text",
        "As we have not enough room in this paper to describe each verb of this text, we have chosen to describe the French verbs stationner, and Burgin",
        "The schemes that we propose are integrated in a semantic dictionary of French.",
        "From a chosen example, our study presents the methodology based on demonstration.",
        "To illustrate our method, we analyse the verbs in the following French text and we give cognitive representations of them: Madame Dupont circulait dans une petite rue a sens unique oil stationnaient des voitures de chaque ate.",
        "Un vehicule sortant d'un parking surgit brusque-ment sur 8a droite.",
        "which means: Mrs Dupont was driving along a small one-way street where cars were parked on each side.",
        "A vehicle leaving a car park shot out on her left'.",
        "\"In agreement with the conceptual language of R.Jackendoff PAC831 4i indexes one of the prototypical meanings of the polysemes.",
        "'See two examples associated with the different meanings of the French verbs router 1.AB13.921 and monter (J.P.Desclts, article to be published).",
        "We need syntactic descriptions such as those of M.Grose (IGRO811).",
        "For identifying the SCSs, we use works on semantics such as ICDL83] and EMEL841.",
        "\"Notice that we make more than a lexical translation from French into English: cognitive laws of the highway code are 'translated\" too.",
        "In x stationne, we have a static positional relation.",
        "This situation is implicitly bound by a constraint (which can be more or less explicit).",
        "The signification of /stationner/ in this proposition is given by the dynamic scheme in figure 3.",
        "The quantification which binds the variable y blocks every instantiation of y.",
        "In our example, the SCS is instantiated with: x des voitures y de chaque ate d'une petite rue a sens unique A constraint is needed to keep a car parked.",
        "It is expressed here using the primitive \"FAIRE\" which keeps the movement from Siti to Sits in the same place.",
        "We say that /x stationne/ if the behaviour of x implies a constraint on its own movement which keep it in the same place.",
        "This constraint is expressed by the equality between the localisations loci of Siti and loc2 of Site."
      ]
    },
    {
      "heading": "2.2 SCS of the French verb surgir",
      "text": [
        "x surgit means a sudden transition, a movement entering the perception zone of an entity able to perceive.",
        "The perception zone is generally taken from the speaker's point of view.",
        "We have a rule ([DES90ipp.285-287, EABR911§2.1) concerning localisation:",
        "x.",
        "In fact, to each x is associated a family of localisations, among which a proper localisation, a peripheral localisation depending on cultural habits, and a neighbouring localisation dependent on the context.",
        "The localisation loc (x) can be determined by taking its internal area, its external area, or its frontier.",
        "The family of localisations can be extended to the localise-tions perceived by the individual entity.",
        "definition of perception: The localisation PER-CEP(x) is defined as a result of the intersection7 of an external area to be perceived and of the properties of perception of the person perceiving (its senses).",
        "x surgit if x moves from Sit' to Sit2.",
        "In Sit', x is situated in any localisation; in Sit2, x is situated in the place of perception of the witness, or, by default, in the area of perception of the speaker.",
        "/surgir/ can be associated with a preposition, for example, sur (on), which partially specifies the place of arrival.",
        "The French relation ÈTRE-SUR can be represented formally by the following set of relationss: definition of the relation ETRE-SUR: i) The one referred to is outside a domain D (closed localisation) ii) The one referred is in contact with the external frontier of the domain D.",
        "iii) An external action (by default, gravitation) keeps the referred one in contact with this external frontier.",
        "Concerning visual space perception (figure 5), the notions of right and left are relative: they can be organised from the point of view either of the subject observed, or of the speaker.",
        "Let us take an orientation from the subject observed A, here, Madame Dupont, which has an intrinsic orientation.",
        "A defines FRONT(A) REAR(A) LEFT(A), RIGHT(A), VIS(A).",
        "The intersection of these areas defines frontiers.",
        "In our example, we can consider that /to be on the left of Mrs Dupont/ means /to be on the external frontier between the areas VIS(Mrs Dupont) and LEFT(Mrs Dupont)/."
      ]
    },
    {
      "heading": "3 Towards a semantico-cognitive lexicon of verbs",
      "text": [
        "We implemented a semantico-cognitive lexicon on a workstation.",
        "The lexicon appears as a set of several windows showing: - a list of entry points: the lexical verbs; by clicking on a verb, a new window is opened, showing: - a list of examples of the entry verb.",
        "- for each of the examples, a button helps obtain the SCS associated with a given verb (and the corresponding archetype, if it exists).",
        "- Visual animation is associated with the SCS, and it is obtained from the archetype.",
        "This animation is the cognitive representation of a skeleton of motion; it may then be \"clothed\" with the textures specific to the moving object.",
        "Our work is limited to the cognitive specification of verbs of motion; it does not take into account the distortion specific to the objects.",
        "- the archetype of the verb, if it exists.",
        "Our demonstration shows the movement corresponding to the verbs in the text.",
        "The SCSs (and the corresponding archetype, if it exists) establish a specification from which: i) infor-Acres DE COLING-92.",
        "NArrrEs, 23-28 Acirr 1992 1 0 4 6 PROC.",
        "OF COLING-92, NANTES, AUG. 23-28, 1992 mation for inferences is extracted; ii) virtual animation can be generated on a screen.",
        "In parallel, we have defined the general language for computer specifications which use the sema.ntico-cognitive primitives that we propose in building the SCSs and the cognitive archetype [ChJ91].",
        "We thank Janet Ormrod, Telecom Bretagne, for her help in producing the English version of this text."
      ]
    }
  ]
}
