{
  "info": {
    "authors": [
      "Yves Scherrer"
    ],
    "book": "Proceedings of the First Workshop on Algorithms and Resources for Modelling of Dialects and Language Varieties",
    "id": "acl-W11-2604",
    "title": "Syntactic transformations for Swiss German dialects",
    "url": "https://aclweb.org/anthology/W11-2604",
    "year": 2011
  },
  "references": [
    "acl-D10-1112",
    "acl-E06-1047",
    "acl-W04-1910",
    "acl-W06-2920",
    "acl-W08-1008"
  ],
  "sections": [
    {
      "text": [
        "LATL Université de Genève Geneva, Switzerland",
        "yves.scherrer@unige.ch",
        "While most dialectological research so far focuses on phonetic and lexical phenomena, we use recent fieldwork in the domain of dialect syntax to guide the development of mul-tidialectal natural language processing tools.",
        "In particular, we develop a set of rules that transform Standard German sentence structures into syntactically valid Swiss German sentence structures.",
        "These rules are sensitive to the dialect area, so that the dialects of more than 300 towns are covered.",
        "We evaluate the transformation rules on a Standard German treebank and obtain accuracy figures of 85% and above for most rules.",
        "We analyze the most frequent errors and discuss the benefit of these transformations for various natural language processing tasks."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "For over a century, dialectological research has focused on phonetic, lexical and morphological phenomena.",
        "It is only recently, since the 1990s, that syntax has gained the attraction of dialectologists.",
        "As a result, syntactic data from field studies are now available for many dialect areas.",
        "This paper explores how dialect syntax fieldwork can guide the development of multidialectal natural language processing tools.",
        "Our goal is to transform Standard German sentence structures so that they become syntactically valid in Swiss German dialects.",
        "!Here, we do not take into account the phonetic, morphological and lexical changes involved in generating the actual Swiss German word forms.",
        "For such a model, see for example Scherrer and Rambow (2010a).",
        "These transformations are accomplished by a set of hand-crafted rules, developed and evaluated on the basis of the dependency version of the Standard German TIGER treebank.",
        "Ultimately, the rule set can be used either as a tool for treebank transduction (i.e. deriving Swiss German treebanks from Standard German ones), or as the syntactic transfer module of a transfer-based machine translation system.",
        "After the discussion of related work (Section 2), we present the major syntactic differences between Standard German and Swiss German dialects (Section 3).",
        "We then show how these differences can be covered by a set of transformation rules that apply to syntactically annotated Standard German text, such as found in treebanks (Section 4).",
        "In Section 5, we give some coverage figures and discuss the most common errors that result from these transformations.",
        "We conclude in Section 6."
      ]
    },
    {
      "heading": "2. Related work",
      "text": [
        "One line of research in natural language processing deals with parsing methods for dialects.",
        "Chiang et al.",
        "(2006) argue that it is often easier to manually create resources that relate a dialect to a standard language than it is to manually create syntactically annotated resources for the dialect itself.",
        "They investigate three approaches for parsing the Levantine dialect of Arabic, one of which consists of transducing a Standard Arabic treebank into Levantine with the help of hand-crafted rules.",
        "We agree with this point of view: we devise transformation rules that relate Swiss German dialects to Standard German.",
        "In the case of closely related languages, different types of annotation projection have been proposed to facilitate the creation of treebanks.",
        "See Volk and Samuelsson (2004) for an overview of the problem.",
        "In a rather different approach, Vaillant (2008) presents a hand-crafted multi-dialect grammar that conceives of a dialect as some kind of \"agreement feature\".",
        "This allows to share identical rules across dialects and differentiate them only where necessary.",
        "We follow a similar approach by linking the transformation rules to geographical data from recent dialectological fieldwork.",
        "Another line of research is oriented towards machine translation models for closely related languages.",
        "It is common in this field that minor syntactic differences are dealt with explicitly.",
        "Corbl-Bellot et al.",
        "(2005) present a shallow-transfer system for the different Romance languages of Spain.",
        "Structural transfer rules account for gender change and word reorderings.",
        "Another system (Homola and Kubon, 2005) covers several Slavonic languages of Eastern Europe and confirms the necessity of shallow parsing except for the most similar language pair (Czech-Slovak).",
        "In contrast, statistical machine translation systems have been proposed to translate closely related languages on a letter-by-letter basis (Vilar et al., 2007; Tiedemann, 2009).",
        "However, the word reordering capabilities of a common phrase-based model are still required to obtain reasonable performances."
      ]
    },
    {
      "heading": "3. The main syntactic features of Swiss German dialects",
      "text": [
        "A general description of the linguistic particularities of Swiss German dialects, including syntax, can be found, for example, in Lotscher (1983).",
        "Some syntactic case studies within the framework of Generative Grammar are presented in Penner (1995).",
        "Currently, a dialectological survey, under the name of SADS (Syntaktischer Atlas der deutschen Schweiz), aims at producing a syntactic atlas of German-speaking Switzerland (Bucheli and Glaser, 2002).",
        "Some preliminary results of this project are described in Klausmann (2006).",
        "to distinguish \"dialects\" from \"closely related languages\".",
        "There are two main types of syntactic differences between Swiss German dialects and Standard German.",
        "Some of the differences are representative of the mainly spoken use of Swiss German.",
        "They do not show much interdialectal variation, and they are also encountered in other spoken varieties of German.",
        "Other differences are dialectological in nature, in the sense that they are specific to some subgroups of Swiss German dialects and usually do not occur outside of the Alemannic dialect group.",
        "This second type of differences constitutes the main research object of the SADS project.",
        "In the following subsections, we will show some examples of both types of phenomena.",
        "No preterite tense Swiss German dialects do not have synthetic preterite forms and use (analytic) perfect forms instead (1a).",
        "Transforming a Standard German preterite form is not trivial: the correct auxiliary verb and participle forms have to be generated, and they have to be inserted at the correct place (in the right verb bracket).",
        "Standard German pluperfect is handled in the same way: the inflected preterite auxiliary verb is transformed into an inflected present auxiliary verb and an auxiliary participle, while the participle of the main verb is retained (1b).",
        "The resulting construction is called double perfect.",
        "(1) a. Wir gingen ins Kino.",
        " – Wir sind ins Kino gegangen.",
        "'We went to the cinema.'",
        "b. als er gegangen war – als er gegangen gewesen ist 'when he had gone' No genitive case Standard German genitive case is replaced by different means in Swiss German.",
        "Some prepositions (e.g. wegen, wahrend 'because, during') use dative case instead of genitive.",
        "Other prepositions become complex through the addition of a second preposition von (e.g. innerhalb 'within').",
        "Verbs requiring a genitive object in Standard German generally use a dative object in Swiss",
        "German unless they are lexically replaced.",
        "Genitive appositions are converted to PPs with von 'of' in the case of non-human NPs (2a), or to a dative-possessive construction with human NPs (2b).",
        "(2) a. der Schatzmeister der Partei – der Schatzmeister von der Partei 'the treasurer of the party' b. das Haus des Lehrers – dem Lehrer sein Haus 'the teacher's house', litt.",
        "'to the teacher his house' Determiners with person names A third difference is the prevalent use of person names with determiners, whereas (written) Standard German avoids determiners in this context:",
        "Verb raising When two or more verbal forms appear in the right verb bracket, their order is often reversed with respect to Standard German.",
        "Several cases exist.",
        "In Western Swiss dialects, the auxiliary verb may precede the participle in subordinate clauses (4a).",
        "In all but Southeastern dialects, the modal verb precedes the infinitive (4b).",
        "Verb raising also occurs for full verbs with infinitival complements, like lassen 'to let' (4c).",
        "In this case, the dependencies between lassen and its complements cross those between the main verb and its complements:",
        "mich einen Apfel Verb projection raising In the same contexts as above, the main verb extraposes to the right along with its complements (4d), (4e).",
        " – dass er ist gegangen 'that he has gone' b. dass du einen Apfel essen willst – dass du einen Apfel willst essen 'that you want to eat an apple' c. dass du mich einen Apfel essen lasst – dass du mich einen Apfel lasst essen 'that you let me eat an apple' d. dass du einen Apfel essen willst – dass du willst einen Apfel essen 'that you want to eat an apple' e. dass du mich einen Apfel essen lasst – dass du mich lasst einen Apfel essen 'that you let me eat an apple' Prepositional dative marking In Central Swiss dialects, dative objects are introduced by a dummy preposition i or a (5a).",
        "However, this preposition is not added if the dative noun phrase is already part of a prepositional phrase (5b).",
        "'the mother (dative)' b. mit der Mutter – mit (*i/a) der Mutter 'with the mother' Article doubling In adjective phrases that contain an intensity adverb like ganz, so 'very, such', the determiner occurs either before the adverb as in Standard German, or after the adverb, or in both positions, depending on the dialect:",
        "(6) ein ganz lieber Mann – ganz ein lieber Mann – ein ganz ein lieber Mann 'a very dear man' Complementizer in wh-phrases Interrogative subordinate clauses introduced by verbs like fragen 'to ask' may see the complementizer dass attached after the interrogative adverb or pronoun.",
        "Relative pronouns Nominative and accusative relative pronouns are substituted in most Swiss German dialects by the uninflected particle wo.",
        "In dative (7a) or prepositional (7b) contexts, the particle wo appears together with an inflected personal pronoun:",
        "Final clauses Standard German allows non-finite final clauses with the complementizer um ...zu 'in order to'.",
        "In Western dialects, this complementizer is rendered as fUr ...z.",
        "In Eastern dialects, a single particle zum is used.",
        "An intermediate form zum .",
        ".",
        ".",
        "z also exists.",
        "Pronoun sequences In a sequence of accusative and dative pronouns, the accusative usually precedes in Standard German, whereas the dative precedes in many Swiss German dialects:",
        "Predicative adjectives In Southwestern dialects, predicative adjectives agree in gender and number with the subject:",
        "Copredicative adjectives A slightly different problem is the agreement of copredicative adjectives.",
        "A copredicative adjective relates as an attribute to a noun phrase, but also to the predicate of the sentence (see example below).",
        "In Northeastern dialects, there is an invariable er-ending for all genders and numbers.",
        "In Southern dialects, the co-predicative adjective agrees in gender and number.",
        "Elsewhere, the uninflected adjective form is used, as in Standard German.",
        "(10) Sie sollten die Milch warm trinken.",
        " – Sie sollten die Milch warme FenLSg / warmer Invar trinken.",
        "'You should drink the milk warm.'",
        "The SADS survey consists of four written questionnaires, each of which comprises about 30 questions about syntactic phenomena like the ones cited above.",
        "They were submitted to 3185 informants in 383 inquiry points.",
        "For each question, the informants were asked to write down the variant(s) that they deemed acceptable in their dialect.",
        "Figure 1: The three maps show the geographical distribution of prepositional dative marking with a (top) and with i (center).",
        "The bottom map shows the inquiry points in which no preposition is added to dative NPs.",
        "The maps are based on SADS question I/7.",
        "Larger circles represent larger proportions of informants considering the respective variant as the most natural one.",
        "The SADS data give us an overview of the syntactic phenomena and their variants occurring in the different Swiss German dialects.",
        "It is on the basis of these data that we compiled the list of phenomena presented above.",
        "More importantly, the SADS data provide us with a mapping from variants to inquiry points.",
        "It suffices thus to implement a small number of variants (between 1 and 5 for a typical phenomenon) to obtain full coverage of the 383 inquiry points.",
        "Figure 1 shows the geographical distribution of the three variants of prepositional dative marking.",
        "For a subset of syntactic phenomena, two types of questions were asked:",
        "• Which variants are acceptable in your dialect?",
        "• Which variant do you consider the most natural one in your dialect?",
        "In the first case, multiple mentions were allowed.",
        "Usually, dialect speakers are very tolerant in accepting also variants that they would not naturally utter themselves.",
        "In this sense, the first set of questions can be conceived as a geographical model of dialect perception, while the second set of questions rather yields a geographical model of dialect production.",
        "According to the task at hand, the transformation rules can be used with either one of the data sets."
      ]
    },
    {
      "heading": "4. Transformation rules",
      "text": [
        "The transformation rules require morphosyntacti-cally annotated Standard German input data.",
        "Therefore, we had to choose a specific annotation format and a specific corpus to test the rules on.",
        "We selected the Standard German TIGER treebank (Brants et al., 2002), in the CoNLL-style dependency format (Buchholz and Marsi, 2006; Kubler, 2008).",
        "This format allows a compact representation of the syntactic structure.",
        "Figure 2 shows a sample sentence, annotated in this format.",
        "While we use the TIGER corpus for test and evaluation purposes in this paper, the rules are aimed to be sufficiently generic so that they apply correctly to any other corpus annotated according to the same guidelines.",
        "We have manually created transformation rules for a dozen of syntactic and morphosyntactic phenomena.",
        "These rules (i) detect a specific syntactic pattern in a sentence and (ii) modify the position, content and/or dependency link of the nodes in that pattern.",
        "The rules are implemented in the form of Python scripts.",
        "As an example, let us describe the transformation rule for article doubling.",
        "This rule detects the following syntactic pattern:",
        "ART ADV ADJA X",
        "The rule then produces the three valid Swiss German patterns - as said above, the transformation rules may yield different output structures for different dialects.",
        "One of the three variants is identical to the Standard German structure produced above.",
        "In a second variant, the positions of the article and the adverb are exchanged without modifying the dependency links:",
        "ADV ART ADJA X",
        "This transformation yields non-projective dependencies (i.e. crossing arcs), which are problematic for some parsing algorithms.",
        "However, the original TIGER annotations already contain non-projective dependencies.",
        "Thus, there is no additional complexity involved in the resulting Swiss German structures.",
        "The third variant contains two occurrences of the determiner, before and after the intensity adverb.",
        "We chose to make both occurrences dependents of the same head node:",
        "As mentioned previously, the SADS data tell us which of the three variants is accepted in which of the 384 inquiry points.",
        "This mapping is non-deterministic: more than one variant may be accepted at a given inquiry point."
      ]
    },
    {
      "heading": "5. Evaluation",
      "text": [
        "In order to get an idea of the frequency of the syntactic constructions mentioned in Section 3, we started by searching the TIGER treebank for the crucial syntactic patterns.",
        "Table 1 shows frequency counts",
        "ID FORM LEMMA CPOSTAG POSTAG FEATS HEAD DEPREL",
        "Figure 2: Example of a CoNLL-style annotated sentence.",
        "Each word (FORM) is numbered (ID), lemmatized (LEMMA), annotated with two levels of part-of-speech tags (CPOSTAG and POSTAG), annotated with morphological information (FEATS) and with dependency relations.",
        "HEAD indicates the ID of the head word, and DEPREL indicates the type of dependency relation.",
        "For example, the word at position 1 (fur) depends on the word at position 4 (reicht) by a PP relation.",
        "of the respective phenomena.",
        "This preliminary study led us to exclude phenomena that could not be detected reliably because the morphosyntactic annotations in TIGER were not precise enough.",
        "For example, TIGER does not distinguish between copredicative (11a) and adverbial (11b) uses of adjectives.",
        "Therefore, it is impossible to automatically count the number of copredicative adjectives, let alone perform the necessary dialectal transformations.",
        "(11) a. Blitzblank hangen die Topfe an der Küchenwand.",
        "'The pots are hanging sparkling clean on the kitchen wall.'",
        "b. Haufig hangen die Topfe an der Küchenwand.",
        "'The pots frequently hang on the kitchen",
        "For each syntactic construction, a development set and a test set were extracted from the TIGER treebank, each of them comprising at most 100 sentences showing that construction.",
        "After achieving fair performance on the development sets, the held-out test data was manually evaluated.",
        "We did not evaluate the accusative-dative pronoun sequences because of their small number of occurrences.",
        "Predicative adjective agreement was not evaluated because the author did not have native speaker's intuitions about this phenomenon.",
        "Table 2 shows the accuracy of the rules on the test data.",
        "Recall that some rules cover different dialectal variants, each of which may show different types of errors.",
        "In consequence, the performance of some rules is indicated as an interval.",
        "Moreover, some dialectal variants do not require any syntactic change of the Standard German source, yielding figures of 100% accuracy.",
        "The evaluation was performed on variants, not on inquiry points.",
        "The mapping between the variants and the inquiry points is supported by the SADS data and is not the object of the present evaluation.",
        "1",
        "fur",
        "fur",
        "APPR",
        "PREP",
        "-",
        "4",
        "PP",
        "2",
        "eine",
        "eine",
        "ART",
        "ART",
        "Acc.Sg.Fem",
        "3",
        "DET",
        "3",
        "Statistik",
        "Statistik",
        "NN",
        "N",
        "Acc.Sg.Fem",
        "1",
        "PN",
        "4",
        "reicht",
        "reichen",
        "VVFIN",
        "V",
        "3.Sg.Pres.Ind",
        "0",
        "ROOT",
        "5",
        "das",
        "das",
        "PDS",
        "PRO",
        "Nom.Sg.Neut",
        "4",
        "SUBJ",
        "6",
        "nicht",
        "nicht",
        "PTKNEG",
        "PTKNEG",
        "-",
        "4",
        "ADV",
        "7",
        "$.",
        "-",
        "0",
        "ROOT",
        "Construction",
        "Sentences",
        "Preterite tense",
        "13439",
        "Genitive case",
        "15351",
        "Person name determiners",
        "5410",
        "Verb raising",
        "3246",
        "Verb projection raising",
        "2597",
        "Prep.",
        "dative marking",
        "2708",
        "Article doubling",
        "61",
        "Compl.",
        "in wh-phrases",
        "478",
        "Relative pronouns",
        "4619",
        "Final clauses",
        "629",
        "Pronoun sequences",
        "6",
        "Predicative adjectives",
        "2784",
        "Total TIGER sentences",
        "40000",
        "The overall performance of the transformation rules lies at 85% accuracy and above for most rules.",
        "Four major error types can be distinguished.",
        "Annotation errors The annotation of the TIGER treebank has been done semi-automatically and is not exempt of errors, especially in the case of out-of-vocabulary words.",
        "These problems degrade the performance of rules dealing with proper nouns.",
        "In (12), the first name Traute is wrongly analyzed as a preterite verb form traute 'trusted, wedded', leading to an erroneous placement of the determiner.",
        " – *traute die Müller / die Traute Müller Imperfect heuristics Some rules rely on a syntactic distinction that is not explicitly encoded in the TIGER annotation.",
        "Therefore, we had to resort to heuristics, which do not work well in all cases.",
        "For example, the genitive replacement rule needs to distinguish human from non-human NPs.",
        "Likewise, adding a complementizer to wh-phrases overgenerates because the TIGER annotation does not reliably distinguish between clause-adjoined relative clauses and interrogative clauses introduced as complement of the main verb.",
        "Conjunctions Many rules rely on the dependency relation type (the DEPREL field in Figure 2).",
        "According to the CoNLL guidelines, the dependency type is only encoded in the first conjunct of a conjunction, but not in the second.",
        "As a result, the transformations are often only applied to the first conjunct.",
        "However, it should not be too difficult to handle the most frequent types of conjunctions.",
        "Word order errors Appositions and quotation marks sometimes interfere with transformation rules and lead to typographically or syntactically unfortunate sentences.",
        "In other cases, the linguistic description is not very explicit.",
        "For example, in the verb projection raising rule, we found it difficult to decide which constituents are moved and which are not.",
        "Moving polarity items is sometimes blocked due to scope effects.",
        "Different types of adverbs also tend to behave differently.",
        "In the previous section, we evaluated each syntactic transformation rule individually.",
        "It is also possible to apply all rules in cascade.",
        "The following example shows an original Standard German sentence (13a) along with three dialectal variants, obtained by the cascaded application of our transformation rules.",
        "The Mörschwil dialect (Northeastern Switzerland, Canton St. Gallen) shows genitive replacement and relative pronoun replacement (13b).",
        "The Central Swiss dialect of Sempach (Canton Lucerne) additionally shows prepositional dative marking (13c), while the Guttannen dialect (Southwestern Switzerland, Canton Berne) shows an instance of verb raising (13d).",
        "All transformations are underlined.",
        "Note again that the transformation rules only produce Swiss German morphosyntactic structures, but do not include word-level adaptations.",
        "For illustration, the last example (13e) includes wordlevel translations and corresponds thus to the \"real\" dialect spoken in Morschwil.",
        "(13) a.",
        "Original: Einen besonderen Stellenwert verdient dabei die alarmierende Zahl junger Menschen, die der PDS ihre Stimme gegeben haben.",
        "'Special importance should be paid to the alarming number of young people who have given their vote to the PDS.'",
        "b. Morschwil: Einen besonderen Stellenwert verdient dabei die alarmierende Zahl von jungen Menschen, wo der PDS ihre Stimme gegeben haben.",
        "c. Sempach: Einen besonderen Stellenwert verdient dabei die alarmierende Zahl von jungen Menschen, wo i der PDS ihre Stimme gegeben haben.",
        "Construction",
        "Accuracy",
        "Preterite tense",
        "89%",
        "Genitive case",
        "85-93%",
        "Person name determiners",
        "80%",
        "Verb raising",
        "96-100%",
        "Verb projection raising",
        "85-100%",
        "Prep.",
        "dative marking",
        "93-100%",
        "Article doubling",
        "100%",
        "Compl.",
        "in wh-phrases",
        "69-100%",
        "Relative pronouns",
        "86-99%",
        "Final clauses",
        "92-100%",
        "d. Guttannen: Einen besonderen Stellenwert verdient dabei die alarmierende Zahl von jungen Menschen, wo der PDS ihre Stimme haben gegeben.",
        "e. Morschwil (\"real\"): En bsondere Stellewert vedient debii di alarmierend Zahl vo junge Mensche, wo de PDS iri Stimm ggee hend."
      ]
    },
    {
      "heading": "6. Conclusion and future work",
      "text": [
        "We have shown that a small number of manually written transformation rules can model the most important syntactic differences between Standard German and Swiss German dialects with high levels of accuracy.",
        "Data of recent dialectological fieldwork provides us with a list of relevant phenomena and their respective geographic distribution patterns, so that we are able to devise the unique combination of transformation rules for more than 300 inquiry points.",
        "A large part of current work in natural language processing deals with inferring linguistic structures from raw textual data.",
        "In our setting, this work has already been done by the dialectologists: by devising questionnaires of the most important syntactic phenomena, collecting data from native dialect speakers and synthesizing the results of the survey in the form of a database.",
        "Relying on this work allows us to obtain precise results for a great variety of dialects, where machine learning techniques would likely run into data sparseness issues.",
        "The major limitation we found with our approach is the lacking precision (for our purposes) of the Standard German treebank annotation.",
        "Indeed, some of the syntactic distinctions that are made in Swiss German dialects are not relevant from a purely Standard German point of view, and have therefore not been distinguished in the annotation.",
        "Additional annotation could be added with the help of semantic heuristics.",
        "For example, in the case of copredicative adjectives (11), a semantic resource could easily tell that pots can be sparkling clean but not frequent.",
        "The purpose of our work is twofold.",
        "First, the rule set can be viewed as part of a transfer-based machine translation system from Standard German to Swiss German dialects.",
        "In this case, one could use a parser to analyze any Standard German sentence before applying the transformation rules.",
        "Second, the rules allow to transform the manually annotated sentences of a Standard German treebank in order to automatically derive Swiss German treebanks.",
        "Such treebanks - even if they are of lower quality than manually annotated ones - could then be used to train statistical models for Swiss German part-of-speech tagging or full parsing.",
        "Moreover, they could be used to train statistical machine translation models to translate out of the dialects into Standard German.",
        "Both lines of research will be tested in future work.",
        "In addition, the rules presented here only deal with syntactic transformations.",
        "Word-level transformations (phonetic, lexical and morphological adaptations) will have to be dealt with by other means.",
        "Furthermore, we would like to test if syntactic patterns can be used successfully for dialect identification, as this has been done with lexical and phonetic cues in previous work (Scherrer and Rambow, 2010b).",
        "Another aspect of future research concerns the type of treebank used.",
        "The TIGER corpus consists of newspaper texts, which is hardly a genre frequently used in Swiss German.",
        "Spoken language texts would be more realistic to translate.",
        "The TüBa-D/S treebank (Hinrichs et al., 2000) provides syntactically annotated speech data, but its lack of morphological annotation and its diverging annotation standard have prevented its use in our research for the time being."
      ]
    }
  ]
}
