{
  "info": {
    "authors": [
      "Beata Trawinski"
    ],
    "book": "SIGSEM Workshop on Prepositions",
    "id": "acl-W06-2103",
    "title": "A Quantitative Approach to Preposition-Pronoun Contraction in Polish",
    "url": "https://aclweb.org/anthology/W06-2103",
    "year": 2006
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents the current results of an ongoing research project on corpus distribution of prepositions and pronouns within Polish preposition-pronoun contractions.",
        "The goal of the project is to provide a quantitative description of Polish preposition-pronoun contractions taking into consideration morphosyntactic properties of their components.",
        "It is expected that the results will provide a basis for a revision of the traditionally assumed inflectional paradigms of Polish pronouns and, thus, for a possible remodeling of these paradigms.",
        "The results of corpus-based investigations of the distribution of prepositions within preposition-pronoun contractions can be used for grammar-theoretical and lexicographic purposes."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "As (´Swidzi´nski and Derwojedowa, 2004) and (Trawi´nski, 2005) have observed, preposition-pronoun contraction (PPC) in Polish (cf. (1)) is a highly idiosyncratic phenomenon.",
        "(1) a. na niego ‘on him’ na´n ‘on – him’ b. w niego ‘in him’ we´n ‘in – him’",
        "On the one hand, not just any pronoun can occur in a PPC, on the other hand, the set of prepositions which are able to contract with pronouns involves a very limited number of elements.",
        "The distribution of pronouns and prepositions within Polish PPCs has not yet been discussed",
        "in detail.",
        "There are, however, several traditional approaches to Polish third person personal pronouns (TPPPs) which provide some relevant information.2 In the following, the approach to TPPPs of (Saloni, 1981), adopted in our research project, will be presented.",
        "According to (Saloni, 1981), the inventory of Polish TPPPs comprises masculine human, masculine animate, masculine inanimate, feminine, and neuter pronouns, inflecting for case (nominative, genitive, dative, accusative, instrumental and locative), number (singular and plural), postprepo-sitionality (yes or no) and accentability (yes or no).",
        "The inflectional paradigms of TPPPs proposed by (Saloni, 1981), and adopted in most Polish grammars, indicate that only genitive and accusative masculine human, masculine animate and masculine inanimate singular TPPPs possess unaccented postprepositional realizations, i.e., are able to contract with prepositions.3 However, corpus evidence indicates that there may be many further possibilities of the realization of unaccented postprepositional pronouns, i.e., pronouns contractible with prepositions.",
        "Corpus data also provide interesting information about the distribution of prepositions within PPCs.",
        "Only some PPCs found in the corpus correspond with respect to the form of prepositions contained in those PPCs, to dictionary data.",
        "The goal of this research project is to characterize the corpus distribution of TPPPs and prepositions occurring within PPCs and to quantitatively analyze the results.",
        "While the first part of the",
        "project has already been completed, the second one is still in progress.",
        "Section 2 presents the results of the corpus examination in regard to the distribution of pronouns and prepositions within PPCs, Section 3 outlines the proposal of a quantitative analysis of the results presented in Section 2, and Section 4 sums up the discussion and outlines future goals."
      ]
    },
    {
      "heading": "2 Corpus Distribution of Pronouns and",
      "text": []
    },
    {
      "heading": "Prepositions within PPCs",
      "text": [
        "For the corpus-based investigation of the distribution of pronouns and prepositions within Polish PPCs, the IPI PAN Corpus of Polish was used .4 Because of their very low frequency, the PPCs were searched for in the largest of the available IPI PAN subcorpora, i.e., the automatically annotated wstepny corpus (over 70 million segments).",
        "PPCs had to be identified manually, as they were not recognized in the wstepny corpus as consisting of multiple segments, instead being identified as unknown forms (tagged by ign).",
        "Thus, in the first instance, a search was performed for all unknown forms ending in -(e)´n.5 Next, a total of 1193 PPCs were manually extracted from 3308 result matches.",
        "Later, an interpretation in terms of grammatical features was assigned to each contracted pronoun by identifying its antecedent.",
        "The antecedent identification proceeded manually as well.",
        "Finally, the set of the acquired PPCs was verified by querying the corpus for all potential contractions of unaccented postprepositional pronouns with each particular Polish preposition.",
        "As a result, genitive and accusative masculine human plural, locative masculine inanimate singular, genitive and accusative masculine inanimate plural, genitive and accusative neuter singular, genitive, accusative and locative neuter plural, genitive and accusative feminine singular, and genitive, accusative and locative feminine plural pronominal forms within PPCs were recorded in addition to the masculine human, masculine animate and masculine inanimate singular pronomi",
        "nal forms.",
        "A further observation that was made on the basis of corpus data was that the set of prepositions detected in contractions with unaccented postprepositional pronouns involves a very limited number of elements, more precisely dla ‘for’, do ‘to’, na ‘on’, od ‘from’, po ‘after’, przez ‘by’, w ‘in’, za ‘behind’, z ‘with’, and przed ‘in front of’.",
        "No occurrences of contractions containing other prepositions were found in the corpus.",
        "While the absence of contractions involving secondary prepositions, such as ponad ‘above’, poprzez ‘through’, mi˛edzy ‘between’, etc.",
        "corresponds to dictionary data, the non-appearance of contractions containing prepositions such as bez ‘without’, o ‘about’, nad ‘above’, or pod ‘under’, provided in Polish dictionaries such as (Dubisz, 2003) or (Ba´nko, 2000), does not.6 Figure 1 on the next page presents an overview of the distribution of all unaccented postprepositional pronouns and prepositions within PPCs found in the IPI PAN Corpus.",
        "For each pronoun form, the context in which it occurs is specified, i.e., the contraction of that form with a particular preposition, and the total number of times this form occurred together with the percentage of the total frequency of all unaccented postprepositional forms is recorded.",
        "In addition, the total of all occurrences of each contraction found in the corpus is indicated, as well as the percentage of the total frequency of all preposition-pronoun contractions occurring in the corpus.7"
      ]
    },
    {
      "heading": "3 Quantitative Interpretation",
      "text": [
        "To determine whether the distribution of the unaccented postprepositional pronouns and prepositions within PPCs found in the IPI PAN Corpus may be considered linguistically significant and, in consequence, may establish the basis for a revision of the traditionally assumed inflectional paradigms, a number of quantitative procedures must be performed.",
        "First of all, it must be determined whether the frequency of each unaccented postprepositional",
        "pronoun form in the corpus is statistically significant.",
        "For this purpose, the distribution of all accented postprepositional pronouns must be compiled.",
        "On the basis of the total frequency of accented and unaccented postprepositional pronouns, the statistical significance can be calculated using the test, for instance.",
        "If one determines that the frequency of unaccented postprepositional pronouns in the corpus is statistically significant, ratios of the total number of particular accented postprepositional pronouns to the total number of their unaccented counterparts can be ascertained.",
        "These ratios can then be compared.8 If the ratios of accented postprepositional pronouns to their unaccented counterparts not included in the traditionally assumed inflectional paradigms correlate with the ratios of accented postprepositional pronouns to their unaccented counterparts contained in the traditionally assumed inflectional paradigms, the distribution of the unaccented postprepositional pronouns in the corpus may be considered linguistically important.",
        "In our ongoing study, the distribution of accented postprepositional pronouns combining with the prepositions dla ‘for’, do ‘to’, na ‘on’, w ‘in’, z ‘with’, od ‘from’, przez ‘by’, po ‘after’, za ‘behind’, and przed ‘in front of’ has been ascertained.",
        "These pronouns correspond to their unaccented counterparts occurring as parts of the contractions dla´n ‘for _TPPP’, do´n ‘to_TPPP’, na´n ‘on_TPPP’, we´n ‘in_TPPP’, ze´n ‘with_TPPP’ / ‘from_TPPP’, ode´n ‘from_TPPP’, przeze´n ‘by_TPPP’, po´n ‘after_TPPP’, za´n ‘be-hind_TPPP’, and przede´n ‘in front of_TPPP respectively.",
        "Note that assigning interpretations to pronouns must proceed manually on the basis of their antecedents, as a vast number of pronouns in the IPI PAN Corpus are resolved incorrectly.",
        "Figure 2 on the next page provides the current results.9 AAlternatively, the percentage of occurrences of each unaccented postprepositional pronoun of the total number of occurrences of unaccented postprepositional pronouns and the percentage of occurrences of each accented postprepositi-nal pronoun of the total number of occurrences of accented postprepositional pronouns can be ascertained and the results compared.",
        "9 Note that in some cases, assigning an interpretation to a given pronoun was impossible, which is indicated in Figure 2 by the question mark (?).",
        "In some cases, identification of an antecedent was not possible, more than one antecedent candidate bearing different features came into question, or some features provided by an antecedent and a given pronoun were inconsistent with one another.",
        "In the majority of cases, morphosyntactic features clashed with contextual / pragmatic / natural features.",
        "Currently, only the distributional characterization of genitive and accusative feminine singular postprepositional pronouns is available for analysis.",
        "It has been ascertained that genitive unaccented postprepositional feminine pronouns are used significantly less frequently in the IPI PAN Corpus than are genitive accented postprepositional feminine pronouns ( =101.76 (df=1), p<0.001), and accusative unaccented postprepositional feminine pronouns are used significantly less frequently in the IPI PAN Corpus than are accusative accented postprepositional feminine pronouns ( =36.95 (df=1), p<0.001).",
        "The percentage of genitive unaccented postprepositional feminine singular pronouns of the total of all unaccented postprepositional pronouns amounted to 2.06 , while the percentage of genitive accented postprepositional feminine singular pronouns amounted to 11.41 .",
        "The percentage of accusative unaccented postprepositional feminine singular pronouns of the total of all unaccented postprepositional pronouns was 1.59 , while the percentage of accusative accented postprepositional feminine singular pronouns was 5.68 .",
        "The ratios of the totals of genitive and accusative accented postprepositional feminine singular pronouns to the totals of their unaccented counterparts are given in Figure 3.",
        "Additionally, Figure 3 provides the ratio of the total of all accented plural pronouns occurring in the contexts indicated in Figure 2, to the total of the unaccented forms.",
        "For the final conclusions, however, the distribution patterns of particular plural pronouns must be described.",
        "Ratio gen, fem, sg 226.56 acc, fem, sg 148.42 pl 759.60",
        "In the next step, the remaining accented postprepositional pronoun forms will be identified in the corpus and totaled.10 Then, the ratios of the totals of these pronouns to the totals of their unaccented forms will be calculated.",
        "Finally, all ra10Note that the total frequency of accented postprepositional forms corresponding to unaccented forms with zero frequency will, in fact, not affect the analysis.",
        "tios will be compared.",
        "If there are any significant differences between particular ratios, an attempt will be made to ascertain possible reasons for these differences (e.g., ungrammaticality, production errors, meta data, etc.)",
        "and conclusions will be made.",
        "If there are no significant differences between the particular ratios, it will be concluded that the distribution patterns of pronouns and prepositions within PPCs found in the corpus are also linguistically significant and that the traditionally assumed inflectional paradigms of TPPPs, as well as previous dictionary specifications of PPCs, may have to be revised."
      ]
    },
    {
      "heading": "4 Summary and Outlook",
      "text": [
        "In this paper, the current results of our ongoing corpus-based study on the distribution of prepositions and pronouns within Polish PPCs were presented.",
        "At this point, conclusions can be drawn that, according to corpus evidence, there seem to exist more pronominal forms being able to contract with prepositions than traditionally assumed.",
        "On the other hand, corpus data provide fewer prepositions contracting with pronouns than do Polish dictionaries.",
        "To verify these results for the purpose of a possible revision of the traditionally assumed inflectional paradigms of TPPPs, as well as for lexicographic purposes, a quantitative analysis was proposed which draws on the calculation and comparison of ratios of the total frequency of all accented postprepositional forms to the total frequency of their unaccented counterparts.",
        "The analysis will be completed within the next project phase.",
        "In future work, other corpora of Polish, such as the PWN Corpus of Polish11 or the PELCRA Corpus 12 will be examined with respect to the distribution of pronouns and prepositions within PPCs, and the results will be compared with those achieved using the IPI PAN Corpus.13 Further on, meta data will be analyzed with respect to the dis",
        "13A preliminary list of PPCs occurring in the PWN Corpus has been provided to us by Magdalena Derwojedowa (personal communication).",
        "According to this list, the following PPCs appear in the PWN Corpus: dla´c ‘for_TPPP’, do´c ‘to_TPPP’, cade´c ‘above_TPPP’, ca´c ‘on_TPPP’, ode ´c ‘from_TPPP’, o´c ‘above_TPPP’, po´c ‘after_TPPP’, przede´c ‘behind _TPPP’, przeze´c ‘by_TPPP’, we´c ‘in_TPPP’, ze´c ‘with_TPPP’ / ‘from _TPPP’.",
        "This set of PPCs does not fully correspond to that found of the IPI PAN Corpus.",
        "Thus, such a comparison seems to be reasonable.",
        "tribution of TPPPs.",
        "Finally, all results will be evaluated by human judges."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We would like to thank Magdalena Derwojedowa, El˙zbieta Hajnicz, Timm Lichte, Adam Przepiórkowski, Janina Radó, Zygmunt Saloni, Marek ´Swidzi´nski and Marcin Woli´nski, as well as the reviewers of the Third ACL-SIGSEM Workshop on Prepositions held at the EACL 2006 in Trento for their helpful comments.",
        "We are also grateful to Janah Putnam for proofreading this paper."
      ]
    }
  ]
}
