{
  "info": {
    "authors": [
      "Yafa Al-Raheb"
    ],
    "book": "SIGdial Workshop on Discourse and Dialogue",
    "id": "acl-W06-1310",
    "title": "Semantic and Pragmatic Presupposition in Discourse Representation Theory",
    "url": "https://aclweb.org/anthology/W06-1310",
    "year": 2006
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper investigates semantic and pragmatic presupposition in Discourse Representation Theory (DRT) and enhances the pragmatic perspective of presupposition in DRT.",
        "In doing so, it draws attention to the need to account for agent presupposition (i.e. both speaker and hearer presupposition) when dealing with pragmatic presupposition.",
        "Furthermore, this paper links this pragmatic conception of presupposition with the semantic one (sentence presupposition) through using ‘information checks’ which agents are hypothesized to employ when making and receiving utterances.1"
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "DRT, with its detailed apparatus for the representation of context, offers the most obvious framework for investigating presupposition in depth (Kamp 1984, 1988, 1990, 1995, 2001a, 200 1b; Kamp and Reyle 1993; Kamp et al.",
        "2005).",
        "However, despite the suitability of DRT for pursuing a detailed account of presupposition, it is argued that in order to enrich our understanding of presupposition within the DRT framework, this framework itself needs to be modified (cf. Al-Raheb 2005).",
        "The approach presented in this paper understands presupposition within the parameters of dynamic semantics (van der Sandt 1992), part of which is DRT, but attempts to go beyond that in order to make the understanding of presupposition within DRT more pragmatic.",
        "The dynamic semantics view of presupposition is incomplete from a pragmatic standpoint because it neglects the connection between",
        "beliefs and presupposition, hence neglecting the connection between pragmatic presupposition and semantic presupposition in DRT.",
        "To account for pragmatic presupposition as well as making presupposition within DRT more pragmatic, presupposition is understood to be a property of the agent.",
        "In essence, the effect of presupposition is to give insights about the speaker’s beliefs as well as the speaker’s beliefs about the hearer’s beliefs.",
        "Speaker belief leads to presupposition, which indicates the beliefs of the speaker to the hearer.",
        "Presupposition is a reflection of the speaker’s state of mind.",
        "This is stronger than what is generally conceded in the literature.",
        "Geurts (1996, 1998, 1999) maintains that a presupposition should not necessarily reflect the beliefs of the speaker, but rather the speaker’s commitment to the truth of the presupposition.",
        "If, for example, we were to use Stalnaker’s (2002) example, (1) I have to pick my sister up from the airport.",
        "Geurts argues that the speaker does not have to believe she has a sister, but just needs to be ‘committed to’ the truth of the presupposition that she has a sister.",
        "In other words, the speaker need only commit to the presupposition (P) being true.",
        "The approach presented here takes a somewhat stronger position than Geurts’ position (Geurts 1999) because it assumes that Grice’s Cooperative Principle is in place (Grice 1975, 1989).",
        "If we make the simplifying assumption that the agents in the dialogue are being cooperative, are not lying, are being relevant, etc., we can take the stronger position that the information introduced by the presupposition, here ‘having a sister’, is indeed a belief held by the speaker.",
        "Viewing presupposition from the more pragmatic perspective of the agents’ point of view in dialogue leads us to viewing presupposition from both the speaker’s and the hearer’s points of view.",
        "Distinguishing speaker presupposition from hearer presupposition helps make the approach to presupposition within DRT more pragmatic, since we are speaking not of truth conditions but of states of mind in communicative interaction.",
        "Therefore, this paper deals with two types of agent presupposition, speaker presupposition and hearer presupposition (cf. section 3).",
        "This is different from semantic presupposition, i.e. sentence presupposition (cf. section 2).",
        "Agent presupposition differs from sentence presupposition in that the latter stems from sentence meaning, whereas the former attaches itself to the beliefs of the speaker and her intentions.",
        "It is argued here that the semantic and pragmatic notions of presupposition in DRT can be linked through linking agents’ beliefs to the utterance being communicated."
      ]
    },
    {
      "heading": "2 Semantic and Pragmatic Presupposition",
      "text": [
        "The literature has mostly considered the hearer’s side of receiving the presupposition when dealing with agent presupposition (pragmatics) as opposed to sentence presupposition (semantics).",
        "For instance, van der Sandt (1992) deals with accommodation from the hearer’s perspective, not distinguishing between speaker and hearer presupposition.",
        "However, the relationship between sentence presupposition and agent presupposition can be explained by dividing agent presupposition into speaker presupposition and hearer presupposition.",
        "From the speaker’s point of view, speakers make utterances to communicate new information.",
        "Generally speaking, to generate a communicatively meaningful utterance, there would be some discrepancy between the speaker’s beliefs and the speaker’s beliefs about the hearer’s beliefs.",
        "The discrepancy leads to an assertion, A, which may need presupposed arguments to be understood.",
        "First, the speaker decides on the assertion after checking belief discrepancies.",
        "Then, the speaker finds the right presuppositions to be able to communicate the assertion.",
        "Hearer presupposition differs in that utterances are split into presupposition and assertion, where possible, and presuppositions are first needed to establish links to objects in order for the new information to be understood by the hearer.",
        "For a hearer, assertions build on presupposition and the procedure is bottom-up (assertion is supported by presupposition).2 Therefore, in line with linking the speaker’s beliefs with the linguistic utterance and the linguistic utterance with the hearer’s beliefs, the speaker’s presupposition is conveyed through the speaker’s utterance (sentence presupposition), and the speaker’s utterance leads to the hearer’s presupposition.",
        "This interaction between the semantic and pragmatic notions of presupposition is a more balanced conception of presupposition (cf.",
        "Figure 1).",
        "With regard to the A part of an utterance received by the hearer, the hearer can first ‘accept’, or ‘weakly believe’, the new information and later on turn that weak belief into a belief, by adding it to her belief set (Al-Raheb 2005).",
        "However, it is worth mentioning that when making an utterance, both the speaker and the hearer focus their attention on A, which can get accepted by the hearer.",
        "In such a case, the hearer may later adopt A as a belief and indicate so to the speaker, making A a mutual belief, which may or may not serve as a presupposition afterwards in the dialogue.",
        "It is possible for P to be a mutual belief that both agents in the conversation mutually know they hold, or a",
        "new piece of information packaged as P. From this discussion, it can be seen that beliefs impose some constraints on making an utterance.",
        "The following section distinguishes between agent presupposition (speaker presupposition and hearer presupposition) and links agents presupposition to sentence presupposition."
      ]
    },
    {
      "heading": "3 Agent Presupposition",
      "text": [
        "Speaker presupposition differs from hearer presupposition in terms of three ‘information checks’ agents are hypothesized to perform when introducing or dealing with presupposition.",
        "The checks are (1) clarification check, (2) informativity check, and (3) consistency check.",
        "The checks are similar in principle to Purver (2004) and van der Sandt (1992).",
        "However, they are developed here as a process which distinguishes speaker generation from hearer recognition, allowing us to differentiate speaker presupposition from hearer presupposition, hence establishing the link between speaker presupposition and sentence presupposition, and between sentence presupposition and hearer presupposition.",
        "The three checks apply to both speaker and hearer.",
        "The clarification check may be used at the beginning of the process of checking.",
        "It corresponds to Grice’s maxim of manner on the part of the speaker (1989).",
        "Nonetheless, as there are different kinds of clarification requests (Purver et al.",
        "2003), clarification can also be initiated at various stages of the check process, indicating a different kind of clarification.",
        "The purpose of the informativity check is to check whether the presupposition is new or old information to the speaker and the hearer.",
        "This check is a modification of Grice’s (1989) quality maxim, which has been reworked to include two degrees of beliefs, acceptance and belief (Al-Raheb 2005).",
        "In addition, it checks whether the information is new or old to the other agent, based on the beliefs of one agent about the other.",
        "The process of checks for the speaker mirrors that of the hearer.",
        "However, as the process of recognition is different from the process of generation, the ‘information checks’ are described for the speaker and hearer individually.",
        "Similarly, the consistency check determines whether the presupposition is consistent with the agents’ beliefs – in accordance with Grice’s maxim of relevance (1989).",
        "For presupposition, as part of the consistency check, another check is performed, more specifically for the hearer’s benefit, which checks whether the presupposition is remarkable or unremarkable.",
        "Generally, information can be accommodated, so long as it is ‘unremarkable’ (Geurts 1999: 36).",
        "For example, (2) The car across the street from my house belongs to my neighbour.",
        "is less likely to cause problems than (3) The small jet across the street from my house belongs to my neighbour, when the hearer knows that the speaker lives in the city centre.",
        "The process of ‘information checks’ influences how speakers make their utterances and how hearers recognize those utterances.",
        "Section 3.1 follows the information check process for presuppositions for the speaker, whereas section 3.2 demonstrates that process for the hearer."
      ]
    },
    {
      "heading": "3.1 Speaker Presupposition",
      "text": [
        "Speaker presupposition differs from hearer presupposition in terms of checks.",
        "When a speaker generates a sentence presupposition (via the communicated utterance), we are assuming that the speaker is bound by Grice’s Cooperative Principle (1975, 1989).",
        "To utter a sentence triggering a presupposition, the speaker needs to have reason to believe that her presupposition is going to be ‘clear’ and ‘consistent’.",
        "The speaker may have previous context in memory that shows her presupposition to be consistent with her beliefs about the hearer’s beliefs.",
        "However, when such evidence is lacking, the speaker may still make presupposition–triggering utterances (sentence presupposition) and then make the judgement that the presupposition is consistent if there is no negative feedback; alternatively, the speaker might receive evidence that shows the presupposition to be contradictory with her beliefs about the hearer’s beliefs.",
        "The informativity check comes into play when the speaker elaborates on given or known information by packaging it as a presupposition and focusing attention on the assertion part of her utterance, i.e. on the new information.",
        "In this case, the",
        "speaker needs to have reason to believe that the hearer is already aware of this presupposed information, therefore, that it is known.",
        "For example,",
        "(4) My grandchild loves horses.",
        "To be consistent, the speaker checks her memory to see if the speaker has record that she, the speaker, has reason to believe that the hearer believes that the speaker has a grandchild.",
        "The speaker, being in a retirement home, discussing her grandchildren with the carer, and having had previous conversations with the same carer about her family, has reason to believe that the hearer already knows she has a grandchild.",
        "She, therefore, presupposes ‘I have a grandchild’.",
        "Another example of elaborating on given information is when the speaker believes the given information has been established, i.e. both the speaker and the hearer believe that the information is part of their mutual or common beliefs.",
        "This constitutes a case of strong speaker belief.",
        "Consider example (5): (5) Sylvia’s will means we have to move out.",
        "In this case, the speaker and the hearer have been talking about Sylvia’s will in their dialogue and both have reason to believe that Sylvia has a will and that they both know the other person has reason to believe Sylvia has a will.",
        "Generally, if the speaker assumes the information presented in the presupposition to be known to the hearer, the speaker would expect the hearer to accept the information provided by the sentence presupposition by default, or even believe it.",
        "This process is generally referred to as binding in dynamic semantics.4 Of course, the hearer may experience some difficulty in understanding and ask for a ‘clarification’, check 1.",
        "However, the information presented as a sentence presupposition may be new.",
        "The speaker may wish to introduce a topic into the dialogue, knowing that the hearer has no previous knowledge of the topic.",
        "The new information (speaker presupposition) is then checked by the speaker for consistency, where it may be remarkable or unremarkable.",
        "Here, we follow Geurts’s (1999) classification of remarkable and unremarkable presupposition.5 Thus, examples (6) and (7), given a certain situation and agents, are more unusual to accommodate without questioning than example (1), where many people may have sisters.",
        "(6) I have to pick my personal trainer up from the airport.",
        "(7) I have to get the keys for my private jet.",
        "Unremarkable information is information that people may accept without too much questioning,",
        "such as having a brother or a sister.",
        "An example of remarkable information might be: (8) My private jet arrives this afternoon.",
        "In social contexts in which it is not expected that everyone owns a private jet, such information will at least raise an eyebrow.",
        "Being cooperative, the speaker will assume, unless the hearer indicates otherwise, that the information she provides in the presupposition is unremarkable for the particular hearer in the particular context, and that the hearer will accommodate the information by either accepting it or believing it.",
        "Whether something is remarkable depends on the specific participant and type of communicative situation.",
        "For example, two film stars talking together would presumably not find example (8) ‘remarkable’, nor might a journalist interviewing a celebrity.",
        "The speaker has to be prepared for cases when, despite being cooperative, the hearer might perceive sentence presupposition as unclear and/or contradictory.",
        "What this means for the present treatment of presupposition is that generally the speaker believes that the new information presented in the presupposition is unremarkable; therefore, the speaker will expect the hearer to accommodate the new information.",
        "However, in case the hearer should find the new information unusual or remarkable, the speaker will, we assume, expect the hearer to check whether the presupposition is consistent with her beliefs or not.",
        "The speaker may also expect the hearer to ask for clarification if the sentence presupposition is not clear.",
        "If clear, the speaker may expect the hearer to accommodate the sentence presupposition and may safely assume that the information has been accepted, unless it is indicated through ‘strong positive feedback’ that the information is actually strongly believed (Al-Raheb 2005).",
        "However, if the presupposition is not clear, the speaker may expect the hearer to ask for clarification and a clarification process takes place, in which the hearer might ask for more clarification if the information is still not clear.",
        "When the information is finally clear, the hearer may provide feedback.",
        "Despite the speaker’s best efforts to be cooperative, there are cases where the presupposition contradicts the hearer’s previous beliefs.",
        "Speakers usually do not expect this to happen, but are generally prepared to produce a clarification or attempt to fix the dialogue when such a problem occurs.",
        "Figure 2 is a flowchart displaying the speaker’s expectations in terms of presupposition according to her beliefs and on the assumption that she is being cooperative.",
        "According to this treatment of presupposition, whether the speaker believes the information in a presupposition is new or old, the result is the same in terms of how the speaker expects the hearer to act.",
        "The only difference is that new information gets accommodated by the hearer, while known information is ‘bound’ and either already accepted or believed (Asher and Lascarides 1998; van der Sandt and Geurts 1991).6 It has to be said that this is of course an ideal situation.",
        "The speaker does not always have beliefs concerning whether the hearer already believes the presupposed information or not.",
        "To sum up, when initiating the topic of a presupposition, we can conclude the following: bel(S, P), bel(S, clear(P)), bel(S, consistent(P)), and bel(S, accept(H,P)).7 The speaker may have either the belief bel(S,-, bel(H,P)) or the belief bel(S,bel(H,P)).",
        "However, in our implementation of the pragmatic and semantic notions of presupposition in DRT, the only beliefs represented after S’s utterance are: bel(S, P), or accept(S,P) and if",
        "sufficient previous information is available, either bel(S,-, bel(H,P)) or bel(S,bel(H,P))."
      ]
    },
    {
      "heading": "3.2 Hearer Presupposition",
      "text": [
        "As a result of the speaker’s initiating the topic of P indicated through sentence presupposition, the hearer acquires the belief that the speaker believes the presupposition.",
        "The first information check to apply to hearer presupposition is the clear/ not clear check.",
        "That is to say, upon hearing P, the hearer first checks whether the presupposition is clear (e.g. hearer has no problems with perception).",
        "As mentioned previously, there are other types of clarification requested when inconsistency arises.",
        "However, what we are concerned with here is whether the hearer has been able to receive the message or not.",
        "Other clarification checks may take place after the hearer performs the new/old (informativity) check and the consistency check.",
        "If the presupposition is not clear in the above sense, the hearer may ask the speaker to clarify her statement.",
        "As a simple example, consider an imaginary dialogue between a customer and customer service assistant about a gas heater:",
        "(9) Customer: How long does it take to fix my gas heater?",
        "Customer Service Assistant: Your what?",
        "Customer: My gas heater needs fixing.",
        "After checking whether the information, sentence presupposition, is clear, the customer service assistant asks the customer to clarify.",
        "In this particular case, the lack of clarity may be attributed to, e.g. not hearing very well.",
        "The hearer expects the speaker to provide an explanation or clarification.",
        "The speaker is then obliged to provide a further explanation.",
        "If the information is still not clear, the hearer may ask for more clarification and the hearer needs to provide an explanation.",
        "Figure 3 incorporates this potentially iterative loop.",
        "This is consistent with conversation analysis research, which assumes that information may be cleared up after an explanation is provided, but also allows for further clarification if needed (Schegloff et al.",
        "1977).",
        "If the sentence presupposition is cleared up, then the hearer may provide feedback that the information is clear.",
        "However, lack of feedback is also considered a case of ‘weak positive feedback’ (Al-Raheb 2005).",
        "Generally, after providing an explanation, the speaker’s assumptions are likely to be that the hearer now has no problems with the sentence presupposition.",
        "Having made sure that the sentence presupposition is clear, the hearer may now move on to perform the informativity check, check 2.",
        "If the information the speaker presents as a sentence presupposition is known to the hearer, in the sense of being in his acceptance space, i.e. already a hearer presupposition, the hearer may strengthen that acceptance by now believing the presupposition (cf. Al-Raheb 2005).",
        "The hearer may previously hold a strong belief about the presupposition, i.e. the hearer may already believe P. In this case, it is not necessary to add a new belief that P to hearer presupposition.",
        "We are assuming here that the hearer’s knowledge of a sentence presupposition means that this presupposition does not contradict previous beliefs held by the hearer.",
        "Figure 4 shows the hearer’s options if the sentence presupposition is already a hearer presupposition, or known to him.",
        "The speaker ideally expects the hearer will accept P (i.e. P will have become hearer presupposition), unless negative feedback is provided by the hearer.",
        "If strong positive feedback is provided by the hearer, the speaker may thereby form the meta-belief that bel(H,bel(S,bel(H,P))).",
        "If the sentence presupposition provides new information, the hearer then performs the consis",
        "tency check.",
        "If the information provided contradicts previous beliefs, the hearer may reject the sentence presupposition and an attempt would be made to remedy or fix the dialogue.",
        "For example, consider:",
        "(10) Speaker: Julia’s husband is coming for dinner.",
        "Hearer: This can’t be!",
        "Julia is widowed!",
        "When the information presented by the sentence presupposition is consistent with the hearer’s belief space or acceptance space, the hearer makes a judgement about whether the information is remarkable (odd or unusual) or unremarkable (cf. Geurts 1999).",
        "If the information is unremarkable, the hearer accommodates the new information by either accepting it or believing it.",
        "In other words, it becomes hearer presupposition.",
        "Figure 5 shows presupposition processing from the hearer’s perspective when the sentence presupposition contains information new to the hearer.",
        "If the presupposition is remarkable, the hearer may check for clarity.",
        "This is a different type of clarity check from the one performed initially.",
        "Clarification checks can arise from different reasons and not just because of difficulty in hearing.",
        "This time the hearer requires an explanation for the oddness of the information used as a presupposition.",
        "This is when the clarification process starts again.",
        "For example,",
        "(11) Speaker: My pet lion requires a lot of",
        "attention.",
        "Hearer: Your pet what?",
        "Speaker: Oh sorry, I mean one of those virtual pets you take care of.",
        "Here, we may assume, the hearer has not found the appropriate discourse referent for ‘pet lion’ and thus goes through ‘remarkable’ check after the consistency check.8 Again, the hearer may provide feedback concerning whether the explanation has been accepted or not.",
        "Unless negative feedback is provided, the hearer is expected to at least accept the presupposition bel(S,accept(H,P)).",
        "In addition, the other agent (speaker) may assume that the hearer now has no problem with the presupposition, bel(S,clear(H,P)).",
        "If the hearer is not convinced by the speaker’s explanation, an attempt at repairing the dialogue is needed.9 To sum up, at the stage of the hearer’s receiving the speaker’s utterance, the hearer may make the judgement that the speaker believes the presupposition (speaker presupposition).",
        "In addition, unless the hearer gives the speaker reason to think that the hearer disagrees with the presupposition, the speaker assumes that the hearer has no problem understanding the sentence presupposition, and further, that the hearer has now come to accept the presupposition (hearer presupposition).",
        "It must be pointed out that generally speaking, unless the speaker has introduced as her presupposition a topic perceived to be new and very unusual, the hearer does not need to go through the clarification process for each presupposition, since generally the presuppositions are not the focus of the speaker’s utterance (Levinson 1983).",
        "This paper has enhanced the pragmatic conception of presupposition in DRT by considering presupposition from both the speaker’s and the hearer’s point of view.",
        "It has also linked semantic presupposition with pragmatic presupposition through linking the speaker’s presupposition with the presupposition communicated by her utterance (sentence presupposition) on the one hand, and sentence presupposition with hearer presupposition on the other hand.",
        "This it was argued is helped by the information checks which both the speaker and the hearer perform."
      ]
    }
  ]
}
