{
  "info": {
    "authors": [
      "Rebecca J. Passonneau"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P89-1007",
    "title": "Getting at Discourse Referents",
    "url": "https://aclweb.org/anthology/P89-1007",
    "year": 1989
  },
  "references": [
    "acl-J86-3001",
    "acl-P83-1007",
    "acl-P86-1031",
    "acl-P88-1014"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "I examine how discourse anaphoric uses of the definite pronoun it contrast with similar uses of the demonstrative pronoun that.",
        "Their distinct contexts of use are characterized in terms of two contextual features – persistence of grammatical subject and persistence of grammatical form – which together demonstrate very clearly the interrelation among lexical choice, grammatical choices and the dimension of time in signalling the dynamic attentional state of a discourse."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Languages vary in the number and kinds of grammatical distinctions encoded in their nominal and pronominal systems.",
        "Language specific means for explicitly mentioning and re-mentioning discourse entities constrain what Grosz and Sidner refer to as the linguistic structure of discourse [2].",
        "This in turn constrains the ways in which discourse participants can exploit linguistic structure for indicating or inferring attentional state.",
        "Attentional state, Grosz and Sidner's term for the dynamic representation of the participants' focus of attention [2], represents – among other things– which discourse entities are currently most salient.",
        "One function of attentional state is to help resolve pronominal references.",
        "English has a relatively impoverished set of definite pronouns in which gender is relevant only in the 3rd person singular, and where number – a fairly universal nominal category – is not relevant in the 2nd person.",
        "Yet even within the English pronominal system, there is a semantic contrast that provides language users with alternative means for accessing the same previously mentioned entities, therefore providing investigators of language with an opportunity to explore how distinct lexicogrammatical features correlate with distinct attentional processes.",
        "This is the contrast between demonstrative and non-demonstrative pronouns.",
        "In this paper I examine how certain uses of the singular definite pronoun it contrast with similar uses of the singular demonstrative pronoun that.",
        "I present evidence that the two pronouns it and that have pragmatically distinct contexts of use that can be characterized in terms of a remarkably simple set of preconditions.",
        "First, in §2 I delineate the precise nature of the comparison made here.",
        "In §3.1, I describe the methods I used to collect and analyze a set of data drawn from ordinary conversational interactions.",
        "The result of my statistical analysis was a single, highly significant multidimensional distributional model, showing lexical choice to be predicted by two features of the local context.",
        "In §3.2, I summarize the statistical results.",
        "They were strikingly clearcut, and provide confirmation that grammatical choices made by participants in a dialogue prior to a particular point in time correlate with lexical choice of either participant at that time.",
        "Of over a dozen different variables that were examined, two alone turned out to have enormous predictive power in distinguishing between the typical contexts for the two pronouns.",
        "Very briefly, the first variable, persistence of grammatical subject, indicates whether both the antecedent and pronoun were subjects of their respective clauses.",
        "The second, persistence of grammatical form, indicates whether the antecedent was a single word phrase or a multi-word phrase, and if the latter, whether the phrase was syntactically more clause-like or more noun-like.",
        "Both variables point up the significance of the temporal dimension of discourse in two ways.",
        "The first has to do with the evanescence of surface syntactic form – the two features pertaining to the grammatical means used to refer to entities are relevant only for a short time, namely across two co-references [17].",
        "The second has to do with the dual nature of referring expressions – as noted by Isard they are constrained by the prior context but immediately alter the context and become part of it [3] [18].",
        "In §4 I discuss how the contrast between the definite and demonstrative pronouns is constrained by the local discourse context, and",
        "how the constraining features of the local context • it, but not that, can be used non-referentially in combination with the lexical contrast provides (itl*that is raining; itl*that is hard to find an evidence about modelling the attentional state of honest politician) discourse.",
        "2 Comparability of it and that Previous work has related the discourse deictic uses of that to the global segmental structure of discourse, and tied the contrast between it and that to the distinction between units of information introduced at the level of discourse segments versus units of information introduced at the level of the constituent structure of sentences [8] [12] [18].",
        "This paper deals only with the latter category.",
        "That is, I am concerned with entities that are evoked into the discourse model by explicit mentions, i.e., noun phrases [19] or other intro.-sentential constituents, and with the difference between accessing these referents via the definite versus the demonstrative pronoun.",
        "Thus the data reported on here are restricted to cases where one of these pronouns has occurred with an explicit linguistic antecedent that is a syntactic argument.' A pronoun's antecedent was taken to be a prior linguistic expression evoking (or re-evoking) a discourse entity that provided a pronoun's referent.",
        "The two expressions were not constrained to be strictly coreferential since a wide variety of semantic relationships may hold between cospecifying expressions [1] [16] [19].",
        "Syntactically it and that have very similar – though not identical – privileges of occurrence.",
        "The following bullets briefly summarize their syntactic differences.",
        "• that, but not it, is categorially ambiguous, occurring either as a determiner or as an independent pronoun • it, but not that, has a reflexive and a possessive form (itselfl*thatself, itsl*thats) • it, but not that, may occur in prepositional",
        "phrases where the pronoun in the PP corefers"
      ]
    },
    {
      "heading": "with a c-commanding NP (the table with a",
      "text": [
        "drawer in ii/that) Pronouns whose antecedents were independent tensed clauses or clausal conjuncts were excluded from consideration here; I reported on a much larger class of contexts in [12] [13] (14].",
        "These differences, though they may ultimately pertain to the phenomena presented here, won't be discussed further.",
        "In general, that can occur with the same syntactic types of antecedents with which it occurs.",
        "Thus, apart from prosodic differences – which were not considered here – the two pronouns are extremely comparable semantically as well as syntactically.",
        "Both pronouns are 3rd person, non-animate, and singular.",
        "They are thus primarily distinguished by the semantic feature of demon-strativity.",
        "An unforeseen but interesting fact is that the proximal demonstrative this occurred very rarely.",
        "So the relevant semantic contrast was that between definiteness and demonstrativity, and did not include the proximal/non-proximal contrast associated with this versus that.",
        "While I had originally planned to investigate the contrast between the two demonstrative pronominals as well, there were only 8 tokens of this out of .--.700 pronouns whose antecedents were sentence internal arguments.",
        "This strongly suggests that however the attentional space of discourse entities is structured, it is not as differentiated as in the spatio-temporal domain, where the contrast between this and that is apparently more relevant.",
        "With respect to the contexts examined here, the proximal/nonproximal contrast between this and that is irrelevant.",
        "A stretch of discourse evokes a set of discourse entities, some of which can be accessed pronomi-nally.",
        "Of these, some can be accessed by it, and some can be accessed by that.",
        "The data I present suggest that the availability of focussed entities for definite and demonstrative pronominal reference differs, and that the consequences on the subsequent attentional state also differs.",
        "The conditions on and consequences of speaker choice of it or that must be pragmatic, and further, it is likely that the choice pertains to attentional state, since both pronominalization and demonstrativity play such a large role in indicating the attentional status of their referents (cf. [8], [15], [18]).",
        "The following excerpts from my conversational data illustrate the syntactic variety of the pro-nouns' antecedents, and give a sense as well that substituting one pronoun for another sometimes results in an equally natural sounding discourse, with the difference being a very subtle one, as",
        "in 2.3 Occasionally, the substitution creates discourse that is pragmatically odd, as in 6.",
        "1.",
        "A: so [you plan to] work for a while, save some money, travel – B: save SOME MONEY and then blow IT (/THAT) off and then go to school 2. what does NOTORIETY mean to you, where does THAT (/IT) put you 3.",
        "I didn't really want TO (PAUSE) TEACH PEOPLE, THAT (/IT) wasn't the main focus 4. so in some ways, I'd like TO BE MY OWN BOSS, so THAT (/iT)'s something that in some way appeals to me very much 5. the drawback is THAT I'M ON CALL 24 HOURS A DAY but IT (/THAT) also means I get different periods of time off 6.",
        "I don't think EACH SITUATION IS INHERENTLY"
      ]
    },
    {
      "heading": "DIFFERENT FROM THE OTHER, at least, THAT",
      "text": [
        "(/TT)'s not the way I look at it In this paper, I focus on the linguistic features of the local context, i.e., the context containing a pronoun token and its antecedent, in order to investigate the relationship between the pronominal features of demonstrativity and definiteness and the local attentional state of a discourse."
      ]
    },
    {
      "heading": "3 Statistical Analysis of the Conversational Data",
      "text": []
    },
    {
      "heading": "3.1 Method Psychologists and sociologists studying face-to",
      "text": [
        "face interaction have argued that the baseline of interactive behavior is dyadic rather than monadic [4] [9]; similarly, in understanding how speakers cooperatively construct a discourse, the baseline behavior must be dialogic rather than mono-logic.",
        "The analytic methods employed here were adapted from those used in studying social interaction among individuals.",
        "I analyzed the local context of lexical choice between it and that in four career-counseling interviews.",
        "The interviews 3 The relevant pronoun tokens and their antecedents appear in CAPS, and the substituted pronoun appears in parentheses to the right of the original.",
        "A: and B: are used to distinguish two speakers, where relevant.",
        "Text enclosed in brackets was added by the author to clarify the context.",
        "took place in a college career-counseling office, and were not staged.",
        "The final corpus consisted of over 3 1/2 hours of videotaped conversation between counselors and students.",
        "This provided an excellent source of data, with the speakers contributing tokens of it/that at the rate of roughly 1 in every 2 sentences, or a total of 1,183 tokens in all.",
        "Nearly all of these were indexed and coded for 16 contextual variables characterizing the linguistic structure of the local context.' These variables fell into two classes: those pertaining to the LINEAR ORGANIZATION OF DISCOURSE, or to the respective locations of the antecedent and pronoun,' and those pertaining to the SYNTACTIC FORM of the antecedent expression.",
        "Statistical analysis was used as a discovery procedure for finding the strongest determinants of lexical choice, rather than to test a particular hypothesis.",
        "The goal was to find the best fit between the contextual variables and lexical choice, i.e., to include in a final statistical model only those variables which were highly predictive.",
        "I used log-linear statistical methods to construct a single best multidimensional model; log-linear analysis permits the use of the x-square statistic for greater than 2-dimensional tables.",
        "This is advantageous, because multidimensionality imposes more constraints on the statistical model, and is thus even more reliable than 2-dimensional tables in revealing non-chance correlations.",
        "In addition to multidimensionality, three other criteria guided the selection of the best fit: a statistically significant probability for the table, meaning a probability of 5.0% or lower; statistical independence of the predictive variables from one another, i.e., that they represented truly distinct phenomena, rather than overlapping factors; and finally, that the distributional patterns were the same for each individual speaker and for each separate conversation, in order to justify pooling the data into a single set.",
        "The antecedents of some of the pronouns occurred in the interlocutor's speech, but change of 4Certain repetitions, e.g., false starts, were excluded from consideration; cf. chapter 2 of (131 5 Location was construed very abstractly, and included, e.g., measures of whether the antecedent and pronoun were in the same, adjacent, or more distant sentences; how deeply embedded syntactically the antecedent and pronoun were; how many referential expressions with the same or conflicting semantic features of person, number and gender intervened between the pronoun and its antecedent; and their respective grammatical roles (131.",
        "6 The reliability of the data was tested by comparing within and across-subjects statistical measures; i.e., I took into account the data for the conversations as a whole, each individual conversation, and each individual speaker [131.",
        "speaker within the local context had no effect on lexical choice, either alone, or in concert with other factors.",
        "Before pooling the data from all conversations and all individual speakers into a single population, the variability across conversations and speakers was tested and found to be insignificant.",
        "Thus the results presented below represent a speaker behavior-lexical choice of pronoun-that is extraordinarily consistent across speakers, that is independent of whether a pronoun and its antecedent occurred in the same speaker's turn, independent of individual speaker and even of individual conversation.",
        "Consequently, it is justifiable to assume that the factors found to predict lexical choice pertain to communicatively relevant purposes.",
        "In other words, whatever these factors are, they presumably pertain not only to models of speech production, but also to models of speech comprehension."
      ]
    },
    {
      "heading": "3.2 Results",
      "text": [
        "Table 1 gives the distribution of pronouns across the relevant contexts and gives the probabilities and k-squares for the two contextual variables and their intercept, i.e., the interaction between them.",
        "The very low probability of 0.04% for ?Note that the 4th category of Antecedent-Other-includes a mixture of atypical arguments, primarily adverbial in nature, like the adverbial argument of go in go far.",
        "the intercept indicates that the two variables are clearly independent, or in other words, represent two distinct contexts.",
        "The exceedingly low probabilities of 0.01% for the contextual variables and the highly significant table k-square (i.e., close to 1) indicate that the model is extremely significant.",
        "The correlation between the dependent dimension of lexical choice and the two independent dimensions, persistence of grammatical subject and persistence of grammatical form, presents an intuitively very satisfying view-yet not an obvious one a priori-of how all three variables conspire together to convey the current attentional status of a discourse referent.",
        "First I will summarize the effects of the two contextual variables one at a time.",
        "Then I will review the distributionally significant facts as a whole.",
        "to occur in exactly one of the two contexts, and that was likely to occur in the opposing context.",
        "If both referring expressions were subjects, then the lexical choice was far more likely to be it than that.",
        "All it took for the balance to swing in favor of the demonstrative was for either the pronoun itself or for its antecedent to be a non-subject.",
        "The two relevant contexts, then are:",
        "• those in which both the antecedent and the target pronoun are syntactic subjects; IT • all other contexts.",
        "THAT",
        "Parallelism has sometimes been suggested as an organizing factor across clauses.",
        "It is certainly a strong stylistic device, but did not make a strong enough independent contribution to the statistical model to be included as a distinct variable.",
        "To repeat, the crucial factor was found to be that both expressions were subjects, not that both had the same grammatical function in their respective clauses.",
        "In §4.1 I will review the relationship of these results to the centering literature [1] [5] [6]."
      ]
    },
    {
      "heading": "Second Dimension: Persistence of Gram",
      "text": [
        "matical Form.",
        "While many grammatical distinctions among sentence constituents are possible, the syntactic form of a pronoun's antecedent correlated with the choice between it and that in the following very specific way.",
        "The 3 discriminating contexts were where the antecedent was:",
        "• any pronoun – the lexical choice for an antecedent pronoun had no effect on the lexical choice of the subsequent pronoun; IT • a canonical NP headed by a noun (including nominalizations); IT or THAT • and all other types of constituents.",
        "THAT",
        "The latter category included gerundives, infinitival expressions, and embedded finite clauses.9 For contexts with a pronominal antecedent, the lexical choice was far more likely to be it.",
        "For canonical NP antecedents, it and that were equally likely, regardless of the type of head.",
        "For other types of constituents, that was far more likely.",
        "Thus there are two opposing contexts and one which doesn't discriminate between the two pronouns, i.e., a context in which the opposition is neutralized.",
        "g Cf. [141 for a detailed discussion of how the precise dividing line between types of antecedents was determined.",
        "The dynamic component of this dimension is that it indicates, for a consecutive pair of co-specifying expressions, whether there has been a shift towards a surface form that is syntactically more compact and semantically less explicit, and if so, how great a shift.",
        "In the first context, where the antecedent is already pronominal, there is no shift, and it has a much higher probability of occurrence than that.",
        "The context in which there is a shift from a lexical NP to a phrasal NP, i.e., a shift from a reduced form to an unreduced one, but no categorial shift, doesn't discriminate between the two pronouns.",
        "The context favoring that is the one in which there is not only a shift from a single word to a multi-word phrase, but also a change in the categorial status of the phrase from a non-NP constituent to a lexical NP.",
        "Full 3-way model.",
        "Table 2 displays the data in a finer-grained two-dimensional x-square table in order to show separately all 4 of the possible outcomes, i.e., it or that as a subject or non-subject.",
        "In this table, the row headings represent the antecedent's form and grammatical role; the column headings represent the lexical choice and grammatical role of the subsequent pronominal expression.",
        "Each cell of the table indicates the absolute frequency, the expected frequency given a non-chance distribution, and the cell x-square, with the latter in boldface type to indicate the significant cells.",
        "This is a somewhat more perspicuous view of the data because it can be displayed schematically in terms of initial states, final states, and enhanced, suppressed or neutral transitions, as in Fig. 1.",
        "However, it is also a somewhat misleading transformation of the 3-dimensional view given in table 1, because it suggests that the grammatical role of a pronoun and that of its antecedent are independent factors.",
        "Since the statistical model shown in table 1 is actually the best fit of the data, better than other models that were tested in which the grammatical role of each expression was treated separately [13], it is crucial to recognize that the statistically significant factor is the pairwise comparison of subject status.",
        "Large cell x-squares in Table 2 indicate the significant contexts, and a comparison of the absolute and expected frequencies in these cells indicate whether the context is significantly frequent or significantly infrequent.",
        "Thus there are 3 types of cells in the table representing the contexts of lexical choice as chance events, as enhanced events, or as suppressed events.",
        "In Fig. 1, I have translated",
        "the table into a set of 3 types of state transitions.",
        "Initial states are in the left column and final states in the right one.",
        "The 3 types of transition are one which is unaffected by the contrast between it and that (no symbol), one which is enhanced (I-), and one which is suppressed (-I).",
        "The initial states in boldface indicate for each antecedent type which of the two grammatical role states was more likely, subject or non-subject.",
        "Absence of final states for the nonNP-Subj initial state indicates that this set of contexts is extremely rare.",
        "In the following section, I discuss the relation of these events to an abstract model of attentional state."
      ]
    },
    {
      "heading": "4 Discussion",
      "text": [
        "The outcome of this study is not a model of attentional processes per se, but rather, a set of factors pertaining to attentional structure that elucidates the shifting functions of the demonstrative pronoun in English discourse.",
        "The particular function served by that seems to depend on what functional contrasts are available given the current attentional state.",
        "It is most useful to think of the data in terms of two major categories of phenomena.",
        "The first category is where a discourse entity has already been mentioned pronominally.",
        "In this case, maintenance of reference in subject grammatical role is a particularly signficant determinant of the choice between it and that.",
        "This effect is discussed in §4.1 in relation to the notion of centering.",
        "The second category is where a discourse entity most recently evoked by a multi-word phrase is subsequently referenced by a pronoun.",
        "While grammatical role is relevant here, its relevance seems to depend on a more salient distinction pertaining to the syntactico-semantic type of the discourse entity, as discussed in §4.2."
      ]
    },
    {
      "heading": "4.1 Definite/Demonstrative Pronouns and Centering",
      "text": [
        "The literature on attentional state has shown that both pronominalization and grammatical role affect the attentional status of a discourse entity.",
        "In this section I will show how the use of the definite pronoun it conforms in particular to the predictions made by Kameyama [6] [5] regarding canonical and non-canonical center-retention, and that the demonstrative pronoun is incompatible with center-retention.",
        "The centering model predicts that an utterance will contain a referent that is distinguished as the backward looking center (Cb) [1], and that if the Cb of an utterance is coreferential with the Cb of the prior utterance, it will be pronominalized [1].",
        "Kameyama [6] proposes that there are two means for retaining a discourse entity as the Cb, canonical center-retention--both references in subject role – and non-canonical center retention – neither reference in subject role.",
        "As shown in Fig. 1, the most enhanced context for lexical choice of it (context 1) was where both the pronoun and its pronominal antecedent were subjects, i.e., canonical center-retention.",
        "The next most enhanced context for it (context 7) was where neither the pronoun nor its pronominal antecedent were subjects, i.e., non-canonical center-retention.",
        "Thus, the definite pronoun correlates with both canonical and non-canonical center retention.",
        "Lexical choice of it is actively suppressed in contexts which are incompatible with center-retention.",
        "Note in Fig. 1 that if the antecedent is neither a pronoun nor a subject, a subsequent reference via it in subject role is suppressed (contexts 13 and 21).",
        "The only (non-rare) context where an it subject is neither enhanced nor suppressed is",
        "where the antecedent is a canonical NP in subject role (context 9) (cf. §4.2).",
        "The demonstrative pronoun is actively suppressed in the case of canonical center-retention (context 2); i.e, given two successive pronominal references to the same entity where reference is maintained in subject role, the referent's attentional state is such that it precludes demonstrative reference.",
        "Use of that is also suppressed if the antecedent is a potential candidate for canonical center retention, even if reference is not maintained in subject role (context 4).",
        "Attentional state is only one component of a discourse structure.",
        "The discourse model as a whole will contain representations of many of the things to whcih the discourse participants can subsequently refer, including discourse entities evoked by NPs, and additionally, as argued by Webber [18], discourse segments.",
        "Webber notes that discourse segment referents may have a different status from the discourse entities evoked by NPs, at least until they have been pronominally referenced.",
        "However, she suggests that when a demonstrative pronoun refers to a discourse entity, it accesses that entity by a process which first involves accessing the discourse segment in which the discourse entity is introduced.",
        "In other words, she posits two distinct referential processes, deictic and anaphoric reference, and suggests that even when a demonstrative pronoun refers to a discourse entity, the process of finding the referent is distinct in kind from anaphoric reference to the same entity.",
        "While I have no evidence that bears directly on such a claim, my data do indicate that some entities in a discourse segment are ordinarily unavailable via the demonstrative pronoun, namely entities that would be expected canonical centers, as described in the preceding paragraph.",
        "Thus my data support the view that there are distinct processes for accessing entities in the model.",
        "It is relevant to note here that the notion of Cb is generally discussed in terms of links between successive utterances.",
        "Since there is an extraordinary frequency of conjoined sentences in conversational language, I distinguished between utterances and independent clauses within an utterance.",
        "The successive references in my data were in successive sentences a majority of the time (roughly 2/3; cf. [13]), but were sometimes separated by one or more sentences (roughly 1/6) and sometimes occurred in the same sentence (roughly 1/6).",
        "This distance factor had no correlation with lexical choice of pronoun, which suggests that discourse segment structure interacts with centering.",
        "The relevant local context for center-retention may not be successive sentences/utterances, but rather, successive sentences/utterances within the same discourse segment.",
        "In any case, for the data presented here, the relevant local context consisted of two successive co-specifying phrases, not two successive utterances.",
        "Since the primary objective of this study was to examine various features of the context immediately preceding a given type of pronoun, rather than to track the discourse history of particular entities, little can be said here about the general case of multiple successive references to the same entity.",
        "However, I did investigate a subset of this general case, namely, successive pronominal references to the same entity where the initial mention was a canonical NP, and where each next co-specifying pronoun served as the antecedent for a subsequent pronoun.",
        "I refer to these as pronoun chains.10 The relative likelihood of it and that was the same for the first slot in the chain, which conforms to the general distribution for pronouns with NP antecedents.",
        "The ratio of it to that in the last position of a chain conforms to chance, i.e., it equals the ratio of it to that in the pronoun chain sample.",
        "But within a chain, that is strongly predicted by persistence of grammatical form.",
        "The demonstrative occured rarely within chains, but where it did occur, either the demonstrative token or its antecedent was a non-subject.",
        "This was found to be the only factor pertaining to linguistic structure that affected the occurrence of that within a pronoun chain.",
        "A final set of conclusions derived from the pronominal initial states in Fig. 1 pertains to the non-predictive contexts, i.e., those which neither enhance nor suppress center-retention, and those which neither enhance nor suppress demonstrative reference.",
        "These are cases where there is either a shift in grammatical role, or where the lexical choice is that (contexts 3, 5, 6 and 8).",
        "When a center is not retained across two successive utterances (in the same discourse segement), then it is likely that the global context is affected [1], perhaps by a center-shift (cf. [5]), or by a segment boundary (cf. [7], 1111).",
        "Centers seem generally to be unavailable for demonstrative reference, but contexts 6 and 8 1°The term seems to have appeared in the philosophical and linguistic literature at about the same time, e.g., in works by K. Donnellan, C. Chastain, M. Halliday and D. Zubin.",
        "There were a total of 101 such chains comprising 305 total pronoun tokens; they ranged in length from 2 to 13 pronouns.",
        "in Fig. 1 perhaps represent a mechanism whereby an entity maintained as center can become available for demonstrative reference; e.g., context 6 may coincide with the chaining context discussed in the preceding paragraph, whereby a locally focussed entity can be accessed by that just in case the prior reference was a non-subject.",
        "Context 8 suggests that demonstrative reference is more available in contexts of non-canonical center retention than canonical center retention."
      ]
    },
    {
      "heading": "4.2 Non-Centered Discourse Entities",
      "text": [
        "I have argued elsewhere that the crucial distinction for the category of non-pronominal antecedents is the contrast between true NPS with NP syntax, versus all other types of syntactic arguments ([12] [14]).",
        "This raises two important issues pertaining to the status of the discourse entities evoked by NPs versus other kinds of arguments.",
        "The first is that if non-NP arguments evoke discourse entities, which they certainly must, such entities apparently have a different status in the model than discourse entities evoked by NPs, given that the combination of lexical choice between it and that and grammatical function so clearly distinguish them.",
        "The second issue is that although the difference in status seems – at first blush – to correlate with a syntactic property, the distinction may ultimately be semantic in nature.",
        "I will discuss each issue in turn.",
        "Two of the non-pronominal initial states in Fig. 1 are distinguished by neither enhancing nor suppressing any of the possible transitions to it or that: NP subjects (9-12), and non-NP non-subjects (17-20).",
        "The extreme rarity of the latter suggests that non-NPs don't occur as grammatical subjects, or that when they do, they are not likely to be re-evoked by a pronoun.",
        "On the other hand, NP subjects are fairly frequent in the contexts where it or that occurs with a non-pronominal antecedent, thus the absence here of enhanced or suppressed transitions suggests that an entity mentioned as an NP subject is free to be accessed in a variety of ways, or more precisely, that it has a relatively unspecified attentional state.",
        "It is neither a particularly likely Cb nor is it particularly available or unavailable for demonstrative reference.",
        "The two remaining non-subject initial states, i.e., NP non-subjects and non-NP non-subjects, both suppress subsequent reference via it subjects, as mentioned in the previous section.",
        "While NP subjects apparently have a somewhat unspecified attentional status, NP non-subjects enhance the lexical choice of non-subject that.",
        "It appears that discourse entities evoked by NPs which are not subjects are in an attentional state that is quite different from that of canonical center retention.",
        "It is especially interesting that when the antecedent is a non-NP non-subject, a subsequent pronominal reference is most likely to be demonstrative, and most likely to be a subject.\"",
        "The enhancement of a that-subject context is completely contrary to the pattern established for subjects and for the demonstrative pronoun.",
        "These facts contribute to the view that entities evoked by nonNP constituents have a special status, but what this status is remains to be determined.",
        "In previous work, I emphasized the syntactic distinction with respect to lexical choice between it and that [14].",
        "Although the most obvious difference is the purely syntactic one, the syntactic distinction between NP and non-NP constituents has a number of semantico-pragmatic consequences.",
        "In discussing the nominal and temporal anaphora within Kamp's framework of discourse representation structures (DRS), Partee raised the question of the difference in status between event-describing clauses and nominalizations [10].",
        "Independent clauses differ from the class of nonNP constituents under consideration here in that the latter occur as arguments of superordinate verbs, and are thus entities participating in a described situation, as well as descriptions of situations.",
        "However, true noun phrases – whether they describe events or not – can have definite or indefinite determiners, and cannot have tense or any aspectual categories associated with the verb.",
        "The study presented here brings us no closer to a solution to the questions posed by Partee regarding the ontology and representation of different kinds of event descriptions, but it does offer further confirmation that entities evoked by NP and non-NP constituents have a different conceptual status, given the different possibilities for lexical choice and grammatical role of a subsequent pronominal mention."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "The following bullets encapsulate the observations made in §4:",
        "• Lexical choice of it indicates canonical or non-canonical center retention • Lexical choice of it in subject role conflicts with non-subject antecedents, but is compatible with an NP-subject antecedent • Lexical choice of that blocks canonical center retention • Lexical choice of that may be more compatible with non-canonical center retention • Lexical choice of that in subject role is most likely when the antecedent is a non-NP constituent • Lexical choice of that is enhanced when the antecedent is a non-NP constituent • Lexical choice of that is enhanced when the antecedent NP is a non-subject • NP subjects have a relatively unspecified attentional status"
      ]
    },
    {
      "heading": "ACKNOWLEDGEMENTS",
      "text": []
    }
  ]
}
