{
  "info": {
    "authors": [
      "Jean-Pierre Chanod",
      "Marc El-Bèze",
      "Sylvie Guillemin-Lanne"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-3143",
    "title": "Coupling an Automatic Dictation System With a Grammar Checker",
    "url": "https://aclweb.org/anthology/C92-3143",
    "year": 1992
  },
  "references": [
    "acl-A83-1015"
  ],
  "sections": [
    {
      "text": [
        "Automatic dictation systems (ADS) are nowadays powerful and reliable.",
        "However, some inadequacies of the underlying models still cause errors.",
        "In this paper, we are essentially interested in the language model implemented in the linguistic component, and we leave aside the acoustic module.",
        "More precisely, we aim at improving this linguistic model by coupling the ADS with a syntactic parser, able to diagnose and correct grammatical errors.",
        "We describe the characteristics of such a coupling, and show how the performance of the ADS improves with the actual coupling realized for French between the Tangora ADS and the grammar checker developed at the IBM France Scientific Center.",
        "Description of the Tangora system The Tangora system is implemented on a personal computer IBM PS/2 or IBM RS/6000.",
        "A vocal I/O card Is added, as well as a specialized card equipped with two micro-processors, which provide the needed power for the decoding algorithms.",
        "The programs are written in assembly or C. The multilingual aspect of the Tangora system (DeGennaro 91) constitutes a major asset.",
        "Indeed, it was initially conceived for English (Averbuch, 87) by the F. Jelinek team (IBM T. J. Watson Research Center), but it was adapted since to process Italian, German and French Inputs.",
        "As a whole, the average error rate is close to 5%.",
        "But problems specific to each language require adapted solutions.",
        "The user is required to train the system by uttering 100 sentences during an enrollment phase, and to manage slight pauses between two words.",
        "For the French system, liaisons at this time are prohibited."
      ]
    },
    {
      "heading": "Architectura of the system",
      "text": [
        "The voice signal is submitted to a chain of signal processing, in order to extract acoustic parameters from the sound wave.",
        "Thus, the data flow is reduced from 30,000 to 100 bytes per second.",
        "Two passes of acoustic evaluation are performed: a relatively gross pass (so-called Fast Match) selects a first list of candidate words (around 500 words); this list is further reduced thanks to the language model (see below), so that only a small number of remaining candidates are submitted to a second, more precise, acoustic pass (so-called Detailed Match).",
        "Storage constraints as well as the methods used to provide the language model explain that the size of the dictionary is limited to about 20,000 entries."
      ]
    },
    {
      "heading": "The decoding algorithm",
      "text": [
        "This algorithm determines the more likely uttered sequence of words.",
        "It works from left to right by combining the various scores estimated by the acoustic and linguistic models, according to a so-called stack decoding strategy.",
        "At this stage, the elementary operation consists in expanding the best existing hypothesis which is not yet expanded, I. e. it consists In keeping the sentence segment, which, followed by the contemplated current word, is rated with the highest likelihood."
      ]
    },
    {
      "heading": "Methods",
      "text": [
        "If one formulates the problem of speech recognition according to an Information theory approach, one naturally chooses probabilistic models among all available language models (Jelinek, 76).",
        "The trigram (Cerf, 90), triPOS1 (Derouault, 84), or trilemma (Derouault, 90) models offer ways of estimating the probability of any sequence of words.",
        "For instance, formula of the trigram model:",
        "The analysis of decoding errors show that half of them are due to the acoustic model, the other half being associated with the Model based on triplets of parts of speech (POS), Acres DE COLING-92, NAN-rEs, 23-28 Acirr 1992 9 4 0 PRoc.",
        "a COL1NG-92, NAN-us, AuG. 23-28, 1992 language model.",
        "Actually, the number of homophones being quite high (2.6) in an inflected language such as French, it is clear that no acoustic model, as perfect as it may be, can produce a satisfactory decoding without the support of a language model."
      ]
    },
    {
      "heading": "Power and limitations of probabilistic language models",
      "text": [
        "Probabilistic language models are powerful enough to considerably reduce ambiguities that the acoustic model alone cannot solve.",
        "However, they suffer from punctual imperfections that are bound to their formulation.",
        "This is clearly shown by testing a probabilistic model on the lattice formed by the set of the homophones of the words of every sentence.",
        "The decoding obtained by searching for the maximum likelihood path (Cart, 91) gives an error rate close to 3%, thus showing some of the inadequacies of the probabilistic language models.",
        "Besides, and again for reliability reasons, statistics need to be gathered from large learning corpora (tens or even hundreds of millions words).",
        "In spite of all the preliminary cleaning that may be done (automatic correction of typos, tripled consonants for Instance), such a huge corpus contains a certain number of grammatical errors, that introduce noise in the model.",
        "Probabilistic estimations are produced by counting triplets of words or grammatical classes.",
        "In any of the trigram, triPOS or trilemma models, a word is generally predicted according to the two preceding words, classes or lemmas only.",
        "However, grammatical rules may apply to larger frames.",
        "Not only the rules often apply to words located out of the window used by the probabilistic model, but also grammatically significant words are to be found either In previous or in posterior position.",
        "Let us mention, as Illustrations, some phenomena for which the probabilistic model does not fit: rr Adverbs and complements constitute an obstacle to the transfer of information on gender, number and person, while this information is needed to choose between different homophones, as In: La COMMISSION charges d' Mahar un plan de soution global aux populations des torrttolres occupes s' est ROUNIE dimanche.",
        "e Appositions and interpolated clauses increase the distance between elements which must agree: Phislours PARTIS d'oppositIon do gaucho, notarnment le parts commu-Mate, PARTAGENT co point do vue.",
        ",r Predicting a word thanks to the preceding words does not allow the system to appropriately control person agreement when the subject follows the verb.",
        "Example: Quo sont DEVENUS lea principaux PROTAGONISTS de la victoira du unze novembre?",
        "• Moreover, some confusions due to homophony induce changes of grammatical category, that require a complete interpretation of the sentence to be properly diagnosed, as in \"erresr (conjunction/verb) or \"a\"/\"a\" (preposition/verb).",
        "Coupling the ADS with the grammar checker",
        "To bring a solution to the problems described above, we propose to perform a grammatical analysis after the decoding operation.",
        "The grammatical analysis applies to the best of the hypotheses selected by the ADS.",
        "It serves as a basis to diagnose grammatical errors and to suggest correc-tions' .",
        "The syntactic parser must prove powerful and reliable enough to effectively improve the performance of the ADS.",
        "It must provide a broad coverage, in order to cope with a large variety of texts, the source and the domain of which are not known in advance.",
        "It must also compute a global analysis of the sentence in order to fill the deficiencies of the probabilistic model."
      ]
    },
    {
      "heading": "Description of the syntactic parser",
      "text": [
        "The syntactic parser we use meets the requirements described above (Chanod 91).",
        "it is actually conceived to provide the global syntactic analysis of extremely diversified texts.",
        "It is based on an original linguistic strategy developed by Karen Jensen for US English (Heiden] 62, Jensen, 86).",
        "The parser initially t A similar approach was tested In English, but only to detect grammatically Incorrect sentences (13ellegarda 92) ACTES DE COLING-92, NAnrrEs, 23-28 min' 1992 9 4 1 hoot:.",
        "or COLING-92, NANTES, AUG. 23-28, 1992 computes a syntactic sketch, which represents the likeliest syntactic surface structure of the sentence; at this stage, such phenomena as coordinations, ellipses, interpolated clauses, if not totally resolved, do not block the parsing.",
        "The analysis is based on the so-called relaxed approach, which consists in rejecting linguistic constraints which, as pertinent as they may be in descriptive linguistics, are rarely satisfied stricto sense in the surface structures of free texts.",
        "This strategy proves to broaden the coverage of the grammar as well as it allows the parser to deal with erroneous texts.",
        "Architecture of the parser: The system is written in PLNLP (Programming Language for Natural Language Processing, G. Heidorn, 72).",
        "It includes:",
        "• A morphologic dictionary (50,000 lemmas plus their Inflection tables),* • A morpho-syntactic dictionary, which describes the sub-categorizations attached to each lemma, • A set of more than 300 PLNLP production rules, which produce the syntactic sketches, • A set of procedures built to reinterpret the syntactic sketches and to diagnose errors, • A form generator, which provides corrected forms.",
        "Indeed, some other techniques are also used.",
        "Strong syntactic constraints are relaxed during a second pass; It allows the system to detect errors which induce major syntactic changes (for Instance confusion \"et/est\"), while forbidding undesired or too numerous parses.",
        "Fitted parses are computed in case the global analysis falls (Jensen, 83) and multiple parses are ranked thanks to specific procedures (Heidorn, 76).",
        "This last point allows the system to automatically select the strongest hypothesis, according to the linguistic features (including the grammar errors) of the syntactic trees."
      ]
    },
    {
      "heading": "Adaptation of the parser to the ADS",
      "text": [
        "As mentioned above, many grammatical errors in written French are actually caused by homophones (gender, number agreement, confusion between Infinitive and past participle, \"chantez/chanter\", \"et/est\", etc.).",
        "The parser, initially built for written French, is thus well prepared to detect errors produced by an ADS.",
        "It can however be adapted to the specific needs of the ADS, by adding specific procedures (detection of Ill-recognized frozen phrases, etc.",
        "), and by filtering out non-homophonic corrections, or corrections which do not belong to the list of candidates initially proposed by the ADS.",
        "Indeed, post-processing procedures are largely used to diagnose errors after the syntactic tree has been computed.",
        "This offers the Immense advantage of making the system evolutionary: It can be easily modified, In order to improve the scope of the detections.",
        "This made the adaptation of the grammar checker to the ADS quite straightforward."
      ]
    },
    {
      "heading": "Description of the processing chain",
      "text": [
        "In case of the ADS, the coupling Is done by a simple call to the parser for each sentence.",
        "In case of the homophone scheme, the diagram of the processing chain Is shown in the following figure:"
      ]
    },
    {
      "heading": "Experiences",
      "text": [
        "Our tests were carried on the following texts: corp1 AFP dispatches (1000 words) corp2 AFP dispatches (3221 words) corp3 email notes (1909 words) corp4 grammar books (1337 words) Only the CORP1 file was obtained through a real decoding; the other corpora were processed by automatically generating their homophones."
      ]
    },
    {
      "heading": "Results",
      "text": [
        "The experiments were made at an early stage of the coupling.",
        "They could certainly be improved with more extensive tests, as the adaptation of the grammar checker to the ADS would gain in accuracy.",
        "Percentage of erroneous words left uncorrected",
        "Given the high performance of the ADS and the difficulty to improve it in the frame of the probabilistic model, the improvement of around 1% observed on three of the test corpora is very promising.",
        "After parsing, the suggested correction is: Les conditions sont trios DURES mats le pays, DEVENU Indefendable, les ACCEPTE.",
        "Le fait que le heros de chacun des trots romans solent different, et rOvelateurs.",
        "After parsing, the suggested correction is: Le fait qua le hero, de chacun des trots romans SOIT DIFFeRENT EST",
        "Ce document est a faire signe recto et verso par le proprletaire et par le gestion-mire.",
        "After parsing, the suggested correction Is: Ce document est A faire SIGNER recto et verso par le proprietalre et par le gestion-nalre."
      ]
    },
    {
      "heading": "Conclusion",
      "text": [
        "Coupling the ADS and the syntactic parser meets the initially assigned objectives quite satisfactorily: broad coverage of the texts parsed by the grammar, meaningful percentage of justified corrections, adequacy of the syntactic parser to the types of errors specifically generated by the decoder.",
        "The tests that we performed on various corpora are all the more encouraging, since a great deal of the remaining errors result from semantic ambiguities that no grammar checker based upon a syntactic analysis of the sentence can detect.",
        "4 The bad results of the CORP3 file are due In great part to the difficulties of e-mall, that make parsing less accurate.",
        "AcrEs DE COLING-92, NANrrEs, 23-28 AGUT 1992 9 4 3 PROC.",
        "OF COLING-92, NAN-rEs, AuG. 23-28, 1992 L'age de la MER le plus frequent a l'accouchement est do vIngt-six ans .",
        "A subsidiary advantage of the coupling would be to detect errors that would not be produced by the ADS but by the speaker him/herself (punctuation, stylistic infelicities, mood of subordinate clauses, etc.).",
        "Not only we may contemplate transcribing as accurately as possible the words of a speaker, but also offering him/her a stylistic aid."
      ]
    }
  ]
}
