{
  "info": {
    "authors": [
      "Tawanda Sibanda",
      "Özlem Uzuner"
    ],
    "book": "Human Language Technology Conference and Meeting of the North American Association for Computational Linguistics",
    "id": "acl-N06-1009",
    "title": "Role of Local Context in Automatic Deidentification of Ungrammatical, Fragmented Text",
    "url": "https://aclweb.org/anthology/N06-1009",
    "year": 2006
  },
  "references": [
    "acl-C00-1030",
    "acl-C02-1151",
    "acl-P03-1002",
    "acl-W04-1217",
    "acl-W99-0613"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Deidentification of clinical records is a crucial step before these records can be distributed to non-hospital researchers.",
        "Most approaches to deidentification rely heavily on dictionaries and heuristic rules; these approaches fail to remove most personal health information (PHI) that cannot be found in dictionaries.",
        "They also can fail to remove PHI that is ambiguous between PHI and non-PHI.",
        "Named entity recognition (NER) technologies can be used for deidentification.",
        "Some of these technologies exploit both local and global context of a word to identify its entity type.",
        "When documents are grammatically written, global context can improve NER.",
        "In this paper, we show that we can dei-dentify medical discharge summaries using support vector machines that rely on a statistical representation of local context.",
        "We compare our approach with three different systems.",
        "Comparison with a rule-based approach shows that a statistical representation of local context contributes more to deidentification than dictionaries and hand-tailored heuristics.",
        "Comparison with two well-known systems, SNoW and IdentiFinder, shows that when the language of documents is fragmented, local context contributes more to deidentification than global context."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Medical discharge summaries contain information that is useful to clinical researchers who study the interactions between, for example, different medications and diseases.",
        "However, these summaries include explicit personal health information (PHI) whose release would jeopardize privacy.",
        "In the United States, the Health Information Portability and Accountability Act (HIPAA) provides guidelines for protecting the confidentiality of health care information.",
        "HIPAA lists seventeen pieces of textual PHI of which the following appear in medical discharge summaries: first and last names of patients, their health proxies, and family members; doctors’ first and last names; identification numbers; telephone, fax, and pager numbers; hospital names; geographic locations; and dates.",
        "Removing PHI from medical documents is the goal of deidentification.",
        "This paper presents a method based on a statistical representation of local context for automatically removing explicit PHI from medical discharge summaries, despite the often ungrammatical, fragmented, and ad hoc language of these documents, even when some words in the documents are ambiguous between PHI and non-PHI (e.g., “Hunting-ton” as the name of a person and as the name of a disease), and even when some of the PHI cannot be found in dictionaries (e.g., misspelled and/or foreign names).",
        "This method differs from traditional approaches to deidentification in its independence from dictionaries and hand-tailored heuristics.",
        "It applies statistical named entity recognition (NER) methods to the more challenging task of deidenti",
        "fication but differs from traditional NER approaches in its heavy reliance on a statistical representation of local context.",
        "Finally, this approach targets all PHI that appear in medical discharge summaries.",
        "Experiments reported in this paper show that context plays a more important role in deidentification than dictionaries, and that a statistical representation of local context contributes more to deidentification than global context."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "In the literature, named entities such as people, places, and organizations mentioned in news articles have been successfully identified by various approaches (Bikel et al., 1999; McCallum et al., 2000; Riloff and Jones, 1996; Collins and Singer, 1999; Hobbs et al., 1996).",
        "Most of these approaches are tailored to a particular domain, e.g., understanding disaster news; they exploit both the characteristics of the entities they focus on and the contextual clues related to these entities.",
        "In the biomedical domain, NER has focused on identification of biological entities such as genes and proteins (Collier et al., 2000; Yu et al., 2002).",
        "Various statistical approaches, e.g., a maximum entropy model (Finkel et al., 2004), HMMs and SVMs (GuoDong et al., 2005), have been used with various feature sets including surface and syntactic features, word formation patterns, morphological patterns, part-of-speech tags, head noun triggers, and coreferences.",
        "Deidentification refers to the removal of identifying information from records.",
        "Some approaches to deidentification have focused on particular categories of PHI, e.g., Taira et al.",
        "focused on only patient names (2002), Thomas et al.",
        "focused on proper names including doctors’ names (2002).",
        "For full deidentification, i.e., removal of all PHI, Gupta et al.",
        "used “a complex set of rules, dictionaries, pattern-matching algorithms, and Unified Medical Language System” (2004).",
        "Sweeney’s Scrub system employed competing algorithms that used patterns and lexicons to find PHI.",
        "Each of the algorithms included in her system specialized in one kind of PHI, each calculated the probability that a given word belonged to the class of PHI that it specialized in, and the algorithm with the highest precedence and the highest probability labelled the given word.",
        "This system identified 99-100% of all PHI in the test corpus of patient records and letters to physicians (1996).",
        "We use a variety of features to train a support vector machine (SVM) that can automatically extract local context cues and can recognize PHI (even when some PHI are ambiguous between PHI and non-PHI, and even when PHI do not appear in dictionaries).",
        "We compare this approach with three others: a heuristic rule-based approach (Douglass, 2005), the SNoW (Sparse Network of Winnows) system’s NER component (Roth and Yih, 2002), and IdentiFinder (Bikel et al., 1999).",
        "The heuristic rule-based system relies heavily on dictionaries.",
        "SNoW and IdentiFinder consider some representation of the local context of words; they also rely on information about global context.",
        "Local context helps them recognize stereotypical names and name structures.",
        "Global context helps these systems update the probability of observing a particular entity type based on the other entity types contained in the sentence.",
        "We hypothesize that, given the mostly fragmented and ungrammatical nature of discharge summaries, local context will be more important for deidentification than global context.",
        "We further hypothesize that local context will be a more reliable indication of PHI than dictionaries (which can be incomplete).",
        "The results presented in this paper show that SVMs trained with a statistical representation of local context outperform all baselines.",
        "In other words, a classifier that relies heavily on local context (very little on dictionaries, and not at all on global context) outperforms classifiers that rely either on global context or dictionaries (but make much less use of local context).",
        "Global context cannot contribute much to deidentification when the language of documents is fragmented; dictionaries cannot contribute to deidentification when PHI are either missing from dictionaries or are ambiguous between PHI and non-PHI.",
        "Local context remains a reliable indication of PHI under these circumstances.",
        "The features used for our SVM-based system can be enriched in order to automatically acquire more and varied local context information.",
        "The features discussed in this paper have been chosen because of their simplicity and effectiveness on both grammatical and ungrammatical free text."
      ]
    },
    {
      "heading": "3 Corpora",
      "text": [
        "Discharge summaries are the reports generated by medical personnel at the end of a patient’s hospital stay and contain important information about the patient’s health.",
        "Linguistic processing of these documents is challenging, mainly because these reports are full of medical jargon, acronyms, shorthand notations, misspellings, ad hoc language, and fragments of sentences.",
        "Our goal is to identify the PHI used in discharge summaries even when text is fragmented and ad hoc, even when many words in the summaries are ambiguous between PHI and non-PHI, and even when many PHI contain misspelled or foreign words.",
        "In this study, we worked with various corpora consisting of discharge summaries.",
        "One of these corpora was obtained already deidentified1; i.e., (many) PHI (and some non-PHI) found in this corpus had been replaced with the generic placeholder [REMOVED].",
        "An excerpt from this corpus is below: HISTORY OF PRESENT ILLNESS: The patient is a 77-year-old-woman with long standing hypertension who presented as a Walk-in to me at the [REMOVED] Health Center on [REMOVED].",
        "Recently had been started q.o.d.",
        "on Clonidine since [REMOVED] to taper off of the drug.",
        "Was told to start Zestril 20 mg. q.d.",
        "again.",
        "The patient was sent to the [REMOVED] Unit for direct admission for cardioversion and anticoagulation, with the Cardiologist, Dr. [REMOVED] to follow.",
        "SOCIAL HISTORY: Lives alone, has one daughter living in [REMOVED].",
        "Is a non-smoker, and does not drink alcohol.",
        "HOSPITAL COURSE AND TREATMENT: During admission, the patient was seen by Cardiology, Dr. [REMOVED], was started on IV Heparin, So-talol 40 mg PO b.i.d.",
        "increased to 80 mg b.i.d., and had an echocardiogram.",
        "By [REMOVED] the patient had better rate control and blood pressure control but remained in atrial fibrillation.",
        "On [REMOVED], the patient was felt to be medically stable.",
        "... We hand-annotated this corpus and experimented with it in several ways: we used it to generate a corpus of discharge summaries in which the [REMOVED] tokens were replaced with appropriate, fake PHI obtained from dictionaries2 (Douglass,",
        "2005); we used it to generate a second corpus in which most of the [REMOVED] tokens and some of the remaining text were appropriately replaced with lexical items that were ambiguous between PHI and non-PHIS; we used it to generate another corpus in which all of the [REMOVED] tokens corresponding to names were replaced with appropriately formatted entries that could not be found in dictionaries4.",
        "For all of these corpora, we generated realistic substitutes for the [REMOVED] tokens using dictionaries (e.g., a dictionary of names from US Census Bureau) and patterns (e.g., names of people could be of the formats, “Mr.",
        "F. Lastname”, “First-name Lastname”, “Lastname”, “F.",
        "M. Lastname”, etc.",
        "; dates could appear as “dd/mm/yy”, “dd Mon-thName, yyyy”, “ddth of MonthName, yyyy”, etc.).",
        "In addition to these reidentified corpora (i.e., corpora generated from previously deidentified data), we also experimented with authentic discharge summaries5.",
        "The approximate distributions of PHI in the reidentified corpora and in the authentic corpus are shown in Table 1."
      ]
    },
    {
      "heading": "4 Baseline Approaches",
      "text": []
    },
    {
      "heading": "4.1 Rule-Based Baseline: Heuristic+Dictionary",
      "text": [
        "Traditional deidentification approaches rely heavily on dictionaries and hand-tailored heuristics.",
        "We obtained one such system (Douglass, 2005) that used three kinds of dictionaries:",
        "• PHI lookup tables for female and male first names, last names, last name prefixes, hospital names, locations, and states.",
        "• A dictionary of “common words” that should never be classified as PHI.",
        "• Lookup tables for context clues such as titles, e.g., Mr.; name indicators, e.g., proxy, daughter; location indicators, e.g., lives in.",
        "Given these dictionaries, this system identifies keywords that appear in the PHI lookup tables but do not occur in the common words list, finds approximate matches for possibly misspelled words, and uses patterns and indicators to find PHI."
      ]
    },
    {
      "heading": "4.2 SNoW",
      "text": [
        "SNoW is a statistical classifier that includes a NER component for recognizing entities and their relations.",
        "To create a hypothesis about the entity type of a word, SNoW first takes advantage of “words, tags, conjunctions of words and tags, bigram and trigram of words and tags”, number of words in the entity, bigrams of words in the entity, and some attributes such as the prefix and suffix, as well as information about the presence of the word in a dictionary of people, organization, and location names (Roth and Yih, 2002).",
        "After this initial step, it uses the possible relations of the entity with other entities in the sentence to strengthen or weaken its hypothesis about the entity’s type.",
        "The constraints imposed on the entities and their relationships constitute the global context of inference.",
        "Intuitively, information about global context and constraints imposed on the relationships of entities should improve recognition of both entities and relations.",
        "Roth and Yih (2002) present results that support this hypothesis.",
        "SNoW can recognize entities that correspond to people, locations, and organizations.",
        "For deidentification purposes, all of these entities correspond to PHI; however, they do not constitute a comprehensive set.",
        "We evaluated SNoW only on the PHI it is built to recognize.",
        "We trained and tested its NER component using tenfold cross-validation on each of our corpora."
      ]
    },
    {
      "heading": "4.3 IdentiFinder",
      "text": [
        "IdentiFinder uses Hidden Markov Models to learn the characteristics of names of entities, including people, locations, geographic jurisdictions, organizations, dates, and contact information (Bikel et al., 1999).",
        "For each named entity class, this system learns a bigram language model which indicates the likelihood that a sequence of words belongs to that class.",
        "This model takes into consideration features of words, such as whether the word is capitalized, all upper case, or all lower case, whether it is the first word of the sentence, or whether it contains digits and punctuation.",
        "Thus, it captures the local context of the target word (i.e., the word to be classified; also referred to as TW).",
        "To find the names of all entities, the system finds the most likely sequence of entity types in a sentence given a sequence of words; thus, it captures the global context of the entities in a sentence.",
        "We obtained this system pre-trained on a news corpus and applied it to our corpora.",
        "We mapped its entity tags to our PHI and non-PHI labels.",
        "Admittedly, testing IdentiFinder on the discharge summaries puts this system at a disadvantage compared to the other statistical approaches.",
        "However, despite this shortcoming, IdentiFinder helps us evaluate the contribution of global context to deidentification."
      ]
    },
    {
      "heading": "5 SVMs with Local Context",
      "text": [
        "We hypothesize that systems that rely on dictionaries and hand-tailored heuristics face a major challenge when particular PHI can be used in many different contexts, when PHI are ambiguous, or when the PHI cannot be found in dictionaries.",
        "We further hypothesize that given the ungrammatical and ad hoc nature of our data, despite being very powerful systems, IdentiFinder and SNoW may not provide perfect deidentification.",
        "In addition to being very fragmented, discharge summaries do not present information in the form of relations between entities, and many sentences contain only one entity.",
        "Therefore, the global context utilized by IdentiFinder and SNoW cannot contribute reliably to deidentification.",
        "When run on discharge summaries, the strength of these systems comes from their ability to recognize the structure of the names of different entity types and the local contexts of these entities.",
        "Discharge summaries contain patterns that can serve as local context.",
        "Therefore, we built an SVM-based system that, given a target word (TW), would accurately predict whether the TW was part of PHI.",
        "We used a development corpus to find features that captured as much of the immediate context of the TW as possible, paying particular attention to cues human annotators found useful for deidentification.",
        "We added to this some surface characteristics for the TW itself and obtained the following features: the TW itself, the word before, and the word after (all lemmatized); the bigram before and the bigram after TW (lemmatized); the part of speech of TW, of the word before, and of the word after; capitalization of TW; length of TW; MeSH ID of the noun phrase containing TW (MeSH is a dictionary of Medical Subject Headings and is a subset of the Unified Medical Language System (UMLS) of the National Library of Medicine); presence of TW, of the word before, and of the word after TW in the name, location, hospital, and month dictionaries; the heading of the section in which TW appears, e.g., “History of Present Illness”; and, whether TW contains “-” or “/” characters.",
        "Note that some of these features, e.g., capitalization and punctuation within TW, were also used in IdentiFinder.",
        "We used the SVM implementation provided by LIBSVM (Chang and Lin, 2001) with a linear kernel to classify each word in the summaries as either PHI or non-PHI based on the above-listed features.",
        "We evaluated this system using tenfold cross-validation."
      ]
    },
    {
      "heading": "6 Evaluation",
      "text": [
        "Local context contributes differently to each of the four deidentification systems.",
        "Our SVM-based approach uses only local context.",
        "The heuristic, rule-based system relies heavily on dictionaries.",
        "IdentiFinder uses a simplified representation of local context and adds to this information about the global context as represented by transition probabilities between entities in the sentence.",
        "SNoW uses local context as well, but it also makes an effort to benefit from relations between entities.",
        "Given the difference in the strengths of these systems, we compared their performance on both the reidentified and authentic corpora (see Section 3).",
        "We hypothesized that given the nature of medical discharge summaries, IdentiFinder would not be able to find enough global context and SNoW would not be able to make use of relations (because many sentences in this corpus contain only one entity).",
        "We further hypothesized that when the data contain words ambiguous between PHI and non-PHI, or when the PHI cannot be found in dictionaries, the heuristic, rule-based approach would perform poorly.",
        "In all of these cases, SVMs trained with local context information would be sufficient for proper deidentification.",
        "To compare the SVM approach with IdentiFinder, we evaluated both on PHI consisting of names of people (i.e., patient and doctor names), locations (i.e., geographic locations), and organizations (i.e., hospitals), as well as PHI consisting of dates, and contact information (i.e., phone numbers, pagers).",
        "We omitted PHI representing ID numbers from this experiment in order to be fair to IdentiFinder which was not trained on this category.",
        "To compare the SVM approach with SNoW, we trained both systems with only PHI consisting of names of people, locations, and organizations, i.e., the entities that SNoW was designed to recognize."
      ]
    },
    {
      "heading": "6.1 Deidentifying Reidentified and Authentic Discharge Summaries",
      "text": [
        "We first deidentified:",
        "• Previously deidentified discharge summaries into which we inserted invented but realistic surrogates for PHI without deliberately introducing ambiguous words or words not found in dictionaries, and • Authentic discharge summaries with real PHI.",
        "Our experiments showed that SVMs with local context outperformed all other approaches.",
        "On the reidentified corpus, SVMs gave an F-measure of 97.2% for PHI.",
        "In comparison, IdentiFinder, having been trained on the news corpus, gave an F-measure of 67.4% and was outperformed by the heuristic+dictionary approach (see Table 2).6",
        "We evaluated SNoW only on the three kinds of entities it is designed to recognize.",
        "We cross-validated it on our corpora and found that its performance in recognizing people, locations, and organizations was 96.2% in terms of F-measure (see Table 37).",
        "In comparison, our SVM-based system, when retrained to only consider people, locations, and organizations so as to be directly comparable to SNoW, had an F-measure of 98%.8",
        "Similarly, on the authentic discharge summaries, the SVM approach outperformed all other approaches in recognizing PHI (see Tables 4 and 5)."
      ]
    },
    {
      "heading": "6.2 Deidentifying Data with Ambiguous PHI",
      "text": [
        "In discharge summaries, the same words can appear both as PHI and as non-PHI.",
        "For example, in the same corpus, the word “Swan” can appear both as the name of a medical device (i.e., “Swan Catheter”) and as the name of a person, etc.",
        "Ideally, we would like to deidentify data even when many words in the",
        "corpus are ambiguous between PHI and non-PHI.",
        "We hypothesize that given ambiguities in the data, context will play an important role in determining whether the particular instance of the word is PHI and that given the many fragmented sentences in our corpus, local context will be particularly useful.",
        "To test these hypotheses, we generated a corpus by rei-dentifying the previously deidentified corpus with words that were ambiguous between PHI and non-PHI, making sure to use each ambiguous word both as PHI and non-PHI, and also making sure to cover all acceptable formats of all PHI (see Section 3).",
        "The resulting distribution of PHI is shown in Table 6.",
        "Our results showed that, on this corpus, the SVM-based system accurately recognized 91.9% of all PHI; its performance, measured in terms of F-measure was also significantly better than all other approaches both on the complete corpus containing ambiguous entries (see Table 7 and Table 8) and only on the ambiguous words in this corpus (see Table 9)."
      ]
    },
    {
      "heading": "6.3 Deidentifying PHI Not Found in Dictionaries",
      "text": [
        "Some medical documents contain foreign or misspelled names that need to be effectively removed.",
        "To evaluate the different deidentification approaches under such circumstances, we generated a corpus in which the names of people, locations, and hospitals were all random permutations of letters.",
        "The resulting words were not found in any dictionaries but followed the general format of the entity name category to which they belonged.",
        "The distribution of PHI in this third corpus is in Table 10.",
        "On this data set, dictionaries cannot contribute to deidentification because none of the PHI appear in dictionaries.",
        "Under these conditions, proper deidentification relies completely on context.",
        "Our results showed that SVM approach outperformed all other approaches on this corpus also (Tables 11 and 12).",
        "Of only the PHI not found in dictionaries, 95.5% was accurately identified by the SVM approach.",
        "In comparison, the heuristic+dictionary approach accurately identified those PHI that could not be found in dictionaries 11.1 % of the time, IdentiFinder recognized these entities 76.7% of the time and SNoW gave an accuracy of 79% (see Table 13)."
      ]
    },
    {
      "heading": "6.4 Feature Importance",
      "text": [
        "As hypothesized, in all experiments, the SVM-based approach outperformed all other approaches.",
        "SVM’s feature set included a total of 26 features, 12 of which were dictionary-related features (excluding MeSH).",
        "Information gain showed that the most informative features for deidentification were the TW, the bigram before TW, the bigram after TW, the word before TW, and the word after TW.",
        "Note that the TW itself is important for classification; many of the non-PHI correspond to common words that appear in the corpus frequently and the SVM learns the fact that some words, e.g., the, admit, etc., are never PHI.",
        "In addition, the context of TW (captured in the form of unigrams and bigrams of words and part-of-speech tags surrounding TW) contributes significantly to deidentification.",
        "There are many ways of automatically capturing context.",
        "In our data, unigrams and bigrams of words and their part-of-speech tags seem to be sufficient for a statistical representation of local context.",
        "The global context, as represented within IdentiFinder and SNoW, could not contribute much to deidentification on this corpus because of the fragmented nature of the language of these documents, because most sentences in this corpus contain only one entity, and because many sentences do not include explicit relations between entities.",
        "However, there is enough structure in this data that can be captured by local context; lack of relations between entities and the inability to capture global context do not hold us back from almost perfect deidentification."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "We presented a set of experimental results that show that local context contributes more to deidentification than dictionaries and global context when working with medical discharge summaries.",
        "These documents are characterized by incomplete, fragmented sentences, and ad hoc language.",
        "They use a lot of jargon, many times omit subjects of sentences, use entity names that can be misspelled or foreign words, can include entity names that are ambiguous between PHI and non-PHI, etc.",
        "Similar documents in many domains exist; our experiments here show that even on such challenging corpora, local context can be exploited to identify entities.",
        "Even a rudimentary statistical representation of local context, as captured by unigrams and bigrams of lemmatized keywords and part-of-speech tags, gives good results and outperforms more sophisticated approaches that rely on global context.",
        "The simplicity of the representation of local context and the results obtained using this simple representation are particularly promising for many tasks that require processing ungrammatical and fragmented text where global context cannot be counted on."
      ]
    },
    {
      "heading": "8 Acknowledgements",
      "text": [
        "This publication was made possible by grant number R01-EB001659 from the National Institute of Biomedical Imaging and Bioengineering; by grant number N01-LM-3-3513 on National Multi-Protocol Ensemble for Self-Scaling Systems for Health from National Library of Medicine; and, by grant number U54-LM008748 on Informatics for Integrating Biology to the Bedside from National Library of Medicine.",
        "We are grateful to Professor Peter Szolovits and Dr. Boris Katz for their insights, and to Professor Carol Doll, Sue Felshin, Gregory Marton, and Tian He for their feedback on this paper."
      ]
    }
  ]
}
