{
  "info": {
    "authors": [
      "Paramveer Dhillon",
      "Jordan Rodu",
      "Michael Collins",
      "Dean Foster",
      "Lyle Ungar"
    ],
    "book": "EMNLP",
    "id": "acl-D12-1019",
    "title": "Spectral Dependency Parsing with Latent Variables",
    "url": "https://aclweb.org/anthology/D12-1019",
    "year": 2012
  },
  "references": [
    "acl-J05-1003",
    "acl-J93-2004",
    "acl-J94-2001",
    "acl-P02-1062",
    "acl-P06-1055",
    "acl-P08-1068",
    "acl-P08-2054",
    "acl-P12-1024",
    "acl-P99-1059",
    "acl-W96-0213"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Recently there has been substantial interest in using spectral methods to learn generative sequence models like HMMs.",
        "Spectral methods are attractive as they provide globally consistent estimates of the model parameters and are very fast and scalable, unlike EM methods, which can get stuck in local minima.",
        "In this paper, we present a novel extension of this class of spectral methods to learn dependency tree structures.",
        "We propose a simple yet powerful latent variable generative model for dependency parsing, and a spectral learning method to efficiently estimate it.",
        "As a pilot experimental evaluation, we use the spectral tree probabilities estimated by our model to re-rank the outputs of a near state-of-the-art parser.",
        "Our approach gives us a moderate reduction in error of up to 4.6% over the baseline re-ranker."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Markov models have been for two decades a workhorse of statistical pattern recognition with applications ranging from speech to vision to language.",
        "Adding latent variables to these models gives us additional modeling power and have shown success in applications like POS tagging (Merialdo, 1994), speech recognition (Rabiner, 1989) and object recognition (Quattoni et al2004).",
        "However, this comes at the cost that the resulting parameter estimation problem becomes non-convex and techniques like EM (Dempster et al1977) which are used to estimate the parameters can only lead to locally optimal solutions.",
        "Recent work by Hsu et al2008) has shown that globally consistent estimates of the parameters of HMMs can be found by using spectral methods, particularly by singular value decomposition (SVD) of appropriately defined linear systems.",
        "They avoid the NP Hard problem of the global optimization problem of the HMM parameters (Terwijn, 2002), by putting restrictions on the smallest singular value of the HMM parameters.",
        "The main intuition behind the model is that, although the observed data (i.e. words) seem to live in a very high dimensional space, but in reality they live in a very low dimensional space (size k ?",
        "30 ?",
        "50) and an appropriate eigen decomposition of the observed data will reveal the underlying low dimensional dynamics and thereby revealing the parameters of the model.",
        "Besides ducking the NP hard problem, the spectral methods are very fast and scalable to train compared to EM methods.",
        "In this paper we generalize the approach of Hsu et al2008) to learn dependency tree structures with latent variables.1 Petrov et al2006) and Musillo and Merlo (2008) have shown that learning PCFGs and dependency grammars respectively with latent variables can produce parsers with very good generalization performance.",
        "However, both these approaches rely on EM for parameter estimation and can benefit from using spectral methods.",
        "We propose a simple yet powerful latent variable generative model for use with dependency pars-1Actually, instead of using the model by Hsu et al2008) we work with a related model proposed by Foster et al2012) which addresses some of the shortcomings of the earlier model which we detail below.",
        "ing which has one hidden node for each word in the sentence, like the one shown in Figure 1 and work out the details for the parameter estimation of the corresponding spectral learning model.",
        "At a very high level, the parameter estimation of our model involves collecting unigram, bigram and tri-gram counts sensitive to the underlying dependency structure of the given sentence.",
        "Recently, Luque et al2012) have also proposed a spectral method for dependency parsing, however they deal with horizontal markovization and use hidden states to model sequential dependencies within a word's sequence of children.",
        "In contrast with that, in this paper, we propose a spectral learning algorithm where latent states are not restricted to HMM-like distributions of modifier sequences for a particular head, but instead allow information to be propagated through the entire tree.",
        "More recently, Cohen et al2012) have proposed a spectral method for learning PCFGs.",
        "Its worth noting that recent work by Parikh et al. (2011) also extends Hsu et al2008) to latent variable dependency trees like us but under the restrictive conditions that model parameters are trained for a specified, albeit arbitrary, tree topology.2 In other words, all training sentences and test sentences must have identical tree topologies.",
        "By doing this they allow for node-specific model parameters, but must retrain the model entirely when a different tree topology is encountered.",
        "Our model on the other hand allows the flexibility and efficiency of processing sentences with a variety of tree topologies from a single training run.",
        "Most of the current state-of-the-art dependency parsers are discriminative parsers (Koo et al2008; McDonald, 2006) due to the flexibility of representations which can be used as features leading to better accuracies and the ease of reproducibility of results.",
        "However, unlike discriminative models, generative models can exploit unlabeled data.",
        "Also, as is common in statistical parsing, re-ranking the outputs of a parser leads to significant reductions in error (Collins and Koo, 2005).",
        "Since our spectral learning algorithm uses a gen-2This can be useful in modeling phylogeny trees for instance, but precludes most NLP applications, since there is a need to model the full set of different tree topologies possible in parsing.",
        "was here?",
        "erative model of words given a tree structure, it can score a tree structure i.e. its probability of generation.",
        "Thus, it can be used to re-rank the n-best outputs of a given parser.",
        "The remainder of the paper is organized as follows.",
        "In the next section we introduce the notation and give a brief overview of the spectral algorithm for learning HMMs (Hsu et al2008; Foster et al. 2012).",
        "In Section 3 we describe our proposed model for dependency parsing in detail and work out the theory behind it.",
        "Section 4 provides experimental evaluation of our model on Penn Treebank data.",
        "We conclude with a brief summary and future avenues for research."
      ]
    },
    {
      "heading": "2 Spectral Algorithm For Learning HMMs",
      "text": [
        "In this section we describe the spectral algorithm for learning HMMs.3"
      ]
    },
    {
      "heading": "2.1 Notation",
      "text": [
        "The HMM that we consider in this section is a sequence of hidden states h ?",
        "{1, .",
        ".",
        ".",
        ", k} that follow the Markov property: p(ht|h1, .",
        ".",
        ".",
        ", ht?1) = p(ht|ht?1) and a sequence of observations x ?",
        "{1, .",
        ".",
        ".",
        ", n} such that p(xt|x1, .",
        ".",
        ".",
        ", xt?1, h1, .",
        ".",
        ".",
        ", ht) = p(xt|ht) 3As mentioned earlier, we use the model by Foster et al. (2012) which is conceptually similar to the one by Hsu et al. (2008), but does further dimensionality reduction and thus has lower sample complexity.",
        "Also, critically, the fully reduced dimension model that we use generalizes much more cleanly to trees.",
        "The parameters of this HMM are: ?",
        "A vector pi of length k where pii = p(h1 = i): The probability of the start state in the sequence being i.",
        "transitioning to state i, given that the previous state was j. ?",
        "A matrix O of size n?",
        "k where Oi,j = p(x = i|h = j): The probability of state h emitting observation x.",
        "Define ?j to be the vector of length n with a 1 in the jth entry and 0 everywhere else, and diag(v) to be the matrix with the entries of v on the diagonal and 0 everywhere else.",
        "The joint distribution of a sequence of observations x1, .",
        ".",
        ".",
        ", xm and a sequence of hidden states",
        "Now, we can write the marginal probability of a sequence of observations as",
        "which can be expressed in matrix form4 as: p(x1, .",
        ".",
        ".",
        ", xm) = 1>AxmAxm?1 ?",
        "?",
        "?Am1pi where Axm ?",
        "Tdiag(O >?xm), and 1 is a k-dimensional vector with every entry equal to 1.",
        "A is called an ?observation operator?, and is effectively a third order tensor, and Axm which is a matrix, gives the distribution vector over states at timem+1 as a function of the state distribution vector at the current time m and the current observation ?xm .",
        "SinceAxm depends on the hidden state, it is not observable, and hence cannot be directly estimated.",
        "4This is essentially the matrix form of the standard dynamic program (forward algorithm) used to estimate HMMs.",
        "However, Hsu et al2008) and Foster et al2012) showed that under certain conditions there exists a fully observable representation of the observable operator model."
      ]
    },
    {
      "heading": "2.2 Fully observable representation",
      "text": [
        "Before presenting the model, we need to address a few more points.",
        "First, let U be a ?representation matrix?",
        "(eigenfeature dictionary) which maps each observation to a reduced dimension space (n ?",
        "k) that satisfies the conditions:",
        "Hsu et al2008); Foster et al2012) discuss U in more detail, but U can, for example, be obtained by the SVD of the bigram probability matrix (where",
        "and ?, ?",
        "and K, described in more detail below, are quantities estimated by frequencies of unigrams, bi-grams, and trigrams in the observed (training) data.",
        "Under the assumption that data is generated by an HMM, the distribution p?",
        "obtained by substituting the estimated values c?1, c?",
        "?, and C?",
        "(y) into equation (1) converges to p sufficiently fast as the amount of training data increases, giving us consistent parameter estimates.",
        "For details of the convergence proof, please see Hsu et al2008) and Foster et al2012)."
      ]
    },
    {
      "heading": "3 Spectral Algorithm For Learning",
      "text": []
    },
    {
      "heading": "Dependency Trees",
      "text": [
        "In this section, we first describe a simple latent variable generative model for dependency parsing.",
        "We then define some extra notation and finally present",
        "the details of the corresponding spectral learning algorithm for dependency parsing, and prove that our learning algorithm provides a consistent estimation of the marginal probabilities.",
        "It is worth mentioning that an alternate way of approaching the spectral estimation of latent states for dependency parsing is by converting the dependency trees into linear sequences from root-to-leaf and doing a spectral estimation of latent states using Hsu et al2008).",
        "However, this approach would not give us the correct probability distribution over trees as the probability calculations for different paths through the trees are not independent.",
        "Thus, although one could calculate the probability of a path from the root to a leaf, one cannot generalize from this probability to say anything about the neighboring nodes or words.",
        "Put another way, when a parent has more than the one descendant, one has to be careful to take into account that the hidden variables at each child node are all conditioned on the hidden variable of the parent."
      ]
    },
    {
      "heading": "3.1 A latent variable generative model for",
      "text": [
        "dependency parsing In the standard setting, we are given training examples where each training example consists of a sequence of words x1, .",
        ".",
        ".",
        ", xm together with a dependency structure over those words, and we want to estimate the probability of the observed structure.",
        "This marginal probability estimates can then be used to build an actual generative dependency parser or, since the marginal probability is conditioned on the tree structure, it can be used re-rank the outputs of a parser.",
        "As in the conventional HMM described in the previous section, we can define a simple latent variable first order dependency parsing model by introducing a hidden variable hi for each word xi.",
        "The joint probability of a sequence of observed nodes x1, .",
        ".",
        ".",
        ", xm together with hidden nodes h1, .",
        ".",
        ".",
        ", hm can be written as",
        "where pa(j) is the parent of node j and d(j) ?",
        "{L,R} indicates whether hj is a left or a right node of hpa(j).",
        "For simplicity, the number of hidden and observed nodes in our tree are the same, however they are not required to be so.",
        "As is the case with the conventional HMM, the parameters used to calculate this joint probability are unobservable, but it turns out that under suitable conditions a fully observable model is also possible for the dependency tree case with the parameterization as described below."
      ]
    },
    {
      "heading": "3.2 Model parameters",
      "text": [
        "We will define both the theoretical representations of our observable parameters, and the sampling versions of these parameters.",
        "Note that in all the cases, the estimated versions are unbiased estimates of the theoretical quantities.",
        "Define Td and T ud where d ?",
        "{L,R} to be the hidden state transition matrices from parent to left or right child, and from left or right child to parent (hence the u for ?up?",
        "), respectively.",
        "In other words (referring to Figure 2)",
        "Let Ux(i) be the i th entry of vector U>?x andG = U>O.",
        "Further, recall the notation diag(v), which is a matrix with elements of v on its diagonal, then: ?",
        "Define the k-dimensional vector ?",
        "(unigram",
        "counts):",
        "where c?",
        "(u) = c(u)N1 , c(u) is the count of observation u in the training sample, and N1 =?",
        "u?n c(u).",
        "?",
        "Define the k?k matrices ?L and ?R (left child-parent and right child-parent bigram counts):",
        "of bigram (u, v) where u is the left child and v is the parent in the training sample, and",
        "where c?",
        "(w, u, v) = c(w,u,v)N3 , c(w, u, v) is the count of bigram (w, u, v) where w is the left child, u is the parent and v is the right child in the training sample, and N3 =?",
        "(w,u,v)?n?n?n c(w, u, v).",
        "?",
        "Define k?k matrices ?L and ?R (skip-bigram counts (left child-right child) and (right child-left child)) 5:"
      ]
    },
    {
      "heading": "3.3 Parameter estimation",
      "text": [
        "Using the above definitions, we can estimate the parameters of the model, namely ?,?L,?R,?L,?R andK, from the training data and define observables useful for the dependency model as6",
        "As we will see, these quantities allow us to recursively compute the marginal probability of the dependency tree, p?",
        "(x1, .",
        ".",
        ".",
        ", xm), in a bottom up manner by using belief propagation.",
        "To see this, let hch(i) be the set of hidden children of hidden node i (in Figure 2 for instance, hch(1) = {2, 3}) and let och(i) be the set of observed children of hidden node i (in the same figure och(i) = {1}).",
        "Then compute the marginal probability p(x1, .",
        ".",
        ".",
        ", xm) from Equation 2 as",
        "where ?i(h) is defined by summing over all the hidden random variables i.e., ?i(h) =?",
        "h?",
        "p(h ?|h)ri(h?).",
        "This can be written in a compact matrix form as",
        "where ?",
        "?ri is a vector of size k (the dimensionality of the hidden space) of values ri(h).",
        "Note that since in Equation 2 we condition on whether xj is the left or right child of its parent, we have separate transition matrices for left and right transitions from a given hidden node dj ?",
        "{L,R}.",
        "The recursive computation can be written in terms of observables as:",
        "The final calculation for the marginal probability of a given sequence is",
        "The spectral estimation procedure is described below in Algorithm 1.",
        "Algorithm 1 Spectral dependency parsing (Computing marginal probability of a tree.)",
        "1: Input: Training examples x(i) for i ?",
        "{1, .",
        ".",
        ".",
        ",M} along with dependency structures where each se"
      ]
    },
    {
      "heading": "3.4 Sample complexity",
      "text": [
        "Our main theoretical result states that the above scheme for spectral estimation of marginal probabilities provides a guaranteed consistent estimation scheme for the marginal probabilities: Theorem 3.1.",
        "Let the sequence {x1, .",
        ".",
        ".",
        ", xm} be",
        "generated by an k ?",
        "2 state HMM.",
        "Suppose we are given a U which has the property that U>O is invertible, and |Uij |?",
        "1.",
        "Suppose we use equation (5) to estimate the probability based on N independent triples.",
        "Then",
        "holds with probability at least 1?",
        "?.",
        "Proof.",
        "A sketch of the proof, in the case without directional transition parameters, can be found in the appendix.",
        "The proof with directional transition parameters is almost identical."
      ]
    },
    {
      "heading": "4 Experimental Evaluation",
      "text": [
        "Since our algorithm can score any given tree structure by computing its marginal probability, a natural way to benchmark our parser is to generate n-best dependency trees using some standard parser and then use our algorithm to re-rank the candidate dependency trees, e.g. using the log spectral probability as described in Algorithm 1 as a feature in a discriminative re-ranker."
      ]
    },
    {
      "heading": "4.1 Experimental Setup",
      "text": [
        "Our base parser was the discriminatively trained MSTParser (McDonald, 2006), which implements both first and second order parsers and is trained using MIRA (Crammer et al2006) and used the standard baseline features as described in McDonald (2006).",
        "We tested our methods on the English Penn Treebank (Marcus et al1993).",
        "We use the standard splits of Penn Treebank; i.e., we used sections 2-21 for training, section 22 for development and section 23 for testing.",
        "We used the PennConverter7 tool to convert Penn Treebank from constituent to dependency format.",
        "Following (McDonald, 2006; Koo",
        "et al2008), we used the POS tagger by Ratnaparkhi (1996) trained on the full training data to provide POS tags for development and test sets and used 10- way jackknifing to generate tags for the training set.",
        "As is common practice we stripped our sentences of all the punctuation.",
        "We evaluated our approach on sentences of all lengths."
      ]
    },
    {
      "heading": "4.2 Details of spectral learning",
      "text": [
        "For the spectral learning phase, we need to just collect word counts from the training data as described above, so there are no tunable parameters as such.",
        "However, we need to have access to an attribute dictionary U which contains a k dimensional representation for each word in the corpus.",
        "A possible way of generating U as suggested by Hsu et al2008) is by performing SVD on bigrams P21 and using the left eigenvectors as U .",
        "We instead used the eigenfeature dictionary proposed by Dhillon et al2011) (LR-MVL) which is obtained by performing CCA on neighboring words and has provably better sample complexity for rare words compared to the SVD alternative.",
        "We induced the LR-MVL embeddings for words using the Reuters RCV1 corpus which contains about 63 million tokens in 3.3 million sentences and used their context oblivious embeddings as our estimate of U .",
        "We experimented with different choices of k (the size of the low dimensional projection) on the development set and found k = 10 to work reasonably well and fast.",
        "Using k = 10 we were able to estimate our spectral learning parameters ?,?L,R,?L,R,K from the entire training data in under 2 minutes on a 64 bit Intel 2.4 Ghz processor."
      ]
    },
    {
      "heading": "4.3 Re-ranking the outputs of MST parser",
      "text": [
        "We could not find any previous work which describes features for discriminative re-ranking for dependency parsing, which is due to the fact that unlike constituency parsing, the base parsers for dependency parsing are discriminative (e.g. MST parser) which obviates the need for re-ranking as one could add a variety of features to the baseline parser itself.",
        "However, parse re-ranking is a good testbed for our spectral dependency parser which can score a given tree.",
        "So, we came up with a baseline set of features to use in an averaged perceptron re-ranker (Collins, 2002).",
        "Our baseline features comprised of two main"
      ]
    },
    {
      "heading": "Method Accuracy Complete",
      "text": [
        "Re-ranking 2).",
        "Accuracy is the number of words which correctly identified their parent and Complete is the number of sentences for which the entire dependency tree was correct.",
        "3).",
        "Base.",
        "Features are the two re-ranking features described in Section 4.3.",
        "4).",
        "log p?",
        "is the spectral log probability feature.",
        "features which capture information that varies across the different n-best parses and moreover were not used as features by the baseline MST parser, ?POS-left-modifier ?",
        "POS-head ?",
        "POS-right-modifier?",
        "and ?POS-left/right-modifier ?",
        "POS-head ?",
        "POS-grandparent?8.",
        "In addition to that we used the log of spectral probability (p?",
        "(x1, .",
        ".",
        ".",
        ", xm) - as calculated using Algorithm 1) as a feature.",
        "We used the MST parser trained on entire training data to generate a list of n-best parses for the development and test sets.",
        "The n-best parses for the training set were generated by 3-fold cross validation, where we train on 2 folds to get the parses for the third fold.",
        "In all our experiments we used n = 50.",
        "The results are shown in Table 1.",
        "As can be seen, the best results give up to 4.6% reduction in error over the re-ranker which uses just the baseline set of features."
      ]
    },
    {
      "heading": "5 Discussion and Future Work",
      "text": [
        "Spectral learning of structured latent variable models in general is a promising direction as has been shown by the recent interest in this area.",
        "It allows us to circumvent the ubiquitous problem of getting stuck in local minima when estimating the latent variable models via EM.",
        "In this paper we ex-8One might be able to come up with better features for dependency parse re-ranking.",
        "Our goal in this paper was just to get a reasonable baseline.",
        "tended the spectral learning ideas to learn a simple yet powerful dependency parser.",
        "As future work, we are working on building an end-to-end parser which would involve coming up with a spectral version of the inside-outside algorithm for our setting.",
        "We are also working on extending it to learn more powerful grammars e.g. split head-automata grammars (SHAG) (Eisner and Satta, 1999)."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "In this paper we proposed a novel spectral method for dependency parsing.",
        "Unlike EM trained generative latent variable models, our method does not get stuck in local optima, it gives consistent parameter estimates, and it is extremely fast to train.",
        "We worked out the theory of a simple yet powerful generative model and showed how it can be learned using a spectral method.",
        "As a pilot experimental evaluation we showed the efficacy of our approach by using the spectral probabilities output by our model for re-ranking the outputs of MST parser.",
        "Our method reduced the error of the baseline re-ranker by up to a moderate 4.6%."
      ]
    },
    {
      "heading": "7 Appendix",
      "text": [
        "This appendix offers a sketch of the proof of The",
        "where Kijk = K(?j)ik are the elements of the tensor K().",
        "Definition 2.",
        "Define ?k as the smallest singular value of ?",
        "and ?.",
        "The proof relies on the fact that a row vector multiplied by a series of matrices, and finally multiplied by a column vector amounts to a sum over all possible products of individual entries in the vectors and matrices.",
        "With this in mind, if we bound the largest relative error of any particular entry in the matrix by, say, ?, and there are, say, s parameters (vectors and matrices) being multiplied together, then by simple algebra the total relative error of the sum over the products is bounded by ?s.",
        "The proof then follows from two basic steps.",
        "First, one must bound the maximal relative error, ?",
        "for any particular entry in the parameters, which can be done using central limit-type theorems and the quantity ?",
        "described above.",
        "Then, to calculate the exponent s one simply counts the number of parameters multiplied together when calculating the probability of a particular sequence of observations.",
        "Since each hidden node is associated with exactly one observed node, it follows that s = 12m + 2L, where L is the number of levels (for instance in our example ?Kilroy was here?",
        "there are two levels).",
        "s can be easily computed for arbitrary tree topologies.",
        "It follows from Foster et al2012) that we achieve",
        "leading to the theorem stated above.",
        "Lastly, note that in reality one does not see ?",
        "and ?k but instead estimates of these quantities; Foster et al2012) shows how to incorporate the accuracy of the estimates into the sample complexity.",
        "Acknowledgement: We would like to thank Emily Pitler for valuable feedback on the paper."
      ]
    }
  ]
}
