{
  "info": {
    "authors": [
      "Dominique Dutoit"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-3151",
    "title": "A Set-Theoretic Approach to Lexical Semantics",
    "url": "https://aclweb.org/anthology/C92-3151",
    "year": 1992
  },
  "references": [],
  "sections": [
    {
      "heading": "RESUME",
      "text": []
    },
    {
      "heading": "UNE APPROCHE ENSEMBLISIE DU SEMANIISIVIE LEXICAL",
      "text": [
        "Nous *seams les resultats dun travail mend depuis piusieurs annees par la sockete MEMODATA sur la structuraticn artantique du lexique frarcais.",
        "Ce travail a fait l'objet d'un premier caMat de recherche avec le Mist:re de la Recherche et de la Tedmok:gie et aboutit aujandhui a un dicticnnahe logiciel de plus de 100 000 mats et locutions regroupes analogiquement et synarymiquerrent (DICOLOGIQUE).",
        "Le titre \"dictiamaite analogique\" negroupe des realiEs tits hettertgenes.",
        "Pour none part, nous &tons le travail de Sisyphe alba an les associations staeotypees pour nous concentrer sur la sttuatnation des dumps stnatniques.",
        "Ainsi, nous dassons, b l'aide de l'ordinateur, et Won l'ecpatise humane, les Millen de faits linguistiques que les dicticnnaires de longue s'attachent h tecenser et a Eger dans usage.",
        "Une panic important de radicle dean d'une fawn forrnelle le dictionnaire des dumps lexicaux : it est tore structuration de mots et d'enserobks de mots prenata l'aspect d'un gtapie ties forternent poly-hieranifique.",
        "A la base de ce graphe, nous ttouvals des ensembles \"primitifs\" : des ensembles qui n'cnt pas de contenant ante que le dictionnaim tout artier.",
        "A rant= extr les mots defmis par les ensembles auxquels cls appethennent, arose que per ]'ensemble de leurs successions d'appartenance.",
        "Dans DICOIAGIQUE, Es successions d'appartenance des ensembles constituent tin is niveatx dune Irene \"quasi-4:01*En\" d'tm ma Il exists 9 types d'ensembles : - Quake ensanbles \"Lisle\" composes de mots ayant tare equivalence de seas et irk calorie grammaticale (nom, verbe, aljedif, advabe).",
        "- Un ensemble \"claw\" destine a recevoir des enutnerations en exterrion (la zoologie par ex.).",
        "- Un ensemble \"Tennes lies\", au conten► asses hetemgene de terms n'ayant pu darner lieu a la creation de lists dam tin \"Theme\" dame.",
        "-Un ensemble Mime capable d'enumerer tout le champ lexical d'une notion.",
        "Bite antes, il pea cartel* des themes.",
        "- Un ensemble \"Description\" employe en cos de Itcessite detainee.",
        "- Un ensemble \"Caracterisfique\" qui negroupe des mots dint les signifies carp:it-tent un metre trait salant Les enonces mathdmatiques correspondent a des fonctionnalites du dictionnaim electronique que nous avons illustre par des exempts empnutes a celui-ci : Croisement de concepts (vetbes aqximant \"faire tatter\" et \"carper\",substanlifs &sigma une \"coiffure\" du \"Pape\", synonymes de \"voler\" par ties \"kali e s \" ...).",
        "- Edition de Estes cu de thanes ( la Este \"Pensee edit= 500 vabes structures, sr tarries potentiels.",
        "- Rechetche des quasi-definitions d'un mot (le berme polysernique \"abate\" est *settle dans radicle).",
        "Awe ces diffaents exeinples, axis axnprenons =anent le dicliennaire des champs knout pat etre consuhe Inclement par un utclisateur hutnain.",
        "Nous posans alas le prcbEtne de son exploitation par la machine elle4rienE.",
        "En remnant les definitions mathernatiques du dictionnaite, onus travakins sur l'indexaticn autotnatique des themes d'un petit text peen daps la passe.",
        "Nous developpais urn strategic d'analyse stricternent Iaxicale.",
        "File est boa* sir tire determination des ensembles capables de caner les sujets abodes per l'encnce.",
        "definitive, le dichonnake pan havaler sur de petits tales Outs n'integnons aucune syntaxe) en-dehots de tootle demarche d'ingenierie prepatatoire.",
        "Actuellement, DICOLOGIQUE contient plus de 100 000 mots et 15 000 ensembles types.",
        "Les 350 000 observations d'appartenance directes des mots, cneees par on expert human, ddveloppent un graphe de 4 OCO 000 de successions d' heritage que nous arnelicaons sans cesse.",
        "Les outils de base que nous conmuisons, tel le SEMIOGRAPHE pour la recherche documentaire, nous pennettent d'evaluer la progression de la qualite des interpretations que Taus obtenons.",
        "Nous antics nate article par note soultsit de rencontrer, kxs du WUNG, des patienanes, franois ou &rangers, qui voudtaient avec Isms 6:hanger des travaux sur ces questions.",
        "AcrEs DE COLING-92, N.orrEs, 23-28 Aoirr 1992 9 8 2 PROC.",
        "COL1NG-92, NANTES, Auo.",
        "23-28, 1992 A SET-THEORETIC APPROACH 10 LEXICAL SEMANIICS D.DUTDIT, MEMODATA."
      ]
    },
    {
      "heading": "INIRODUCTION",
      "text": [
        "We present the results of the work carried out over several years by the Memodata Company on the structure of the French lexicon.",
        "This work has been accomplished thanks to a first research contract with the Ministry of Research and Technology and today has lead to a dictionary of more than 100 000 words and phrases grouped analogically and synonymously.",
        "If we understand quite well how a dictionary like this can be used with ease by humans, we set the problem of the identification of meaning by a computer.",
        "We will evaluate how Dicologique adds information complentary to the information contained in semantic nets.",
        "Thanks to a somewhat unusual construction method and the systematic classification of words according to their meaning, we are progressing to a continuous system of localisation of the meaning itself.",
        "On the map we created, it is possible to compute the meaning due to lexical semantics for any sentence written in natural language..."
      ]
    },
    {
      "heading": "1) GENERAL PURPOSE OF ANALOGICAL DICTIONARES",
      "text": [
        "The purpose of dictionaries grouped under the name \"analogical\" is always the ease of the passage from a word to an idea and the inverse passage from an idea to a word.",
        "This aim is reached by the make up of lists of stereotyped associations and of semantic fields.",
        "The first approach does not have the same likelihood of ending with a satisfactory result as the second.",
        "The stereotyped associations depend on the idea of time, the background and the experience of each individual.",
        "Their record can only be a track of the associative memory from the individual.",
        "On the other hand, the dictionary of semantic fields is perfectly workable at any time ; it is based on the linguistic conventions that the language dictionaries have tried for centuries to record and to normalize.",
        "It is not possible, by definition, to construct a dictionary made up of stereotyped associations, whereas it is possible to work on the complexity of hundreds and thousands of linguistic facts which we have classified.",
        "We will give a mathematical description of the dictionary of the semantic fields.",
        "This approach is in parallel with concrete examples derived from the database."
      ]
    },
    {
      "heading": "2) DESCRIPIION AND UPILISAlION OF 'ME DICTIONARY",
      "text": [
        "The dictionary of analogies and synonyms that has been set up is a structure of sets and words which the conceptual figure (1) shows.",
        "The objects \"wards\" (shown by Wu) are represented in the rectangles and the objects \"sets\" (shown by C,) in the parallelograms.",
        "When moving through Dicologique from the left to the right, we move from the general to the specific.",
        "a) Dernilions inked to the inatiOn fitssa the left to the tight * Suppose we talc c,, a set contained in 0.",
        "The function P(C„ C) measures the depth of the inclusicn.",
        "Example",
        "* Set C can ea vain 1 to xis Ci goes fain 1 to 'I', 4' is the number of subsets duldren of Ci).",
        "* Suppose we take C(C) the set containing all the direct subsets, or children, of C.",
        "* A set C, contains 1 to Y tenninal words (u goes firm I to Y, Y is the number of terminal wads of C).",
        "* Suppose we take A(C) the set of words direcdy children of C.",
        "In our example, function A produces the synceyrns for boat.",
        "Becalm of their politico on the graph we will often consider them as lexical prototypes * Suppose we tale a function M(C).",
        "M(C,) °runts the number of wads in a set C. (M(C) = w) *Suppom We take U(G), the catents of the lexical field of C, ie.",
        "the set of words ccetained in C. U(C) = {W., with 1 < = u < = oi and such that it exists a set Cy containing W. and such that p(c„c>> = O)}",
        "baleiier7, chattier's, pecheixotnenade9 (day boat), U(bateau kegler ee *hem), U(bateau de pecir de *since)\" ).",
        "This function allows to edit, with their structure or without, 1444 verbs currently contained in the set \"changer (to diange/to alter).",
        "Comment : acootding to air example, the fitndion U(kisie 2) weal provide a result quite different final the actual dieficeary Dicologique.",
        "In fact \"leisure\" is a structure with reveral thcosands of words and several levels of intermediate sets we have not shown in figure (2).",
        "b) Property of die graph derived finm thew defiritinns The existence of the function M(C) for all sets C infers that the structures of inclusion are without",
        "loops, i.e. there are sets which are not contained in any other set but the set of the graph G (mot node) itself.",
        "Sets Cdy contained in the RI of tir graph G me named \"pint:tiles\".",
        "C.) Smoak and grammatical characteristics of the sets and words In Dicxilogique there are 9 types of sets : - four types of sets named \"lists\".",
        "They give the quasi synonyms, i.e. lists composed of words which are equivalent in meaning and identical in grammar.",
        "We have the following types of grammatical sets : noun, verb, adjective, adverb.",
        "- die set named \"class\" A set of this type contains nouns which can be subsumed under the same concept.",
        "In our example in figure (2), \"bateau\" is a set containing on the one hand words which represent its prototype values (\"bateau\", \"navire\", \"ernbarcation\") and on the other \"classes\" of specific boats.",
        "- die set named \"telated wads\" Generally, the contents and utilizations of this type of set are rather various.",
        "We need it, for example, to represent the link between \"baleinier\" and \"baleine\"13, which is not shown in figure 2 so as not to weigh down the graph.",
        "- the set named \"theme\" This set contains all the concepts and words associated in a particular semantic field.",
        "It may also contain other sets such as \"related words\" or smaller \"themes\".",
        "- the set named \"descriptice\" It contains the constituents organically connected to a concept.",
        "It is only used when absolutely necessary for a definition.",
        "- the set named \"diamooisfics\" It subsumes words having the same outstanding feature.",
        "For example, our set of class \"bateau edger de Oche\" could be found under a set characterized by the feature \"small\" which differentiates this class from other classes of boats.",
        "As for the words, we have provided them with the usual characteristics, i. e. their morphological classes (grammar) and their image labels (colloquial, archaic, literary ...) which contain the 13bekiie AMES DE COLING-92, NANres, 23-28 Aoirr 1992 9 8 4 PROC, or COLING-92, NANTES, AUG. 23-28, 1992 usual information associated to each word in every dictionary.",
        "d) Use of the previous defiritions in Dicobgique Moving through the dictionary from the general to the particular is a process widely put into practice by users who may either search a precise term to be discovered by intersection of associated concepts or intend to edit a lexical field or a classified list.",
        "Intfiion The logic of the sets takes into account the logical \"and\", \"or\" and negation.",
        "Here are some examples of searches which are always based on the intersection of sets edited by the function U(Cj) : - Search of a please term Search of the name of the \"coiffure du Pape14\".",
        "The intersection of \"Papers\" (theme of 162 words) and \"chapeau' 6\" (list of 180 words) or \"couronne17\" (theme of 33 words) produces the words \"fiare\"\", \"calotte19\" etc.",
        "in 10 seconds on the micro computer.",
        "- Smut of woods to express an idea Search of the verb to express the idea of \"faire tomberm\" and \"couper21\".",
        "The intersection of the two lists of corresponding verbs converges on about 20 words (abattre, decapiter, meter, &rancher ...).",
        "- Seance of synonyms awarding to a context The synonym of \"voler22\" such that the meaning is more suitable for a bee.",
        "The words \"butiner23\" and \"voltiger24\" are immediately produced."
      ]
    },
    {
      "heading": "RiithAoadfiadY",
      "text": [
        "It pitripally has two aims : - to wars' among very wide lists for the terms which help to get a rewire idea.",
        "For example, the list of verbs \"penser25\" contains about 500 structured verbs that allow to move continously through the whole field concerned.",
        "- to have a please idea about a structure.",
        "This is especially interesting for the sets containing predetermined taxonomies.",
        "The edition of the set of class \"animals\" presents the scientific taxonomy of the animal world.",
        "About 4100 indexed animals can be visualized in a structure of 500 classes."
      ]
    },
    {
      "heading": "2.2 MOVING FROWTHERIGFff TOTHELEFT",
      "text": [
        "This is the opposite of the previous work.",
        "It corresponds to moving from the particular to the general.",
        "a) Definitions related to the motion from the right to the left A set named (.)",
        "may be included in 1 to S2 sets Ci (i going from 1 to SI, CI being the number of \"parents\" (main sets) of Ci).",
        "This function permits, therefore, to move upward (towards the root node) in the structure of the sets.",
        "TIE SI claws G constitute the \"quasi definition\" rig Example : In figure (2), the set \"bateau de Oche de plaisance\" is defined by the set of sets h = {{bateau de peche}, {bateau de plai.sance}}.",
        "A terminal word W. can belong to 1 to I sets Ci (i going from 1 to I, I being the number of \"parents\" (main sets) of We).",
        "In Dicologique the direct questioning of a word gives, as in all dictionaries, the \"(quasi)-definition\" of the word.",
        "We /dames Ggne the \"quasi definition\" ofd tem Example : In figure (2), the watch of \"baleinier\" gives the list \"bateau de *le and the act of linked wads \"balcine\".",
        "b) Properties of the G graph we defmed this It exists for every non primitive object of G, 1 to Et\" series of connections which link it to one of these primitives.",
        "All series of coon:Vials far an object tat= together cambium the inheritance ,H °Mils (him'.",
        "c) Use oldie previous dermitions in Dicobgique The table (3) represents the result of a part of the search of the polysemous word \"abattre\".",
        "We have limited the reproduction of the result to the polysemous zone only.",
        "The left column shows the sets containing \"abattre\" directly.",
        "The column in the middle, the type of set concerned.",
        "The right column shows the number of elements in the set concerned.",
        "This result is produced by the computer immediately.",
        "In the first place the elements of the above table lead to the following searches which correspond to moving from the left to the right : * Seanth of syroryins of %battle\" with the 'waning of \"denuire\".",
        "The edition of the structured set \"detruire\" (L) produces the 262 verbs which constitute the set \"detruire\" in alphabetical order.",
        "* Seared of synonyms of \"abaft\" with the meaning of \"coupe?",
        "and \"hie tomber\" We apply the logical function \"AND\" to these sets of verbs and about 20 verbs are produced.",
        "7 to 8 verbs will be left if we add the list \"tier\" as a supplementary constraint.",
        "The processing takes 4 to"
      ]
    },
    {
      "heading": "5 seconds.",
      "text": [
        "Nbriqg horn the partkular to the getrialit is possible to enlarge the idea of \"dthire\" to the sets which include it.",
        "The structured edition of 1400 words contained in the \"changer\" list takes less than a minute on the micro computer.",
        "The motion from the particular to the general offers much fewer functions than the inverse motion.",
        "At the very most it is used to locate.",
        "Often the 26 .",
        "find =Fer-ri ocuperun wire : lo at down a hue",
        "consultation of Dicologique is motivated by the search of synonyms.",
        "The edition of the contents of the terminal nodes of figure 3 appears to be largely enough for human users.",
        "Lecture : tante* Lecture : appartenir I, est lachta dans Fig= 4 a part oft& oancerIzal onit of a\"(L) But the position of the computer is very different : if humans possess the structures necessary for interpreting the terms, i. e. the linguistic heritage and the knowledge of the world, the computer for its part possesses neither of them.",
        "This is why we try to supply it with the lexical knowledge absolutely necessary in a coherent system.",
        "Obviously this knowledge is situated in the inheritance fmm the \"primitives\" to the words.",
        "Let's see an example in which the motion from the right to the left is applied to a problem of automatic indexing in information retrieval."
      ]
    },
    {
      "heading": "2.3 An aurfication to Won:nation retrieval",
      "text": [
        "We want the system to retrieve the lexical key elements of the following small piece of text : \"The accident, on Friday, took place in foggy weather.",
        "The two cars that crashed into each other caused a pile up of about 50 vehicles on the congested national dual carriageway.\"",
        "Strategy for resolution : The strictly lexical analysis of this short passage will be based on the calculation of the surface corresponding to each concept (set) covering one or more words of this document : the more abstract a concept, the bigger its surface.",
        "For every set Cj we have defined its cardinality and its depth in comperison with the primitive P(Ci, Q), with 0 as a primitive and casidering a specific passage from the general to the particular.",
        "Suppose we take Max P(0, Cj) the maximum depth of the graph whatever j might be.",
        "We know, fruit experience, that this maximum depth is attained in detailed enumerations of wads which have very peck meanings and designate conaete things Acres DE COLING-92, Nanrres, 23-28 AU:1T 1992 9 8 6 PRoc.",
        "OF COLING-92, NA6rres, AuG. 23-28, 1992 We define the functien (q) to measure the distance between the concept Cj and the concept that maximizes ROA.",
        "Te surface of a concept is given by the formula as follows : = Ant) * where h specifies the series of connections h kr the calculation of the surface of Ck Notes : I) Each concept possesses h evaluations of its surface accounting for its h series of connections.",
        "2) In reality A(Cj) takes into account a complementary piece of information : the semantic characteristics of sets.",
        "A set of the type \"list\" introduces a more stretched arc than a set of the types \"theme\" or \"related words\".",
        "3) If Dicologique is a general dictionary capable of resolving problems of information retrieval referring to general language, it is very easy to adjust it to a precise problem (for example, the thesaurus of a specific undertaking).",
        "One only has to stretch each arc situated on the passage of the series of connections of each term of the thesaurus.",
        "The surfaces S, which are situated in a norm reference, describe a map of meaning on which all the continuous calculations of Euclidian geometry are made possible.",
        "To resolve our problem, it is possible to keep the mathematical expressions very simple : a simple mean.",
        "Each word of the document is recognized in the dictionary as it activates all the sets containing it according to their specific weights S(Q which depend on their series of connections.",
        "Finally, each set will have been activated k times.",
        "The analysis will take into account as the most relevant set the one which presents the smallest ratio of S(CC)/k.",
        "S(Q/k measures the weight of the concept in the text.",
        "Our dictionary produces the beginning of a Irierarchy in accordance with the conceptual sets which summarize the text given in the example : 1° : car ; 2° : accident ; 3° : road_ The other sets have negligible weights.",
        "The complete analysis (but useless) takes 5 minutes on a compatible computer.",
        "We have finished with the description of the results of our work en the semantic structure of the lexical.",
        "We think it might be interesting if we add a description of the uncurl we use for constricting the map of meaning we have presented above."
      ]
    },
    {
      "heading": "3) MEDICO OF S1RUCIUMNG AND EWING COVIENTS OF ME DICTIONARY",
      "text": [
        "It is difficult to present completely the method of structuring we use as we lack of the supplementary page this would involve.",
        "To put it simply, all of the 100 000 words and current phrases, the 15 000 typified sets have been created manually and are continually worked over again, thanks to a structuring tool specially developed for this purpose.",
        "The 350 000 observations of direct connections of words, the 4 000 000 series of inheritance which we run currently are, proportional to our efforts, increasing daily and of better quality.",
        "The point at issue in this iterative procedure is, of course, to make appear in Dicologique tendencies towards sets of \"primitives\" in the linguistic sense.",
        "The number and articulation of these primitives should be both sufficient and necessary to define the objects depending on them."
      ]
    },
    {
      "heading": "RATHER FROJECIN F'OR THE NEVI",
      "text": [
        "Our will is to continue working on the structure of the lexicon, as to the quantity of vocabulary represented of course, but principally with regard to the quality of the structure of the lexicon.",
        "Moreover, we have been developing basic tools such as the Semiographe for information retrieval which allow us to evaluate the progression of the quality of interpretations we obtain.",
        "If we hope to find partners during COLING 92 who want to join us in our current research projects, we are also very interested in meeting people from foreign universities and firms who would like to launch a version of Dicologique in another language."
      ]
    },
    {
      "heading": "REFERFNCES",
      "text": []
    }
  ]
}
