{
  "info": {
    "authors": [
      "Gábor Prószéky"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1087",
    "title": "Processing Clinical Narratives in Hungarian",
    "url": "https://aclweb.org/anthology/C86-1087",
    "year": 1986
  },
  "references": [
    "acl-P84-1049",
    "acl-P84-1057"
  ],
  "sections": [
    {
      "text": [
        "This paper describes a system That extracts information from Hungarian descriptive texts of medical, domain.",
        "Texts of clinical narratives define a suhlanguage that uses limited syntax but holds the main characteristics of the language, namely free word order and rich morphology.",
        "We offer a fairly general parsing method for free word order languages and the way how to use it for parsing Hungarian clinical.",
        "texts.",
        "The system can handle simple cases of ellipses, anaphora, unknown words and typical abbreviations of clinical practice.",
        "The system translates texts of anamneses, patient visits, laboratory tests, medical examinations and discharge summaries into OM information format usable for a medical expert system.",
        "Simil.arly to this expert system, the information formatting program has been written in MPROLOG language and its experimental_ version runs on PROPER-16, a Hungarian made (IBM-XT compatible) microcomputer.",
        "paRvIrw In the pass; few years we have developed a computational_ system to analyze Hungarian texts using a morphological.",
        "analyzer (Preszeky et al. 1982) and a gerlF3F2l parsing program called ANAGRAMMA (EANAlytic GRAMMAr) (PrOsz6ky 1984).",
        "The whole system for iuformation formatting is based on those modules and consists of five consequent parts: (i) morphological analysis, (ii) normalization, (iii) parsing, (iv) evaluation, (v) mapping into the information format.",
        "The last block 15 an operation that converts the output of ANAGRAMMA, which is (ii)+(iii)t(iv), to a format that can he used by a medical expert system.",
        "The approach leads to a structure shown by Figure 1."
      ]
    },
    {
      "heading": "2. MORPHOLOGICAL ANALYSIS",
      "text": [
        "The first phase is the morphological analysis of word forms.",
        "Hungarian is a free word order language, therefore the role of suffixes is very important from the viewpoint of identifying phrasal constituents.",
        "A lot of syntactic and semantic information (number, person, possession, case, tense, mood etc.)",
        "are carried by these elements.",
        "The concatenation of stem and suffixes is sometimes rather complex: there are suffixes that have different stem – dependent forms and stems that have different suffix-dependent forms.",
        "Thus the lexicon must contain all the possible variants of the stems as independent entries or we have to define on algorithm for constructing the real.",
        "sterns from the archiphonemes of the lexicon.",
        "We have chosen the former alternative.",
        "[lie lexicon consists of four parts hut only conceptually.",
        "Erom the point of view of the algorithm, it is an integral whole.",
        "The reasons why we distinguish its parts are 8S follows:",
        "(i) All the NL processing programs of an agglutinative language must know all.",
        "the grammatical morphemes of the language.",
        "(ii) The dictionary of common expressions is not neceRsary hut it is a useful.",
        "part of all NL systems.",
        "This module can be enlarged by the user.",
        "1) limo t /I 0_1.1 1, WU, Ul.",
        ".1,]",
        "the lexical elements-Ehat is needed for the actual type of applicatiun (ON querying, updating, information extraction, translation etc.).",
        "(iv) The special lexicon contains terms of the actual application field (in our case the terms of medical science).",
        "This module can, of course, lie enlarged by the user.",
        "After updating the lexicon, entries will he arranged in alphabetical.",
        "order.",
        "The morphological analyzer is a finite state automaton mnr:If.",
        "Taos a word-to he analyzed from the input sequence of words and searches the dictionary in order to find the input word.",
        "If the luft part of the word matches a dictionary entry, the entry's informational part must he copied to the working buffer.",
        "The content of this buffer will he the input to the syntactical analyzer.",
        "Then the automaton begins to work from right to left.",
        "Its output is the sequence of the informational parts of the grammatical morphemes standing after the stem we identified a short while ago.",
        "If the luformation of the stem and the suffixes are not compatible or there remained an UH-procesed part in the word, the algorithm tries to analyze the word as a compound once more and if this process fails then it asks the user what to do.",
        "Figure 2 is an illustration of this process.",
        "(The \"origin\" of the entries is marked by C, C, A and S, that is grammatical, common, actual and special lexicon, respectively.)"
      ]
    },
    {
      "heading": "3. PROBLEMS OF PARSING",
      "text": [
        "The well_ known methods generally utilized for parsing NLs are not convenient for treating languages like Hungarian, Finnish, Esthonian or Japanese, cf. (Neli-markka et al.",
        "1984),(TsiIii et al. 1984),(Pr6szeky 1984).",
        "In these languages, the suffixes carry nut most of the",
        "task of marking grammatical function, therefore, the word order -- strictly speaking, the phrase order will he relatively free.",
        "So we must turn our attention to (i) the internal structure of the phrases and (ii) the order of phrases (and the intonation, of course only in speech) that plays an important role in expressing communicative functions.",
        "The basic idea of the strategy we propose builds on the invariants of the sentence structure of free word order languages, that is, (i) the first thing to do is to recognize the internal structure of the parts of speech and (ii) the second is to interpret their relative order.",
        "This order is connected with the communicative roles (topic, focus etc.)",
        "of the structure.",
        "The syntactic analysis of free word order sentences is based upon the morphemes identified by morphological analysis.",
        "The lexicon cannot help us to give 'the actual functional role of a morpheme because of two reasons:",
        "(i) All possible functional roles of a morpheme cannot be listed.",
        "(ii) If there were several possible roles in the description of morphemes nobody would know which of them to use actually.",
        "4.",
        "UNKNOWN ELEMENTS",
        "The problems of the unknown elements can arise not only in the case of computational analysis, since people may read/hear morphemes never read/heard before, yet they can identify the actual syntactic role of them without any knowledge of any previous syntactical categorization.",
        "The category or word class of a word is statistical information about its occurrence in particular syntactic positions.",
        "For example, the word 'beteg' can be a noun ('patient') or an adjective in Hungarian.",
        "It is an adjective in adjectival use, that is without inflections or before adjectival suffixes: 'El6zOleg soha nem volt beteg.' ('He has never been ill before.') 'Hat napja fekszik hetegen.' ('He has been laid up since six days.') The same morpheme can, however, be a noun before nominal suffixes: 'A betegnek nem volt infarktusa.' ('The patient has had no infarctions.') Although we consider categorization as a syntactic generalization, we do not claim that there are no independent syntactical categories.",
        "In agglutinative languages such categories are e.g. the nominal suffixes just mentioned.",
        "These categories are not arbitrary, because one cannot introduce a new suffix to the language, but can, however, use new stems in the sentence.",
        "If the parser knows these regularities, then lexical categories will he used for control only."
      ]
    },
    {
      "heading": "5. SENTENCE STRUCTURE IN AGGLUTINATIVE LANGUAGES",
      "text": [
        "Below we will make use of Hungarian examples to show the most important properties of a typical agglutinative language.",
        "In a simple sentence there can be only one finite verbal suffix.",
        "If we have a sentence containing two of them, then we have to do with coordinate clauses or one sentence with a subordinate clause.",
        "Naturally, the finite suffix is immediately preceded by a verbal stem.",
        "If the sentence has no finite verbal.",
        "suffixes, (i) it contains a 0-copula that is rather frequent, not only in medical texts but also in the everyday Hungarian or (ii) there is ellipsis in the sentence.",
        "The non-finite verbal suffixes are also preceded by a verbal stem.",
        "These elements can behave differently according to whether or not they influence the word order of other elements.",
        "We consider the noun as an element that stands before a nominal suffix group.",
        "Sometimes the lexicon does not categorize theis morpheme as a noun.",
        "We consider this situation as a case of a missing noun.",
        "Regeneration of missing elements is important because of identifying elliptical constructions.",
        "For example, Hungarian adjectives can have nominal endings when no noun occurs in the structure.",
        "As it seems, most of 'the morphemes do not have a fixed lexical category, because their positions in the sentence actually define their functional role.",
        "But we have some important lexical features:",
        "(i) Stems .",
        "They are closed morphologically to 'the left and open to the right (formally: <stem ).",
        "\"Open\" means an ability 'to join other elements.",
        "In the case U.I.",
        "'Jowl-like Ill Ius U less uu Li ICC' 1::LIAll-j1 I Li are, fur example, the case suffixes.",
        "(ii) Suffixes.",
        "They are closed morphologically to the right and open to the left ( suffix> ), e.g. the case endings.",
        "(iii) Open endings.",
        "They are open morphologically on both sides ( open ), e.g. the morphemes marking plurality or possessivity.",
        "(iv) Closed elemnts.",
        "They are closed on both sides ( <closed> ), e.g. adjectives, numerals, adverbials.",
        "So, if a closed side immediately precedes an open one or an open one a closed one, the parser has to correct the \"wrong\" sequence inserting an empty morpheme: (a) <stem <closed>►<stem suffix >< closed> (b) < closed> suffix)--a.<closed> <stem suffix> Instance (a) can be, for example, a genitive case-insertion (as this case ending can sometimes have an empty form in Hungarian) and instance (b) can be a noun insertion between an adjectival stem and a nominal suffix."
      ]
    },
    {
      "heading": "6. PARTS OF SPEECH",
      "text": [
        "The surface scheme of a Hungarian sentence is the following: ( N>\"<V NF>4)*<V F> ( <A>*<S N)''‹V NF>*)* where A stands for adverbials, S for nominal and V for verbal stems, N for nominal case endings, F for finite and NF for non-finite verbal suffixes.",
        "Hence the types of the constituents are as follows:",
        "(i) independent adverbials (without any suffix), (ii) non-finite verbs (e.g. infinitive, gerund), (iii) nominal groups with case ending, (iv) a verb plus a finite suffix (the main verb of the sentence).",
        "Having made clear the internal structure of the constituents, the parser can deal with the formal evaluation of the connections between the constituents (e.g. verb and complements, possessives and possessors",
        "etc,).",
        "In the first part of the parsing we do not need any S-symbols, more precisely, any string over a particular set, the parts of speech, can serve as 5 symbol.",
        "The main parts of speech can be described with a help of the schemes (i.",
        ")-(iv), but in fact, only (ii) and (iii) arc important.",
        "Adverhi.als of type (1) usually consist of one element and every sentence has one and only one structure of type (iv).",
        "Sentences rather frequently consist of more than two constituents, hut in a free word order language there is no typical primary order of these constituents.",
        "Our method is based on this observation.",
        "We do not describe the structural relations in the sentence sequentially from the left to the right end of the sentence.",
        "Our rules form blocks and these blocks are used in en order depending on the elements of the actual sentence.",
        "7.",
        "ANAGRAMMA Between the morphological analysis and the parsing we need a normalization procedure that inserts the missing morphemes on the basis of the formal lexical.",
        "properties of the elements of the input string.",
        "If the input string includes interjective signs or words and (i) this sign means subordination, then it seems to he obvious to take the embedded string out and handle it like an independent sentence, or (ii) this sign or word means co-ordination, then we will elaborate the coordinate structures parallel:1y.",
        "So, to analyze a simple sentence of Hungarian, the ANAGRAMMkparser would begin with the question 'Is there any substring of the sentence to he parsed that has the form of the first rule's left hand side?'.",
        "If the answer is 'yes', the right side of the same rule is substituted as many times as the substring occurs in the sentence.",
        "For example: The rule: AOJ N2 N1 The sentence",
        "• OFT AOJ N2 CAS1 OFT ADJ N2 CAS1 V FIN1 to be parsed'",
        "The result: OFT NI CAS] []LT NI CAS1 V FIN1 If the sentence does not contain the substring, the next rule follows.",
        "In this way all rules can lie applied once only, although ...10l10.1 we would probably have to use them more than once.",
        "The repeated use of the rules can ho realized with the help of cycles:",
        "4: CAS1 V ADM ADJ 5: AOJ N2 NI 6: OFT NI N 7: N CAS1 --- CAS 8: ADJ CAS1 CAS 9: V FIN1 FIN • • 5: DET TT N CAS1 V ADM N2 CAS1 DET NI CAS1 VEIN].",
        ".",
        "6: PET N .",
        "CAS1 V ADJ) N2 CAS1 N CAS1 V FIN1 .",
        "7: DET CAS V AIM N2 CAS1 [As V FIN1 .",
        "4: TT AAl N2 CAS1 CAS V FIN1.",
        ".",
        "5: TT N1 CAT_ GAS V FINI .",
        "6: N CAS1 CAS V FIN1.",
        ".",
        "7: CAS CAS V FIN1.",
        ".",
        "9: CAS CAS FIN .",
        "Figlie 4",
        "The parsing is over if (i) all elements of the actual.",
        "string to he parsed are from the distinguished set (e.g. CAS and PIN in the above example), or (ii) the algorithm is after the last rule and there is no acceptable cycle-end after this rule.",
        "We say that the algorithm cannot interpret the sentence if there have remained other than distinguished elements.",
        "The parser can operate more quickly if the rules in the same package give the description of the same grammatical phenomenon.",
        "Such modules consist of rule, the left sides of which are similar.",
        "If a package contains only rules whose left side does not contain any element of the sentence to be parsed, then it can be omitted.",
        "We can use this method of simplification without much ado, owing to an X-like formalism that guarantees that no new symbols can be born as a result of application of the rewriting rules.",
        "We use decreasing bar levels alike the formal.",
        "derivation process does withewents."
      ]
    },
    {
      "heading": "8. EVALUATION",
      "text": [
        "The evaluation module is essentially a pattern matching algorithm that ifientilies the link between (i) the predicates and their arguments, (ii.)",
        "the anaphoric elements and their antecedents, and (iii) the\"parallel\" structures separated by the normalizer.",
        "The lexical.",
        "forms of predicates contain the surface case endings and the semantic role of the needed constituents,therefore the algorithm has to look for these constituents and order the new features given to them by the pre-dcate.The identification of the antecedents of anaphoric elements is similar, but antecedents often occur in previous sentences.",
        "Therefore the evaluator can set up a connection with the analyzed form of the same paragraph."
      ]
    },
    {
      "heading": "9. MAPPING INTO INFORMATION FORMAT",
      "text": [
        "After some consultation with physicians it was possible to establish the specialized concept classes and the patterns of the concept class co-occurrence from which the information format could be defined.",
        "The nouns in the lexicon are subcategorized by their membership in these classes.",
        "Most classes are mapped into the appro,priate slot:, because the names of the classes are the labels of the slots of the frames used by tile expert system.",
        "Figure 5 shows the form of the formatted text:"
      ]
    },
    {
      "heading": "10. REFERENCES",
      "text": [
        "The kernel of the cycle is a sequential rule package and its condition is the quantity of rules applied at the last pass over the cycle.",
        "If it is not 0, then the algorithm continues at the first rule of the package.",
        "If it is 0, that is, there were no such applications, the rule of the next number has to be applied.",
        "A trace of an ANAGRAMMA parsing: DET TT ADJNI2 C4S1 V ADJ1 N2 CAS1 TT Apt] N2 CAS1 V FIN1 ."
      ]
    }
  ]
}
