{
  "info": {
    "authors": [
      "Paola Merlo"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P92-1040",
    "title": "An LR Category-Neutral Parser With Left Corner Prediction",
    "url": "https://aclweb.org/anthology/P92-1040",
    "year": 1992
  },
  "references": [
    "acl-C86-1010",
    "acl-C86-1050",
    "acl-P85-1010"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper we present a new parsing model of linguistic and computational interest.",
        "Linguistically, the relation between the parser and the theory of grammar adopted (Government and Binding (GB) theory as presented in Chomsky(1981, 1986a,b) is clearly specified.",
        "Computationally, this model adopts a mixed parsing procedure, by using left corner prediction in a modified LR parser."
      ]
    },
    {
      "heading": "ON LINGUISTIC THEORY",
      "text": [
        "For a parser to be linguistically motivated, it must be transparent to a linguistic theory, under some precise notion of transparency (see Abney 1987).",
        "GB theory is a modular theory of abstract principles.",
        "A parser which encodes a modular theory of grammar must fulfill apparently contradictory demands: for the parser to be explanatory it must maintain the modularity of the theory, while for the parser to be efficient, modularization must be minimized so that all potentially necessary information is available at all times.1 We explore a possible solution to this contradiction.",
        "We observe that linguistic information can be classified into 5 different classes, as shown in (1), on the basis of their informational content.",
        "These we will call IC Classes.",
        "(1) a. Configurations: sisterhood, c-command, m-command, ±maximal projection ... b. Lexical features: ±N, ±V, ±Funct, ±c-selected, ±Strong Agr c. Syntactic features: ±Case, ±9, ±7, ±barrier.",
        "d. Locality information: minimality, binding, antecedent government.",
        "e. Referential information: ±D-linked, ±anaphor, ±pronominal.",
        "This classification can be used to specify precisely the amount of modularity in the parser.",
        "Berwick(1982:400ff) shows that a modular system is efficient only if modules that depend on each other are compiled, while independent modules are not.",
        "We take the notion of dependent and independent to correspond to IC Classes, in that primitives that belong to the same IC Class are dependent on each other, while primitives that belong to different IC Classes are independent from each other.",
        "We impose a modularity requirement that makes precise predictions for the design of the parser.",
        "Modularity Requirement (MR) Only primitives that belong to the same IC Class can be compiled in the parser."
      ]
    },
    {
      "heading": "RECOVERING PHRASE STRUCTURE",
      "text": [
        "According to the MR, notions such as headedness, directionality, sisterhood, and maximal projection can be compiled and stored in a data structure, because these notions belong to the same IC Class, configurations.",
        "These features are compiled into context-free rules in our parser.",
        "These basic X rules are augmented by A rules licensed by the part of Trace theory that deals with configurations.",
        "The crucial feature of this grammar is that nonterminals specify only the X projection level, and not the category.",
        "The full context-free grammar is shown in Figure 1.",
        "The recovery of phrase structure is a crucial component of a parser, as it builds the skeleton which is needed for feature annotation.",
        "It must be efficient and it must fail as soon as an error is encountered, in order to limit backtracking.",
        "An LR(k) parser (Knuth 1965) has these properties, since it is deterministic on unambiguous input, and it has been proved to recognize only.",
        "valid prefixes.",
        "In our parser, we compile the grammar shown above into an LALR(1) (Aho and Ullman 1972) parse table.",
        "The table has been modified",
        "in order to have more than one action for each table entry.2 Three stacks are used: a stack for the states traversed so far; a stack for the semantic attributes associated with each of the nodes; a tree stack of partial trees.",
        "The LR algorithm is encoded in a parse predicate, which establishes a relation between two sets of 5-tuples, as shown in (2).2",
        "(2) TixSixAixCixPTi--,Tix.SixkxCixPT;",
        "Our parser is more elaborate and less restrictive than a standard LR parser, because it imposes conditions on the attributes of the states and it is nondeterministic.",
        "In order to reduce the amount of nondeterminism, some predictive power has been introduced.",
        "The cooccurence restrictions between categories, and subcategorization information of verbs is compiled in a table, which we call Left Corner Prediction Table (LC Table).",
        "By looking at the current token, at its category label, and its subcategorization frame, the number of choices of possible next states can be restricted.",
        "For instance, if the current token is a verb, and the LR table allows the parser either to project one level up to V', or it requires to create an empty object NP, then, on consulting the subcategorization information, the parser can eliminate the second option as incorrect if the verb is intransitive."
      ]
    },
    {
      "heading": "RESULTS AND COMMENTS",
      "text": [
        "The design presented so far embodies the MR, since it compiles only dependent features in two tables off-line.",
        "Compared to the use of partially or fully instantiated context-free grammars, this 'This modification is necessary because the grammar compiled into the LR table is not an LR grammar.",
        "'In (2) Tk is an element of the set of input tokens, Skis an element of the set of states in the LR table, Ak is an element of the set of attributes associated with each state in the table, Ck is an element of the set of chains, i.e. displaced element, and PTk is an element of the set of tokens predicted by the left corner table (see below).",
        "organization of the parsing algorithms has been found to be better on several grounds.",
        "Consider again the X grammar that we use in the parser, shown in Figure 1.",
        "One of the crucial features of this grammar is that the nonterminals are specified only for level and headedness.",
        "This version of the grammar is a recent result.",
        "In previous implementations of the parser, the projections of the head in a rule were instantiated: for instance NP --+ YP .",
        "Empirically, we find that on compiling the partially instantiated grammar the number of rules is increased proportionately to the number of categories, and so is the number of conflicts in the table.",
        "Figure 2 shows the relative sizes of the LALR(1) tables and the number of conflicts.",
        "Moreover, on closer inspection of the entries in the table, categories that belong to the same level of projection show the same reduce/reduce conflicts.",
        "This means that introducing unrestricted categorial information increases the size of the table without decreasing the number of conflicts in each entry, i.e. without reducing the nondeterminism in the table.",
        "These findings confirm that categorial information can be factored out of the compiled table, as predicted by the MR.",
        "The information about cooccurrence restrictions, category and subcategorization frame is compiled in the Left Corner (LC) table, as described above.",
        "Using two compiled tables that interact on-line is better than compiling all the information into a fully instantiated, standard context-free grammar for several reasons.4 Computationally, it is more efficient.5 Practically, manipulating a small, highly abstract grammar is 4Fully instantiated grammars have been used, among others, by Tomita(1985) in an LR parser, and by Dorr(1990), Fong(1991) in GB-based parsers.",
        "much easier.",
        "It is easy to maintain and to embed in a full-fledged parsing system.",
        "Linguistically, a fully-instantiated parser would not be transparent to the theory and it would be language dependent.",
        "Finally, it could not model some experimental psycholinguistic evidence, which we present below."
      ]
    },
    {
      "heading": "PSYCHOLINGUISTIC SUPPORT",
      "text": [
        "A reading task is presented in Frazier and Rayner 1987 where eye movements are monitored: they find that in locally ambiguous contexts, the ambiguous region takes less time than an unambiguous counterpart, while a slow down in processing time is registered in the disambiguating region.",
        "This suggests that selection of major categorial information in lexically ambiguous sentences is delayed.6 This delay means that the parser must be able to operate in absence of categorial information, making use of a set of category-neutral phrase structure rules.",
        "This separation of item-dependent and item-independent information is encoded in the grammar used in our parser.",
        "A parser that uses instantiated categories would have to store categorial cooccurence restrictions in a different data structure, to be consulted in case of lexically ambiguous inputs.",
        "Such design would be redundant, because categorial information would be encoded twice."
      ]
    },
    {
      "heading": "CONCLUSION",
      "text": [
        "The module described in this paper is implemented and embedded in a parser for English of limited coverage, but it has some shortcomings, which axe currently under investigation.",
        "Refinements are needed to compile the LC table automatically, to define IC Classes predictively instead of by exhaustive listing.",
        "Finally, a formal proof is needed to show that our definition of independent and dependent is always going to increase efficiency."
      ]
    },
    {
      "heading": "ACKNOWLEDGEMENTS",
      "text": [
        "This work has benefited from suggestions by Bonnie Dorr, Paul Gorrell, Eric Wehrli and Amy Weinberg.",
        "The author is supported by a Fellowship from the Swiss-Italian Foundation.",
        "6 For instance, in the sentences in (3), (from Frazier and Rayner 1987) the ambiguous target item, shown in capitals in (3)a, takes less time than the unambiguous control in (3)b, while there is a slow down in the disambiguating material (in italics).",
        "(3) a.",
        "The warehouse FIRES numerous employees each year.",
        "b.",
        "That warehouse fires numerous employees each year."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
