{
  "info": {
    "authors": [
      "Yoav Seginer"
    ],
    "book": "45th Annual Meeting of the Association of Computational Linguistics",
    "id": "acl-P07-1049",
    "title": "Fast Unsupervised Incremental Parsing",
    "url": "https://aclweb.org/anthology/P07-1049",
    "year": 2007
  },
  "references": [
    "acl-E95-1020",
    "acl-N06-1020",
    "acl-P02-1017",
    "acl-P04-1061",
    "acl-P06-1109",
    "acl-W00-0717",
    "acl-W06-2912"
  ],
  "sections": [
    {
      "text": [
        "Institute for Logic, Language and Computation Universiteit van Amsterdam Plantage Muidergracht 24 1018TV Amsterdam The Netherlands yseginer@science.uva.nl",
        "This paper describes an incremental parser and an unsupervised learning algorithm for inducing this parser from plain text.",
        "The parser uses a representation for syntactic structure similar to dependency links which is well-suited for incremental parsing.",
        "In contrast to previous unsupervised parsers, the parser does not use part-of-speech tags and both learning and parsing are local and fast, requiring no explicit clustering or global optimization.",
        "The parser is evaluated by converting its output into equivalent bracketing and improves on previously published results for unsupervised parsing from plain text."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Grammar induction, the learning of the grammar of a language from unannotated example sentences, has long been of interest to linguists because of its relevance to language acquisition by children.",
        "In recent years, interest in unsupervised learning of grammar has also increased among computational linguists, as the difficulty and cost of constructing annotated corpora led researchers to look for ways to train parsers on unannotated text.",
        "This can either be semi-supervised parsing, using both annotated and unannotated data (McClosky et al., 2006) or unsupervised parsing, training entirely on unan-notated text.",
        "The past few years have seen considerable improvement in the performance of unsupervised parsers (Klein and Manning, 2002; Klein and Manning, 2004; Bod, 2006a; Bod, 2006b) and, for the first time, unsupervised parsers have been able to improve on the right-branching heuristic for parsing English.",
        "All these parsers learn and parse from sequences of part-of-speech tags and select, for each sentence, the binary parse tree which maximizes some objective function.",
        "Learning is based on global maximization of this objective function over the whole corpus.",
        "In this paper I present an unsupervised parser from plain text which does not use parts-of-speech.",
        "Learning is local and parsing is (locally) greedy.",
        "As a result, both learning and parsing are fast.",
        "The parser is incremental, using a new link representation for syntactic structure.",
        "Incremental parsing was chosen because it considerably restricts the search space for both learning and parsing.",
        "The representation the parser uses is designed for incremental parsing and allows a prefix of an utterance to be parsed before the full utterance has been read (see section 3).",
        "The representation the parser outputs can be converted into bracketing, thus allowing evaluation of the parser on standard treebanks.",
        "To achieve completely unsupervised parsing, standard unsupervised parsers, working from part-of-speech sequences, need first to induce the parts-of-speech for the plain text they need to parse.",
        "There are several algorithms for doing so (Schütze, 1995; Clark, 2000), which cluster words into classes based on the most frequent neighbors of each word.",
        "This step becomes superfluous in the algorithm I present here: the algorithm collects lists of labels for each word, based on neighboring words, and then directly uses these labels to parse.",
        "No clustering is performed, but due to the Zipfian distribution of words, high frequency words dominate these lists and parsing decisions for words of similar distribution are guided by the same labels.",
        "Section 2 describes the syntactic representation used, section 3 describes the general parser algorithm and sections 4 and 5 complete the details by describing the learning algorithm, the lexicon it constructs and the way the parser uses this lexicon.",
        "Section 6 gives experimental results."
      ]
    },
    {
      "heading": "2. Common Cover Links",
      "text": [
        "The representation of syntactic structure which I introduce in this paper is based on links between pairs of words.",
        "Given an utterance and a bracketing of that utterance, shortest common cover link sets for the bracketing are defined.",
        "The original bracketing can be reconstructed from any of these link sets.",
        "An utterance is a sequence of words (xi,..., xn) and a bracket is any subsequence (xj,..., Xj) of consecutive words in the utterance.",
        "A set B of brackets over an utterance U is a bracketing of U if every word in U is in some bracket and for any X, Y e B either X n Y = 0, X C Y or Y C X (non-crossing brackets).",
        "The depth of a word x e U under a bracket B e B (x e B) is the maximal number of brackets X1,..., Xn e B such that x e X1 C ... C Xn C B .A word x is a generator of depth d of B in B if x is of minimal depth under B (among all words in B) and that depth is d. A bracket may have more than one generator.",
        "A common cover link over an utterance U is a triple x - – y where x, y e U, x = y and d is a nonnegative integer.",
        "The word x is the base of the link, the word y is its head and d is the depth of the link.",
        "The common cover link set RB associated with a bracketing B is the set of common cover links over",
        "U such that x - – y e RB iff the word x is a generator of depth d of the smallest bracket B e B such that x, y e B (see figure 1(a)).",
        "Given RB, a simple algorithm reconstructs the bracketing B: for each word x and depth 0 < d,",
        "Figure 1: (a) The common cover link set RB of a bracketing B, (b) a representative subset R of RB, (c) the shortest common cover link set based on R.",
        "create a bracket covering x and all y such that for some d' < d, x – > y e RB.",
        "Some of the links in the common cover link set RB are redundant.",
        "The first redundancy is the result of brackets having more than one generator.",
        "The bracketing reconstruction algorithm outlined above can construct a bracket from the links based at any of its generators.",
        "The bracketing B can therefore be reconstructed from a subset R C RB if, for every bracket B e B, R contains the links based at least at one generator of B.",
        "Such a set R is a representative subset of RB (see figure 1(b)).",
        "A second redundancy in the set RB follows from the linear transitivity of R#:",
        "Lemma 1 Ify is between x and z, x - – y e Rb and y - – z e Rb then x - – z e Rb where if there is a link y – x e Rb then d = max(d1, d2) and d = d1otherwise.",
        "This property implies that longer links can be deduced from shorter links.",
        "It is, therefore, sufficient to leave only the shortest necessary links in the set.",
        "Given a representative subset R of RB, a shortest common cover link set of Rb is constructed by removing any link which can be deduced from shorter links by linear transitivity.",
        "For each representative subset R C RB, this defines a unique shortest common cover link set (see figure 1(c)).",
        "Given a shortest common cover link set S, the bracketing which it represents can be calculated by",
        "'From the bracket reconstruction algorithm it can be seen that links of depth 0 may never be dropped.",
        "(a) dependency structure (b) shortest common cover link set",
        "first using linear transitivity to deduce missing links and then applying the bracket reconstruction algorithm outlined above for RB.",
        "Having defined a link-based representation of syntactic structure, it is natural to wonder what the relation is between this representation and standard dependency structures.",
        "The main differences between the two representations can all be seen in figure 2.",
        "The first difference is in the linking of the NP the boy.",
        "While the shortest common cover link set has an exocentric construction for this NP (that is, links going back and forth between the two words), the dependency structure forces us to decide which of the two words in the NP is its head.",
        "Considering that linguists have not been able to agree whether it is the determiner or the noun that is the head of an NP, it may be easier for a learning algorithm if it did not have to make such a choice.",
        "The second difference between the structures can be seen in the link from know to sleeps.",
        "In the shortest common cover link set, there is a path of links connecting know to each of the words separating it from sleeps, while in the dependency structure no such links exist.",
        "This property, which I will refer to as adjacency plays an important role in incremental parsing, as explained in the next section.",
        "The last main difference between the representations is the assignment of depth to the common cover links.",
        "In the present example, this allows us to distinguish between the attachment of the external (subject) and the internal (object) arguments of the verb.",
        "Dependencies cannot capture this difference without additional labeling of the links.",
        "In what follows, I will restrict common cover links to having depth 0 or 1.",
        "This restriction means that any tree represented by a shortest common cover link set will be skewed - every subtree must have a short branch.",
        "It seems that this is indeed a property of the syntax of natural languages.",
        "Building this restriction into the syntactic representation considerably reduces the search space for both parsing and learning."
      ]
    },
    {
      "heading": "3. Incremental Parsing",
      "text": [
        "To calculate a shortest common cover link for an utterance, I will use an incremental parser.",
        "Incre-mentality means that the parser reads the words of the utterance one by one and, as each word is read, the parser is only allowed to add links which have one of their ends at that word.",
        "Words which have not yet been read are not available to the parser at this stage.",
        "This restriction is inspired by psycholinguistic research which suggests that humans process language incrementally (Crocker et al., 2000).",
        "Ifthe incrementality of the parser roughly resembles that of human processing, the result is a significant restriction of parser search space which does not lead to too many parsing errors.",
        "The adjacency property described in the previous section makes shortest common cover link sets especially suitable for incremental parsing.",
        "Consider the example given in figure 2.",
        "When the word the is read, the parser can already construct a link from know to the without worrying about the continuation of the sentence.",
        "This link is part of the correct parse whether the sentence turns out to be I know the boy or I know the boy sleeps.",
        "A dependency parser, on the other hand, cannot make such a decision before the end of the sentence is reached.",
        "If the sentence is I know the boy then a dependency link has to be created from know to boy while if the sentence is I know the boy sleeps then such a link is wrong.",
        "This problem is known in psycholinguistics as the problem of reanalysis (Sturt and Crocker, 1996).",
        "Assume the incremental parser is processing a prefix (x1,..., xk) of an utterance and has already deduced a set of links L for this prefix.",
        "It can now only add links which have one of their ends at xk and it may never remove any links.",
        "From the definitions in section 2.2 it is possible to derive an exact characterization of the links which may be added at each step such that the resulting link set represents some bracketing.",
        "It can be shown that any shortest common cover link set can be constructed incrementally under these conditions.",
        "As the full specification of these conditions is beyond the scope of this paper, I will only give the main condition, which is based on adjacency.",
        "It states that a link may be added from x to y only if for every z between x and y there is a path of links (in L) from x to z but no link from z to y.",
        "In the example in figure 2 this means that when the word sleeps is first read, a link to sleeps can be created from know, the and boy but not from I.",
        "Given these conditions, the parsing process is simple.",
        "At each step, the parser calculates a nonnegative weight (section 5) for every link which may be added between the prefix (x 1,..., xk-1) and xk.",
        "It then adds the link with the strongest positive weight and repeats the process (adding a link can change the set of links which may be added).",
        "When all possible links are assigned a zero weight by the parser, the parser reads the next word of the utterance and repeats the process.",
        "This is a greedy algorithm which optimizes every step separately."
      ]
    },
    {
      "heading": "4. Learning",
      "text": [
        "The weight function which assigns a weight to a candidate link is lexicalized: the weight is calculated based on the lexical entries of the words which are to be connected by the link.",
        "It is the task ofthe learning algorithm to learn the lexicon.",
        "The lexicon stores for each word x a lexical entry.",
        "Each such lexical entry is a sequence of adjacency points, holding statistics relevant to the decision whether to link x to some other word.",
        "These statistics are given as weights assigned to labels and linking properties.",
        "Each adjacency point describes a different link based at x, similar to the specification of the arguments of a word in dependency parsing.",
        "a finite set P = {Stop, In*, In, Out} of linking properties.",
        "The Stop specifies the strength of non-attachment, In and Out specify the strength of inbound and outbound links and In* is an intermediate value in the induction of inbound and outbound strengths.",
        "A lexicon L is a function which assigns each word w e W a lexical entry (..., A-2, A-1, Af, Af,...).",
        "Each of the Aw is an adjacency point.",
        "Each Aw is a function Aw : L(W) U P – R which assigns each label in L(W) and each linking property in P a real valued strength.",
        "For each Aw, #(Aw) is the count of the adjacency point: the number of times the adjacency point was updated.",
        "Based on this count, I also define a normalized version of Aw: Aw(1)= Aw(1)/#(Aw).",
        "Given a sequence of training utterances (Ut)0<t, the learner constructs a sequence of lexicons (Ls)0<sbeginning with the zero lexicon L0 (which assigns a zero strength to all labels and linking properties).",
        "At each step, the learner uses the parsing function PLs based on the previously learned lexicon Ls to extend the parse L of an utterance Ut.",
        "It then uses the result of this parse step (together with the lexicon Ls) to create a new lexicon Ls+1 (it may be that Ls = Ls+1).",
        "This operation is a lexicon update.",
        "The process then continues with the new lexicon Ls+1.",
        "Any of the lexicons Ls constructed by the learner may be used for parsing any utterance U, but as s increases, parsing accuracy should improve.",
        "This learning process is open-ended: additional training text can always be added without having to rerun the learner on previous training data.",
        "To define a lexicon update, I extend the definition of an utterance to be U = (0^, x1,..., xn, 0r) where 0^ and 0r are boundary markers.",
        "The property of adjacency can now be extended to include the boundary markers.",
        "A symbol a e U is adjacent to a word x relative to a set of links L over U if for every word z between x and a there is a path of links in L from x to z but there is no link from z to a.",
        "In the following example, the adjacencies of x1 are 0^, x2 and x3:",
        "If a link is added from x2 to x3, x4 becomes adjacent to x1 instead of x3 (the adjacencies of x1 are then 0^,",
        "The positions in the utterance adjacent to a word x are indexed by an index i such that i < 0 to the left of x, i > 0 to the right of x and |i| increases with the distance from x.",
        "The parser may only add a link from a word x to a word y adjacent to x (relative to the set of links already constructed).",
        "Therefore, the lexical entry of x should collect statistics about each of the adjacency positions of x.",
        "As seen above, adjacency positions may move, so the learner waits until the parser completes parsing the utterance and then updates each adjacency point Af with the symbol a at the ith adjacency position of x (relative to the parse generated by the parser).",
        "It should be stressed that this update does not depend on whether a link was created from x to a.",
        "In particular, whatever links the parser assigns, Ax-1) and Af are always updated by the symbols which appear immediately before and after x.",
        "The following example should clarify the picture.",
        "Consider the fragment:",
        "All the links in this example, including the absence of a link from box to on, depend on adjacency points of the form Af-1) and Af which are updated independently of any links.",
        "Based on this alone and regardless of whether a link is created from put to on, Aput will be updated by the word on, which is indeed the second argument of the verb put.",
        "false otherwise",
        "The update of Ax by a begins by incrementing the count:",
        "If a is a boundary symbol (0j or 0r ) or if x and a are words separated by stopping punctuation (full stop, question mark, exclamation mark, semicolon, comma or dash):",
        "(In practice, only = [a] and the 10 strongest labels in Afign(-i) are updated.",
        "Because of the exponential decay in the strength of labels in Afign(-i), this is a good approximation.)",
        "If i = – 1 , 1 and a is not a boundary or blocked by punctuation, simple bootstrapping takes place by updating the following properties:",
        "ASign(-i) M • ASign(i)",
        "To understand the way the labels and properties are calculated, it is best to look at an example.",
        "The following table gives the linking properties and strongest labels for the determiner the as learned from the complete Wall Street Journal corpus (only A(-e1) and A1he are shown):",
        "Stop In*In Out [.company]",
        "A strong class label [w] indicates that the word w frequently appears in contexts which are similar to the.",
        "A strong adjacency label [u;_] (or [_«;]) indicates"
      ]
    },
    {
      "heading": "0. otherwise",
      "text": [
        "that w either frequently appears next to the or that w frequently appears in the same contexts as words which appear next to the.",
        "The property Stop counts the number of times a boundary appeared next to the.",
        "Because the can often appear at the beginning of an utterance but must be followed by a noun or an adjective, it is not surprising that Stop is stronger than any label on the left but weaker than all labels on the right.",
        "In general, it is unlikely that a word has an outbound link on the side on which its Stop strength is stronger than that of any label.",
        "The opposite is not true: a label stronger than Stop indicates an attachment but this may also be the result of an inbound link, as in the following entry for to, where the strong labels on the left are a result of an inbound link:",
        "For this reason, the learning process is based on the property .",
        "Af which indicates where a link is not possible.",
        "Since an outbound link on one word is inbound on the other, the inbound/outbound properties of each word are then calculated by a simple bootstrapping process as an average ofthe opposite properties of the neighboring words."
      ]
    },
    {
      "heading": "5. The Weight Function",
      "text": [
        "At each step, the parser must assign a non-negative weight to every candidate link x d y which may be added to an utterance prefix (x1,..., xk), and the link with the largest (non-zero) weight (with a preference for links between xk-1 and xk) is added to the parse.",
        "The weight could be assigned directly based on the In and Out properties of either x or y but this method is not satisfactory for three reasons: first, the values of these properties on low frequency words are not reliable; second, the values of the properties on x and y may conflict; third, some words are ambiguous and require different linking in different contexts.",
        "To solve these problems, the weight of the link is taken from the values of In and Out on the best matching label between x and y.",
        "This label depends on both words and is usually a frequent word with reliable statistics.",
        "It serves as a prototype for the relation between x and y.",
        "A label 1 is a matching label between Af and 1 = (y, 1) then AlSlgn(-l) is defined to be 1).",
        "In practice, as before, only the top 10 labels in Af and A~ , s are considered.",
        "The best matching label from x to y is calculated between Af and ASlgn(-l) such that Af is on the same side of x as y and was either already used to create a link or is the first adjacency point on that side of x which was not yet used.",
        "This means that the adjacency points on each side have to be used one by one, but may be used more than once.",
        "The reason is that optional arguments of x usually do not have an adjacency point of their own but have the same labels as obligatory arguments of x and can share their adjacency point.",
        "The Af with the strongest matching label is selected, with a preference for the unused adjacency point.",
        "As in the learning process, label matching is blocked between words which are separated by stopping punctuation.",
        "The best matching label 1 = (w, 5) from x to y can be either a class (5 = 0) or an adjacency (5 = 1) label at Af.",
        "If it is a class label, w can be seen as taking the place of x and all words separating it from y (which are already linked to x).",
        "If 1 is an adjacency label, w can be seen to take the place of y.",
        "The calculation of the weight Wt(x d y) of the link from x to y is therefore based on the strengths of the In and Out properties of Af where a = Sign(i) if 1 = (w, 0) and a = Sign( – i) if 1 = (w, 1).",
        "In addition, the weight is bounded from above by the best label match strength, s(1):",
        "where if Af (In*) < 0 and Af (Out) < 0 then d = 1 and otherwise d = 0.",
        "• In all other cases, Wt(x – y) = 0.",
        "A link x y attaches x to y but does not place y inside the smallest bracket covering x.",
        "Such links are therefore created in the second case above, when the attachment indication is mixed.",
        "To explain the third case, recall that s(1) > 0 means that the label 1 is stronger than Stop on Af.",
        "This implies a link unless the properties of w block it.",
        "One way in which w can block the link is to have a positive strength for the link in the opposite direction.",
        "Another way in which the properties of w can block the link is if 1 = (w, 0) and Af (Out) < 0, that is, if the learning process has explicitly determined that no outbound link from w (which represents x in this case) is possible.",
        "The same conclusion cannot be drawn from a negative value for the In property when 1 = (w, 1) because, as with standard dependencies, a word determines its outbound links much more strongly than its inbound links."
      ]
    },
    {
      "heading": "6. Experiments",
      "text": [
        "The incremental parser was tested on the Wall Street Journal and Negra Corpora.",
        "Parsing accuracy was evaluated on the subsets WSJX and NegraX of these corpora containing sentences of length at most X (excluding punctuation).",
        "Some of these subsets were used for scoring in (Klein and Manning, 2004; Bod, 2006a; Bod, 2006b).",
        "I also use the same precision and recall measures used in those papers: multiple brackets and brackets covering a single word were not counted, but the top bracket was.",
        "The incremental parser learns while parsing, and it could, in principle, simply be evaluated for a single pass of the data.",
        "But, because the quality of the parses of the first sentences would be low, I first trained on the full corpus and then measured parsing accuracy on the corpus subset.",
        "By training on the full corpus, the procedure differs from that of Klein, Manning and Bod who only train on the subset of bounded length sentences.",
        "However, this excludes the induction of parts-of-speech for parsing from plain text.",
        "When Klein and Manning induce the parts-of-speech, they do so from a much larger corpus containing the full WSJ treebank together with additional WSJ newswire (Klein and Manning, 2002).",
        "The comparison between the algorithms remains, therefore, valid.",
        "Table 1 gives two baselines and the parsing results for WSJ10, WSJ40, Negra10 and Negra40 for recent unsupervised parsing algorithms: CCM and DMV+CCM (Klein and Manning, 2004), U-DOP (Bod, 2006b) and UML-DOP (Bod, 2006a).",
        "The middle part of the table gives results for parsing from part-of-speech sequences extracted from the treebank while the bottom part of the table given results for parsing from plain text.",
        "Results for the incremental parser are given for learning and parsing from left to right and from right to left.",
        "WSJ10",
        "WSJ40",
        "NegralO",
        "Negra40",
        "Model",
        "UP",
        "UR",
        "UFi",
        "UP UR UFi",
        "UP",
        "UR",
        "UFi",
        "UP",
        "UR",
        "UFi",
        "Right-branching",
        "55.1",
        "70.0",
        "61.7",
        "35.4 47.4 40.5",
        "33.9",
        "60.1",
        "43.3",
        "17.6",
        "35.0",
        "23.4",
        "Right-branching+punct.",
        "59.1",
        "74.4",
        "65.8",
        "44.5 57.7 50.2",
        "35.4",
        "62.5",
        "45.2",
        "20.9",
        "40.4",
        "27.6",
        "Parsing from POS",
        "CCM",
        "64.2",
        "81.6",
        "71.9",
        "48.1",
        "85.5",
        "61.6",
        "DMV+CCM(POS)",
        "69.3",
        "88.0",
        "77.6",
        "49.6",
        "89.7",
        "63.9",
        "U-DOP",
        "70.8",
        "88.2",
        "78.5",
        "63.9",
        "51.2",
        "90.5",
        "65.4",
        "UML-DOP",
        "82.9",
        "66.4",
        "67.0",
        "Parsing from plain text",
        "DMV+CCM(DISTR.)",
        "65.2",
        "82.8",
        "72.9",
        "Incremental",
        "75.6",
        "76.2",
        "75.9",
        "58.9 55.9 57.4",
        "51.0",
        "69.8",
        "59.0",
        "34.8",
        "48.9",
        "40.6",
        "Incremental (right to left)",
        "75.9",
        "72.5",
        "74.2",
        "59.3 52.2 55.6",
        "50.4",
        "68.3",
        "58.0",
        "32.9",
        "45.5",
        "38.2",
        "The first baseline is the standard right-branching baseline.",
        "The second baseline modifies right-branching by using punctuation in the same way as the incremental parser: brackets (except the top one) are not allowed to contain stopping punctuation.",
        "It can be seen that punctuation accounts for merely a small part of the incremental parser's improvement over the right-branching heuristic.",
        "Comparing the two algorithms parsing from plain text (of WSJ10), it can be seen that the incremental parser has a somewhat higher combined F1 score, with better precision but worse recall.",
        "This is because Klein and Manning's algorithms (as well as Bod's) always generate binary parse trees, while here no such condition is imposed.",
        "The small difference between the recall (76.2) and precision (75.6) of the incremental parser shows that the number of brackets induced by the parser is very close to that of the corpus and that the parser captures the same depth of syntactic structure as that which was used by the corpus annotators.",
        "Incremental parsing from right to left achieves results close to those of parsing from left to right.",
        "This shows that the incremental parser has no built-in bias for right branching structures.",
        "The slight degradation in performance may suggest that language should not, after all, be processed backwards.",
        "While achieving state of the art accuracy, the algorithm also proved to be fast, parsing (on a 1.86GHz Centrino laptop) at a rate of around 4000 words/sec.",
        "and learning (including parsing) at a rate of 3200 -3600 words/sec.",
        "The effect of sentence length on parsing speed is small: the full WSJ corpus was parsed at 3900 words/sec.",
        "while WSJ10 was parsed at 4300 words/sec.",
        "test."
      ]
    },
    {
      "heading": "7. Conclusions",
      "text": [
        "The unsupervised parser I presented here attempts to make use of several universal properties of natural languages: it captures the skewness of syntactic trees in its syntactic representation, restricts the search space by processing utterances incrementally (as humans do) and relies on the Zipfian distribution of words to guide its parsing decisions.",
        "It uses an elementary bootstrapping process to deduce the basic properties of the language being parsed.",
        "The algorithm seems to successfully capture some ofthese basic properties, but can be further refined to achieve high quality parsing.",
        "The current algorithm is a good starting point for such refinement because it is so very simple.",
        "Acknowledgments I would like to thank Dick de Jongh for many hours of discussion, and Remko Scha, Reut Tsarfaty and Jelle Zuidema for reading and commenting on various versions of this paper."
      ]
    }
  ]
}
