{
  "info": {
    "authors": [
      "Marten van Schijndel",
      "Luan Nguyen",
      "William Schuler"
    ],
    "book": "Workshop on Cognitive Modeling and Computational Linguistics",
    "id": "acl-W13-2605",
    "title": "An Analysis of Memory-based Processing Costs using Incremental Deep Syntactic Dependency Parsing",
    "url": "https://aclweb.org/anthology/W13-2605",
    "year": 2013
  },
  "references": [
    "acl-J93-2004",
    "acl-N01-1021",
    "acl-N13-1010",
    "acl-P06-1055",
    "acl-P10-1121",
    "acl-W12-1705"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Reading experiments using naturalistic stimuli have shown unanticipated facilitations for completing center embeddings when frequency effects are factored out.",
        "To eliminate possible confounds due to surface structure, this paper introduces a processing model based on deep syntactic dependencies.",
        "Results on eye-tracking data indicate that completing deep syntactic embeddings yields significantly more facilitation than completing surface embeddings."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Self-paced reading and eye-tracking experiments have often been used to support theories about inhibitory effects of working memory operations in sentence processing (Just and Carpenter, 1992; Gibson, 2000; Lewis and Vasishth, 2005), but it is possible that many of these effects can be explained by frequency (Jurafsky, 1996; Hale, 2001; Karlsson, 2007).",
        "Experiments on large naturalistic text corpora (Demberg and Keller, 2008; Wu et al., 2010; van Schijndel and Schuler, 2013) have shown significant memory effects at the ends of center embeddings when frequency measures have been included as separate factors, but these memory effects have been facilitatory rather than inhibitory.",
        "Some of the memory-based measures that produce these facilitatory effects (Wu et al., 2010; van Schijndel and Schuler, 2013) are defined in terms of initiation and integration of connected components of syntactic structure,1 with the presumption ?",
        "*Thanks to Micha Elsner and three anonymous reviewers for their feedback.",
        "This work was funded by an Ohio State University Department of Linguistics Targeted Investment for Excellence (TIE) grant for collaborative interdisciplinary projects conducted during the academic year 2012?13.",
        "1Graph theoretically, the set of connected components that referents that belong to the same connected component may cue one another using content-based features, while those that do not must rely on noisier temporal features that just encode how recently a referent was accessed.",
        "These measures, based on left-corner parsing processes (Johnson-Laird, 1983; Abney and Johnson, 1991), abstract counts of unsatisfied dependencies from noun or verb referents (Gibson, 2000) to cover all syntactic dependencies, motivated by observations of Dem-berg and Keller (2008) and Kwon et al. (2010) of the inadequacies of Gibson's narrower measure.",
        "But these experiments use naturalistic stimuli without constrained manipulations and therefore might be susceptible to confounds.",
        "It is possible that the purely phrase-structure-based connected components used previously may ignore some integration costs associated with filler-gap constructions, making them an unsuitable generalization of Gibson-style dependencies.",
        "It is also possible that the facilitatory effect for integration operations in naturally-occurring stimuli may be driven by syntactic center embeddings that arise from modifiers (e.g.",
        "The CEO sold [[the shares] of the company]), which do not require any dependencies to be deferred, but which might be systematically under-predicted by frequency measures, producing a confound with memory measures when frequency measures are residualized out.",
        "In order to eliminate possible confounds due to exclusion of unbounded dependencies in filler-gap constructions, this paper evaluates a processing model that calculates connected components on deep syntactic dependency structures rather than surface phrase structure trees.",
        "This model accounts unattached fillers and gaps as belonging to separate connected components, and therefore performs additional initiation and integration op-of a graph ?V, E?",
        "is the set of maximal subsets of it {?V1, E1?, ?V2, E2?, ...} such that any pair of vertices in each Vi can be connected by edges in the corresponding Ei.",
        "connected component of surface syntactic phrase structure corresponding to (b) two connected components of deep syntactic dependency structure for the noun phrase the person who officials say stole millions, prior to the word say.",
        "Connections established prior to the word say are shown in black; subsequent connections are shown in gray.",
        "erations in filler-gap constructions as hypothesized by Gibson (2000) and others.",
        "Then, in order to control for possible confounds due to modifier-induced center embedding, this refined model is applied to two partitions of an eye-tracking corpus (Kennedy et al., 2003): one consisting of sentences containing only non-modifier center embeddings, in which dependencies are deferred, and the other consisting of sentences containing no center embeddings or containing center embeddings arising from attachment of final modifiers, in which no dependencies are deferred.",
        "Processing this partitioned corpus with deep syntactic connected components reveals a significant increase in facilitation in the non-modifier partition, which lends credibility to the observation of negative integration cost in processing naturally-occurring sentences."
      ]
    },
    {
      "heading": "2 Connected Components",
      "text": [
        "The experiments described in this paper evaluate whether inhibition and facilitation in reading correlate with operations in a hierarchic sequential prediction model that initiate and integrate connected components of hypothesized syntactic structure during incremental parsing.",
        "The model used in these experiments refines previous connected component models by allowing fillers and gaps to occur in separate connected components of a deep syntactic dependency graph (Mel?c?uk, 1988; Kintsch, 1988), even when they belong to the same connected component when defined on surface structure.",
        "For example, the surface syntactic phrase structure and deep syntactic dependency structure for the noun phrase the person who officials say stole millions are shown in Figure 1.2 Notice that after the word officials, there is only one connected component of surface syntactic phrase structure (from the root noun phrase to the verb phrase with gap), but two disjoint connected components of deep syntactic dependency structure (one ending at i3, and another at i5).",
        "Only the deep syntactic dependency structure corresponds to familiar (Just and Carpenter, 1992; Gibson, 1998) notions of how memory is used to store deferred dependencies in filler-gap constructions.",
        "The next section will describe a generalized categorial grammar, which (i) can be viewed as context-free, to seed a latent-variable probabilistic context-free grammar to accurately derive parses of filler-gap constructions, and (ii) can be viewed as a deep syntactic dependency grammar, defining dependencies for connected components in terms of function applications."
      ]
    },
    {
      "heading": "3 Generalized Categorial Grammar",
      "text": [
        "In order to evaluate memory effects for hypothesizing unbounded dependencies between referents of fillers and referents of clauses containing gaps, a memory-based processor must define connected components in terms of deep syntactic dependencies (including unbounded dependencies) rather than in terms of surface syntactic phrase structure trees.",
        "To do this, at least some phrase structure edges must be removed from the set of connections that define a connected component.",
        "Because these unbounded dependencies are not represented locally in the original Treebank format, probabilities for operations on these modified 2Following Mel?c?uk (1988) and Kintsch (1988), the graphical dependency structure adopted here uses positionally-defined labels (?0?",
        "for the predicate label, ?1?",
        "for the first argument ahead of a predicate, ?2?",
        "for the last argument behind, etc.)",
        "but includes unbounded dependencies between referents of fillers and referents of clauses containing gaps.",
        "It is assumed that semantically-labeled structures would be isomorphic to the structures defined here, but would generalize across alternations such as active and passive constructions, for example.",
        "connected components are trained on a corpus annotated with generalized categorial grammar dependencies for ?gap?",
        "arguments at all categories that subsume a gap (Nguyen et al., 2012).",
        "This representation is similar to the HPSG-like representation used by Hale (2001) and Lewis and Vasishth (2005), but has a naturally-defined dependency structure on which to calculate connected components.",
        "This generalized categorial grammar is then used to identify the first sign that introduces a gap, at which point a deep syntactic connected component containing the filler can be encoded (stored), and a separate deep syntactic connected component for a clause containing a gap can be initiated.",
        "A generalized categorial grammar (Bach, 1981) consists of a set U of primitive category types; a set O of type-constructing operators allowing a recursive definition of a set of categories C =def U ?",
        "(C ?",
        "O ?",
        "C); a set X of vocabulary items; a mapping M from vocabulary items in X to semantic functions with category types in C; and a set R of inference rules for deriving functions with category types inC from other functions with category types in C. Nguyen et al. (2012) use primitive category types for clause types (e.g. V for finite verb-headed clause, N for noun phrase or nominal clause, D for determiners and possessive clauses, etc.",
        "), and use the generalized set of type-constructing operators to characterize not only function application dependencies between arguments immediately ahead of and behind a functor (-a and -b, corresponding to ?\\?",
        "and ?/?",
        "in Ajdukiewicz-Bar-Hillel categorial grammars), but also long-distance dependencies between fillers and categories subsuming gaps (-g), dependencies between relative pronouns and antecedent modif-icands of relative clauses (-r), and dependencies between interrogative pronouns and their arguments (-i), which remain unsatisfied in derivations but function to distinguish categories for content and polar questions.",
        "A lexicon can then be defined in M to introduce lexical dependencies and obligatory pronominal dependencies using numbered functions for predicates and deep syntactic arguments, for example: the ?",
        "(?i (0 i)=the) : D person ?",
        "(?i (0 i)=person) : N-aD who ?",
        "(?k i (0 i)=who ?",
        "(1 i)=k) : N-rN",
        "pose arguments and modifiers and propagate gaps.",
        "Arguments g of type d ahead of functors h of type cad are composed by passing non-local dependencies ?",
        "?",
        "{-g, -i, -r} ?",
        "C from premises to conclusion in all combinations: g:d h: cad ?",
        "( fc-ad g h): c (Aa) g:d?",
        "h: cad ?",
        "?k ( fc-ad (g k) h): c?",
        "(Ab) g:d h: c-ad?",
        "?",
        "?k ( fc-ad g (h k)): c?",
        "(Ac) g:d?",
        "h: c-ad?",
        "?",
        "?k ( fc-ad (g k) (h k)): c?",
        "(Ad) Similar rules compose arguments behind functors: g: c-bd h:d ?",
        "( fc-bd g h): c (Ae) g: c-bd?",
        "h:d ?",
        "?k ( fc-bd (g k) h): c?",
        "(Af) g: c-bd h:d?",
        "?",
        "?k ( fc-bd g (h k)): c?",
        "(Ag) g: c-bd?",
        "h:d?",
        "?",
        "?k ( fc-bd (g k) (h k)): c?",
        "(Ah) These rules use composition functions fc-ad and fc-bd for initial and final arguments, which define dependency edges numbered v from referents of predicate functors i to referents of arguments j, where v is the number of unsatisfied arguments ?1...?v ?",
        "{-a, -b} ?C in a category label: fu?1..v?1-ac def= ?g h i ?",
        "j (v i)= j ?",
        "(g j) ?",
        "(h i) (1a) fu?1..v?1-bc def= ?g h i ?",
        "j (v i)= j ?",
        "(g i) ?",
        "(h j) (1b) R also contains inference rules to compose modifier functors g of type u-ad ahead of modificands h of type d: g: u-ad h:c ?",
        "( fIM g h):c (Ma) g: u-ad?",
        "h:c ?",
        "?k ( fIM (g k) h):c?",
        "(Mb) g: u-ad h:c?",
        "?",
        "?k ( fIM g (h k)):c?",
        "(Mc)",
        "g:d h:e ?",
        "( f g h):c or g:d h:e ?",
        "?k( f (g k) h):c or g:d h:e ?",
        "?k( f g (h k)):c or g:d h:e ?",
        "?k( f (g k) (h k)):c",
        "g: u-ad?",
        "h:c?",
        "?",
        "?k ( fIM (g k) (h k)):c?",
        "(Md) or for modifier functors behind a modificand: g:c h: u-ad ?",
        "( fFM g h):c (Me) g:c?",
        "h: u-ad ?",
        "?k ( fFM (g k) h):c?",
        "(Mf) g:c h: u-ad?",
        "?",
        "?k ( fFM g (h k)):c?",
        "(Mg) g:c?",
        "h: u-ad?",
        "?",
        "?k ( fFM (g k) (h k)):c?",
        "(Mh) These rules use composition functions fIM and fFM for initial and final modifiers, which define dependency edges numbered ?1?",
        "from referents of modifier functors i to referents of modificands j: fIM def= ?g h j ?i (1 i)= j ?",
        "(g i) ?",
        "(h j) (2a) fFM def= ?g h j ?i (1 i)= j ?",
        "(g j) ?",
        "(h i) (2b) R also contains inference rules for hypothesizing gaps -gd for arguments and modifiers:3 g: cad ?",
        "?k ( fc-ad {k} g): c-gd (Ga) g: c-bd ?",
        "?k ( fc-ad {k} g): c-gd (Gb) g:c ?",
        "?k ( fIM {k} g):c-gd (Gc) and for attaching fillers e, d-re, die as gaps -gd: g:e h: c-gd ?",
        "?i ?",
        "j (g i) ?",
        "(h i j):e (Fa) g:d-re h: c-gd ?",
        "?k j ?i (g k i) ?",
        "(h i j): c-re (Fb) g:d-ie h: c-gd ?",
        "?k j ?i (g k i) ?",
        "(h i j): c-ie (Fc) 3Since these unary inferences perform no explicit composition, they are defined to use only initial versions composition functions fc-ad and fIM.",
        "and for attaching modificands as antecedents of relative pronouns: g:e h:c-rd ?",
        "?i ?",
        "j (g i) ?",
        "(h i j):e (R) An example derivation of the noun phrase the person who officials say stole millions using these rules is shown in Figure 2.",
        "The semantic expression produced by this derivation consists of a conjunction of terms defining the edges in the graph shown in Figure 1b.",
        "This GCG formulation captures many of the insights of the HPSG-like context-free filler-gap notation used by Hale (2001) or Lewis and Vasishth (2005): inference rules with adjacent premises can be cast as context-free grammars and weighted using probabilities, which allow experiments to calculate frequency measures for syntactic constructions.",
        "Applying a latent variable PCFG trainer (Petrov et al., 2006) to this formulation was shown to yield state-of-the-art accuracy for recovery of unbounded dependencies (Nguyen et al., 2012).",
        "Moreover, the functor-argument dependencies in a GCG define deep syntactic dependency graphs for all derivations, which can be used in incremental parsing to calculate connected components for memory-based measures."
      ]
    },
    {
      "heading": "4 Incremental Processing",
      "text": [
        "In order to obtain measures of memory operations used in incremental processing, these GCG inference rules are combined into a set of parser",
        "productions, similar to those of the ?right corner?",
        "parser of van Schijndel and Schuler (2013), except that instead of recognizing shallow hierarchical sequences of connected components of surface structure, the parser recognizes shallow hierarchical sequences of connected components of deep syntactic dependencies.",
        "This parser exploits the observation (van Schijndel et al., in press) that left-corner parsers and their variants do not need to initiate or integrate more than one connected component at each word.",
        "These two operations are then augmented with rules to introduce fillers and attach fillers as gaps.",
        "This parser is defined on incomplete connected component states which consist of an active sign (with a semantic referent and syntactic form or category) lacking an awaited sign (also with a referent and category) yet to come.",
        "Semantic functions of active and awaited signs are simplified to denote only sets of referents, with gap arguments (?k) stripped off and handled by separate connected components.",
        "Incomplete connected components, therefore, always denote semantic functions from sets of referents to sets of referents.",
        "This paper will notate semantic functions of connected components using variables g and h, incomplete connected component categories as c/d (consisting of an active sign of category c and an awaited sign of category d), and associations between them as g:c/d.",
        "The semantic representation used here is simply a deep syntactic dependency structure, so a connected component function is satisfied if it holds for some output referent i given input referent j.",
        "This can be notated ?i j (g:c/d { j} i), where the set { j} is equivalent to (?",
        "j?",
        "j?= j).",
        "Connected component functions that have a common referent j can then be composed into larger connected components:4 ?i jk (g { j} i) ?",
        "(h {k} j) ?",
        "?i j (g?h {k} i) (3) Hierarchies of ?",
        "connected components can be represented as conjunctions: ?i1 j1... i?",
        "j?",
        "(g1:c1/d1 { j1} i1) ?",
        "... ?",
        "(g?:c?/d?",
        "{ j?}",
        "i?).",
        "This allows constraints such as unbounded dependencies between referents of fillers and referents of clauses containing gaps to be specified across connected components by simply plugging variables for filler referents into argument positions for gaps.",
        "A nondeterministic incremental parser can now be defined as a deductive system, given an input sequence consisting of an initial connected component state of category T/T, corresponding to an existing discourse context, followed by a sequence of observations x1, x2, .",
        ".",
        ".",
        ", processed in time order.",
        "As each xt is encountered, it is connected to an existing connected component or it introduces a new disjoint component using the productions shown in Figures 3, 4, and 5.",
        "4These are connected components of dependency structure resulting from one or more composition functions being composed, with each function's output as the previous function's second argument.",
        "This uses a standard definition of function composition: (( f ?",
        "g) x) = ( f (g x)).",
        "Operations on dependencies that can be derived from surface structure (see Figure 3) are taken directly from van Schijndel and Schuler (2013).",
        "First, if an observation xt can immediately fill the awaited sign of the last connected component g?",
        ":c/d, it is hypothesized to do so, turning this incomplete connected component into a complete connected component (g?",
        "f ):c (Production ?Fa); or if the observation can serve as an initial sub-sign of this awaited sign, it is hypothesized to form a new complete sign f :e in a new component with xt as its first observation (Production +Fa).",
        "Then, if either of these resulting complete signs g?",
        ":d can immediately attach as an initial child of the awaited sign of the most recent connected component g?",
        "?1:a/c, it is hypothesized to merge and extend this connected component, with xt as the last observation of the completed connected component (Production +La); or if it can serve as an initial sub-sign of this awaited sign, it is hypothesized to remain disjoint and form its own connected component (Production ?La).",
        "The side conditions of La productions are defined to unpack gap propagation (instances of ?k that distinguish rules Aa?h and Ma?h) from the inference rules in Section 3, because this functionality will be replaced with direct substitution of referent variables into subordinate semantic functions, below.",
        "The Nguyen et al. (2012) GCG was defined to pass up unbounded dependencies, but in incremental deep syntactic dependency processing, unbounded dependencies are accounted as separate connected components.",
        "When hypothesizing an unbounded dependency, the processing model simply cues the active sign of a previous connected component containing a filler without completing the current connected component.",
        "The four +F, ?F, +L, and ?L operations are therefore combined with applications of unary rules Ga?c for hypothesizing referents as fillers for gaps (providing f ?",
        "in the equations in Figure 4).",
        "Productions ?Fb and +Fb fill gaps in initial children, and Productions ?Lb and +Lb fill gaps in final children.",
        "Note that the Fb and Lb productions apply to the same types of antecedents as Fa and La productions respectively, so members of these two sets of productions cannot be applied together.",
        "Applications of rules Fa?c and R for introducing fillers are applied to store fillers as existentially quantified variable values in Lc productions (see Figure 5).",
        "These Lc productions apply to the same type of antecedent as La and Lb productions, so these also cannot be applied together.",
        "Finally, connected components separated by gaps which are no longer hypothesized (?)",
        "are reattached by a +N production.",
        "This +N production may then be paired with a ?N production which yields its antecedent unchanged as a consequent.",
        "These N productions apply to antecedents and consequents of the same type, so they may be applied together with one F and one L production, but since the +N production removes in its consequent a ?",
        "argument required in its antecedent, it may not apply more than once in succession (and applying the ?N production more than once in succession has no effect).",
        "An incremental derivation of the noun phrase the person who officials say stole millions, using these productions, is shown in Figure 6."
      ]
    },
    {
      "heading": "5 Evaluation",
      "text": [
        "The F, L, and N productions defined in the previous section can be made probabilistic by first computing a probabilistic context-free grammar (PCFG) from a tree-annotated corpus, then transforming that PCFG model into a model of probabilities over incremental parsing operations using a grammar transform (Schuler, 2009).",
        "This allows the intermediate PCFG to be optimized using an existing PCFG-based latent variable trainer",
        "unique referent variables (calculated according to the equations in Section 4).",
        "Semantic functions are abbreviated to ?..?",
        "for readability.",
        "This derivation yields the following lexical relations: (0 i1)=the, (0 i2)=person, (0 i3)=who, (0 i4)=officials, (0 i5)=say, (0 i6)=stole, (0 i7)=millions, and the following argument relations: (1 i2)=i1, (1 i3)=i2, (1 i5)=i4, (2 i5)=i6, (1 i6)=i3, (2 i6)=i7.",
        "(Petrov et al., 2006).",
        "When applied to the output of this trainer, this transform has been shown to produce comparable accuracy to that of the original Petrov et al. (2006) CKY parser (van Schijndel et al., 2012).",
        "The transform used in these experiments diverges from that of Schuler (2009), in that the probability associated with introducing a gap in a filler-gap construction is reallocated from a ?F?L operation to a +F?L operation (to encode the previously most subordinate connected component with the filler as its awaited sign and begin a new disjoint connected component), and the probability associated with resolving such a gap is reallocated from an implicit ?N operation to a +N operation (to integrate the connected component containing the gap with that containing the filler).",
        "In order to verify that the modifications to the transform correctly reallocate probability mass for gap operations, the goodness of fit to reading times of a model using this modified transform is compared against the publicly-available baseline model from van Schijndel and Schuler (2013), which uses the original Schuler (2009) transform.5 To ensure a valid comparison, both parsers are trained on a GCG-reannotated version of the Wall Street Journal portion of the Penn Treebank (Marcus et al., 1993) before being fit to reading times using linear mixed-effects models (Baayen et al., 2008).6 This evaluation focuses on the processing that can be done up to a given point in a sentence.",
        "In human subjects, this processing includes both immediate lexical access and regressions that",
        "(Bates et al., 2011; R Development Core Team, 2010).",
        "aid in the integration of new information, so the reading times of interest in this evaluation are log-transformed go-past durations.",
        "The first and last word of each line in the Dundee corpus, words not observed at least 5 times in the WSJ training corpus, and fixations after long saccades (>4 words) are omitted from the evaluation to filter out wrap-up effects, parser inaccuracies, and inattention and track loss of the eyetracker.",
        "The following predictors are centered and used in each baseline model: sentence position, word length, whether or not the previous or next word were fixated upon, and unigram and bi-gram probabilities.",
        "Then each of the following predictors is residualized off each baseline before being centered and added to it to help residualize the next factor: length of the go-past region, cumulative total surprisal, total surprisal (Hale, 2001), and cumulative entropy reduction (Hale, 2003).9 All 2-way interactions between these effects are 7Go-past durations are calculated by summing all fixations in a region of text, including regressions, until a new region is fixated, which accounts for additional processing that may take place after initial lexical access, but before the next region is processed.",
        "For example, if one region ends at word 5 in a sentence, and the next fixation lands on word 8, then the go-past region consists of words 6-8 while go-past duration sums all fixations until a fixation occurs after word 8.",
        "Log-transforming eye movements and fixations may make their distributions more normal (Stephen and Mirman, 2010) and does not substantially affect the results of this paper.",
        "8For the n-gram model, this study uses the Brown corpus (Francis and Kucera, 1979), the WSJ Sections 02-21 (Marcus et al., 1993), the written portion of the British National Corpus (BNC Consortium, 2007), and the Dundee corpus (Kennedy et al., 2003) smoothed with modified Kneser-Ney (Chen and Goodman, 1998) in SRILM (Stolcke, 2002).",
        "9Non-cumulative metrics are calculated from the final word of the go-past region; cumulative metrics are summed over the go-past region.",
        "included as predictors along with the predictors from the previous go-past region (to account for spillover effects).",
        "Finally, each model has subject and item random intercepts added in addition to by-subject random slopes (cumulative total sur-prisal, whether the previous word was fixated, and length of the go-past region) and is fit to centered log-transformed go-past durations.10 The Akaike Information Criterion (AIC) indicates that the gap-reallocating model (AIC = 128,605) provides a better fit to reading times than the original model (AIC = 128,619).11 As described in Section 1, previous findings of negative integration cost may be due to a confound whereby center-embedded constructions caused by modifiers, which do not require deep syntactic dependencies to be deferred, may be driving the effect.",
        "Under this hypothesis, embeddings that do not arise from final adjunction of modifiers (henceforth canonical embeddings) should yield a positive integration cost as found by Gibson (2000).",
        "To investigate this potential confound, the Dundee corpus is partitioned into two parts.",
        "First, the model described in this paper is used to annotate the Dundee corpus.",
        "From this annotated corpus, all sentences are collected that contain canonical embeddings and lack modifier-induced embeddings.12 This produces two corpora: one consisting entirely of canonical center-embeddings such as those used in self-paced reading experiments with findings of positive integration cost (e.g. Gibson 2000), the other consisting of the remainder of the Dundee corpus, which contains sentences with canonical embeddings but also includes modifier-caused embeddings.",
        "The coefficient estimates for integration operations (?F+L and +N) on each of these corpora are then calculated using the baseline described above.",
        "To ensure embeddings are driving any observed effect rather than sentence wrap-up effects, the first and last words of each sentence are excluded from both data sets.",
        "Integration cost is measured by the amount of probability mass the parser allocates to ?F+L and +N operations, accu-10Each fixed effect that has an absolute t-value greater than 10 when included in a random-intercepts only model is added as a random slope by-subject.",
        "11The relative likelihood of the original model to the gap-sensitive model is 0.0009 (n = 151,331), which suggests the improvement is significant.",
        "12Modifier-induced embeddings are found by looking for embeddings that arise from inference rules Mah in Section 3.",
        "of the Dundee corpus: one containing only canonical center embeddings and the other composed of the rest of the sentences in the corpus.",
        "mulated over each go-past region, and this cost is added as a fixed effect and as a random slope by subject to the mixed model described earlier.13 The fixed effect estimate for cumulative integration cost from fitting each corpus is shown in Table 1.",
        "Application of Welch's t-test shows that the difference between the estimated distributions of these two parameters is highly significant (p < 0.0001).14 The strong negative correlation of integration cost to reading times in the purely canonical corpus suggests canonical (non-modifier) integrations contribute to the finding of negative integration cost."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "This paper has introduced an incremental parser capable of using GCG dependencies to distinguish between surface syntactic embeddings and deep syntactic embeddings.",
        "This parser was shown to obtain a better fit to reading times than a surface-syntactic parser and was used to parse the Dundee eye-tracking corpus in two partitions: one consisting of canonical embeddings that require deferred dependencies and the other consisting of sentences containing no center embeddings or center embeddings arising from the attachment of clause-final modifiers, in which no dependencies are deferred.",
        "Using linear mixed effects models, completion (integration) of canonical center embeddings was found to be significantly more negatively correlated with reading times than completion of non-canonical embeddings.",
        "These results suggest that the negative integration cost observed in eye-tracking studies is at least partially due to deep syntactic dependencies and not due to confounds related to surface forms.",
        "13Integration cost is residualized off the baseline before being centered and added as a fixed effect.",
        "14Integration cost is significant as a fixed effect (p = 0.001) in both partitions: canonical (n = 16,174 durations) and non-canonical (n = 131,297 durations)."
      ]
    }
  ]
}
