{
  "info": {
    "authors": [
      "Nobuhiro Kaji",
      "Masaru Kitsuregawa"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C08-1051",
    "title": "Using Hidden Markov Random Fields to Combine Distributional and Pattern-Based Word Clustering",
    "url": "https://aclweb.org/anthology/C08-1051",
    "year": 2008
  },
  "references": [
    "acl-C02-1120",
    "acl-C02-1144",
    "acl-J92-4003",
    "acl-N03-1032",
    "acl-N04-1043",
    "acl-N06-4007",
    "acl-N07-1043",
    "acl-P05-1017",
    "acl-P06-2075",
    "acl-P08-1047",
    "acl-P08-1068",
    "acl-P89-1010",
    "acl-P90-1034",
    "acl-P93-1024",
    "acl-P98-1012",
    "acl-P98-2124",
    "acl-P98-2127",
    "acl-P99-1004",
    "acl-P99-1014",
    "acl-W04-3205",
    "acl-W06-1664"
  ],
  "sections": [
    {
      "text": [
        "Word clustering is a conventional and important NLP task, and the literature has suggested two kinds of approaches to this problem.",
        "One is based on the distributional similarity and the other relies on the co-occurrence of two words in lexico-syntactic patterns.",
        "Although the two methods have been discussed separately, it is promising to combine them since they are complementary with each other.",
        "This paper proposes to integrate them using hidden Markov random fields and demonstrates its effectiveness through experiments."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Word clustering is a technique of grouping similar words together, and it is important for various NLP systems.",
        "Applications of word clustering include language modeling (Brown et al., 1992), text classification (Baker and McCallum, 1998), thesaurus construction (Lin, 1998) and so on.",
        "Furthermore, recent studies revealed that word clustering is useful for semi-supervised learning in NLP (Miller et al., 2004; Li and McCallum, 2005; Kazama and Torisawa, 2008; Koo et al., 2008).",
        "A well-known approach to grouping similar words is to use distribution of contexts in which target words appear.",
        "It is founded on the hypothesis that similar words tend to appear in similar contexts (Harris, 1968).",
        "Based on this idea, some studies proposed probabilistic models for word clustering (Pereira et al., 1993; Li and Abe, 1998; Rooth et al., 1999; Torisawa, 2002).",
        "Others proposed distributional similarity measures between words (Hindle, 1990; Lin, 1998; Lee, 1999; Weeds et al., 2004).",
        "Once such similarity is defined, it is trivial to perform clustering.",
        "On the other hand, some researchers utilized co-occurrence for word clustering.",
        "The idea behind it is that similar words tend to co-occur in certain patterns.",
        "Considerable efforts have been devoted to measure word similarity based on cooccurrence frequency of two words in a window (Church and Hanks, 1989; Turney, 2001; Terra and Clarke, 2003; Matsuo et al., 2006).",
        "In addition to the classical window-based technique, some studies investigated the use of lexico-syntactic patterns (e.g., X or Y) to get more accurate co-occurrence statistics (Chilovski and Pantel, 2004; Bollegala et al., 2007).",
        "These two approaches are complementary with each other, because they are founded on different hypotheses and utilize different corpus statistics.",
        "Consider to cluster a set of words based on the distributional similarity.",
        "It is likely that some words are difficult to cluster due to the data sparseness or some other problems, while we can still expect that those words are correctly classified using patterns.",
        "This consideration leads us to combine distributional and pattern-based word clustering.",
        "In this paper we propose to combine them using mixture models based on hidden Markov random fields.",
        "This model was originally proposed by (Basu et al., 2004) for semi-supervised clustering.",
        "In semi-supervised clustering, the system is provided with supervision in the form of pairwise constraints specifying data points that are likely to belong to the same cluster.",
        "These constraints are directly incorporated into the clustering process as a prior knowledge.",
        "Our idea is to view the co-occurrence of two words in lexico-syntactic patterns as constraints, and incorporate them into distributional word clustering.",
        "In summary, this paper discusses the problem of integrating multiple approaches for word clustering.",
        "We consider that the clustering results are improved if multiple approaches are successfully combined and if they are complementary with each other.",
        "Our contribution is to provide a probabilistic framework for this problem.",
        "Although our proposal aims at combining the distributional and pattern-based approaches, it is also applicable to combine other approaches like (Lin et al., 2003), as we will discuss in Section 5.4."
      ]
    },
    {
      "heading": "2. Distributional Clustering",
      "text": [
        "This and next section describe distributional and pattern-based word clustering respectively.",
        "Section 4 will explain how to combine them.",
        "In distributional word clustering, similarity between words (= nouns) is measured by the distribution of contexts in which they appear.",
        "As a context, verbs that appear in certain grammatical relations with the target nouns are typically used.",
        "Using the distribution of such verbs, we can express a noun n by a feature vector 4>{n):",
        "where fnVi denotes the frequency of noun-verb pair (n,Vi), and V denotes the number of distinct verbs.",
        "The basic idea of using the distribution for clustering is to group n and rl together if 4>{n) and 4>{n') are similar.",
        "Let us consider a soft clustering model.",
        "We hypothesize that 4>{ri) is a mixture of multinomial, and the probability of n is defined by",
        "EL fnv!",
        "J",
        "where Z is the number of mixture components, ttz is the mixing coefficient (J2Z ^z = 1), fn = J2V fnv is the total number of occurrence of n, and",
        "'We ignored p(fn) by assuming that it is independent of hidden variables.",
        "See (McCallum and Nigam, 1998) for detail discussion.",
        "fivz is the parameter of the multinomial distribution (J2V Vvz = !",
        ")• In this model the hidden variables can be interpreted as semantic class of nouns.",
        "Now consider a set of nouns n = {rii}f=l.",
        "Let z = {zi}f=l be a set of hidden variables corresponding to n. Assuming that the hidden variables are independent and ru is also independent of other nouns given the hidden variables, the probability of n is defined by p(n\\z) = Y\\p(ni\\zi).",
        "Hereafter, we use p{n\\z) instead of p{4>{n)\\z) to keep the notation simple.",
        "p(n|z) is the conditional distribution on all nouns given all the hidden variables, and p(z) is the prior distribution on the hidden variables.",
        "Computing the log-likelihood of the complete data (n, z), we found",
        "The parameters can be estimated by the EM algorithm.",
        "In the E-step, p(zi\\rii) is computed based on current parameters.",
        "It is computed by",
        "z ^z il i^z",
        "In the M-step, the parameters are re-estimated by using the result of the E-step:",
        "a + Ei fnifPizi = k\\m) OtV + Y,v Ei frnvPiZi = k\\m",
        "where a is a smoothing factor.",
        "Both steps are repeated until a convergence criteria is satisfied.",
        "The important point to note is that the E-step can be computed using the above equation because the hidden variables are independent.",
        "Table 1: Four lexico-syntactic patterns, where X and Y are extracted as co-occurring words.",
        "Note that ya, mo, and to are Japanese postpositions, and they correspond to or or and in English."
      ]
    },
    {
      "heading": "3. Pattern-based Clustering",
      "text": [
        "A graph-based algorithm was employed in order to cluster words using patterns.",
        "We first construct the graph in which vertices and edges correspond to words and their cooccurrences in patterns respectively (Figure 1).",
        "We employed four lexico-syntactic patterns (Table 1) to extract co-occurrence of two words from corpus.",
        "Note that we target Japanese in this paper although our proposal is independent of languages.",
        "The edges are weighted by the strength of cooccurrence that is computed by the Point-wise Mutual Information (PMI):",
        "where f(rii,rij) is the co-occurrence frequency of two nouns, and V means summation over all nouns.",
        "If PMI is less than zero, the edge is removed.",
        "Assuming that similar words tend to co-occur in the lexico-syntactic patterns, it is reasonable to consider that a dense subgraph is a good cluster (Figure 1).",
        "Following (Matsuo et al., 2006), we exploit the Newman clustering (Newman, 2004) to partition the graph into such dense subgraphs.",
        "We start by describing Newman's algorithm for unweighted graphs and we will generalize it to weighted graphs later.",
        "The Newman clustering is an algorithm that divides a graph into subgraphs based on connectivity.",
        "Roughly speaking, it divides a graph such that there are a lot of edges between vertices in the same cluster.",
        "In the algorithm goodness of clustering is measured by score Q:",
        "# of edges between two vertices in cluster i and j # of all edges",
        "The term is the fraction of edges between cluster i and j. ai is the sum of over all clusters, and af represents the expected number of fraction of edges within the cluster i when edges are given at random.",
        "See (Newman, 2004) for the detail.",
        "The Newman clustering optimizes Q in an agglomerative fashion.",
        "At the beginning of the algorithm every vertex forms a singleton cluster, and we repeatedly merge two clusters so that the join results in the largest increase in Q.",
        "The change in Q when cluster i and j are merged is given by",
        "The above procedure is repeated until Q reaches local maximum.",
        "The algorithm can be easily generalized to weighted graphs by substituting \"sum of weights of edges\" for \"# of edges\" in the definition of .",
        "The other part of the algorithm remains the same."
      ]
    },
    {
      "heading": "4. Integration based on Hidden Markov Random Fields",
      "text": [
        "This section represents how to integrate the distribution and pattern for word clustering.",
        "Clustering has long been discussed as an unsupervised learning problem.",
        "In some applications, however, it is possible to provide some form of supervision by hand in order to improve the clustering result.",
        "This motivated researchers to investigate semi-supervised clustering, which uses not only unlabeled data but supervision in the form of pairwise constraints (Basu et al., 2004).",
        "In this framework, the clustering system is provided with a set of pairwise constraints specifying data points that are likely to belong to the same cluster.",
        "These constraints are directly incorporated into the clustering process as a prior knowledge.",
        "Our idea is to view the co-occurrence of two words in lexico-syntactic patterns as constraints, and incorporate them into the distributional clustering.",
        "The rest of this section describes how to extend the distributional clustering so as to incorporate the constraints, and how to generate the constraints using the patterns.",
        "Let C be a set of pairwise constraints, and consider to incorporate the constraints into the distributional clustering (Section 2).",
        "In what follows we assume each constraint e C represents that Zi and Zj are likely to have the same value, and it is associated with a weight ?%(> 0) corresponding to a penalty for constraint violation.",
        "It is easy to extend the distributional clustering algorithm so as to incorporate the constraints.",
        "This is done by just changing the prior distribution on hidden variables p(z).",
        "Following (Basu et al., 2004), we construct the Markov random field on the hidden variables so as to incorporate the constraints.",
        "The new prior distribution is defined as where S(-) is the delta function.",
        "S(zi / Zj) takes one if the constraint (i, j) is violated and otherwise zero.",
        "G is the normalization factor of the Markov random field (the second term).",
        "By examining the log-likelihood of the complete data, we can see how violation of constraints is penalized.",
        "Using the new prior distribution, we get - logG.",
        "The first term in the right-hand side is equal to the log-likelihood of the multinomial mixture, namely equation (1).",
        "The second term can be interpreted as the penalty for constraint violation.",
        "The last term is a constant.",
        "It is worth pointing out that the resulting algorithm makes a soft assignment and polysemous words can belong to more than one clusters.",
        "The parameters are estimated by the EM algorithm.",
        "The M-step is exactly the same as discussed in Section 2.2.",
        "The problem is that the hidden variables are no longer independent and the E-step requires the calculation of where z-,j means all hidden variables but zi.",
        "The computation of the above equation is intractable because the summation in it requires 0{ZN~l) operations.",
        "Instead of exactly computing p(zi\\ri), we approximate it by using the mean field approximation (Lange et al., 2005).",
        "In the mean field approximation, p{z\\xi) is approximated by a factorized distribution q(z), in which all hidden variables are independent:",
        "Using q(z) instead of p(z\\n), computation of the E-step can be written as follows:",
        "The parameters of q(z) are determined such that the KL divergence between q(z) and p(z\\n) is minimized.",
        "In other words, the approximate distribution q{z) is determined by minimizing under the condition that J2k ^(-^ = k) = 1 for all %.",
        "This optimization problem can be resolved by introducing Lagrange multipliers.",
        "Because we cannot get the solution in closed form, an iterative method is employed.",
        "Taking the derivative of equation (4) with respect to a parameter q%k = qi(zi = k) and setting it to zero, we get the following updating formula:",
        "where = j) £ C} and is the value of qik at i-th iteration.",
        "The derivation of this formula is found in Appendix.",
        "It is often pointed out that even small amounts of misspecified constraints significantly decrease the performance of semi-supervised clustering.",
        "This is because the error of misspecified constraints is propagated to the entire transitive neighborhoods of the constrained data (Nelson and Cohen, 2007).",
        "As an example, consider that we have two constraints and (j, k).",
        "If the former is misspecified one, the error propagate to k through j.",
        "To tackle this problem, we propose a technique to put an upper bound 0 on the size of the transitive neighborhoods.",
        "Our constraint generation process is as follows.",
        "To begin with, we modified the Newman clustering so that the maximum cluster size does not exceed 0.",
        "This can be done by prohibiting such merge that results in larger cluster than 0.",
        "Given the result of the modified Newman clustering, it is straightforward to generate constraints.",
        "Constraints are generated between two nouns in the same cluster if they co-occur in the lexico-syntactic patterns at least one time.",
        "The penalty for constraint violation Wij was set to PMI(nj, rij ).",
        "This procedure obviously ensures that the size of the transitive neighborhoods is less than 6."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "We parsed 15 years of news articles by KNP so as to obtain data sets for the distributional and pattern-based word clustering (Table 2).",
        "The number of distinct nouns in total was 297,719.",
        "Note that, due to the computational efficiency, we removed such nouns that appeared less than 10 times with verbs and did not appear at all in the patterns.",
        "A test set was created using manually tailored Japanese thesaurus (Ikehara et al., 1997).",
        "We randomly selected 500 unambiguous nouns from 25 categories (20 words for each category).",
        "For comparison we implemented the following baseline systems.",
        "• The multinomial mixture (Section 2).",
        "• The Newman clustering (Newman, 2004).",
        "http://nlp.kuee.kyoto-u.ac.jp/nl-resource/",
        "Table 2: Data sets statistics.",
        "The first and second row shows the number of distinct words (and word pairs) used for the distributional and pattern-based word clustering respectively.",
        "• Three K-means algorithms using different distributional similarity or dissimilarity measures: cosine, askew divergence (Lee, 1999), and Lin's similarity (Lin, 1998).",
        "• The CBC algorithm (Lin and Pantel, 2002; Pantel and Lin, 2002).",
        "All the nouns in the data set were clustered by the proposed and baseline systems.",
        "For the mixture models and K-means, the number of clusters was set to 1,000.",
        "The parameter 6 was set to 100.",
        "The result was assessed by precision and recall using the test data.",
        "The precision and recall were computed by the B-CUBED algorithm as follows (Bagga and Baldwin, 1998).",
        "For each noun m in the test data, precision^ and recall; are defined as where Si is the system generated cluster containing m and Ti is the goldstandard cluster containing rii.",
        "The precision and recall are defined as an average of precision^ and recall for all the nouns in the test data respectively.",
        "The result of soft clustering models cannot be directly evaluated by the precision and recall.",
        "In such cases, each noun is assigned to the cluster that maximizes p{z\\n).",
        "Table 3 shows the experimental results.",
        "The best results for each statistic are shown in bold.",
        "For the mixture models and K-means, the precision and recall are an average of 10 trials.",
        "nouns",
        "208,934",
        "verbs",
        "64,954",
        "noun-verb pairs",
        "4,804,715",
        "nouns",
        "245,465",
        "noun-noun pairs",
        "633,302",
        "all the baseline systems.",
        "It was statistically significantly better than the multinomial mixture (P < 0.01, Mann-Whitney U-test).",
        "Note that it is possible to improve some baseline systems, especially CBC, by tuning the parameters.",
        "For CBC we simply used the same parameter values as reported in (Lin and Pantel, 2002).",
        "Compared with the multinomial mixture, one advantage of our method is that it has broad coverage.",
        "Our method can successfully handle unknown words, which do not appear with verbs at all (i.e., fn = 0 and 4>{n) is zero vector), if they co-occur with other words in the lexico-syntactic patterns.",
        "For unknown words, the hidden variables are determined based only on p(z) because p{n\\z) takes the same value for all hidden variables.",
        "This means that our method clusters unknown words using pairwise constraints.",
        "On the other hand, the multinomial mixture assigns all the unknown words to the cluster that maximizes p{z).",
        "The test set included 51 unknown words.",
        "We split the test set into two parts: fn = 0 and fn / 0, and calculated precision and recall for each subset (Table 4).",
        "Although the improvement is especially significant for the unknown words, we can clearly confirm the improvement for both subsets.",
        "For the Newman clustering we can discuss similar things (Table 5).",
        "Different from the Newman clustering, our method can handle nouns that do not co-occur with other nouns if 0 < /„.",
        "In this case the test set included 64 unknown words.",
        "It is interesting to point out that our framework can further incorporate lexico-syntactic patterns for dissimilar words (Lin et al., 2003).",
        "Namely, we can use patterns so as to prevent distribution-ally similar but semantically different words (e.g., ally and supporter (Lin et al., 2003)) from being assigned to the same cluster.",
        "This can be achieved by using cannot-link constraints, which specify data points that are likely to belong to different clusters (Basu et al., 2004).",
        "The remaining problem is which patterns to use so as to extract dissimilar words.",
        "Although this problem has already been discussed by (Lin et al., 2003), they mainly addressed antonyms.",
        "We believe that a more exhaustive investigation is required.",
        "In addition, it is still unclear whether dissimilar words are really useful to improve clustering results.",
        "One problem that we did not examine is how to determine optimal number of clusters.",
        "In the experiment, the number was decided with trial-and-error through our initial experiment.",
        "We leave it as our future work to test methods of automatically determining the cluster number (Pedersen and Kulkarni, 2006; Blei and Jordan, 2006)."
      ]
    },
    {
      "heading": "6. Related work",
      "text": [
        "As far as we know, the distributional and pattern-based word clustering have been discussed independently (e.g., (Pazienza et al., 2006)).",
        "One of the most relevant work is (Bollegala et al., 2007), which proposed to integrate various patterns in order to measure semantic similarity between words.",
        "Although they extensively discussed the use of patterns, they did not address the distributional approach.",
        "Mirkin (2006) pointed out the importance of integrating distributional similarity and lexico-syntactic patterns, and showed how to combine the two approaches for textual entailment acquisition.",
        "Although their work inspired our research, we discussed word clustering, which is related to but different from entailment acquisition.",
        "Lin (2003) also proposed to use both distributional similarity and lexico-syntactic patterns for finding synonyms.",
        "However, they present an opposite viewpoint from our research.",
        "Their proposal is to exploit patterns in order to filter dissimilar words.",
        "As we have already discussed, the integration of such patterns can also be formalized using similar probabilistic model to ours.",
        "P",
        "R",
        "Fi",
        "proposed",
        ".383",
        ".437",
        ".408",
        "multinomial mixture",
        ".360",
        ".374",
        ".367",
        "Newman (2004)",
        ".318",
        ".353",
        ".334",
        "cosine",
        ".603",
        ".114",
        ".192",
        "a-skew divergence (Lee, 1999)",
        ".730",
        ".155",
        ".255",
        "Lin's similarity (Lin, 1998)",
        ".691",
        ".096",
        ".169",
        "CBC (Lin and Pantel, 2002)",
        ".981",
        ".060",
        ".114",
        "fn = 0 /„ / 0",
        "P R Fi P R Fi",
        "proposed multi.",
        ".320 .632 .435 .412 .450 .430 .099 1.000 .181 .402 .394 .398",
        "Table 4:",
        "Detail comparison with the multinomial",
        "mixture.",
        "/(«;,*) = 0 /(ni;*)/0 P R Fi P R Fi",
        "proposed Newman",
        ".600 .456 .518 .380 .479 .424",
        ".071 1.000 .133 .354 .412 .381",
        "A variety of studies discussed determining polarity of words.",
        "Because this problem is ternary (positive, negative, and neutral) classification of words, it can be seen as one kind of word clustering.",
        "The literature suggested two methods of determining polarity, and they are analogous to the distributional and co-occurrence-based approaches in word clustering (Takamura et al., 2005; Hi-gashiyama et al., 2008).",
        "We consider it is also promising to integrate them for polarity determination."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "The distributional and pattern-based word clustering have long been discussed separately despite the potentiality for their integration.",
        "In this paper, we provided a probabilistic framework for combining the two approaches, and demonstrated that the clustering result is significantly improved.",
        "Our important future work is to extend current framework so as to incorporate patterns for dissimilar words using cannot-link constraints.",
        "We consider such patterns further improve the clustering result.",
        "Combining distribution and pattern is important for other NLP problems as well (e.g., entailment acquisition, polarity determination).",
        "Although this paper examined word clustering, we consider a part of our idea can be applied to other problems.",
        "Acknowledgement",
        "This work was supported by the Comprehensive Development of e-Society Foundation Software program of the Ministry of Education, Culture, Sports, Science and Technology, Japan.",
        "We can rewrite equation (4) as follows:",
        "where we made use of the fact that logp(z|n) = logp(n|z)p(z) + const.",
        "Taking the derivative of equation (6), (7), and (8) with respect to qik, we found",
        "m.",
        "where const denotes terms independent of A;.",
        "Making use of these results, the updating formula can be derived by taking the derivative of equation (4) with respect to qik and setting it to zero."
      ]
    }
  ]
}
