{
  "info": {
    "authors": [
      "Naohiko Uramoto"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-2161",
    "title": "Positioning Unknown Words in a Thesaurus by Using Information Extracted from a Corpus",
    "url": "https://aclweb.org/anthology/C96-2161",
    "year": 1996
  },
  "references": [
    "acl-C92-2082",
    "acl-C94-1100",
    "acl-W95-0105"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes a. method for positioning unknown words in an existing thesaurus by using word-to-word relationships with relation (case) markers extracted from a large corpus.",
        "A suitable area of the thesaurus for an unknown word is estimated by integrating the human intuition buried in the thesaurus and statistical data extracted from the corpus.",
        "To overcome the problem of data sparseness, distinguishing features of each node, called \"viewpoints\" are extracted automatically and used to calculate the similarity between the unknown word and a. word in the thesaurus.",
        "The results of an experiment confirm the contribution of viewpoints to the positioning task."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Thesauruses are among the most useful knowledge resources for natural language processing.",
        "For example, English thesauruses such as Roget's Thesaurus and WordNet [4] are widely used for tasks in this area.",
        "[5, 6, 3].",
        "However, most existing thesauruses are compiled by hand, and consequently, the following three problems occur when they are used for NEP systems.",
        "First, existing thesauruses have insufficient vocabularies, especially in languages other titan English.",
        "In Japan, there are no free thesauruses that can be shared by researchers.",
        "Furthermore, general-domain thesauruses do not cover domain-specific terms.",
        "Second, the human intuition used in constructing thesauruses is not explicit.",
        "Most existing thesauruses are hand-crafted by observing huge amounts of data on the usage of words.",
        "The data and human judgements used in constructing thesauruses would be very useful in NLP systems; unfortunately, however, ads information is not represented in the thesauruses.",
        "Third, the structure of thesauruses is subjective.",
        "The depth and density of nodes in (tree-like) thesauruses directly affect the calculated distances between words.",
        "For example, nodes for biological words have many levels, while abstract words are classified in relatively shallow levels.",
        "However, existing thesauruses only represent uniform relationships between words.",
        "This paper describes a. way of overcoming the problems, using a. medium-size Japanese thesaurus and large corpus.",
        "The main goal of our work is to expand the thesaurus automatically, explicitly including distinguishing features (viewpoints), and to construct a. domain-sensitive thesaurus system.",
        "To expand the vocabulary of the thesaurus, it is important to position new words in it automatically.",
        "In this paper, words that are not contained in the thesaurus but that appeared in the corpus more than once are called unknown words.'",
        "The proper positions of the unknown words in the thesaurus are estimated by using word-to-word relationships extracted from a large-scale corpus.",
        "This task may he similar to word-sense disambiguation, which determines the correct sense of a. word from several predefined candidates.",
        "However, in positioning a word whose sense is unknown, a suitable position must be selected from thousands of nodes (words) in the thesaurus, and therefore it is very difficult to position the word with pinpoint accuracy.",
        "Instead, in this paper, we give a method for determining the area in which the unknown words belongs.",
        "For example, suppose the word \"SENTOU.KI\" (fighter) is not contained in a thesaurus.",
        "Calculation of the similarity between the word and those in the thesaurus assigns it to the area [flying vehicle [air plane, helicopter]].",
        "Viewpoints are features that distinguish a. node from other nodes in the thesaurus, and are good clues for estimating the area to which an unknown word should be assigned.",
        "The area can be efficiently estimated by extracting viewpoints.",
        "Several systems have used WordNet and statistical information from large corpora [3, 5, 6].",
        "However, there are two common problems: noisy co-occurrence of words and data sparseness.",
        "In WordNet, since each node in the thesaurus is a set of words that have synonym relationships (SynSet), various methods for similarity calculation using the SynSet classes have been proposed.",
        "In this paper, ISAMAP [8], a hand-crafted Japanese thesaurus, is used as a core.",
        "To overcome the problems of noise",
        "and data sparseness, relationships of connected nodes the sky,\" but not \"ships fly\" or \"a. ship in the sky.\"",
        "in the thesaurus are used.",
        "Resnik proposed a class That is, (plane, SUBJ, fly) and (plane, in, sky) Can based approach, in which sets of words are used lie called viewpoints for the word \"plane.\"",
        "is used as a. class.",
        "In our approach, on the other instead of words [5].",
        "In Ids approach, each Synset, 3 Positioning Unknown Words hand, art area that contains connected nodes in the This section describes the procedure for positioning thesaurus is used as a class.",
        "The nodes are colt ()I' words iu 1SAMA P. In this task, the input is a fleeted by IS-A relationships as well as synonym word to 1)e, placed somewhere in 1SAMAP.",
        "The goal relationships, and therefore large areas represent, is to determine the most, suitable area for the word.",
        "strong similarities to unknown words.",
        "The procedure consists of the following three steps:"
      ]
    },
    {
      "heading": "2 Knowledge Sources",
      "text": [
        "This section describes the thesaurus and statistical data used in this paper.",
        "A Japanese noun thesaurus called ISA MAP is a. set, of IS-A relationships.",
        "It contains about 4,000 nouns with about ten levels.",
        "Each node of ISA MAP is a. word or a. word and its (one or two) synonyms.",
        "Figure 1 shows the top categories of ISAMA Some words are placed at.",
        "multiple positions in the thesaurus.",
        "For example, SENSUIKAN (submarine)\" is classified as \"water vehicle\" and \"weapon.\"",
        "'1.ro extract viewpoints for the existing structure of the thesaurus in order to position unknown words in it, a collection of pairs of words ;mid their relation markers, together with their frequency, was extracted from a corpus.",
        "The source of the words was articles published in a. Japanese newspaper (Nikkei Shinbun) in 1993.",
        "'the articles were morphologically analyzed antomatically, and then stored in the following form: oc(wordl, word2) = n This means that, wordl and word2 occur n times with a relation marker rel.",
        "Relation markers consist of case markers such as \"GA\", \"WO\", and \"NI\", and adnominal forms of adjectives and adjective nouns.",
        "The statistical data for each relationship are shown in Figure 2.",
        "We use restrictive relationships with the markers, rather titan word 2-grants, for two reasons.",
        "In the unknown-word-sense disambiguation task, the number of possible candidate word-senses (positions in the thesaurus, ill this paper) is very large, and Huts it is important to reduce noises that prevent, the output of a result.. Second, these case relationships can be used to identify classification viewpoints for thesauruses.",
        "For example.",
        "suppose that,"
      ]
    },
    {
      "heading": "3.1 Basic Idea",
      "text": [
        "The basic idea is very simple.",
        "For an unknown word, the word-to-word relationships that contain it are extracted.",
        "The similarity between t he word and each node in ISA MAI' is calculated.",
        "'Hie nodes for which tile similarity exceeds a predefined threshold are marked and connected in the thesaurus.",
        "The left, tree in Figure 3 shows nodes in the thesaurus.",
        "The marked nodes are represented by black cif,.",
        "cies.",
        "For straightforward statistical similarity calculations, there are many similar words, including noisy words.",
        "In this paper, the following three hypotheses are used to resolve the problem.",
        "First, the marked words form certain areas (connected nodes) of words in the thesaurus.",
        "The areas that occupy a large space are preferred.",
        "The right tree in Figure 3 shows areas of words.",
        "Soc(md, specific words, that is to say, words at, lower levels of trees are preferred.",
        "In Figure 3, areal is preferred to area2.",
        "Third, each node in the thesaurus has viewpoints that distinguish it, from other nodes.",
        "The viewpoints for each node are extracted by using case and modification relationships that contain statistical data.",
        "extracted from the corpus.",
        "Ilan unknown word has the same viewpoints as a certain node, the similarity for the node is weighted.",
        "'the next subsection describes how viewpoints are extracted."
      ]
    },
    {
      "heading": "3.2 Extraction of Viewpoints",
      "text": [
        "A viewpoint, is a, set of distinguishing features for each node in a thesaurus.",
        "'The viewpoint of a node",
        "node is defined as a list (node, marker, word).",
        "Though such features are implicitly used in the creation of roost existing thesauruses according to human intuition, they are lost when the constructed thesauruses are used.",
        "An exception is the WordNet, in which the distinguishing features are manually listed.",
        "In this paper, the distinguishing features are extracted automatically, reflecting the characteristics of the corpus to be used.",
        "For example, Figure 5 shows a, part of ISAMAP.",
        "The viewpoint of a node in the thesaurus is estimated by using a certain procedure.",
        "Suppose we want to extract the viewpoint al the noun \"11 ERIKOP-LITA.A\" (helicopter).",
        "The word occurs 131 times in our corpus.",
        "Figure 3.2 shows examples of the relationships.",
        "For each relationship, a search is made for nodes that have the same relationship.",
        "In the case of the pattern \"TlIKAU\" (use), 385 nodes with the same relationship are extracted front areas, scattered throughout ISAMAP.",
        "On the other hand, the pattern \"TOBU\" (fly) shares only two nodes, helicopter and airplane.",
        "The nodes have direct ISA relationships; in other words, the nodes are can be connected in the hierarchy of nodes.",
        "Since the viewpoints of a node are inherited by its children in many cases, the existence of the connected nodes that include ISA relationships is strong evidence for the viewpoints.",
        "M this case, (fly, SUB) is a viewpoint for the node \"airplane,\" which is the topmost of the connected nodes.",
        "Viewpoints are extracted by calculating the typicalness of word-to-word relationships.",
        "Given a node nd and its candidate viewpoint (a pair of a relation marker ref and a word w), the typicalness of the viewpoint is calculated as",
        "where N is a set of nodes in ISAMAP, and C is a set of connected nodes that contain the word w. Examples of the viewpoints (whose typicalness exceeds 0.5.)",
        "are as follows:"
      ]
    },
    {
      "heading": "3.3 Example for Positioning Words in ISAMAP",
      "text": [
        "Let us consider an example to see how algorithm works.",
        "Suppose the word \"SENTOUKI.\"",
        "(fighter3) is to be placed in the thesaurus.",
        "First, for each node in the ISAMAP, the similarity between the word and the node is calculated.",
        "The similarity is calculated according to the follow-i rig formula:",
        "P is set of words that co-occurs with w1ortn2, and the argument \"..\" can be any words.",
        "If the similarity value exceeds a predefined threshold, the node is marked.",
        "Figure 6 shows marked nodes that have high similarity.",
        "aIn English, a fighter means both a plane and a person; however, the original Japanese word SENTOUKI means only a plane.",
        "Areas that contain marked nodes are calculated.",
        "'I'he results are given in Figure 7.",
        "The most suitable area.",
        "for the word \"fighter\" must be selected from multiple candidate sets of connections.",
        "'lite final phase is the evaluation of the candidates.",
        "Each ca.rididate is evaluated according to the following four criteria.",
        "Criterion 1: Tile size of the candidate.",
        "Given an input word w (in this case, \"fighter\"), arid a. node that is contained in the candidate C, Cl E„,„„ sim(w, •ode).",
        "Criterion 2: The height of the candidate.",
        "C2 is the 1111111 her of levels ill the candidate.",
        "For Cxa.mple, in the candidate (a) in Figure 7, C2 , 2.",
        "Criterion 3: The average depth of the nodes.",
        "For example, the depth of the node \"airplane\", whose node-id is 0.0.0.0.0.0.1.0.2.0, is 10.",
        "Criterion 4: 'I'he number of viewpoints.",
        "For example, candidate (a) (whose top node is \"human\") has the largest number of nodes.",
        "However, as shown in Figure 6, the matched relationships (\"bad hu-Mau/ fighter\" arid \"protect human/fighter\") are trot typical expressions for the word \"fighter\"; that is, the relationships are not viewpoints.",
        "On the other hand, \"airplane\" in candidate (c) shares the \"fighter (airplane) fly\", which is the viewpoint of the node \"airplane.\"",
        "C4 is the number of matched relationships that are considered as viewpoints of the node in the candidate.",
        "The total preference P(word) is pi Cl.",
        "+p2C2 1,3C'3-Fp4(14, where PI, p2, pa, and pi are weights for each criterion.",
        "Intuitively, and according to a preliminary experiment, the contribution of C3 should carry more weight than the other criteria (in our ex-lwriment, p2 1, p3 0.4, arid p4 3).",
        "The most preferable candidate for the word \"fighter\" is (c); tliat, is, \"lighter\" is placed in the area.",
        "whose top node is \"flying vehicle.\""
      ]
    },
    {
      "heading": "4 Experiment and Discussion",
      "text": [
        "This section describes sonic experiments for positioning words in ISA MAP.",
        "Figure 4 shows part of the results.",
        "In the experiment, 2,000 nodes with the root \"physical object\" in ISA MAP were used.",
        "of the node.",
        "For example, the likely area of \"heavy oil\" is \"(object (material (fuel (gas, petroleum))))\", whose top node is very abstract.",
        "However, the relationship \"heavy oil and gash\" suggests the position of \"heavy oil.\"",
        "By using the proposed method, the existing thesaurus was expanded to cover a large quantity of text.",
        "Though ISAMAP was designed for general purposes, the method allows it to reflect a specific domain through the use of a. domain-dependent corpus.",
        "One of our goals is to develop a corpus-based thesaurus, consisting of a core thesaurus such as 1SAMAP and a corpus that reflects domain knowledge.",
        "When a thesaurus is used for NIT applications, such as an information retrieval and disamView- biguation system, there is no need for it to havewell-defined treelike structure.",
        "The system can use the thesaurus as a black box via certain functions.",
        "For example, the following functions are needed for a corpus-based thesaurus system:",
        "The experiment yielded several observations.",
        "points are strong clues for determining the suit able positions in the thesaurus for unknown words.",
        "In co-occurrence-based similarity calculation, words with strong similarities but whose relationships seem strange to human intuition reduce the accuracy of the proposed method.",
        "However, in many cases, these strong similarities are caused by less typical co-occurrences.",
        "In Figure 6, the words \"buy,\" \"purchase,\" and \"have\" convey less informative relationships than viewpoint relationships.",
        "If there are many relationships for an unknown word, the possibility of the existence of viewpoints will increase.",
        "However, some relationships may be noisy.",
        "Figure 9 shows the relationships between the number of relationships and the accuracy or positioning.",
        "In this case, the accuracy means the percentage of words for which the most preferable area estimated by the proposed method contained the node that the word really belonged to.",
        "As shown in Figure 9, 50-100 relationships are needed to estimate the nodes.",
        "On the other hand, too many relationships prevent the extraction of useful viewpoints.",
        "It is very difficult to position a. word with pinpoint accuracy.",
        "Experiment.",
        "showed that the following heuristic is useful.",
        "If an unknown word has conjunctive relationships with a node (word) in a, particular area.",
        "it can be positioned as a sibling positionW: returns the position (or path) of the word w. ttpe VO 'Min a C (W): returns the superordina.te words of the word w. subordinate(w): returns the subordinate words of the word w. simila•H: returns the words similar to w. disionm6v1, 10): returns the distance between wl and w2.",
        "It is important that the return values of the functions should be depend on the corpus and the local context of words.5 7'lle proposed method can be used to realize these functions.",
        "Viewpoints make it possible to realize a. dynamic interpretation of distance."
      ]
    },
    {
      "heading": "5 Related Work",
      "text": [
        "The method proposed here is related to two topics in the literature: automatic construction of a thesaurus and word-sense disa.mbiguation.",
        "There have been several st tidies of the automatic construction of thesauruses or sets of 1S-A relationships [7, 1].",
        "In these studies, the constructed relationships sometimes do not, match human intuition.",
        "IS-A rela.tionships do not.",
        "appear in the corpora.",
        "explicitly, and it, is therefore difficult to extract, them without, including noisy relationships.",
        "In our approach, a. core thesaurus is used to integrate human intuition with corpus-based co-occurrence information.",
        "Ya.rowsky proposed a method for word disambiguation using Rogers Thesaurus [9].",
        "I n Ids approach, a word whose senses are known (a word may have several senses) is disambiguate(' by using \"salient.",
        "words\" for each word-sense.",
        "A set, of salient words is a. list, of words with no relationships.",
        "In our approach, word-to-word relationships with markers are used, in order to reduce noises and to extract, viewpoints.",
        "Some other methods of word-sense disambiguation using WordNet have been proposed [2, 6, 3].",
        "Their approaches are similar to ours, with, the difference that the sense of a word to be placed in the thesaurus is unknown.",
        "Thousands of nodes in the thesaurus are candidates, and tin -fore, more subtle knowledge is needed.",
        "Use of a core thesaurus and viewpoints -, that is, word-to-word relationships with relation markers makes it possible to estimate a. suitable area for a.n unknown word."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "This paper has described a method for positioning tot known words in art existing thesaurus by using word-to-word relationships with relation markers extracted from a. large corpus.",
        "Suitable areas in the thesaurus for unknown words were estimated by integrating human intuition buried in the thesaurus with statistical data.",
        "extracted front the corpus.",
        "1;x-periments showed that, assigning \"viewpoints\" for each node gives important information can be used to estimate suitable positions in the thesaurus for unknown words.",
        "The following topics should he invest.igated in future work: • When an unknown word ha,s several word-senses, derivative meanings of it tend to lie buried among the candidates.",
        "If' we take the example of the word \"fighter\" used in this paper, \"weapon\" is recognized as a candidate area, but, is not given a, strong similarity.",
        "One reason for the problem is the lack of view-, points.",
        "More local contexts of the word are needed to specify such meanings.",
        "• The similarity value and viewpoints can be used to refine the structure of the thesaurus.",
        "They make it, possible to change dynamically the relationships between words in the thesaurus according to domain-sensitive corpus.",
        "We are now developing tIte general functions described in the previous section to realize a large-scale thesaurus for NIT systems.",
        "• if the number of occurrences of an unknown words is low, the proposed method tends to output larger areas as'poSitions.",
        "Other mi-traints such as use of local context are required.",
        "Acknowledgement We would like to thank Prof. Hozunii Tanaka, 'Tokyo Institute o ['Tech nology for allowing us to use ISA M AP."
      ]
    }
  ]
}
