{
  "info": {
    "authors": [
      "Masaaki Nagata",
      "Teruka Saito",
      "Kenji Suzuki"
    ],
    "book": "Workshop on Data-Driven Methods in Machine Translation",
    "id": "acl-W01-1413",
    "title": "Using the Web as a Bilingual Dictionary",
    "url": "https://aclweb.org/anthology/W01-1413",
    "year": 2001
  },
  "references": [
    "acl-J93-2003",
    "acl-P00-1062",
    "acl-P99-1068"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present a system for extracting an English translation of a given Japanese technical term by collecting and scoring translation candidates from the web.",
        "We first show that there are a lot of partially bilingual documents in the web that could be useful for term translation, discovered by using a commercial technical term dictionary and an Internet search engine.",
        "We then present an algorithm for obtaining translation candidates based on the distance of Japanese and English terms in web documents, and report the results of a preliminary experiment."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In the field of computational linguistics, the term ‘bilingual text’ is often used as a synonym for ‘parallel text’, which is a pair of texts written in two different languages with the same semantic contents.",
        "In Asian languages such as Japanese, Chinese and Korean, however, there are a large number of ‘partially bilingual texts’, in which the monolingual text of an Asian language contains several sporadically interlaced English words as follows: The above sentence is taken from a Japanese medical document, which says “Since glaucoma is now manageable if diagnosed early, macular degeneration is becoming a major cause of visual impairment in developed nations”.",
        "These partially bilingual texts are typically found in technical documents, where the original English technical terms are indicated (usually in parenthesis) just after the first usage of the Japanese technical terms.",
        "Even if you don’t know Japanese, you can easily guess ‘ ’ is the translation of ‘macular degeneration’.",
        "Partially bilingual texts can be used for machine translation and cross language information retrieval, as well as bilingual lexicon construction, because they not only give a correspondence between Japanese and English terms, but also give the context in which the Japanese term is translated to the English term.",
        "For example, the Japanese word ‘ ’ can be translated into many English words, such as ‘degeneration’, ‘denatu-ration’, and ‘conversion’.",
        "However, the words in the Japanese context such as ‘ (disease)’ and ‘ (impairment)’ can be used as informants guiding the selection of the most appropriate English word.",
        "In this paper, we investigate the possibility of using web-sourced partially bilingual texts as a continually-updated, wide-coverage bilingual technical term dictionary.",
        "Extracting the English translation of a given Japanese technical term from the web on the fly is different from collecting a set of arbitrary many pairs of English and Japanese technical terms.",
        "The former can be thought of example-based “ (macular degeneration) ” translation, while the latter is a tool for bilingual lexicon construction.",
        "Internet portals are starting to provide on-line bilingual dictionary and translation services.",
        "However, technical terms and new words are unlikely to be well covered because they are too specific or too new.",
        "The proposed term translation extractor could be an useful Internet tool for human translators to complement the weakness of existing on-line dictionaries and translation services.",
        "In the following sections, we first investigate the coverage provided by partially bilingual texts in the web as discovered by using a commercial technical term dictionary and an Internet search engine.",
        "We then present a simple algorithm for extracting English translation candidates of a given Japanese technical term.",
        "Finally, we report the results of a preliminary experiment and discuss future work."
      ]
    },
    {
      "heading": "2 Partially Bilingual Text in the Web",
      "text": []
    },
    {
      "heading": "2.1 Coverage of Fields",
      "text": [
        "It is very difficult to measure precisely in what field of science there are a large number of partially bilingual text in the web.",
        "However, it is possible to get a rough estimate on the relative amount in different fields, by asking a search engine for documents containing both Japanese and English technical terms in each field several times.",
        "For this purpose, we used a Japanese-to-English technical term dictionary licensed from NOVA, a maker of commercial machine translation systems.",
        "The dictionary is classified into 19 categories, ranging from aeronautics to ecology to trade, as shown in Table 1.",
        "There are 1,082,594 pairs of Japanese and English technical terms1 .",
        "We randomly selected 30 pairs of Japanese and English terms from each category and sent queries to an Internet search engine, Google (Google, 2001), to see whether there are any documents that contain both Japanese and English technical terms.",
        "The fourth column in Table 1 shows the percentage of queries (J-E pairs) returned by at least one document.",
        "It is very encouraging that, on average, 42% of the queries returned at least one document.",
        "The results show that the web is worth mining for bilingual lexicon, in fields such as aeronautics, computer, and law."
      ]
    },
    {
      "heading": "2.2 Classification of Format",
      "text": [
        "In order to implement a term translation extractor, we have to analyze the format, or structural pattern of the partially bilingual documents.",
        "There are at least three typical formats in the web.",
        "Figure 1 shows examples.",
        "aligned paragraph format table format plain text format In ‘aligned paragraph’ format, each paragraph contains one language and the paragraphs with different languages are interlaced.",
        "This format is often found in web pages designed for both Japanese and foreigners, such as official documents by governments and academic papers by researchers (usually title and abstract only).",
        "In ‘table’ format, each row contains a pair of equivalent terms.",
        "They are not necessarily marked by the TABLE tag of HTML.",
        "This format is often found in bilingual glossaries of which there are many in the web.",
        "Some portals offer hyper links to such bilingual glossaries, such as kotoba.ne jp (kotoba.ne jp, 2000).",
        "In ‘plain text’ format, phrases of different language are interlaced in the monolingual text of the baseline language.",
        "The vast majority of partially bilingual documents in the web belongs to this category.",
        "The formats of the web documents are so wildly different that it is impossible to automatically classify them to estimate the relative quantities belonging to each format.",
        "Instead, we examined the distance (in bytes) from a Japanese technical term to its corresponding English technical term in the documents retrieved from the web by the experiment described in the Section 2.1 Figure 2 shows the results.",
        "Positive distance indicates that the English term appeared after the Japanese term, while negative distance indicates the reverse.",
        "It is observed that the English and Japanese terms are likely to appear very close to Registration for Foreign Residents and Birth Registration The official name for registration for foreign residents in Japan as determined by the Ministry of Justice is Alien Registration ...",
        "Anyone staying in Japan for more than 90 days children born in Japan ...",
        "each other.",
        "28% (=233/847) of English terms appeared just after (within 10 bytes) the corresponding Japanese terms.",
        "58% (=490/847) of English terms appeared within 50 bytes.",
        "They probably reflect either table or plain text format.",
        "Although there are 28% (=237/847) English terms appeared outside the window of 200 bytes, we find this ‘distance heuristics’ very powerful, so it was used in the term translation algorithm described in the next section."
      ]
    },
    {
      "heading": "3 Term Translation Extraction Algorithm",
      "text": [
        "Let and be Japanese and English technical terms which are translations of each other.",
        "Let be a document, and let be a set of documents which includes the Japanese term .",
        "Let be a statistical translation model which gives the likelihood (or score) that and are translations of each other.",
        "Figure 3 shows the basic (conceptual) algorithm for extracting the English translation of a given Japanese technical term from the web.",
        "First, we retrieve all documents that contain the",
        "given Japanese technical term using a search engine.",
        "We then eliminate the Japanese only documents.",
        "For each English term contained in the (partially) bilingual documents, we compute the translation probability , and select the English term which has the highest translation probability.",
        "In practise, it is often prohibitive to down load all documents that include the Japanese term.",
        "Moreover, a reliable Japanese-English statistical translation model is not available at the moment because of the scarcity of parallel corpora.",
        "Rather, one of the aim of this research is to collect the resources for building such translation models.",
        "We therefore employed a very simplistic approach.",
        "Instead of using all documents including the Japanese term, we used only the predetermined number of documents (top 100 documents based on the rank given by the search engine).",
        "This entails the risk of missing the documents including the English terms we are looking for.",
        "Instead of using a statistical translation model, we used a scoring function in the form of a geometric distribution as shown in Equation (1).",
        "Here, is the byte distance between Japanese term and English term .",
        "It is divided by 10 and the integer part of the quotient is used as the variable in the geometric distribution ( indicates flooring operation).",
        "The parameter (the average) of the geometric distribution is set to 0.6 in our experiment.",
        "There is no theoretical background to the scoring function Equation (1).",
        "It was designed, after a trial and error, so that the likelihood of candidates pairs being translations of each other decreases exponentially as the distance between the two terms increases.",
        "Starting from the score of 0.6, it decreases 40% for every 10 bytes.",
        "If we observed the same pair of Japanese and English terms more than once, it is more likely that they are valid translations.",
        "Therefore, we sum the score of Equation (1) for each occurrence of pair and select the highest scoring English term as the translation of the Japanese term ."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": []
    },
    {
      "heading": "4.1 Test Terms",
      "text": [
        "In order to factor out the characteristics of the search engine and the proposed term extraction algorithm, we used, as a test set, those words that are guaranteed to have at lease one retrieved document that includes both Japanese and English terms.",
        "First, we randomly selected 50 pairs of such Japanese and English terms, from the pairs used in the experiment described in Section 2.1.",
        "They are shown in Figure 2.",
        "We then sent each Japanese term as a query to an Internet search engine, Google, and down loaded the top 100 web documents.",
        "“o” indicates that at least one of the down loaded documents included both terms.",
        "“x” indicates that no document included both terms.",
        "This resulted in a test set of 34 pairs of Japanese and English terms.",
        "For example, although there are a lot of documents which include both “ ” and “west”, the top 100 documents retrieved by “ ” as the query did not contain “west” since “ ” is a highly frequent Japanese word."
      ]
    },
    {
      "heading": "4.2 Extraction Accuracy",
      "text": [
        "Table 3 shows the extraction accuracy of the English translation of Japanese term.",
        "Since both Japanese and English terms could occur as a subpart of more longer terms, we need to consider local alignment to extract the English subpart corresponding to the Japanese query.",
        "Instead of doing this alignment, we introduced two partial match measures as well as exact matching.",
        "In Table 3, ‘exact’ indicates that the output is exactly matched to the correct answer, while ‘partial-1’ indicates that the correct answer was a subpart of the output; ‘partial-2’ indicates that at least one word of the output is a subpart of the correct answer.",
        "For example, the eye disease ‘ ’, whose translation is ‘macular degeneration’, is sometimes more formally refereed to as ‘ ’, whose translation is ‘age-related macular degeneration’.",
        "‘Partial-1’ holds if ‘age-related macular degeneration’ is extracted when the query is ‘ generation’ is included in the output when the query is ‘ ’.",
        "It is encouraging that useful outputs (either exact or partial matches) are included in the top 10 candidates with the probability of around 60%.",
        "Since we used simple string matching to measure the accuracy automatically, the evaluation reported in Table 3 is very conservative.",
        "Because the output contains acronyms, synonyms, and related words, the overall performance of the system is fairly credible.",
        "For example, the extracted translations for the query ‘ ’ (National Information Infrastructure) were as follows, where the second candidate is the correct answer.",
        "NII (nii) is the acronym for National Information Infrastructure, while GII (gii) and UNII (unii) stand for Global Information Infrastructure and Unlicensed National Information Infrastructure, respectively.",
        "If the query is a chemical substance, its molecular formula, instead of acronym, is often extracted, such as ‘HCOOCH3’ for ‘ (methyl formate).",
        "As for synonyms, although we took ‘operating expenses’ to be the correct translation for ‘ ’, the following third candidate ‘operating cost’ is also a legitimate translation.",
        "This is counted as ‘partial-2’ because ‘operating’ is a subpart of the correct answer.",
        "For your information, OHR (Over Head Ratio) is a management index and equals to the operating cost divided by the gross operating profit.",
        "‘Fa’ happened to be used three times in a tutorial document on accounting to stand for ‘operating expenses’, such as “ where ‘ ’ means ‘cost’.",
        "The following example is a combination of the acronyms, synonyms and related words, which is, in a sense, a typical output of the proposed system.",
        "The query is ‘ ’, and ‘climate study’ is the translation we assumed to be correct.",
        "A subpart of the 9th candidate ‘climate research’ is also a legitimate translation.",
        "‘WCRP’ is the acronym for ‘World Climate Research Pro-gramme’, which is the 9th candidate and is translated to ‘ ’ which includes the original Japanese query.",
        "‘WMO’ stands for World Meteorological Organization, which hosts this international program.",
        "In short, if you look at the extracted translations together with the context from which they are extracted, you can learn a lot about the relevant information of the query term and its translation candidates.",
        "We think this is a useful tool for human translators, and it could provide a useful resource for statistical machine translation and cross language information retrieval."
      ]
    },
    {
      "heading": "5 Discussion and Related Works",
      "text": [
        "Previous studies on bilingual text mainly focused on either parallel texts, non-parallel texts, or comparable texts, in which a pair of texts are written in two different languages (Veronis, 2000).",
        "However, except for governmental documents from Canada (English/French) and Hong Kong (Chinese/English), bilingual texts are usually subject to such limitations as licensing conditions, usage fees, domains, language pairs, etc.",
        "One approach that partially overcomes these limitations is to collect parallel texts from the web (Nie et al., 1999; Resnik, 1999).",
        "To provide better coverage with fewer restrictions, we focused on partially bilingual text.",
        "Considering the enormous volume of such texts and the variety of fields covered, we believe they are the best resource to mine for MT-related applications that involve English and Asian languages.",
        "The current system for extracting the translation of a given term is more similar to the information extraction system for term descriptions (Fujii and Ishikawa, 2000) than any other machine translation systems.",
        "In order to collect descriptions for technical term X, such as ‘data mining’, (Fujii and Ishikawa, 2000) collected phrases like “X is Y” and “X is defined as Y”, from the web.",
        "As our system used a scoring function based solely on byte distance, introducing this kind of pattern matching might improve its accuracy.",
        "Practically speaking, the factor that most influences the accuracy of the term translation extractor is the set of documents returned from the search engine.",
        "In order to evaluate the system, we used a test set that guarantees to contain at least one document with both the Japanese term and its English translation; this is a rather optimistic assumption.",
        "Since the search engine is an uncontrollable factor, one possible solution is to make your own search engine.",
        "We are very interested in combining such ideas as focused crawling (Chakrabarti et al., 1999) and domain-specific Internet portals (McCallum et al., 2000) with the proposed term translation extractor to develop a domain-specific on-line dictionary service."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "We investigated the possibility of using the web as a bilingual dictionary, and reported the preliminary results of an experiment on extracting the English translations of given Japanese technical terms from the web.",
        "One interesting approach to extending the current system is to introduce a statistical translation model (Brown et al., 1993) to filter out irrelevant translation candidates and to extract the most appropriate subpart from a long English sequence as the translation by locally aligning the Japanese and English sequences.",
        "Unlike ordinary machine translation which generates English sentences from Japanese sentences, this is a recognition-type application which identifies whether or not a Japanese term and an English term are translations of each other.",
        "Considering the fact that what the statistical translation model provides is the joint probability of Japanese and English phrases, this could be a more natural and prospective application of statistical translation model than sentence-to-sentence translation."
      ]
    }
  ]
}
