{
  "info": {
    "authors": [
      "Mark-Jan Nederhof",
      "Giorgio Satta"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J11-4009",
    "title": "Splittability of Bilexical Context-Free Grammars is Undecidable",
    "url": "https://aclweb.org/anthology/J11-4009",
    "year": 2011
  },
  "references": [
    "acl-C96-1058",
    "acl-J03-4003",
    "acl-P01-1017",
    "acl-P96-1023",
    "acl-P99-1059"
  ],
  "sections": [
    {
      "text": [
        "Mark-Jan Nederhof University of St. Andrews",
        "Giorgio Satta** University of Padua",
        "Bilexical context-free grammars (2-LCFGs) have proved to be accurate models for statistical natural language parsing.",
        "Existing dynamic programming algorithms used to parse sentences under these models have running time of O(|w|), where w is the input string.",
        "A 2-LCFG is splittable if the left arguments of a lexical head are always independent of the right arguments, and vice versa.",
        "When a 2-LCFGs is splittable, parsing time can be asymptotically improved to O(|w|).",
        "Testing this propertyis therefore of central interest to parsing efficiency.",
        "In this article, however, we show the negative result that splittability of 2-LCFGs is undecidable."
      ]
    },
    {
      "heading": "1.. Introduction",
      "text": [
        "Bilexical context-free grammars, or 2-LCFGs for short, are specialized context-free grammars where each nonterminal is associated with a terminal symbol representing a lexical element of the language of interest.",
        "Furthermore, no more than two symbols can be used in the right-hand side of a rule, and the terminal symbol associated with the left-hand side of a rule must also occur on the right-hand side.",
        "In this way, 2-LCFGs are able to specify syntactic constraints as well as lexically specific preferences that influence the combination of predicates with their arguments or modifiers.",
        "Models based on 2-LCFGs have therefore been of central interest in statistical natural language parsing, as they allow selection of high-quality parse trees.",
        "One can in fact see 2-LCFGs as abstract models of the head automata of Alshawi (1996), the probabilistic projective dependency grammars of Eisner (1996), and the head-driven statistical models of Charniak (2001) and Collins (2003).",
        "Parsing algorithms based on 2-LCFGs can be very efficient.",
        "In the general case, existing dynamic programming algorithms have running time of O(|w|), where w is the input string.",
        "(In this article we disregard complexity factors that depend on the input grammar, which we will consider to be constants.)",
        "In cases in which, for each (lexical) head, the two processes of generating its left and right arguments are, to some",
        "* School of Computer Science, University of St. Andrews, North Haugh, St. Andrews, Fife, KY16 9SX, Scotland.",
        "E-mail: markjan.nederhof@gmail.com.",
        "** Department of Information Engineering, University of Padua, via Gradenigo 6/A, I-35131 Padova, It E-mail: satta@dei.unipd.it.",
        "Submission received: 8 September 2010; revised submission received: 21 January 2011; accepted for publication: 17 April 2011.",
        "In the literature, this condition on independence between left and right arguments of each head has been called splittability (Eisner 1997; Eisner and Satta 1999).",
        "Testing for splittability on an input 2-LCFG is therefore of central interest to parsing efficiency.",
        "The computability of this test has never been investigated, however.",
        "In this article splittability is defined for 2-LCFGs in terms of equivalence to another grammar in which independence between left and right arguments of each head is ensured by a simple syntactic restriction.",
        "This restriction is called split form.",
        "Informally, a 2-LCFG is in split form if it can be factorized into individual subgrammars, one for each head, and each subgrammar produces the left and the right arguments of its head through two derivation processes, one happening strictly after the other.",
        "One may believe that a necessary and sufficient condition for splittability is that a 2-LCFG does not allow recursive structures that alternately generate left (L) and right (R) arguments of some head a.",
        "These structures could well result in subderivations producing sequences of the form LnaRn, for any n > 0, which would appear to preclude the application of the O(|w|) algorithm.",
        "This situation, however, does not mean in general that the grammar is not splittable.",
        "Although a subset of the rules in a grammar may generate structures such as those just discussed, there may be additional rules that make the observed dependencies between left and right arguments irrelevant.",
        "In fact, splittability of a 2-LCFG is undecidable, as will be shown in this article.",
        "Our result is based on the fact that it is undecidable whether a linear context-free grammar with a center marker (to be defined later) generates a regular language.",
        "This fact is originally proved in this article, and does not follow from the weaker result stating the undecidability of regularity of (general) linear context-free languages, which is well known in the formal language literature (Hopcroft and Ullman 1979, exercise 8.10a, page 214) and which is originally due to Hunt III and Rosenkrantz (1974).",
        "The remaining part of this article is organized as follows.",
        "In Section 2 we present some preliminary background, and in Section 3 we define 2-LCFGs and the notion of splittability.",
        "In Section 4 we prove the main result of this article, and draw some conclusions in Section 5."
      ]
    },
    {
      "heading": "2.. Preliminaries",
      "text": [
        "In this article we assume the reader is familiar with the notions of context-free grammar, Turing machine, and undecidability (see, e.g., Hopcroft and Ullman 1979).",
        "We briefly summarize the adopted notation now.",
        "A context-free grammar (CFG) is a 4-tuple G = (S, N, S, R), where S is a finite set of terminals, N is a finite set of nonterminals, disjoint from S and including the start symbol S,and R is a finite set of rules.",
        "Each rule has the form A – a, where A e N and a e (S U N)*.",
        "A CFG is called linear if each rule A – a has at most one nonterminal in the right-hand side a.",
        "and transitive closure of =$> is denoted as =$>*.",
        "The language generated by G is defined as L(G) = {w e S* | S ^* w}.",
        "Splittability of 2-LCFGs",
        "We now introduce a special class of CFGs that will play a central role in the proofs in this article.",
        "Assume a distinguished symbol # e S, which we will refer to as a center marker.",
        "The class of linear CFGs with center marker #, or lin-CFG(#) for short, is the class of CFGs in which each rule either has the form A – # or the form A – uBv, where A,B e N and u,v e (S \\{#})*, where symbol \"\\\" denotes set difference.",
        "We say a grammar in lin-CFG(#) is in binary form if the total length of u and v in rules A – uBv is at most 1.",
        "It is not difficult to see that there is a language-preserving transformation of grammars in lin-CFG(#) to binary form, as suggested by the following example.",
        "Example 1 S – aSa, S – aSb, S – bSa, S – bSb, S – #.",
        "For this grammar, strings in L(G) have the form u#v,with u e (S \\{#})* and v e (S \\ { #} ) * having the same length.",
        "A rule such as S – aSb can be replaced by a pair of rules in binary form, for example S – aA and A – Sb, where A is a new nonterminal."
      ]
    },
    {
      "heading": "3.. Bilexical CFGs and Splittability",
      "text": [
        "We start this section with the definition of 2-LCFG, which is based on Eisner and Satta (1999).",
        "Let ND be a finite alphabet whose symbols will be called delexicalized nonterminals.",
        "We combine Nd with a set S of terminal symbols as follows:",
        "ND(S) = {A[a] | A e ND, a e S}.",
        "A bilexical context-free grammar is a CFG G = (S, Nd (S) U{S}, S, R).",
        "Every rule in R has one of the following five forms:",
        "• A [a] – a.",
        "The nonterminal occurrences C[a]andB[a] in the second and third rules, respectively, and the nonterminal occurrence B[a] in the fourth rule will be referred to as head child occurrences.",
        "Notice that the head child of a rule is always associated with the same terminal as the left-hand-side nonterminal.",
        "The nonterminal occurrence A[a]inthe first rule, and the nonterminal occurrences B[b]and C[c] in the second and third rules, respectively, will be referred to as maximal projection occurrences.",
        "Observe how in a parse tree generated by a 2-LCFG, each occurrence of a lexical element (represented as a terminal symbol) is also part of several head child occurrences of nonterminals above it, up to some unique maximal projection occurrence.",
        "We assume that the head child occurrence in a rule is always marked within the rule itself, in order to disambiguate cases in which the head child and the maximal projection share the same terminal (a = b in the second rule or a = c in the third).",
        "Let G = (S, N, S, R) be a 2-LCFG and choose some A[a] e N that occurs as maximal projection in some rule in R. We now define a grammar G(A[a]) = (S(A[a]), N(A[a]), A[a], R(A[a])) in lin-CFG(a).",
        "The main idea here is that G(A[a]) captures all descending paths in parse trees of G from any maximal projection occurrence of A[a]downtoa,treatingthe maximal projection occurrences of G's nonterminals to the left and right of these paths as terminal symbols of G(A[a]).",
        "Each such maximal projection nonterminal B[b], when treated as a terminal, will be denoted as B[b].",
        "The start symbol is A [a] and the rule set R(A[a]) is specified as follows:",
        "• D[a] – a is in R(A[a]) for each rule D[a] – a in R.",
        "Grammar G(A[a]) might contain useless rules, that is, rules that never appear in a derivation of a string of the generated language, but this is irrelevant to the development of the results in this article.",
        "We now introduce an equivalence relation on 2-LCFGs, which will be used later in the definition of splittability.",
        "As we will see, our equivalence relation is stronger than the usual weak equivalence between grammars, where the latter only requires that the languages generated by two grammars be the same.",
        "In addition to weak equivalence, we demand that two 2-LCFGs establish the same predicate-argument dependencies between lexical elements in the generated sentences, as will be explained here.",
        "Definition 1",
        "Two 2-LCFGs G1 and G2 are d-equivalent if the following conditions are all satisfied:",
        "1.",
        "G1 and G2 have the same set of nonterminals that occur as maximal projections;",
        "2.",
        "G1 and G2 have the same rules rewriting the start symbol, that is, the rules of the form S – A[a]; and",
        "3. for each nonterminal A[a] that occurs as a maximal projection in G1 and G2, the grammars G1A[a]) and G2A[a]) generate the same languages.",
        "If two 2-LCFGs G1 and G2 are d-equivalent, then L(G1) = L(G2).",
        "1 One way to formalize this marking is to have a separate subset of delexicalized nonterminals that are part of each maximal projection occurrence and never a part of any head child occurrence.",
        "Splittability of 2-LCFGs",
        "We show the stronger statement that, for each maximal projection occurrence A[a]from G1 and G2 (item 1 in Definition 1) and for each w G S*, we have A [a] =Gt w if and only if A [a] =G2 w. The statement of the lemma easily follows from item 2 in Definition 1.",
        "We proceed by induction on |w|.",
        "tion 1 we also have A[a] ==G(A[a]) a and hence A [a] ==G2 a.",
        "The converse statement is shown similarly.",
        "Assume now \\wl > 1.",
        "If A [a] ==G1 w, there must be a \"head-driven\" derivation rewriting maximal projection occurrence A[a]intoa through a chain of head child nonterminal occurrences.",
        "More precisely, we can write:",
        "with l, r > 0, l + r > 0 (because Iwl > 1), and the indicated occurrence of a in uav is generated from A [a] through a chain of rule applications always rewriting the head child of the previous rule and generating the maximal projection occurrences B,[b,], 1 < i < l, and Cj[cj], 1 < j < r.",
        "Due to Equation (1) we have A [a] =*GA[a]) B1[b1] • • • Bl[bl]aC1[c1] • • • Cr [cr]and from item 3 in Definition 1 we have A[a] ==*G(A[a]) B1[b1] • • • Bl[bl]aC1[c1] • • • Cr[cr].",
        "We thus conclude that A[a] = *G2 B1[b1] Bl[bl]aC1[c1] Cr[cr].",
        "From Equation (1) we can also see that there must be strings ui,1 < i < l and vj, 1 < j < r,suchthat Bi[bi] =G1 ui and Cj[bj] =G1 vj, where u1 • • • ul = u and v1 • • • vr = v. Because each Bi[bi] and each Cj[cy] is a maximal projection occurrence, we can apply the inductive hypothesis and conclude that Bi[bi] = *G2 ui and Cj[bj] = *G2 vj,1< i < l and",
        "Besides enforcing the weak equivalence between two 2-LCFGs, the d-equivalence relation guarantees that the grammars establish the same dependencies between pairs of lexical elements in the generated sentences.",
        "To explain this, we borrow subsequently the notion of dependency structure from dependency grammars.",
        "Let G be a 2-LCFG and let t be a parse tree assigned by G to a string w G S*.",
        "We can associate with t a dependency structure, by considering all rule occurrences in t that link two lexical elements from w. For each rule occurrence A[a] – B[b] C[a] in t, a link is constructed from the corresponding occurrence of b in w to the corresponding occurrence of a.",
        "Similarly, a rule occurrence A [a] – B[a] C[c] gives rise to a link from the corresponding occurrence of c to the corresponding occurrence of a.",
        "Notice that a dependency structure abstracts away from some topological aspects of the parse trees.",
        "For example, two rules A [a] – B[a] C[c]and B[a] – D[d] E[a] could give rise to the same dependency structures as the two rules A [a] – D[d] F[a]and F[a] – E[a] C[c].",
        "It is not difficult to see that if two 2-LCFGs G1 and G2 are d-equivalent, then the sets of dependency structures they assign to strings in the common language (via the set of parse trees as sketched above) are identical.",
        "Example 2",
        "Consider the 2-LCFG G\\ defined by the rules:",
        "and the 2-LCFG G2 defined by the rules:",
        "A[a] – A'[a], A'[a] – A'[a] D[d], A'[a] – A'[a] E[e].",
        "G\\ and G2 are d-equivalent, and thus generate the same language by Lemma 1.",
        "This language consists of all strings of the form uav, where u €{b,c}* and v e{d,e}*.Fur-thermore, the set of dependency structures associated by G1 and G2 to any of the strings they can generate are the same.",
        "Figure 1 shows one instance of such a correspondence.",
        "Note that in addition to the tree in Figure 1(a), there are two more trees generated by grammar G1 that correspond to the dependency structure in Figure 1(c).",
        "Figure 1",
        "Two parse trees for the string bead under grammars G1 (a) and G2 (b)fromExample2.Bothtrees correspond to the same associated dependency structure (c).",
        "Splittability of 2-LCFGs",
        "We conclude this section with the definition of splittability, which is central to this article.",
        "We first introduce a special form for 2-LCFGs, which we call split form.",
        "The intuition is that a 2-LCFG is in split form if, for each maximal projection nonterminal occurrence A[a], all arguments on the left are generated first, followed by the generation of all arguments on the right.",
        "Definition 2",
        "A 2-LCFG G = (S,Nd(S) U{S}, S, R)isin split form if, for each maximal projection occurrence of a nonterminal A[a] g Nd(S), the nonterminals in G(A[a]) can be divided into two disjoint sets N(A[a]) and NA[a]),suchthat A[a] G N(A[a]) and all of the following conditions are satisfied:",
        "4. if D[a] – a in R(A[a]), then D[a] g NA[a]).",
        "Note that the left arguments of A [a] are generated via the nonterminals in N(A[a]), and the right arguments are generated via nonterminals in NA[a]).",
        "Furthermore, in the top-down generation of the arguments we can switch from nonterminals in N(A[a])to nonterminals in N(A[a]) only once, through a rule of the form D[a] – B[a]suchthat D[a] g N(A[a]) and B[a] g NA[a]), as stated by the third item in Definition 2.",
        "Grammar G2 from Example 2 is in split form, with N(A[a]) = {A[a]} and NA[a]) = {A'[a]}.",
        "The importance of 2-LCFGs in split form is that they allow parsing in time O(|w|), which is independent of the size of G assuming Nd is fixed.",
        "This contrasts with the time complexity o(|w|) for arbitrary 2-LCFGs.",
        "We say a 2-LCFG G1 is splittable if there is a 2-LCFG G2 in split form such that Gi and G2 are d-equivalent.",
        "Grammar Gi from Example 2 is splittable, because it is d-equivalent to grammar G2 in the same example, and the latter is in split form.",
        "Example 3",
        "Consider the 2-LCFG defined by the following rules:",
        "C[c] – c.",
        "Note that there is an equal number of arguments on either side of the head a.",
        "No 2-LCFG in split form can achieve this dependency, and therefore this grammar is not splittable.",
        "We can now formally prove that if a 2-LCFG is splittable, then the left arguments of each head are independent of its right arguments, and vice versa, in the sense that only a finite amount of information can be passed between the two sides.",
        "Theorem 1",
        "Let G be a 2-LCFG.",
        "G is splittable if and only if, for each maximal projection occurrence A[a]from G, the lin-CFG(a) G(A[a]) generates a regular language.",
        "If G is splittable, then there exists a split 2-LCFG Gs such that G and Gs are d-equivalent.",
        "Let A[a] be a nonterminal of Gs that occurs as maximal projection, and consider the lin-CFG(a) G^A[a]), whose nonterminals are partitioned into sets N(A[a]) and N(A[a]) as in Definition 2.",
        "It is not difficult to see that L(G^A[a])) is a regular language.",
        "This regular language is the finite union of the languages:",
        "for all possible distinct choices of rules of the form B[a] – C[a]from GSA[a]) with B[a] G N(A[a]) and C[a] G N(A[a]).",
        "For each such choice, the set of strings u is clearly regular, as it is generated by a right-linear subgrammar.",
        "Similarly, the set of strings v is regular.",
        "Because G and Gs are d-equivalent, it follows that each G(A[a]) generates a regular language as well.",
        "Conversely, assume that for each maximal projection occurrence A[a]fromG we have that G(A[a]) generates a regular language.",
        "Then we can construct an alternative grammar in lin-CFG(a) generating the same language as G(A[a]), but now in split form.",
        "To this end, assume a finite automaton M accepting L(G(A[a])) with a finite set Q of states and a transition relation – .",
        "For each transition q1 – q2 of M, we can construct right-linear rules corresponding to transitions occurring on paths from the initial state of M to state qi, and left-linear rules corresponding to transitions occurring on paths from state q2 to any final state of M. _",
        "Concretely, for each transition q – q' such that q1 is reachable from q', we construct rule q[a] – B[b] q'[a], and for each transition q – q' such that q is reachable from q2,we construct rule q'[a] – q[a] B[b].",
        "We also construct rule A[a] – q0[a], where q0 is the initial state of M,and therule q2[a] – a.",
        "For each final state qf of M that is reachable from q2we furthermore construct the rule q1[a] – qf [a].",
        "The resulting grammar generates the strings that are accepted by M by computations that traverse the transition q1 – q2.",
        "Each transition q1 – q2 gives rise to one such grammar.",
        "We can now take the disjoint union of such grammars for all transitions q1 – q2, taking different copies of automaton states q in nonterminals q[A] for each combination of q1 and q2.",
        "The result is a grammar generating all strings accepted by M. Nonterminals q[a] are defined to be in N(A[a]) or in NA[a]) depending on whether a state q1 in a transition q1 – q2 is reachable from q or whether q is reachable from a state q2 in a transition q1 – q2.",
        "Naturally A[a]istakentobein N(A[a]).",
        "The requirements on split form are now clearly satisfied.",
        "■"
      ]
    },
    {
      "heading": "4.. Undecidability Results",
      "text": [
        "This section presents the main results of this article.",
        "We start with some basic notions from computability theory and with the adopted notation for Turing machines.",
        "We use single-tape, single-head, deterministic Turing machines.",
        "A configuration of a Turing machine M is a string over some alphabet S, encoding the current content of the tape along with the position of the head on the tape and the current state.",
        "In the initial configuration, the tape contains the input to the Turing machine, the head is placed at the start of the tape, and the machine is in its (unique) initial state.",
        "An accepting configuration is any configuration of M of which the current state belongs to a distinguished set of accepting states.",
        "An accepting computation of M is a sequence of configurations of M starting with an initial configuration and ending with a final",
        "Splittability of 2-LCFGs",
        "configuration, and such that consecutive configurations are related by a valid move of the machine.",
        "Without loss of generality, we assume that any accepting computation has an odd number of moves, and at least three.",
        "For a given string w, we write w to denote the mirror image of w. Consider a Turing machine M whose configurations are defined over some alphabet S, and assume two fresh symbols $ and # not in S. Following the notation of Bordihn, Holzer, and Kutrib (2005), we encode accepting computations of M as strings of the form:",
        "Here, w0,w2k+1 are configurations of M,with w0 an initial configuration and w2k+1an accepting configuration.",
        "Furthermore, for each i with 0 < i < 2k, configuration is related to configuration wi+1 by a valid move of M. We define VALC(M)tobethe set of all valid computations of M, represented as before.",
        "We say that a string u is accepted by M if u occurs in an initial configuration w0 in some computation in VALC(M).",
        "The language L(M) is defined to be the set of all strings accepted by M.",
        "We rely on the following result (Hopcroft and Ullman 1979, page 189):",
        "For a Turing machine M, it is undecidable whether the language L(M)isfinite.",
        "We also need the following result, which is essentially the same as a result reported by Hopcroft and Ullman (1979, Lemma 8.8, page 204).",
        "We provide a complete proof here because we need to adapt the result to our special encoding of valid computations, which is somewhat different from that used by Hopcroft and Ullman (1979), and because Hopcroft and Ullman only report a sketch of the proof.",
        "For a Turing machine M, the language VALC(M) is context-free if and only if L(M)is finite.",
        "If L(M) is finite, then VALC(M) is also finite (because M is deterministic).",
        "Hence VALC(M) is a context-free language.",
        "If L(M ) is an infinite language, we need to show that VALC (M ) cannot be a context-free language.",
        "To this end, we use the version of Ogden's lemma presented by Hopcroft and Ullman (1979, page 129).",
        "This lemma states that if L is a context-free language, there exists a constant n such that, if we arbitrarily mark n or more distinct positions in a string in L, then we can write that string as uvwxy in such a way that v and x together include at least one marked position, vwx includes at most n marked positions, and uviwxiy is in L for any i > 0.",
        "Assume now that VALC(M) is a CFL.",
        "Because L(M) is an infinite language, the length of its strings can be arbitrarily large.",
        "Therefore there must be a string in",
        "VALC(M) of the form:",
        "with w2 having length greater than n. This is so because the initial configuration w0, representing the input string, can be chosen with arbitrarily large length, and only two moves of M have been applied to obtain w2 from w0.",
        "Let us mark all positions of a that",
        "Now let a = uvwxy be a factorization satisfying Ogden's lemma.",
        "If v or x contain one or more occurrences of the symbol $, we can pump such a string in a and obtain a new string which is not a valid computation, which is a contradiction.",
        "More precisely, assume that v contains exactly one occurrence of $, and write v = v'$v\".",
        "If we choose i = 3 in Ogden's lemma, we obtain a new string with two instances of configuration v''v' in it.",
        "This would imply a loop in the computation of a deterministic Turing machine, and therefore the resulting string cannot be an accepting computation.",
        "Using similar arguments, we can conclude that neither v nor x contains an occurrence of symbol $.",
        "Because v and x together must include at least one marked position, we can distinguish two (not necessarily distinct) cases.",
        "In the first case, v is entirely included in the string w2.",
        "This means that we can pump w2 to a new configuration of arbitrarily large length, without pumping w0.",
        "But this is a contradiction, because w0 and w2 are only two moves apart.",
        "In the second case, x is entirely included in the string w2.",
        "Similarly to the first case, we can pump w2 to a new configuration of arbitrarily large length, without pumping w1, but this is also a contradiction because the two configurations are related by a single move.",
        "Therefore VALC(M) cannot be a CFL.",
        "■",
        "We now define the set of invalid computations of M, written INVALC(M), as:",
        "We deviate from Bordihn, Holzer, and Kutrib (2005) in that we only consider those is, the linear context-free grammars with center marker #, introduced in Section 2.",
        "Our proof differs somewhat from proofs of similar statements in Hopcroft and Ullman (1979) for general linear CFGs, in that the center marker has a prominent role in the grammar, and the construction must ensure that # occurs exactly once.",
        "Given a Turing machine M, one can effectively construct a grammar in lin-CFG(#) generating INVALC(M).",
        "Intuitively, our grammar is the union of several subgrammars, which generate, respectively:",
        "a set of strings of the form (2) in which the w\\ can be arbitrary strings over S, except that w0 must not be an initial configuration, similarly, a set of strings of the form (2) in which w2k+1 must not be a final configuration, a set of strings of the form (2) in which for some i, w2i+1 must not be the successor of w2i-, fall within w2.",
        "if and only if INVALC(M) is a regular language.",
        "Splittability of 2-LCFGs",
        "a set of strings of the form (2) in which for some i, w2i- must not be the successor of w2i_1, a set of strings of the form:",
        "where ui e S* (1 < i < k), vj e S* (1 < j < m)and m < k.",
        "It is straightforward to construct each of these subgrammars as linear grammars with center marker #, similarly to proofs from Hopcroft and Ullman (1979, pages 203 and 215).",
        "The statement of the theorem then follows from the fact that the class lin-CFG(#) is closed under (finite) union.",
        "■",
        "We now show that it is undecidable whether a linear context-free grammar with a center marker generates a regular language.",
        "This result is stronger than a similar result stating the undecidability of regularity for general linear context-free languages, originally obtained by Hunt III and Rosenkrantz (1974) and also reported by Hopcroft and Ullman (1979, Exercise 8.10a, page 214), in that our languages have an explicit center marker that unambiguously splits the string into two parts.",
        "Here we report a direct proof of the result for linear context-free grammars with a center marker, whereas the similar result for general linear context-free grammars is indirectly obtained by Hunt III and Rosenkrantz (1974, Corollary 2.7(5) and discussion at page 66) through sufficient conditions for the undecidability of a family of general predicates.",
        "Theorem 2",
        "It is undecidable whether a grammar in lin-CFG(#) generates a regular language.",
        "Let M be a Turing machine.",
        "We start by claiming that L(M) is finite if and only if INVALC(M) is regular.",
        "To show this, assume first that L(M) is finite.",
        "Because our Turing machines are deterministic, VALC(M) is also finite, and therefore regular.",
        "From Equation (3), it follows that INVALC(M) is regular as well.",
        "Conversely, if INVALC(M) is regular, then so is VALC(M).",
        "This means that VALC(M) is context-free and, by Lemma 3, that L(M)isfinite.",
        "Suppose now that it is decidable whether a grammar in lin-CFG(#) generates a regular language.",
        "Following Lemma 4, we can effectively construct a grammar in lin-CFG(#) generating INVALC(M).",
        "Under our assumption, we can now decide whether INVALC(M ) is regular and hence, by our claim, whether L(M ) is finite.",
        "This contradicts Lemma 2.",
        "Hence, it must be undecidable whether a grammar in lin-CFG(#) generates a regular language.",
        "■ Example 4",
        "Consider the (unambiguous) grammar that is defined by the rules:",
        "Despite rules such as A – aAa and A – bAb, which by themselves may appear to make is in lin-CFG(a).",
        "In order to obtain the main result of this article, we only need to look at a very simple type of 2-LCFG in which we can identify a given linear context-free grammar with a center marker.",
        "Theorem 3",
        "Splittability of bilexical CFGs is undecidable.",
        "We show that the existence of an algorithm for deciding whether a 2-LCFG is splittable would imply an algorithm for deciding whether any grammar in lin-CFG(#) generates a regular language, contrary to Theorem 2.",
        "Let G1 be a grammar in lin-CFG(#).",
        "Without any loss of generality, we assume that:",
        "G1 is in binary form; the start symbol of G1 has the form S[#]; each nonterminal symbol of G1 has the form A[#], for some A;and each terminal symbol of G1 is either # or a symbol of the form B[b], for some B and some b.",
        "From G1 we construct a 2-LCFG G2 as follows.",
        "The start symbol of G2 is S^,and G2has a single rule – S[#] expanding the start symbol.",
        "Each rule from G1 is copied to be a rule of G2, after replacing each terminal symbol B[b] by a nonterminal B[b].",
        "The"
      ]
    },
    {
      "heading": "5.. Discussion",
      "text": [
        "Splittability of 2-LCFGs is of central importance to the processing efficiency of several models that are currently being used in statistical natural language parsing, as discussed in the Introduction.",
        "The notion of splittability has been originally introduced by Eisner (1997) and Eisner and Satta (1999) for the closely related formalism of head automaton grammars.",
        "In this article we gave an equivalent definition for 2-LCFGs, through the notion of d-equivalence, and we showed that splittability of 2-LCFGs is undecidable.",
        "remaining rules are of the form B[b] – b for each terminal symbol B[b]of G1.",
        "Splittability of 2-LCFGs",
        "The result immediately carries over to head automaton grammars, through the standard mapping defined by Eisner and Satta (1999).",
        "Our result is based on a characterization of the notion of splittability (theorem 1) in terms of a factorization of a bilexical CFG into linear context-free grammars with center markers, and on the regularity of these linear grammars.",
        "The same characterization has been claimed by Eisner and Satta (1999) relative to head automaton grammars, without a formal proof.",
        "Central to our result is a proof showing the undecidability of regularity for linear context-free grammars with center markers (Theorem 2).",
        "This strengthens an already known result stating the undecidability of regularity for general linear context-free languages.",
        "The main implication of our results is that mechanical analysis of a 2-LCFG will not suffice to determine whether the grammar is splittable or not.",
        "There are trivial sufficient conditions for splittability, as for example requiring that the grammar is already in the split form of definition 2.",
        "Also, if G(B[b]) has a single nonterminal, for each B[b]that occurs as maximal projection in a 2-LCFG G, then G is trivially splittable.",
        "It is an open problem whether splittability is decidable in case the number of nonterminals in each G(B[b]) is bounded by some constant larger than one.",
        "The proof techniques presented in this article do not seem to lend themselves to extension of our undecidability results in this direction.",
        "Other interesting sufficient conditions for splittability are not known.",
        "To obtain a more general setting, one might depart from 2-LCFGs and consider Chomsky normal form context-free grammars where each binary rule classifies its two nonterminals into functor (or predicate projection) and argument.",
        "Also in this case, one can pose the question of whether the two processes of generating the left and the right arguments of each predicate are independent one of the other.",
        "The results reported in this article can be extended to show undecidability of this question as well."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We are indebted to the anonymous reviewers for many detailed and helpful comments.",
        "Among other things, the terminology has been improved relative to the first version of this article.",
        "This we owe to a valuable suggestion from one of the reviewers."
      ]
    }
  ]
}
