{
  "info": {
    "authors": [
      "Gideon S. Mann"
    ],
    "book": "Human Language Technologies 2007: the Conference of the North American Chapter of the Association for Computational Linguistics; Proceedings of the Main Conference",
    "id": "acl-N07-1042",
    "title": "Multi-Document Relationship Fusion via Constraints on Probabilistic Databases",
    "url": "https://aclweb.org/anthology/N07-1042",
    "year": 2007
  },
  "references": [
    "acl-C96-1079",
    "acl-N06-1038",
    "acl-P02-1006",
    "acl-P04-1053",
    "acl-P04-1073",
    "acl-P05-1045",
    "acl-P05-1060",
    "acl-P05-1061"
  ],
  "sections": [
    {
      "text": [
        "Multi-document Relationship Fusion via Constraints on Probabilistic Databases",
        "Gideon Mann",
        "Previous multi-document relationship extraction and fusion research has focused on single relationships.",
        "Shifting the focus to multiple relationships allows for the use of mutual constraints to aid extraction.",
        "This paper presents a fusion method which uses a probabilistic database model to pick relationships which violate few constraints.",
        "This model allows improved performance on constructing corporate succession timelines from multiple documents with respect to a multi-document fusion baseline."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Single document information extraction of named entities and relationships has received much attention since the MUC evaluations in the mid-90s (Ap-pelt et al., 1993; Grishman and Sundheim, 1996).",
        "Recently, there has been increased interest in the extraction of named entities and relationships from multiple documents, since the redundancy of information across documents has been shown to be a powerful resource for obtaining high quality information even when the extractors have access to little or no training data (Etzioni et al., 2004; Hasegawa et al., 2004).",
        "Much of the recent work in multi-document relationship extraction has focused on the extraction of isolated relationships (Agichtein, 2005; Paşca et al., 2006), but often the goal, as in single document tasks like MUC, is to extract a template or a relational database composed of related facts.",
        "With databases containing multiple relationships, the semantics of the database impose constraints on possible database configurations.",
        "This paper presents a statistical method which picks relationships which violate few constraints as measured by a probabilistic database model.",
        "The constraints are hard constraints, and robust estimates are achieved by accounting for the underlying extraction/fusion uncertainty.",
        "This method is applied to the problem of constructing management succession timelines which have a rich set of semantic constraints.",
        "Using constraints on probabilistic databases yields F-Measure improvements of 5 to 18 points on a per-relationship basis over a state-of-the-art multi-document extraction/fusion baseline.",
        "The constraints proposed in this paper are used in a context of minimally supervised information extractors and present an alternative to costly manual annotation."
      ]
    },
    {
      "heading": "2. Semantic Constraints on Databases",
      "text": [
        "This paper considers management succession databases where each record has three fields: a CEO's name and the start and end years for that person's tenure as CEO (Table 1 Column 1).",
        "Each record is represented by three binary logical predicates: ceo(c,x), start(x,y), end(x,y), where c is a company, x is a CEO's name, and y and y are years.",
        "Table 1: Database semantics can provide 1) a method to augment the explicit relationships in the database with implicit relationships and 2) logical constraints on these explicit and implicit relationships.",
        "In the above table, c is a company, x% is a person, and y% is a time.",
        "In this setting, database semantics allow for the derivation of other implicit relationships from the database: the immediate predecessor of a given CEO (precedes(x,x)), all predecessors of a given CEO (predates(x ,x)) and all years the CEO was in office (inojfice(x,y)), where x is a CEO's name and t a year (Table 1 Column 2).",
        "These implicit relationships and the original explicit relationships are governed by a series of semantic relations which impose constraints on the permissible database configurations (Table 1 Column 3).",
        "For example, it will always be true that a CEO's start date precedes their end date:",
        "Vx : start(x, y),end(x, y) => y < y .",
        "Multi-document extraction of single relationships exploits redundancy and variety of expression to extract accurate information from across many documents.",
        "However, these are not the only benefits of extraction from a large document collection.",
        "As well as being rich in redundant information, large document collections also contain a wealth of secondary relationships which are related to the relationship of interest via constraints as described above.",
        "These secondary relationships can yield benefits to augment those achieved by redundancy."
      ]
    },
    {
      "heading": "3. Multi-Document Database Fusion",
      "text": [
        "There are typically two steps in the extraction of single relationships from multiple documents.",
        "In the first step, a relationship extractor goes through the corpus, finds all possible relationships r in all sentences s and gives them a score p(r|s).",
        "Next, the",
        "ity, typically binary relationships are combined (McDonald et al., 2005).",
        "relationships are fused across sentences to generate one score <<r for each relationship.",
        "This paper proposes a third step which combines the fusion scores across relationships.",
        "This section first presents a probabilistic database model generated from fusion scores and then shows how to use this model for multi-document fusion.",
        "A relationship r is defined to be a 3-tuple rt'a'b = r(t, a, b), where t is the type of the relationship (e.g. start), and a and b are the arguments of the binary relationship.",
        "To construct a probabilistic database for a given corpus, the weights generated in relationship fusion are normalized to provide the conditional probability of a relationship given its type:",
        "Z^ri:rt=t Yrt,a,b where < r is the fusion score generated by the extraction/fusion system.",
        "By applying a prior over types p(t), a distribution p(r1,t1) can be derived.",
        "Given strong independence assumptions, the probability of an ordered database configuration R = r1,,n of types t1..n is:",
        "Explicit Relationships",
        "Implicit Relationships",
        "Logical Constraints (a partial list)",
        "ceo(c, x) start(x, y) end(x, y)",
        "precedes(x ,x) inojfice(x, y) predates(x, x)",
        "ceo(c,x), precedes(x ,x) <^ ceo(c,x), end(x,y), start(x, y) start(x,y), inojfice(x,y), end(x, y) => y < y < yinojfice(x, y), inoffice(x, y), y < y => predates(x ,x) precedes(x ,x), inojfice(x ,y), inojfice(x,y) => y < y",
        "As proposed, the model in Equation 1 is faulty since the relationships in a database are not independent.",
        "Given a set of database constraints, certain database configurations are illegal and should be assigned zero probability.",
        "To address this, the model in Equation 1 is augmented with constraints that explicitly set the probability of a database configuration to zero when they are violated.",
        "A database constraint is a logical formula n(ri..n('q)), where n(rj) is the arity of the constraint n. For the constraints presented in this paper, all constraints n are modeled with two terms na and rf where:",
        "For a set of relationships, a constraint holds if rj() is true, and the constraint applies if rja() is true.",
        "A constraint rj() can only be violated (false) when the constraint applies, since: (false => X) = true.",
        "In application to a database, each constraint rj is quantified over the database to become a quantified constraint rjrin.",
        "For example, the constraints that a person's start date must come before their end date is universally quantified over all pairs of relationships in a configuration R = r^n:",
        "(r\\ = start, r\\ = end, rc^ (ryear < rfar).",
        "This constraint applies to start and end relationships whose CEO argument matches and is violated when the years are not in order.",
        "If the quantified constraint nn „ is true for a given database configuration r\\^nthen it holds.",
        "To ensure that only legal database configurations are assigned positive probabilities, Equation 1 is augmented with a factor 1 if nn..n holds 0 otherwise.",
        "To include a constraint r , the database model in Equation 1 is extended to be:",
        "Pn {r\\..n,t\\.",
        "where Z is the partition function and corresponds to the total probability of all database configurations.",
        "A set of constraints n1..Q = n--nQ can be integrated similarly:",
        "ri..",
        "With these added constraints, the probabilistic database model assigns non-zero probability only to databases which don't violate any constraints.",
        "3.2 Constraints on Probabilistic Databases for Relationship Rescoring",
        "Though the constrained probabilistic database model in Equation 2 is theoretically appealing, it would be infeasible to calculate its partition function which requires enumeration of all legal 2ndatabases.",
        "This section proposes two methods for re-scoring relationships with regards to how likely they are to be present in a legal database configuration using the model proposed above.",
        "The first method is a confidence estimate based on how likely it is that r holds for a given relationship r1 :",
        "where the expectation that the constraint holds is equivalent to the likelihood ratio between the database probability models with and without constraints.",
        "In effect, this model measures the expectation that the constraint holds for a finite database \"look-ahead\" of size n(n) – 1.",
        "With this method, for a constraint to reduce the confidence in a particular relationship by half, half of all configurations would have to violate the constraint.",
        "Since inconsistencies are relatively rare, for a given relationship An(r,t) œ 1 (i.e. almost all small databases are legal).",
        "To remedy this, another factor <fia is defined similarly to (f)T, except that it takes a value of 1 only if the constraint applies to that database configuration.",
        "An applicability probability model is then defined as:",
        "rl.",
        "The second confidence estimate is based on how likely it is that the constraint is holds in cases where it applies (i.e. is not violated):",
        "nS P(ri ,ti",
        "When the constraint doesn't apply it cannot be violated, so this confidence estimate ignores those configurations that can't be affected by the constraint.",
        "Recall that AT(r,t) is the likelihood ratio between the probability of configurations in which r holds for constraint n and all configurations.",
        "In contrast, ATa (r, t) is the likelihood ratio between the database configurations where r applies and holds for n and the database configurations where n applies.",
        "In the later ratio, for confidence in a particular relationship to be cut in half, only half of the configurations which might actually contain an inconsistency would be required to produce a violation.As a result, ATa (r, t) gives a much higher penalty to relationships which create inconsistencies than does A, (r, t).",
        "In order to apply multiple constraints, independent database look-aheads are generated for each constraint q:",
        "Ani..Q>ai..Q (ri,ti) = Y\\At<i ,aq (ri,h).",
        "For a particular relationship type, these confidence scores are calculated and then used to rank the relationships via:",
        "Databases with different precision/recall trade offs can be selected by descending the ranked list."
      ]
    },
    {
      "heading": "4. Experiments",
      "text": [
        "In order to test the fusion method proposed above, human annotators manually constructed truth data of complete chief executive histories for 18 Fortune-500 companies using online resources.",
        "Extraction from these documents is particularly difficult because these data have vast differences in genre and style and are considerably noisy.",
        "Furthermore, the task is complicated to start with.",
        "A corpus was created for each company by issuing a Google query for \"CEO-of-Company OR Company-CEO\", and collecting the top ranked documents, generating up to 1000 documents per company.",
        "The data was then split randomly into training, development and testing sets of 6, 4, and 8 companies.",
        "Training : Anheuser-Busch, Hewlett-Packard,",
        "Lenner, McGraw-Hill, Pfizer, Raytheon Dev.",
        ": Boeing, Heinz, Staples, Textron Test : General Electric, General Motors, Gannett, The Home Depot, IBM, Kroger, Sears, UPS",
        "Ground truth was created from the entire web, but since the corpus for each company is only a small web snapshot, the experimental results are not similar to extraction tasks like MUC and ACE in that the corpus is not guaranteed to contain the information necessary to build the entire database.",
        "In particular,",
        "1) Only one start or end per person.",
        "2) Only a CEO's start or end dates belong in the database.",
        "3) Start dates come before end dates.",
        "4) Can't be in the middle of someone else's tenure.",
        "Vr1,r2 ,r3 : Tj(r1,r2,rs) = (r1ype = start U inof fice,r22ype = end U inof fice,rt3ype = start U inoffice U end, rce° = rc2eo = rleo,r\\ear < ryear) == (ryear < ryear U ryear > ryear)_",
        "5) CEO's are only in office after their start.",
        "6) CEO's are only in office before their end.",
        "(r{ype = end,rt2ype = start,rtype = precedes, rrf° = rfirst ,rrf° = rjecond) == (ryear = ryear)_8) All of the someone's dates (start, inoffice, end) are before their successors.",
        "Vr1,r2 ,r3 : Tj(r1,r2,rs) = (r1ype = start U end U inof f ice,rtype' = start U inoffice U end,rtype = precedes,",
        "rceo = rfirst rceo = rsecond) .",
        "(ryear ^ ryear)",
        "9) Only CEO succession in the database.",
        "Table 2: For a CEO succession database like the one presented in Table 1, the above constraints must hold if the database is consistent.",
        "many CEOs from pre-Internet years were either infrequently mentioned or not mentioned at all in the database.",
        "In the following experiments, recall is reported for facts that were retrieved by the extraction system.",
        "A two-class maximum-entropy classifier was trained for each relationship type.",
        "Each classifier takes a sentence and two marked entities (e.g. a person and a year) and gives the probability that a relationship between the two entities is supported by the sentence.",
        "For each relationship type, one of the elements is designated as the \"hook\" in order to generate likely negative examples.",
        "In training, all entity pairs are collected from the corpus.",
        "The pairs whose \"hook\" element doesn't appear in the database are thrown out.",
        "The remaining pairs are then marked",
        "CEO.",
        "by exact match to the database.",
        "In testing, the relationship extractor yields the probability p(rls) of an entity pair relationship r in a particular sentence s.",
        "The features used in the classifier are: unigrams between the given information and the target, distance in words between the given information and the target, and the exact string between the given information and the target (if less that 3 words long).",
        "After extraction from individual sentences, the relationships are fused together such that there is one score for each unique entity pair.",
        "In the case of person names, normalization was performed to merge coreferent but lexically distinct names (e.g. \"Phil",
        "Condit\" and \"Philip M. Condit\").",
        "In the following experiments, the baseline fusion score is:",
        "Given the management succession database proposed in Section 2, Table 2 enumerates a set of quantified constraints.",
        "Information extraction and fusion were run separately for each company to create a probabilistic database.",
        "In this section, various constraint sets are applied, either individually or jointly, and evaluated in two ways.",
        "The first measures per-relationship precision/recall using the model pro-",
        "Baseline Only One (1) CEOs Only (2) Start Before End (3) Inoffice After Start (5)",
        "Figure 1: Precision/Recall curve for start(x,t) relationships.",
        "The joint constraint \"2,3,5,8\" is the best performing, even though constraints \"3\" and \"8\" (not pictured) alone don't perform well.",
        "posed and the second looks at the precision/recall of a heterogeneous database with many relationship types.",
        "Both evaluations examine the ranked lists of relationships, where the relationships are ranked by rescoring via constraints on probabilistic databases (Equation 3) and compared to the baseline fusion score (Equation 4).",
        "The evaluations use two standard metrics, interpolated precision at recall level i (Pr), and MaxF1:",
        "MaxF1 = max – -j- .",
        "Figures 1, 2, and 3 show precision/recall curves for the application of various sets of constraints.",
        "Table 3 lists the MaxF1 scores for each of the constraint variants.",
        "For start and end, the majority of constraints are beneficial.",
        "For precedes, only the constraint that improved performance constraints both people in the relationship to be CEOs.",
        "Across all relationships, performance is hurt when using the constraint that there could only be one relationship of each type for a given CEO.",
        "The reason behind this is that the confidence estimate based on this constraint favors relationships with few competitors, and those relationships are typically for people who are infrequent in the corpus (and therefore unlikely to be CEOs).",
        "The best-performing constraint sets yield between 5 and 18 points of improvement on Max F1 (Table 3).",
        "Surprisingly, the gains from joint con-",
        "Baseline Only One (1) CEOs Only (2) Inoffice Before End (6)",
        "Figure 2: Precision/Recall curve for end(x,t) relationships alone.",
        "The joint constraint \"2,6\" is the best performing.",
        "Baseline End is Start (7) First Before Second (8) Only CEO Succession (9)",
        "Figure 3: Precision/Recall for precedes(x,y) relationships alone.",
        "Though the constraint \"First Before Second (8)\" helps performance on start(x,t) relationships, the only constraint which aids here is \"Only CEOs Succession (9)\".",
        "straints are sometimes more than their additive gains.",
        "\"2,3,5,6,8\" is 6 points better for the start relationship than \"2,3,5,6\", but the gains from \"8\" alone are negligible.",
        "These performance gains on the individual relationship types also lead to gains when generating an entire database (Figure 4).",
        "The highest performing constraint is the \"CEOs Only (2)\" constraint, which outperforms the joint constraints of the previous section.",
        "One reason the joint constraints don't do as well here is that each constraint makes the confidence estimate smaller and smaller.",
        "This doesn't have an effect when judging the relationship types individually, but when combining the relationships results, the fused relationships types (start, end) be-",
        "Table 3: Max F1 scores for three relationships Start(x,t), End(x,t) and Precedes(x,y)) in isolation and within the context of whole database DB.",
        "The joint constraints perform best for the explicit relationships in isolation.",
        "Using constraints on implicit derived fields (Inoffice and Precedes) provides additional benefit above constraints strictly on explicit database fields (start, end, ceo).",
        "come artificially lower ranked than the unfused relationship type (ceo).",
        "The best performing contrained probabilistic database approach beats the baseline by 5 points."
      ]
    },
    {
      "heading": "5. Related Work",
      "text": [
        "Techniques for information extraction from minimally supervised data have been explored by Brin (1998), Agichtein and Gravano (2000), and Ravichandran and Hovy (2002).",
        "Those techniques propose methods for estimating extractors from example relationships and a corpus which contains instances of those relationships.",
        "Nahm and Mooney (2002) explore techniques for extracting multiple relationships in single document extraction.",
        "They learn rules for predicting certain fields given other extracted fields (i.e. a someone who lists Windows as a specialty is likely to know Microsoft Word).",
        "Perhaps the most related work to what is presented here is previous research which uses database information as co-occurrence features for information extraction in a multi-document setting.",
        "Mann",
        "Figure 4: Precision/Recall curve for whole database reconstruction.",
        "Performance curves using constraints dominate the baseline.",
        "and Yarowsky (2005) present an incremental approach where co-occurrence with a known relationship is a feature added in training and test.",
        "Culotta et al.",
        "(2006) introduce a data mining approach where discovered relationships from a database are used as features in extracting new relationships.",
        "The database constraints presented in this paper provide a more general framework for jointly conditioning multiple relationships.",
        "Additionally, this constraint-based approach can be applied without special training of the extraction/fusion system.",
        "In the context of information fusion of single relationships across multiple documents, Downey et al.",
        "(2005) propose a method that models the probabilities of positive and negative extracted classifications.",
        "More distantly related, Sutton and McCallum (2004) and Finkel et al.",
        "(2005) propose graphical models for combining information about a given entity from multiple mentions.",
        "In the field of question answering, Prager et al.",
        "(2004) answer a question about the list of compositions produced by a given subject by looking for related information about the subject's birth and death.",
        "Their method treats supporting information as fixed hard constraints on the original questions and are applied in an ad-hoc fashion.",
        "This paper proposes a probabilistic method for using constraints in the context of database extraction and applies this method over a larger set of relations.",
        "Richardson and Domingos (2006) propose a method for reasoning about databases and logical constraints using Markov Random Fields.",
        "Their model applies reasoning starting from a known database.",
        "In this paper the database is built from extraction/fusion of relationships from web pages and contains a significant amount of noise.",
        "Max F1",
        "Constraint Set",
        "Start",
        "End",
        "Pre.",
        "DB",
        "0 (baseline)",
        "31.2",
        "35.8",
        "34.5",
        "37.9",
        "Only One (1)",
        "10.5",
        "7.2",
        "-",
        "38.1",
        "CEOs Only (2) or (9)",
        "43.3",
        "39.4",
        "39.4",
        "42.9",
        "Start Before End (3)",
        "40.8",
        "32.8",
        "-",
        "40.9",
        "No Overlaps (4)",
        "31.5",
        "35.9",
        "-",
        "36.8",
        "Inoffice After Start (5)",
        "32.5",
        "-",
        "-",
        "38.2",
        "Inoffice Before End (6)",
        "-",
        "36.5",
        "-",
        "37.4",
        "End is Start (7)",
        "7.3",
        "8.0",
        "20.7",
        "39.2",
        "First before Second (8)",
        "31.4",
        "35.6",
        "26.3",
        "38.1",
        "2,5,6",
        "43.3",
        "40.8",
        "-",
        "42.7",
        "2,3,5,6",
        "43.9",
        "43.3",
        "-",
        "42.2",
        "2,3,5,6,8",
        "49.3",
        "43.9",
        "26.3",
        "40.9"
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "This paper has presented a probabilistic method for fusing extracted facts in the context of database extraction when there exist logical constraints between the fields in the database.",
        "The method estimates the probability than the inclusion of a given relationship will violate database constraints by taking into account the uncertainty of the other extracted relationships.",
        "Along with the relationships explicitly listed in the database, constraints are formed over implicit fields directly recoverable from the explicit listed relationships.",
        "The construction of CEO succession timelines using minimally trained extractors from web text is a particularly challenging problem because of noise resulting from the wide variation in genre in the corpora and errors in extraction.",
        "The use of constraints on probabilistic databases is effective in resolving many of these errors, leading to improved precision and recall of retrieved facts, with F-measure gains of 5 to 18 points.",
        "The method presented in this paper combines symbolic and statistical approaches to natural language processing.",
        "Logical constraints are made more robust by taking into account the uncertainty of the extracted information.",
        "An interesting area of future work is the application of data mining to search for appropriate constraints to integrate into this model."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This work was supported in part by DoD contract #HM1582-06-1-2013.",
        "Any opinions, findings and conclusions or recommendations expressed in this material belong to the author and do not necessarily reflect those of the sponsor."
      ]
    }
  ]
}
