{
  "info": {
    "authors": [
      "Laurent Prévot",
      "Stefano Borgo",
      "Alessandro Oltramari"
    ],
    "book": "Proceedings of OntoLex 2005 – Ontologies and Lexical Resources",
    "id": "acl-I05-7013",
    "title": "Interfacing Ontologies and Lexical Resources",
    "url": "https://aclweb.org/anthology/I05-7013",
    "year": 2005
  },
  "references": [
    "acl-W99-0501"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "During the last few years, a number of works aiming at interfacing ontologies and lexical resources have been initiated.",
        "This paper aims at clarifying the current picture of this domain.",
        "It compares ontologies built following different methodologies and analyses their combination with lexical resources.",
        "A point defended in the paper is that different methodologies lead to very different characteristics for the resulting resources.",
        "We classify these methodologies show how actual projects fit into this classification."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "During the last few years, ontologies and lexical resources have been put under the spotlight for dealing with various NLP tasks such as word sense disambiguation and bridging resolution.",
        "Interfacing ontology and computational lexicon has been presented as a promising approach for Human Language Technologies (HLT), from classical NLP tasks to meaning negotiation in multi-agent systems.",
        "In this paper we aim at clarifying the populated landscape of the ongoing initiatives in the domain.",
        "We will introduce in section 2 our methodology classification for combining ontologies and lexical resources.",
        "Then we will survey some of the most popular top-level ontologies, namely Dolce (Masolo et al., 2003), opencyc and sumo (Niles and Pease, 2001).",
        "'The terms \"computational lexicon\" and \"lexical resource\" are often used as synonyms in the literature.",
        "These ontologies are quite different although this might not be evident to the newcomer.",
        "The purpose of the section 3 is to highlight the methodologies used for building them.",
        "In section 4, on the ground of the first two sections we will show how actual initiatives fit into our classification.",
        "The lexical resources considered in the paper are basically those of the WordNet family (Fellbaum, 1998).",
        "We will conclude with some comments on multi-linguality issues.",
        "2 Classifying experiments in ontologies and lexical resources The main aim of interfacing ontologies and lexical resources is the development of machine-understandable knowledge bases to be used in Human Language Technologies.",
        "The need for such integrated knowledge resources is a central issue for the next generation tools envisaged by the Semantic Web, where knowledge sharing, information integration, interoperability and semantic adequacy are main requirements.",
        "Different methods may guide the linking of ontologies and lexical resources, depending on the final result one intends to achieve, namely to enhance the coverage of an ontology or to build a system comprising properties of an ontology and a lexical resource.",
        "A generalization of these tasks may suggest the following methodological options: {i) restructuring a computational lexicon on the basis of ontological-driven principles; {ii) populating an ontology with lexical information; aligning an ontology and a lexical resource The first option {i) concentrates on the lexical resource and involves the ontology only at the \"metalevel\": the ontological restructuring is carried out following formal constraints of ontological design (Guarino and Welty, 2004), for instance introducing the ontological distinction between role or type for concepts.",
        "On the other side, {ii) requires to map lexical units to ontological entries, focusing on the \"object-level\" (Niles and Pease, 2001): in this case the formal constraints correspond to ontological categories and relations already implemented in an existing ontology.",
        "In this simplifying view, a computational lexicon and an ontology are taken as bare taxonomies of terms, the former contains only lex-icalised concepts (i.e. substance) and linguistic relations (i.e. hyponymy) while the latter provides formal structure of both lexicalised and not-lexicalised concepts (i.e. amount-of-matter) and relations (part-of).",
        "It is clear then that this second method has to include a comparative analysis of the ontology and the lexical resource in order to find bridging synonymous terms, including the search for cases of possible homonyms too.",
        "Finally {Hi), the most complete of the proposed approaches, collects both the \"meta-level\" and \"object-level\" character of the previous approaches in order to produce a system that is ontologically sound and linguistically motivated (Oltramari et al., 2002).",
        "The experimental perspectives focused in this paper will show that ontologies and lexical resources generally keep their own peculiarities in the process of integration: in other words, neither {ii) nor {Hi) bring to an actual merging of ontological properties and lexical information.",
        "Although it is possible for different ontologies to be coherently merged in a new one - associating semantically similar concepts and finding the points of intersection (Taboada et al., 2005) - the real benefit of integrating ontologies and computational lexicons follows from keeping them as distinct layers of semantic information, albeit improved by their mutual linkings and features.",
        "This is the main reason why we choose the term alignment (and not merging) for the most advanced interfacing method, i.e. {Hi).",
        "As stated above, both ontologies and lexical resources may be built around a taxonomic structure; however they often include information of different type as well.",
        "Consider an axiomatic ontology like Dolce (Masolo et al., 2003): it provides an axiomatisation of part-of, constitution, dependence, participation, that is, it characterizes several non-hierarchical relations.",
        "Similarly, a lexical resource like the Princeton WordNet (Fellbaum, 1998) is organised as a semantic network, whose nodes (sets of synonym terms) are bound together by several lexical and conceptual relations (besides hy-ponymy/hyperonymy we have meronymy, antonymy, causation, entailment and so on).",
        "This fact suggests the introduction of another dimension here called contraint density, which, as far as we know, has not been considered in the literature.",
        "Constraints density captures the density of the \"network of constraints\" that holds between the concepts.",
        "It can be opposed to the concept density that situates ontologies from top-level to domain-level (see Fig. 1).",
        "Constraint density deals with non-hierarchical features of ontologies and lexical resources, like extension with axioms for dependence, participation and constitution, formalization of meronymy relation, translation of glosses into axioms and consistency checks (See for instance (Gangemi et al., 2003b)).",
        "Participation, Top-level Mid-level Domain-level Concept density Figure 1 : Concept and constraint density To make an analogy with the ontology development terminology, resources having very dense constraint network correspond to heavyweight ontologies while loose constraint network can be assodated to lightweight ontologies (Guarino, 1998a; Gômez-Pérez et al., 2004).",
        "Lexical resources are conceptually very dense but they do not have a dense network of constraints.",
        "On the other hand, ontologies, specially top-level ones, are not densely populated but offer a dense network of constraints for their concepts.",
        "Formal Ontology (DOLCE, SUMO, OPENCYC)"
      ]
    },
    {
      "heading": "ONTOWORDNET SUMO-WN OPENCYC+WN",
      "text": [
        "Lexical resource (WN) A final remark needs to be done about the nature of the lexical resources we look at.",
        "Although the experiments we consider in sections 4 and 5 concern the interfacing of ontologies with Princeton Word-Net, the methodologies we present here are general and apply to other resources as well, like computational lexicons built on the basis of the original Princeton resource (i.e. EuroWordNet (Vossen, 1998) modules).",
        "The three methods we isolated have not been applied to other types of lexical resources, for example FrameNet.",
        "We believe this is a question of time since nowadays in the literature \"Wordnets\" is the de facto standard for interfacing.",
        "We expect that further experience with different kinds of lexical resources will shed new light on the advantages and drawbacks of the three methodologies."
      ]
    },
    {
      "heading": "3 Ontologies and their construction",
      "text": [
        "Ontology, as understood in the area of knowledge representation, is a young research area with several weaknesses among which the lack of established methodologies as well as of evaluation criteria.",
        "Thus, one should not be surprised if the ontologies today available have been built following disparate approaches resulting in quite different systems.",
        "This is particularly evident in the area of top-level ontology by which, in this paper, we mean the research in formal and foundational ontologies.",
        "These ontologies are knowledge structures that (1) adopt a rich formal language (generally some kind of first-order logic) and (2) aim at classifying basic notions of general interest like process, event, object, quality, and so on.",
        "Here we concentrate on three top-level ontologies, namely Dolce, opencyc, and sumo, that well indicate this variety of approaches.",
        "However, the main reason to focus on these is their attention to linguistic resources: these are the systems that have been used explicitly in relationship WordNet.",
        "dolce (a Descriptive Ontology for Linguistic and Cognitive Engineering (Masolo et al., 2003)) was released in its actual version in 2003 and has been constructed according to well documented philosophical principles.",
        "The content of the ontology is motivated from a cognitive viewpoint since the overall aim is to capture the ontological categories underlying everyday language and human common-sense.",
        "This view explains the adoption in dolce of a multiplicative approach which justifies the existence of co-localized (yet different) objects.",
        "For instance, Dolce claims that a statue and the clay of which it is made, are different entities which share the same spatial (and possibly temporal) location.",
        "Co-localized entities are needed to consistently model linguistic expressions in which incompatible properties seem to be referred to the same object: a scratched statue is different (since scratched) and yet it is the same statue it was before.",
        "In dolce this is possible since the statue itself might not be affected by (minor) scratches, but the clay does because parts of it break up.",
        "dolce includes very basic and general notions only providing a total of about 40 categories which are richly axiomatized by using about a 100 relations and 80 axioms.",
        "In the paper, we consider the \"lite\" version of dolce (aka dolce-lite+), namely an extension of the axiomatic ontology that do not consider modality, temporal indexing, and relation composition.",
        "This version contains more concepts and allows for the implementation of dolce-based resources (i.e. the alignment of dolce and WordNet called On-toWordNet) in languages that are less expressive than FOL e.g. OWL-DL, OWL-Lite, and RDF.",
        "dolce is public resource and is released under the Lesser GNU Public License.",
        "opencyc is the ontology of cyc, a project initiated in 1984 with the aim of building a knowledge base comprising both scientific and common-sense knowledge, cyc grow to include hundreds of thousand elements between atomic terms, concepts, and axioms.",
        "To overcome consistency issues, cyc is now subdivided in hundreds of \"microtheories\".",
        "Microtheories are, roughly speaking, bundles of assertions and rules in a specific domain of knowledge and are supposed to be locally consistent although not official claim is made in this sense.",
        "opencyc is a byproduct of cyc and was not part of the original project.",
        "Unfortunately the open-cyc ontology has not been constructed according to philosophical principles nor following an ontological tested methodology.",
        "Indeed, still today the focus is on coverage: in the website one reads that opencyc includes \"an upper ontology whose domain is all of human consensus reality\", which explains the 47,000 concepts and more than 300,000 assertions it contains, but makes one wonder what \"upper\" means here!",
        "Initially, it was obtained by isolating the taxonomy of the most general notions in cyc (perhaps with minor adjustments) but it was never followed by an ontological analysis and study of these notions.",
        "One can observe that opencyc adopts (at least in part) a cognitive viewpoint since some categories capture naïve conceptions of \"reality\".",
        "For this reason, opencyc is compatible with the multiplicative approach (as seen in dolce) although this has not been followed in a systematic way.",
        "Since we lack a characterization of the ontological commitment and an analysis of the ontological choices embedded in the opencyc hierarchy there is not much to say about its ontological relevance.",
        "A further problem is the scarce axiomatization of opencyc which makes impossible to analyze the adequacy of the system in formal ontology.",
        "opencyc is publicly available under the GNU Lesser General Public License.",
        "sumo (Suggested Upper Merged Ontology (Niles and Pease, 2001)) began as a potpourri of theories in the knowledge representation area among which (Sowa, 1995; Borgo et al., 1996; Allen, 1984; Smith, 1996).",
        "The ontology was created for computer applications (data interoperability, information retrieval, etc.)",
        "with no philosophical concerns and did not adopt ontological principles.",
        "This attitude is still present today (notwithstanding sporadic claims that sumo is \"rooted in metaphysical naturalism\"), and the overall system is ontologically unclear as pointed out several times in the SUO mailing list.Still, one can recognize some ontological choices in the system like the distinction between objects and events, and the adoption of a realistic approach.",
        "However, there is no guarantee that these have been consistently exploited in the whole ontology.",
        "The last version was released in 2005 and consists of about 4,000 assertions and 1,000 concepts.",
        "Several domain ontologies, linked to sumo, are also available.",
        "In the paper, we consider also the middle level ontology called milo.",
        "milo is written in the same language of sumo and is provided as a \"bridge\" system between the general ontology and a number of domain ontologies.",
        "The latest version available on the web has been released in July 2004 and is marked \"provisional and incomplete\".",
        "We consider it since it is an integral part of the research in ontology and linguistic resources based on sumo.",
        "sumo was initially distributed under the GNU Licence.",
        "Now it is subject to other restrictions; in particular, sumo \"must not be utilized for any conformance/compliance purposes\" and \"[...] entities seeking permission to reproduce this document, in whole or in part, must obtain permission.\" However, these restrictions should not apply to research work.",
        "4 How actual resources fit the classification Generally speaking, projects interfacing ontologies and lexical resource are not easy to compare since beside generic statement, objectives are rarely addressed and the results are not homogeneously evaluated.",
        "Our classification of methodologies is simply a framework to put some order and to situate these resources.",
        "It is not meant to be a measure for ranking these resources.",
        "This section shows how actual resources fit into the classification.",
        "The work underlying the OntoWordNet project is rooted in early proposals about upper levels of lexical resources (Guarino, 1998b).",
        "More recent presentations can be found in (Oltramari et al., 2002; Gangemi et al., 2003a).",
        "The program of OntoWordNet includes:",
        "The first point clearly addresses the restructuring task we presented in section 2 while points (2) and (3) deal with populating an ontology.",
        "The last point addresses the orthogonal issue of constraint density (axiomatizing the glosses).",
        "OntoWordNet project highly relies on the OntoClean methodology (Guarino and Welty, 2004).",
        "This methodology proposes to determine which meta-properties hold for a given property.",
        "Very roughly, a rigid property is a property that is essential to all its instances while a non-rigid property is not and a anti-rigid is essential to none of them.",
        "Some properties (called sortais) are carrying with them an identity criterion.",
        "A property ((f)) can be said to be dependent on another one (ip) if for all instance of cf> some instance of ip must exist (and it is not a part or a constituent of it).",
        "Finally, another meta-property we will use in our example (section 5) is unity.",
        "'A property (</>) is said to carry unity (+U) if there is a common unifying relation R such that all the instances of cf> are essential wholes under R. A property carries anti-unity (~U) if all its instances can possibly be non-who les\" (Gangemi et al., 2001).",
        "The second step of the methodology consists of checking that a series of constraints involving these meta-properties are actually satisfied.",
        "For example, it is required for unitarian properties to not subsumes anti-unitarian ones, or properties that subsume rigid properties to be rigid themselves.",
        "This prevents, for example, roles to subsume types.",
        "More accurately we found in (Guarino and Welty, 2000) that roles are non-rigid, they do not supply their identity criterion but might carry one and they are dependent on other properties.",
        "Types, on the other side, are rigid and supply their own identity criterion.",
        "The first version of OntoWordNet was extreme on this point in requiring the removal of roles from the ontology.",
        "The last version softens the position and requires only to label roles for separating them from types.",
        "This constraint checking is a crucial aspect of the OntoWordNet project.",
        "It is at this step that the lexical resource benefits from some ontological cleaning.",
        "OntoWordNet does not simply populate the top-level ontology by attaching WordNet terms under ontology concepts.",
        "OntoWordNet determines which constraints have to be satisfied for integrating a WORDNETsynset in an ontology in order to preserve its properties.",
        "OntoWordNet also claims that WordNet itself benefits from the reorganization and from the application of the constraints.",
        "A full description of these constraints can be found in (Oltramari et al., 2002; Gangemi et al., 2003a).",
        "However, the re-structuration has been performed systematically only on the third-fourth upper levels of WordNet.",
        "The current OntoWordNet is therefore made of a re-structured, cleaned, upper level and of a simple copy of WordNet at the lower levels (without any OntoClean check).",
        "Finally, axiomatizing WordNet glosses (in the spirit of XWN described in section 4.4) is a research objective of OntoWordNet project as well and it is currently pursued as shown in (Gangemi et al., 2003b).",
        "In conclusion, OntoWordNet is a costly methodology that hasn't been apply of the totality of WordNet but that offers general rules to clean the lexical resource and populate the ontology.",
        "This methodology fully corresponds to our third category, an alignment between a lexical resource and an ontology.",
        "The next proposal we present is the integration of opencyc with WordNet.",
        "The integration is obtained by adding in opencyc synonym relationship between opencyc concepts and WordNet synsets (Reed and Lenat, 2002).",
        "The purpose is simply to enrich the ontology with WordNet information.",
        "In our classification, this work falls into the populating an ontology option since there is no interest in restructuring the lexical resource nor in merging the two systems.",
        "We call the third approach sumo-wn (Niles and Pease, 2003), i.e. the integration of sumo with WordNet.",
        "This integration has been performed for nouns, verbs, adverbs and adjective synsets.",
        "The result is a new resource whose entries are Word-Net synsets tagged by sumo categories.",
        "At first sight, this project seems to address the three methodologies we identified: (i) Restructuring a lexical resource (tagging WordNet entries with sumo categories might constitute a first step for restructuring WordNet), (ii) Populating an ontology (tagging also allows to present WordNet synsets as synonyms, hyponyms and instances of sumo concepts), (iii) Aligning an ontology and a lexical resource because sumo-wn concerns both methodologies.",
        "This brief description of sumo-wn integration makes it sound very complete.",
        "However we need to look closer at the methodology in order to understand exactly what is done in sumo-wn.",
        "The result of the interfacing between sumo and WordNet is a list of synset annotated with sumo concepts.",
        "The main task is therefore the annotation.",
        "In (Niles and Pease, 2003) three unproblematic annotation cases are presented:",
        "• the WordNet synset is an hyponym of an existing sumo concept • the WordNet synset is an instance of of an existing sumo concept",
        "Unfortunately, the examples given in (Niles and Pease, 2003) are a bit confusing as we will see in our discussion of practical example (section 5).",
        "We will see later that ontology has been recently improved but since our focus is on the methodology we look at problems that arise from its application disregarding ad hoc solutions.",
        "Another global problem for sumo-wn is the absence of verification during the integration process.",
        "The quality of the resulting resource relies totally on the quality of WordNet and sumo.",
        "This is problematic since structural problems of WordNet are now well-known and we saw in section 3 that the methodology for building sumo jeopardize its use as a well-founded reference for annotating the resource.",
        "We believe that a more careful restructuring of WordNet is required before populating the ontology, and only then an annotation with sumo concepts might have its interest, sumo-wn links are rather ad-hoc and it is difficult to figure out how such an approach can extend the accuracy of WordNet or sumo.",
        "In conclusion, sumo-wn addresses only the second category of our classification {populating) although the annotation of WordNet entries could be seen as a preliminary step for restructuring the resource.",
        "Moreover, since there is no clear methodology for determining how to perform the tagging, it would be dangerous to use this tagging for modifying the resource.",
        "The extended WordNet(XWN) project started with the objective of improving several weaknesses of WordNet.",
        "These weaknesses are described in (Harabagiu and Moldovan, 1998) and include in particular the need for more conceptual relations such as causation and entailment which are absent or not enough developed in WordNet.",
        "The proposal (Harabagiu et al., 1999) consists in \"translating\" WordNet glosses into logical formulas with the help of natural language analysis.",
        "WordNet glosses are in a first step parsed to produce \"logical forms\".",
        "The second step consists in the transformation of the \"logical form\" into \"semantic forms\" by taking into account finer semantic aspects such as thematic relations.",
        "WordNet glosses eventually become axioms that can be manipulated in a more precise and efficient way than current natural language glosses.",
        "Moreover the disambiguation of the terms in the glosses and its systematic linking to other WordNet entries and to terms present in other glosses augment dramatically the connectivity between WordNet synsets.",
        "This work is very promising and is complementing the previous approaches presented in sections 4.1 and 4.3 which at this point provides mainly taxonomic axioms.",
        "In our terminology, XWN wants to increase the constraint density since the axioms derived from this method are potentially of all types.",
        "XWN is not properly speaking proposing to interface an ontology and a lexical resource because it does not involve explicitly an existing ontology.",
        "Since the ontological input is implicit XWN does not enter into our classification.",
        "However, if this ontological input was coming from an existing ontology, XWN would belong to the restructuring methodological option.",
        "The result of our classification is summarized in table 2.",
        "Among the initiatives we looked at, opencyc is a clear example of a populating methodology, sumo-wn fall also into this category while OntoWordNet includes both the restructuring methodology through the application of OntoClean and the populating one by linking Word-Net synsets to dolce-lite+ categories.",
        "Finally, sumo-wn offers a complete integration of Word-Net while OntoWordNet and opencyc are, for different reasons, incomplete.",
        "5 Two practical examples Underground_Rai 1 road examples The first example comes from the sumo-wn presentation (Niles and Pease, 2003).",
        "It concerns the hyponym case.",
        "It is claimed that the sumo concept ReligiousOrganization is a hypernym of WordNet synset Christian_Science (gloss: \"religious system based on the teachings of Mary Baker Eddy emphasizing spiritual healing\").",
        "Since ReligiousOrganization are Organizations, there is no clear reason for setting Christian_science to be an organization because sumo organizations are \"corporate or similar institutions (...)\".",
        "The corresponding category for Christian_Science should be something like Christian_Science_Church.",
        "There are actually another WordNet synset for Christian_Science (gloss: \"Protestant denomination founded by Mary Baker Eddy in 1866.\").",
        "But even accepting this conceptual shortcut, it is still not clear why Christian_Science is an hyponym of ReligiousOrganization and not an instance-of it.",
        "For Christian_Science to be a subtype of Organization, there must be at least two instances of Christian_Science.",
        "The WordNet gloss describes it more as a general doctrine and therefore as an instance of something like ?i Religious_System.",
        "The example provided fits better the second WordNet synset.",
        "We don't have enough information about the notions of religious systems and organization to pursue further the investigation but it is clear to us that the choices that have been made in sumo on these topics are dubious.",
        "The current version we can find online corrected some of these problems as we can see in figure 3.",
        "In the downloadable file, we can find both synsets.",
        "The first one is now an instance-of \"ReligiousOrganization while the second one is a subtype of sumo's Proposition.",
        "The example provided for illustrating the instance-of case is very similar to the previous one.",
        "In this case, UndergroundRailroad (gloss: abolitionist secret aid to escaping slaves) is taken to be an instance-of and not an hyponym"
      ]
    },
    {
      "heading": "Religious Organization",
      "text": [
        "of sumo Organization.",
        "In the end, it remains difficult to understand the methodology adopted to classify terms in these two examples one wonders if there is something more than the intuitions of the sumo-wn developers.",
        "In OntoWordNet Christian_Science and its hyperonyms are integrated in the resource as shown in figure 3.",
        "The hierarchy corresponds to the WordNet one until the top-level of the hierarchy.",
        "About the first sense, the last WordNet hypernym is Organization and there is organization present in dolce-lite+.",
        "The second sense is more tricky because of a double inheritance in the WordNet hierarchy.",
        "Regarding the Underground_Railroad, the OntoWordNet version proposed it as a subtype of Escape.",
        "It is a clear example that shows that the application of the methodology is incomplete in the current version of OntoWordNet.",
        "Because of its development cost, the checking and the restructuration of WordNet couldn't go deeper than the first four upper levels of the hierarchy.",
        "As a result, Underground_Railroad hasn't been checked and therefore not corrected yet in OntoWordNet.",
        "The second example concern the need for Word-Net restructuration.",
        "In WordNet cement (gloss: \"a building material that is a powder made of a mixture of calcined limestone and clay\") is situated under building_material and further under artifact (see Fig. 4).",
        "On the meta-properties level, Artefact presents therefore both unitarian concept such as regular artefacts (chair, hammer, .",
        ".",
        ".)",
        "and non-unitarian object such as cement.",
        "This constitutes a formal violation in terms of OntoClean methodology.",
        "In sumo-wn this violation is repeated since building_material is-a SelfConnecte-dObject, which is an unitarian concept (+U) and SelfConnectedObject include Food which subsumes itself Beverage, that is clearly non-unitarian (~U).",
        "On the other hand, OntoWordNet performs a re-structuration at this level which forces to distinguish unitarian and non-unitarian concepts as explained in (Oltramari et al., 2002).",
        "building_material is therefore removed from the artefact category and put under functional-matter which is-subsumed by amount_of_matter (~U).",
        "The artefact synset is put under ORDlNARY_object.",
        "Finally,"
      ]
    },
    {
      "heading": "6 One or many resources?",
      "text": [
        "The previous sections of this paper have emphasized the differences between existing proposals for interfacing top-level ontologies with lexical resources.",
        "These strong differences lead unsurprisingly to very different lexical resources or enhanced ontologies.",
        "The next natural step is to ask for what these tools are more adequate.",
        "Is each specific tool adequate to a given number of NLP tasks, or on the opposite, can we claim that some tool is suited for most of them?",
        "The soundness of the top-level ontologies seems to be crucial.",
        "Afterall this property is already essential for the quality of the top-level on which the whole architecture relies.",
        "However, soundness is very complex and costly to preserve when the size of the ontology increases.",
        "One might wonder if such hard constraint is absolutely necessary when dealing with lexical resources for performing NLP tasks.",
        "One motivation for this work is to determine whether these efforts for preserving the soundness of the resources are worth in all applications, and if not for which applications soudness should be guaranteed.",
        "Unfortunately, the lack of benchmark on these issues prevent us from answering these questions at this time.",
        "We can only emphasize the need of comparative evaluations on different tasks such as word sense disambiguation, bridging resolution, metaphor resolution or translation.",
        "Here we remain at the level of theoretical justifications while quantitative evaluations will be considered in future work.",
        "As we saw, many differences between the approaches we presented can be explained in terms of granularity or what we called constraint density.",
        "Taxonomic axioms (coarse-grained) are easy to obtain, while meronomic (mid-grained), dépendance and participation (fine-grained) axioms are much more difficult to get.",
        "This classification has to be related to the knowledge engineering distinction proposed in (Guarino, 1998a) in which coarse-grained ontologies are opposed to fine-grained one.",
        "The former corresponds to reference, off-line or heavyweight ontologies and the later to shareable, on-line or lightweight ones.",
        "Performing some tasks can be more efficient or even provide better results with only taxonomic axioms while other tasks might require more fine-grained axioms.",
        "Finally, each developer should be able to choose the level of constraint density of the tool he develops according to the required level of precision.",
        "A general coherent model, both for applications and psycholinguistic adequacy, may consist of only one resource in which the constraints are classified according to their level of granularity.",
        "The previous section suggests that different applications need different characteristics from the resource.",
        "As an illustration we will consider now multilingual resources and, more particularly, how the different approaches presented above can be used in a multilingual context.",
        "The general purpose of this kind of work is to provide lexical resources in several languages aligned with a shared ontology like the Inter-Lingual-Index in EuroWordNet (Vossen, 1998).",
        "Such resources are obviously highly valuable for most applications dealing with translation and multi-linguality.",
        "Linguistic and psycholinguistic fundamental research is also concerned in such experiments.",
        "They might allow the practical comparison of lexical structure of different languages and thus constitute an important aspect in the research about the relativist/universalist debate (Gumperz and Levinson, 1996).",
        "A first approach, taken for example in (Huang et al., 2004) consists in starting from an existing lexical resource (in this case the original English WordNet) aligned with an ontology (here sumo) and a translation database (here the English-Chinese Translation Equivalents Database).",
        "The general idea is to translate the original resource into the new language.",
        "In order to do so, a bottom-up approach has been used.",
        "First Chinese lemmas were linked to English WordNet synsets.",
        "Then the English WordNet semantic relations were automatically inserted into the Chinese resource.",
        "The next crucial step consisted in the manual checking of the result.",
        "The correspondence is made through the terminology and the taxonomic axioms.",
        "This approach is fast and does not require a preexisting lexical resource for each language.",
        "The main drawback seems to be the level of precision of the alignment.",
        "The accuracy of the new resource will be at most the one of the starting resource.",
        "Moreover it might be the case, specially in lower levels of the lexical resource, that lexical structures do no fit.",
        "This methodology commits to lexical organization derived from a given language and tries to fit another language into its actual structure.",
        "In (Huang et al., 2003), an accurate manual check might reduce this tendency but the methodology to fix the problems in the alignment is not fully discussed and it is costly.",
        "A second approach consists in developing parallel alignment with the same methodology for both languages.",
        "Of course, it requires to have a lexical resource for each language.",
        "In this case the correspondence between the languages can be made not only through the terms and taxonomic axioms but also through more fine-grained axioms potentially derived from original glosses.",
        "This approach is obviously less efficient than the previous one.",
        "Moreover the need to have computational lexicons for both languages prevents its use for most of natural languages.",
        "These \"foundational\" multilingual lexical resources are still to come and won't replace the fast developing multilingual resources since these latter are essential for languages that did not benefit of extended and systematic efforts comparable to those on English language.",
        "However, the careful integration of two rich and comparable (because axiomatized in a same logical language) lexical resources is expected to provide a more detailed and accurate tool than those currently developed.",
        "Also, this method allows a cross-linguistic investigation on languages and might constitute a significant step toward understanding lexical organization.",
        "Overall the creation of authentic lexical resource tailored for each language and built according to language specificities and their careful integration seems complementary to the current efficient and fast-developing multilingual resource proposed in (Huang et al., 2004)."
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "We proposed a way to classify the work done in interfacing ontologies and lexical resources.",
        "It consists in a clear separation between the restructuration of a lexical resource on the ground of an existing ontology hosting ontological principles, and the process of populating an ontology with lexical resources terms.",
        "A third option, called alignment, is a combination of these two aspects for the benefit of both the lexical resource and the ontology.",
        "We have shown how actual ongoing work fits this classification through some examples.",
        "Finally, in the light of these clarifications, we discussed the issue of constraint density for lexical resources and related it to the light-weight/heavy-weight distinction established in kwnowledge representation.",
        "In this paper, we showed that different construction methodologies leads to different features in the resulting resources.",
        "Finally we emphasized the need for selecting top-level ontologies and lexical resources according to their reliability.",
        "As explained in the paper, future work concerns in particular the practical evaluation of the resources developed with the different methods that have been presented.",
        "This evaluation has to be done task by task in order to understand better which task requires which features.",
        "Such an evaluation constitute a crucial step for the integration of ontological enhancement for lexical resources."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors would like to thank the ONTOLEX reviewers for their comments and suggestions.",
        "J. F. Allen.",
        "1984.",
        "Towards a general theory of action and time.",
        "Artificial intelligence, 23:123-154.",
        "S. Borgo, N. Guarino, and C. Masolo.",
        "1996.",
        "A pointless theory of space based on strong connection and congruence.",
        "In M. Kaufmann, editor, Proceedings of Knowledge Representation and Reasoning (KR96).",
        "C. Fellbaum, editor.",
        "1998.",
        "WordNet: An Electronic Lexical Database.",
        "MIT Press.",
        "C.Fillmore.",
        "1976.",
        "Frame semantics and the nature of language.",
        "In Annals of the New York Academy of Sciences: Conference on the Origin and Development of Language and Speech."
      ]
    }
  ]
}
