{
  "info": {
    "authors": [
      "Damaris M. Ayuso",
      "Varda Shaked",
      "Ralph M. Weischedel"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P87-1005",
    "title": "An Environment for Acquiring Semantic Information",
    "url": "https://aclweb.org/anthology/P87-1005",
    "year": 1987
  },
  "references": [
    "acl-J83-3005",
    "acl-J86-3002",
    "acl-P81-1030",
    "acl-P85-1024",
    "acl-P86-1005",
    "acl-P86-1018",
    "acl-P86-1033",
    "acl-P86-1036"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "An improved version of IRACQ (for Interpretation Rule ACQuisition) is presented.1 Our approach to semantic knowledge acquisition: 1) is in the context of a general purpose NL interface rather than one that accesses only databases, 2) employs a knowledge representation formalism with limited inferencing capabilities, 3) assumes a trained person but not an Al expert, and 4) provides a complete environment for not only acquiring semantic knowledge, but also maintaining and editing it in a consistent knowledge base.",
        "IRACQ is currently in use at the Naval Ocean Systems Center."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The existence of commercial natural language interfaces (NLI's), such as INTELLECT from Artificial Intelligence Corporation and O&A from Symantec, shows that NLI technology provides utility as an interface to computer systems.",
        "The success of all NLI technology is predicated upon the availability of substantial knowledge bases containing information about the syntax and semantics of words, phrases, and idioms, as well as knowledge of the domain and of discourse context.",
        "A number of systems demonstrate a high degree of transportability, in the sense that software modules do not have to be changed when moving the technology to a new domain area; only the declarative, domain specific knowledge need be changed.",
        "However, creating the knowledge bases requires substantial effort, and therefore substantial cost.",
        "It is this assessment of the state of the art that causes us to conclude that knowledge acquisition is one of the most fundamental problems to widespread applicability of NLI technology.",
        "This paper describes our contribution to the acquisition of semantic knowledge as evidenced in IRACQ (for Interpretation Rule ACQuisition), within the context of our overall approach to representation of domain knowledge and its use in the IRUS natural language system [5, 6, 27].",
        "An initial version of IRACQ was reported in [19].",
        "Using IRACQ, mappings 'The work presented here was supported under DARPA contract #N00014-85-C-0016.",
        "The views and conclusions contained in this document are those of the authors and should not be interpreted as necessarily representing the official policies, either expressed or implied, of the Defense Advanced Research Projects Agency or of the United States Government between valid English constructs and predicates of the domain may be defined by entering sample phrases.",
        "The mappings, or interpretation rules (IRules), may be defined for nouns, verbs, adjectives, and prepositions.",
        "[Rules are used by the semantic interpreter in enforcing selectional restrictions and producing a logical form as the meaning representation of the input sentence.",
        "IRACQ makes extensive use of information present in a model of the domain, which is represented using NIKL [18, 21], the terminological reasoning component of KL-TWO [26].",
        "Information from the domain model is used in guiding the IRACO/user interaction, assuring that acquisition and editing yield IRules consistent with the model.",
        "Further support exists for the !Rule developer through a flexible editing and debugging environment.",
        "IRACQ has been in use by non-Al experts at the Naval Ocean Systems Center for the expansion of the database of semantic rules in use by IRUS.",
        "This paper first surveys the kinds of domain specific knowledge necessary for art NLI as well as approaches to their acquisition (section 2).",
        "Section 3 discusses dimensions in the design of a semantic acquisition facility, describing our approach.",
        "In section 4 we describe IRules and how they are used.",
        "An example of a clause IRule definition using IRACQ is presented.",
        "Section 5 describes initial work on an !Rule paraphraser.",
        "Conclusions are in section 6."
      ]
    },
    {
      "heading": "2 Kinds of Knowledge",
      "text": [
        "One kind of knowledge that must be acquired is lexical information.",
        "This includes morphological information, syntactic categories, complement structure (if any), and pointers to semantic information associated with individual words.",
        "Acquiring lexical information may proceed by prompting a user, as in TEAM [13], IRUS [7], and JANUS [9].",
        "Alternatively, efforts are underway to acquire the information directly from on-line dictionaries [3, 16].",
        "Semantic knowledge includes at least two kinds of information: selectional restrictions or case frame constraints which can serve as a filter on what makes sense semantically, and rules for translating the word senses present in an input into an underlying semantic representation.",
        "Acquiring such selectional restriction information has been studied in TEAM, the Linguistic String Parser [12], and our system.",
        "Acquiring the meaning of the word senses has been studied by several individuals, including [11, 17].",
        "This paper",
        "focuses on acquiring such semantic knowledge using IRACO.",
        "Basic facts about the domain must be acquired as well.",
        "This includes at least taxonomic information about the semantic categories in the domain and binary relationships holding between semantic categories.",
        "For instance, in the domain of Navy decision-making at a US Fleet Command Center, such basic domain facts include:",
        "Such information, though not linguistic in nature, is clearly necessary to understand natural language, since, for instance, \"Enterprise's overall rating\" presumes that there is such a readiness rating, which can be verified in the axioms mentioned above about the domain.",
        "However, this is clearly not a class of knowledge peculiar to language comprehension or generation, but is in fact essential in any intelligent system.",
        "General tools for acquiring such knowledge are emerging; we are employing KREME [1] for acquiring and maintaining the domain knowledge.",
        "Knowledge that relates the predicates in the domain to their representation and access in the underlying systems is certainly necessary.",
        "For instance, we may have the unary predicates vessel and harpoon.capable; nevertheless, the concept (i.e., unary predicate) corresponding to the logical expression ( X x) [vessel(x) & harpoon.capable(x)] may correspond to the existence of a \"y\" in the \"harp\" field of the \"uchar\" relation of a data base.",
        "TEAM allows for acquisition of this mapping by building predicates \"bottom-up\" starting from database fields.",
        "We know of no general acquisition approach that will work with different kinds of underlying systems (not just databases).",
        "However, maintaining a distinction between the concepts of the domain, as the user would think of those concepts, separate from the organization of the database structure or of some other underlying system, is a key characteristic of the design and transportability of IRUS.",
        "Finally, a fifth kind of knowledge is a set of domain plans.",
        "Though no extensive set of such plans has been developed yet, there is growing agreement that such a library of plans is critical for understanding narrative [20], a user's needs [22], ellipsis [8, 2], and ill-formed input [28], as well as for following the structure of discourse [14, 15].",
        "Tools for acquiring a large collection of domain plans from a domain expert, rather than an Al expert, have not yet appeared.",
        "However, inferring plans from textual examples is under way [17]."
      ]
    },
    {
      "heading": "3 Dimensions of Acquiring Semantic Knowledge",
      "text": [
        "We discuss in this section several dimensions available in designing a tool for acquiring semantic knowledge within the overall context of an NLI.",
        "In presenting a partial description of the space of possible semantic acquisition tools, we describe where our work and the work of several other significant, recently reported systems fall in that space of possibilities."
      ]
    },
    {
      "heading": "3.1 Class of underlying systems.",
      "text": [
        "One could design tools for a specific subclass of underlying systems, such as database management systems, as in TEAM [13] and TELI [4].",
        "The special nature of the class of underlying systems may allow for a more tailored acquisition environment, by having special-purpose, stereotypical sequences of questions for the user, and more powerful special-purpose inferences.",
        "For example, in order to acquire the variety of lexical items that can refer to a symbolic field in a database (such as one stating whether a mountain is a volcano), TEAM asks a series of questions, such as \"Adjectives referencing the positive value?\" (e.g., volcanic), and \"Abstract nouns referencing the positive value?\" (e.g., volcano).",
        "The fact that the field is binary allows for few and specific questions to be asked.",
        "The design of IRACO is intended to be general purpose so that any underlying system, whether a data base, an expert system, a planning system, etc., is a possibility for the NLI.",
        "This is achieved by having a level of representation for the concepts, actions, and capabilities of the domain, the domain model, separate from the model of the entities in the underlying system.",
        "The meaning representation for an input, a logical form, is given in terms of predicates which correspond to domain model concepts and roles (and are hence referred to as domain model predicates).",
        "!Rules define the mappings from English to these domain model predicates.",
        "In our NLI, a separate component then translates from the meaning representation to the specific representation of the underlying system [24, 25].",
        "IRACO has been used to acquire semantic knowledge for access to both a relational database management system and an ad hoc application system for drawing maps, providing calculations, and preparing summaries; both systems may be accessed from the NLI without the user being particularly aware that there are two systems rather than one underneath the NLI."
      ]
    },
    {
      "heading": "3.2 Meaning representation.",
      "text": [
        "Another dimension in the design of a semantic knowledge acquisition tool is the style of the underlying semantic representation for natural language input.",
        "One could postulate a unique predicate for almost every word sense of the language.",
        "TEAM",
        "seems to represent this approach.",
        "At some later level of processing than the initial semantic acquisition, a level of inference or question/answering must be provided so that the commonalities of very similar word senses are captured and appropriate inferences made.",
        "A second approach seems to be represented in TELI, where the meaning of a word sense is translated into a boolean composition of more primitive predicates.",
        "SACO represents a related approach, but we allow a many-to-one mapping between word senses and predicates of the domain, and use a more constraining representation for the meaning of word senses.",
        "Following the analysis of Davidson [10] we represent the meaning of events (and also of states of affairs) as a conjunction of a single unary predicate and arbitrarily many binary predicates.",
        "Objects are represented by unary predicates and are related through binary relations.",
        "Using such a representation limits the kind and numbers of questions that have to be asked of the user by the semantic acquisition component.",
        "The representation dovetails well with using NIKL (18, 21], a taxonomic knowledge representation system with a formal semantics, for stating axioms about the domain."
      ]
    },
    {
      "heading": "3.3 Model of the domain",
      "text": [
        "One may choose to have an explicit, separate representation for concepts of the domain, along with axioms relating them.",
        "Both IRUS and TEAM have explicit models.",
        "Such a representation may be useful to several components of a system needing to do some reasoning about the domain.",
        "The availability of such information is a dimension in the design of semantic acquisition systems, since domain knowledge can streamline the acquisition process.",
        "For example, knowing what relations are allowable between concepts in the domain, aids in determing what predicates can hold between concepts mentioned in an English expression, and therefore, what are valid semantic mappings (IRules, in our case).",
        "Our NIKL representation of the domain knowledge, the domain model, forms the semantic backbone of our system.",
        "Meaning is represented in terms of domain model predicates; its hierarchy is used for enforcing selectional restrictions and for !Rule inheritance; and some limited inferencing is done based on the model.",
        "After semantic interpretation is complete, the NIKL classification algorithm is used in simplifying and transforming high level meaning expressions to obtain the underlying systems' commands [25].",
        "Due to its importance, the domain model is developed carefully in consultation with domain experts, using tools to assure its correctness.",
        "This approach of developing a domain model independently of linguistic considerations or of the type of underlying system is to be distinguished from other approaches where the domain knowledge is shaped mostly as a side effect of other processes such as lexical acquisition or database field specification."
      ]
    },
    {
      "heading": "3.4 Assumptions about the user of the acquisition tool.",
      "text": [
        "If one assumes a human in the semantic acquisition process, as opposed to an automatic approach, then expectations regarding the training and background of that user are yet another dimension in the space of possible designs.",
        "The acquisition component of TELI is designed for users with minimal training.",
        "In TEAM, database administrators or those capable of designing and structuring their own database use the acquisition tools.",
        "Our approach has been to assume that the user of the acquisition tool is sophisticated enough to be a member of the support staff of the underlying system(s) involved, and is familiar with the way the domain is conceived by the end users of the NLI.",
        "More particularly, we assume that the individual can become comfortable with logic so that he/she may recognize the correctness of logical expressions output by the semantic interpreter, but need not be trained in Al techniques.",
        "A total environment is provided for that class of user so that the necessary knowledge may be acquired, maintained, and updated over the life cycle of the NLI.",
        "We have trained such a class of users at the Naval Ocean Systems Center (NOSC) who have been using the acquisition tools for approximately a year and a half."
      ]
    },
    {
      "heading": "3.5 Scope of utilities provided.",
      "text": [
        "It would appear that most acquisition systems have focused on the inference problem of acquiring knowledge initially and have paid relatively little attention to explaining to the user what knowledge has been acquired, providing sophisticated editing facilities above the level of the internal data structures themselves, or providing consistency checks on the database of knowledge acquired.",
        "Providing such a complete facility is a goal of our effort; feedback from non-Al staff using the tool has already yielded significant direction along those lines.",
        "The tool currently has a very sophisticated, flexible debugging environment for testing the semantic knowledge acquired independently of the other components of the NLI, can present the knowledge acquired in tables, and uses the set of domain facts as a way of checking the consistency of what the user has proposed and suggesting alternatives that are consistent with what the system already knows.",
        "Work is also underway on an intelligent editing tool guaranteeing consistency with the model when editing, and on an English paraphraser to express the content of a semantic rule."
      ]
    },
    {
      "heading": "4 IRACQ",
      "text": [
        "The original version of IRACO was conceived by R. Bobrow and developed by M. Moser [19].",
        "From sample noun phrases or clauses supplied by the user, it inferred possible selectional restrictions and let the user choose the correct one.",
        "The user then had to supply the predicates that should be used in the interpretation of the sample phrase, for inclusion in the [Rule.",
        "From that original foundation, as IRUS evolved to use NIKL.",
        "SACO was modified to take advantage of the NIKL knowledge representation language and the form we have adopted for representing events and states of affairs.",
        "For example, now RAC() is able to suggest to the user the predicates to be used in the interpretation, assuring consistency with the model.",
        "Following a more compositional approach, Rules can now be defined for prepositional phrases and adjectives that have a meaning of their own, as opposed to just appearing in noun 'Rules as modifiers of the head noun.",
        "Thus possible modifiers of a head noun (or nominal semantic class) include its complements (if any), and only prepositional phrases or other modifiers that do not have an independent meaning (as in the case of idioms).",
        "Analogously, modifiers of a head verb (or event class) include its complements.",
        "Adjective and prepositional phrase IRules specify the semantic class of the nouns they can modify.",
        "Also, maintenance facilities were added, as discussed in sections 4.3, 4.4, and 5."
      ]
    },
    {
      "heading": "4.1 IRules",
      "text": [
        "An !Rule defines, for a particular word or (semantic) class of words, the semantically acceptable English phrases that can occur having that word as head of the phrase, and in addition defines the semantic interpretation of an accepted phrase.",
        "Since semantic processing is integrated with syntactic processing in IRUS, the IRules serve to block a semantically anomalous phrase as soon as it is proposed by the parser.",
        "Thus, selectional restrictions (or case frame constraints) are continuously applied.",
        "However, the semantic representation of a phrase is constructed only when the phrase is believed complete.",
        "There are !Rules for four kinds of heads: verbs, nouns, adjectives, and prepositions.",
        "The left hand side of the.",
        "IFlule states the selectional restrictions on the modifiers of the head.",
        "The right hand side specifies the predicates that should be used in constructing a logical form corresponding to the phrase which fired the IRule.",
        "When a head word of a phrase is proposed by the parser to the semantic interpreter, all 'Rules that can apply to the head word for the given phrase type are gathered as follows: for each semantic property that is associated with the word, the !Rules associated with the given domain model term are retrieved, along with any inherited Rules.",
        "A word can also have Rules fired directly by it, without involving the model.",
        "Since the IRules corresponding to the different word senses may give rise to separate interpretations, they are carried along in parallel as the processing continues.",
        "If no !Rules are retrieved, the interpreter rejects the word.",
        "One use of the domain model is that of Rule inheritance.",
        "When an Rule is defined, the user decides whether the new !Rule (the base !Rule) should inherit from 'Rules attached to higher domain model terms (the inherited IRules), or possibly inherit from other !Rules specified by the user.",
        "When a modifier of a head word gets transmitted and no pattern for it exists in a base 'Rule for the head word, higher !Rules are searched for the pattern.",
        "If a pattern does exist for the modifier in a given IRule, no higher ones are tried even if it does not pass the semantic test.",
        "That is.",
        "inheritance does not relax semantic constraints."
      ]
    },
    {
      "heading": "4.2 An IRACQ session",
      "text": [
        "In this section we step through the definition of a clause IRule for the word \"send\", and assume that lexical information about \"send\" hat already been entered.",
        "The sense of \"sending\" we will define, when used as the main verb of a clause, specifies an event type whose representation is as follows:",
        "where the agent a must be a commanding officer, the object o must be a unit and the destination d must be a region.",
        "From the example clauses presented by the user IRACO must learn which unary and binary predicat.",
        ", are to be used to obtain the representation above Furthermore, IRACO must acquire the most gene'.-' semantic class to which the variables a, o, and d belong.",
        "Output from the system is shown in bold face input from the user in regular face, and comments ar, inserted in italics.",
        "Word that should trigger this !Rule: send Domain model term to connect !Rule to (select-K to view the network): deployment"
      ]
    },
    {
      "heading": "DEPLOYMENT",
      "text": [
        "Enter an example sentence using \"send\": An admiral sent Enterprise to the Indian Ocean.",
        "(predicate '(agent *v* commanding.officer.1)) (class 'DEPLOYMENT))) Do you wish to edit the !Rule?",
        "no <The person may, for example, want to insert something in the action part of the !Rule that was not covered by the MAC() questions.> This concludes our sample RAC() session."
      ]
    },
    {
      "heading": "4.3 Debugging environment",
      "text": [
        "The facility for creating and extending !Rules is integrated with the IRUS NLI itself, so that debugging can commence as soon as an addition is made using IRACO.",
        "The debugging facility allows one to request IRUS to process any input sentence in one of several modes: asking the underlying system to fulfill the user request, generating code for the underlying system, generating the semantic representation only, or parsing without the use of semantics (on the chance that a grammatical or lexical bug prevents the input from being parsed).",
        "Intermediate stages of the translation are automatically stored for later inspection, editing, or reuse.",
        "IRACO is also integrated with the other acquisition facilities available.",
        "As the example session above illustrates, IRACO is integrated with KREME, a knowledge representation editing environment.",
        "Additionally, the IRACO user can access a dictionary package for acquiring and maintaining both lexical and morphological information.",
        "Such a thoroughly integrated set of tools has proven not only pleasant but also highly productive."
      ]
    },
    {
      "heading": "4.4 Editing an Rule",
      "text": [
        "If the user later wants to make changes to an 'Rule, he/she may directly edit it.",
        "This procedure, however, is error-prone.",
        "The syntax rules of the IRule can easily be violated, which may lead to cryptic errors when the !Rule is used.",
        "More importantly, the user may change the semantic information of the IRule so that it no longer is consistent with the domain model.",
        "We are currently adding two new capabilities to the 'Rule editing environment:",
        "1.",
        "A tool that uses some of the same IRACO software to let the user expand the coverage of an !Rule by entering more example sentences.",
        "2.",
        "In the case that the user wants to bypass IRACO and modify an IRule, the",
        "user will be placed into a restrictive editor that assures the syntactic integrity of the IRule, and verifies the semantic information with the domain model."
      ]
    },
    {
      "heading": "5 An IRule Paraphraser",
      "text": [
        "An !Rule paraphraser is being implemented as a comprehensive means by which an IRACO user can observe the capabilities introduced by a particular !Rule.",
        "Since paraphrases are expressed in English, the IRule developer is spared the details of the IRule internal structure and the meaning representation.",
        "The !Rule paraphraser is useful for three main purposes: expressing !Rule inheritance so that the user does not redundantly add already inherited information, identifying omissions from the IRule's linguistic pattern, and verifying !Rule consistency and completeness.",
        "This facility will aid in specifying and maintaining correct !Rules, thereby blocking anomalous interpretation of input."
      ]
    },
    {
      "heading": "5.1 Major design features",
      "text": [
        "The IRule paraphraser makes central use of the IRUS paraphraser (under development), which paraphrases user input, particularly in order to detect ambiguities.",
        "The IRUS paraphraser shares in large part the same knowledge bases used by the understanding process, and is completely driven by the IRUS meaning representation language (MRL) used to represent the meaning of user queries.",
        "Given an MRL expression for an input, the IRUS paraphraser first transforms it into a syntactic generation tree in which each MRL constituent is assigned a syntactic role to play in an English paraphrase.",
        "The syntactic roles of the MRL predicates are derived from the IRules that could generate the MRL.",
        "In the second phase of the IRUS paraphraser, the syntactic generation tree is transformed into an English sentence.",
        "This process uses an ATN grammar and ATN interpreter that describes how to combine the various syntactic slots in the generation tree into an English sentence.",
        "Morphological processing is performed where necessary to inflect verbs and adjectives, pluralize nouns, etc.",
        "The !Rule paraphraser expresses the knowledge in a given IRule by first composing a stereotypical phrase from the !Rule linguistic pattern (i.e., the left hand side of the !Rule).",
        "For the \"send\" !Rule of the previous section, such a phrase is \"A commanding officer sent a unit to a region\".",
        "For inherited IRules, the 'Rule paraphraser composes representative phrases that match the combined linguistic patterns of both the local and the inherited Rules.",
        "Then, the IRUS parser/interpreter interprets that phrase using the given IRule, thus creating an MRL expression.",
        "Finally, the IRUS paraphraser expresses that MRL in English.",
        "Providing an English paraphrase from just the linguistic pattern of an !Rule would be simple and uninteresting.",
        "The purpose of obtaining MRLs for representative phrases and using the IRUS paraphraser to go back to the English is to force the use of the right hand side of the IRule which specifies the semantic",
        "interpretation.",
        "In this way anomalies introduced by, for example, manually changing variable names in the right hand side of the 'Rule (which point to linguistic constituents of the left hand side), can be detected."
      ]
    },
    {
      "heading": "5.2 Role within IRACQ",
      "text": [
        "IRACQ will invoke the !Rule Paraphraser at two interaction points: (1) at the start of an IRACQ session when the user has selected a concept to which to attach the new !Rule (paraphrasing IRules already associated with that concept shows the user what is already handled--a new !Rule might not even be needed), and (2) at the end of an IRACQ session, assisting the user in detecting anomalies.",
        "The planned use of the !Rule Paraphraser is illustrated below with a shortened version of an IRACQ session.",
        "Word that should trigger this !Rule: change Domain model term to connect IRule to: change.in.readiness Paraphrases for existing 'Rules (inherited phrases are capitalized):",
        "• Location information should not be repeated in the new CHANGE.1N.READINESS.2 'rule since it will be inherited.",
        "The IRACO session proceeds as described in the previous example session.>"
      ]
    },
    {
      "heading": "6 Concluding Remarks",
      "text": [
        "Our approach to semantic knowledge acquisition: 1) is in the context of a general purpose NL interface rather than one that accesses only databases, 2) employs a knowledge representation formalism with limited inferencing capabilities, 3) assumes a trained person but not an Al expert, and 4) provides a corn-plete environment for not only acquiring semantic knowledge, but also maintaining and editing it in a consistent knowledge base.",
        "This section comments on what we have learned thus far about the point of view espoused above.",
        "First, we have transferred the IRUS natural language interface, which includes IRACQ, to the staff of the Naval Ocean Systems Center.",
        "The person in charge of the effort at NOSC has a master's degree in linguistics and had some familiarity with natural language processing before the effort started.",
        "She received three weeks of hands-on experience with IRUS at BBN in 1985, before returning to NOSC where she trained a few part-time employees who are computer science undergraduates.",
        "Development of the dictionary and 'Rules for the Fleet Command Center Battle Management Program (FCCBMP), a large Navy application [23], has been performed exclusively by NOSC since August, 1986.",
        "Currently, about 5000 words and 150 Rules have been defined.",
        "There are two strong positive facts regarding IRACQ's generality.",
        "First, IRUS accesses both a large relational data base and an applications package in the FCCBMP.",
        "Only one set of Rules is used, with no cleavage in that set between IRules for the two applications.",
        "Second, the same software has been useful for two different versions of IRUS.",
        "One employs MRL [29], a procedural first order logic, as the semantic representation of inputs; the second employs IL, a higher-order intensional logic.",
        "Since the !Rules define selectional restrictions, and since the Davidson-like representation (see section 3) is used in both cases, IRACQ did not have to be changed; only the general procedures for generating quantifiers, scoping decisions, treatment of tense, etc.",
        "had to be revised in IRUS.",
        "Therefore, a noteworthy degree of generality has been achieved.",
        ".",
        "Our key knowledge representation decisions were the treatment of events and states of affairs, and the use of NIKL to store and reason about axioms concerning the predicates of our logic.",
        "This strongly influenced the style and questions of our semantic acquisition process.",
        "For example, IRACQ is able to propose a set of predicates that is consistent with the domain model to use for the interpretation of an input phrase.",
        "We believe representation decisions must dictate much of an acquisition scenario no matter what the decisions are.",
        "In addition, the limited knowledge representation and inference techniques of NIKL deeply affected other parts of our NLI, particularly in the translation from conceptually-oriented domain predicates to predicates of the underlying systems.",
        "The system does provide an initial version of a complete environment for creating and maintaining semantic knowledge.",
        "The result has been very desirable compared to earlier versions of SACO and IRUS that did not have such debugging aids nor integration with tools for acquiring and maintaining the",
        "domain model.",
        "We intend to integrate the various acquisition, consistency, editing, and maintenance aids for the various knowledge bases even further."
      ]
    }
  ]
}
