{
  "info": {
    "authors": [
      "Vincenza Pignataro"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2109",
    "title": "A Computational Approach to Topic and Focus in a Production Model",
    "url": "https://aclweb.org/anthology/C88-2109",
    "year": 1988
  },
  "references": [
    "acl-C82-1017",
    "acl-E85-1039"
  ],
  "sections": [
    {
      "text": [
        "' Amipaktiiontoi ApprOa,,d11 'it') Topic and ikielits iot 8 PICCAPP iat 1.4(41(;i1 Vincenzo latkiiklATAR(1 Fake f. Litignistik u.leiteratur s. Universitfit Bielefeld Postfach 8640 1)-4801; Bielefeld 1 lira, mitt CA the presented restatrch is the develop, as Yea intuit-41c model of the functional concepts topic and den r be used in natural language processing systems.",
        "ls with two points of investigation: the first point eCOAMIi403 the identification of the topic and focus of an utterance.",
        "Within the frame of the linguistic discussion on such concepts topic and focus will be considered as semantic, pragmatic and .ioittnational rather then as syntactic phenomena.",
        "An operational definition of topic and focus is obtained on the basis of basic semantic-pragmatic categories which are defined in relation to a specified cionext.",
        "The second point concerns the integration of ;lie topic anO focus identification rules in a system for natural language generation.",
        "The aim of the application is the validation of the developed topic and focus model with respect to some aspect of the generation process like thematic progression and icceitt mapping.",
        "Moreover the identification of topic and focus aan he used to make prediction about the thematic progression end the accent mapping in the blocks world texts.",
        "For the podia-joii of indefinite pronouns like none\" and of definite articles noun phrase it is necessary to recur to the smart-t-atic eategories.",
        "•",
        "e inn emit:extra, factors for the whole comet/leaprowss toil for the subprocesses running in parallel like the diattibetion of information and the marking of topic and focus is zite reason for attempting a definition of the \"context\" for this reenicted domain.",
        "This new approach is designed to replace the iran titionni sin vie question criterion used in determining the topic end single sentences and make a genuine sentan-iiclOiqigifia!iC Seainiiiott of topic, salient topic and focus possible.",
        "eke:car:ate iveiain ideas of the Prague School /cf.",
        "gic;iiva(,d'rbiovi 1982, Hajic6vif,Sgall 1885, Sgall et al.",
        "1986/.",
        "inoston generation model is developed as a simulation of of simplified German texts taken from blocks intents, in which a speaker has to advise the hearer A0 V!/ to build a pyramid, a bridge and a Node.",
        "The under-ying Jtiseottree model consists of the action sequence TAKE, po)W, which was found to be constant in the pro-aJ The number of blocks involved in the ectioii determines the number of the following PUT ,• • .+'0-.",
        ")1, , a limn is der which allows a description of of the expatimerits using statements like green(b,), tgtil(ln) meaning that 111 is an element of the unoirde-O:: the beana's blocks, Bat for the communication process A7 of the participants arc as important as ,„aoloe flow pwantil thorn.",
        "Therefore a language 12 is defi-ned, which allows speaking about the assumptions of the speaker about the hearer and his world.",
        "In fact in the experiment the speaker and the hearer do not see each other; they mainly rely on assumptions about their mutual knowledge /Schiffers 1972/.",
        "Statements of 1,2 are for ex.",
        "amkal) where amkis a property symbol of L2 and a, is the statement on(b,,b2).",
        "arnk(on(beb2)) means that it is assumed to be mutual knowledge that the block b, is on the block h2.",
        "Other examples of statements of L2 are id(b1) meaning that the block b, has been identified in a TAKE action, neq(TAKE) meaning that TAKE can be interpreted unequivocally and apl(11) meaning that 11 is assumed to be a potential position for the moved blocks.",
        "For practical reasons we consider the context C to be a pair of sets of statements in the language L2: <C01, CO2>.",
        "CO, contains statements about the world of the speaker and those assumptions about mutual knowledge which remain unchanged during an experiment.",
        "CO2 contains the speaker's assumptions about the hearer's blocks, their actual and their potential positions."
      ]
    },
    {
      "heading": "1.2 Operationalisation of the categories assignment",
      "text": [
        "The units of analysis are semantic representation of utterances from the blocks world texts.",
        "'1'o every element of the semantic representation some semantic categories will be operationally assigned.",
        "In this session a formal definition of the units of analysis and of the operational rules is given.",
        "Every semantic rc,,presentation of an illocutionary plan is an ordered set IP ae ‹.",
        ":x1,...x„>, where x, is the verb and the remaining elements x2 to x„ correspond to the elements of the case fauna of the verb xi.",
        "For every element x of IP there is an individual COUtillY1t in the language L2 referred to as x*.",
        "The assignment of &extenttic-pragmatic categories to the elements of IP is a function, which maps every pair (x,C), where x e IP and C is the context, onto the sernanticapragmatic categories of x, representing the status of x with respect to C. The contextual labels are given (g), chosen mentioned (in), mentioned in the previous sentence (trip) and their negation --JO, rn, does not occur.",
        "These symbols build the alphabet --, nip} .",
        "The operationalisation criteria are:",
        "(1) If x e 1P, then: (i) if there is a property y of 1.1 such that y(x*) CI CO/ U CO2 and for every other object",
        "x': y(x.",
        "'*) 11 CO, U CO2 ohm g(x).",
        "This criterion applies e.g. in case there is only OM for which the property hearer(0) holds.",
        "(ii) If' amk(x'1') and ueq(xe) n CO, U CO2, then g(x).",
        "This criterion applies e.g. for xreTAKE being element of the action sequence <TAKE,PUT,PROVE>, which is considered to tie assumed mutual knowledge and for the hearer unequivocally interpretable.",
        "(2) If 'x e IP, UHB(x*) e CO2, then ch(x) and -1m(x).",
        "This criterion applies e.g. to the elements of the unordered set of the hearer's blocks.",
        "(3) If x e IP, id(x*) e CO2, then : (i) if x is the first object in a sequence of PUT actions, then ch(x), m(x), mp(x).",
        "(ii) If x is neither the first nor the last object in a sequence of PUT actions, then ch(x), m(x) and -7mp(x).",
        "(iii) If x is the last object of the sequence of PUT actions, then -Ich(x), m(x) and -'mp(x).",
        "(iv) If x is the only object of the single PUT-action, then -Ich(x), m(x), and 7 mp(x).",
        "(4) If x e IP and apl(x*) e CO2, then ch(x) and --,m(x).",
        "This criterion applies e.g. when the speaker assumes that there is a position on(b1), among others, that can be potentially occupied by the block being moved.",
        "The labels ch, ch mirror the step of the problem solving while the labels m, mp, -im, Imp directly refer to the dynamics of the utterance production.",
        "4.",
        "Definition of Topic (t), Salient Topic (st) and Focus (f) topic rules: (5) If g(x) a IP then t(x).",
        "(6) If ( -Feb, m, mp(x)) e IP then t(x).",
        "salient topic rules: (7) If (ch, m, mp(x)) E IP then st(x).",
        "(8) If (ch, -imp(x)) a IP then st(x).",
        "(9) If ( ch, m, -Imp(x)) a IP then st(x).",
        "The rules (7) and (8) can be replaced by the equivalent rule (7*) If (ch,m(x)) a IP then st(x).",
        "focus rules: (10) If (ch, m(x)) a IP then f(x)."
      ]
    },
    {
      "heading": "1.4 Examples",
      "text": [
        "For lack of space I will not give a detailed specification of the context.",
        "In order to give an idea about the relation between the single arguments of the representation of the illocutionary plans and their contextual status example 1 will be presented in the following order: rule number, assigned category and contextual information.",
        "Example 1 The arguments of the illocutionary plan <TAKE, ADRESSEE,OBJECT> yield the following labels:",
        "Therefore the new IP' is <g(TAKE), g(ADRESSEE), ((ch, --/m)(OBJECT))> and the application of rule (5) to the first and second argument and of rule (10) to the third argument of IP' gives IP\" : <t(TAICE), t(ADRESSEE),f(OBJECT)>.",
        "The surface structure of the illocutionary plan IP would be: \"du nimmst einen roten Klotz\" meaning \"(you) take a red block\".",
        "Bold print within the examples designate possible occurrences of accents and underlining highlights the words responsible for the cohesion of the surface form.",
        "Example 2 Application of the rule to",
        "In this case the new illocutionary plan IP' is:.",
        "<g(PUT),g(ADRESSEE),(( --Ich,m,rnp)(OBJECT)), ((ch, 7 m)(GOAL)>.",
        "The application 'of rule (5) to the first and second argument, of rule (6) to the third and of rule (10) to the fourth argument of 111' gives IP\": <t(PUT),t(ADItESSEE),t(OBJECT)),f(GOAL)> .",
        "The surface structure would be \"du stellst ihn auf den tisch\" meaning \"put it on the table\".",
        "Example 3 In order to illustrate the application of the salient topic rule we assume that the following utterance is made as a consequence of an illocutionary TAKE plan: \"du nimmst einen roten und ernes blauen Klotz\", meaning \"take a red and a blue block\".",
        "Two, illocutionary PUT plans would follow:",
        "For the first , second and fourth argument of the set 1P1 and IP2 the same conditions as in the above PUT examples hold.",
        "For the third argument the following rules apply:",
        "The application of rule (5) to the first and second arguments, of rule (7) to the third argument in 1P1',of rule (9) to the thirdI argument of IP2' and of rule (10) to the fourth arguments of 1P1' and IP2' yields:",
        "The surface structure would be : \"du stellst den roten auf den, grimen und den Maim auf den coma\" meaning \"put the red oil; the green and the blue on the red\".",
        "If in an illocutionary TAKE plan the third argument consists of a list of many objects, then for every object OBI ch(OBJ) and -im(OBJ) holds.",
        "This can be abbreviated by the expression.",
        "(ch, -,m)* of the formal language over the alphabet A.",
        "For every, third argument of an illocutionary PUT plan the following holds: for the first object (ch,rn,nip), for the objects 2 to pg--11 (ch,m, -imp) and for the last object ( -imp).",
        "This can be abbreviated by the expression",
        "(01901,11111),(Cli,M, --tmp)5',( If \"du nirminst zwei/drei griine Kliitze\", meaning \"take three red blocks\", is uttered then a cohesive succeding utterance should be \"du stellst awn einen und einen / den letzten ....\", meaning \"pat one„, one,... and one/the last one...\".",
        "In case the taken blocks were \"two reds and a blue\" the succeeding answers must be: 'do stellst einen einen roten,.. .",
        "und den leaning put one red..., one red... and the blue...\" 7.",
        "Mitglii+dini in generationystem The coated of the dynamics of the conversation through the labals mentioned (riO, mentioned in the previous utterance (MA and the mattcing of utterance elements topic (t) and focus (f) are only two of the various subprocesses that run parallel during the linens 1)034111oion processes.",
        "In the automatic generation of natural knave, spoken as well.",
        "as written, the thematic progression of a sequences of utterances and their formal cohesion must also be taken into consideration.",
        "For the spoken language prosodic cohesion must be considered additionally.",
        "Our rules for the identification of topic (t), salient topic (st) and focus (f) guarantees the coherence ei; the thematic progression /Dams 1970/ of two or more successive utterances of the action sequence.",
        "Two very simple rules for thematic progression with the respective number of the OXillOpICS above are now given.",
        "Ill: The only focussed OBJECT of a TAKE-action becomes the topicalized OBJECT of the following Pun action (ex.1,2).",
        "R2: The two/three focussed OBJECTS of the TAKEaction become the OBJECT of the following two/three PUT actions and will be labelled salient topic (Ex.3).",
        "Our topic, salient topic and focus identification rules also allows to male predictions about the distribution of accents.",
        "Indeed an accent will be assigned to the elements labelled salient topic (si) and focus (f); the topic elements (t) get no accents.",
        "In this phase of the work accents are assigned to all arguments of the proposition.",
        "The assignment of the accent to the adjective instead of the noun in phrases like \"...den roten,..\" involves application of the same criteria inside lower level constituents.",
        "In order to generate cohesive surface structures it is also necessary to know when to um a definite article within noun phrases (the last one : der letzte) or an indefinite pronoun (one : ein).",
        "This choice depends on tine pragmatic decision of taking one or more blocks and on the properties shared by the objects in question.",
        "Under the assumption that only the parallel processing semantic and pragmatic information allows the choice of appropriate lexical material.",
        "For this purpose we will extend our set of semantic categories to express if a certain objects is an underdetermined or a determined element of a set.",
        "/For an extended discussion see Pignataro 1987 and Pignataro (forthcoming)/."
      ]
    },
    {
      "heading": "3. Geliteuttion Model",
      "text": [
        "The generation model consists of four functions: F1, F2, F3 sand F4.",
        "F1 maps a illocutionary plan IP and the context C onto an illocutionary plan IP' with additional semantics pragmatic categories.",
        "e' maps onto IP\": i.e. semanticpragmatic categories oelto topic, salient topic and focus.",
        "F3 maps IP\" onto surface seretcnccs.",
        "maps C and IP onto the changed context C'."
      ]
    }
  ]
}
