{
  "info": {
    "authors": [
      "Tomas Vlk"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2148",
    "title": "Topic/Focus Articulation and Intensional Logic",
    "url": "https://aclweb.org/anthology/C88-2148",
    "year": 1988
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "A semantic analysis of topic and focus as two parts of tectogrammatical representation by means of transparent intensional logic (TIL) is presented.",
        "It is pointed out that two sentences (more precisely, their tectogrammatical representations) differing just in the topic/focus articulation (TFA) denote different propositions, i.e. that TFA has an effect upon the semantic content of the sentence.",
        "An informal short description of an algorithm handling the TFA in the translation of tectogrammatical representations into the constructions of TIL is added.",
        "The TFA algorithm divides a representation into two parts corresponding to the topic and focus; every part is analyzed (translated) in isolation and then the resulting construction is put together.",
        "The TIL construction'discussed here reflect the scope of negation and some of the presuppositions observed."
      ]
    },
    {
      "heading": "1. Introduction: Transparent intensional logic",
      "text": [
        "One of the current tasks of semantic studies consists in finding a procedure translating the die-ambiguated linguistic meanings of sentences (see Sgall et al., 1986) into the constructions of intensional logic.",
        "The core of such procedure was developed (V1k, 1987), but a description of this procedure exceeds the scope of the present paper.",
        "The aim of this paper is rather to present some ideas used in the algorithm handling the topic/focus articulation within the translation.",
        "Sufficient means for the semantic analysis of natural language are given by Tichy's Transparent intensional logic (TIL).",
        "Referring to exact definitions to Tichy (1980) and Katerna (1985), we reproduce here only a brief characterization of TIL.",
        "Let o = ( T, F ) be a set of truth-values, let L be a set of individuals (the universe of discourse) and let CO be a set of possible worlds (the logical space).",
        "Then = l a, G,Gt)) is an epistemic basis.",
        "Then (i) any member of Bi.tva type over B.",
        "(ii) if tat,..4% are types over B, then (tfl...1%) is a type over B, where (tf,..10 is the met of (total and partial) functions from ft r -.KIN to t .",
        "(iii) the types over B are just those introduced in (i),(ii).",
        "Any member of type 2 is called an object of type , or an 2-object.",
        "An object is an 2-object for any t .",
        "For every type a denumerably infinite met of 2-variablem is at our disposal.",
        "The constructions are the ways in which objects can be given.",
        "They are defined inductively, (i) any 2-object, and also any 2-variable, is an 2 construction (called the atomic construction).",
        "(ii) let F be a Mt • f..1-construction, X, a f – construction for ial,..,n. Then the application (F X, X.",
        "...",
        "X.)",
        "of F to Kt, Ks, X. is an 2-construction.",
        "(iii) let Y be an 2-construction and xi, , x. distinct variables of types ..... respectively.",
        "Then the abstraction (ax, x. x. Y] of Y on xl, x.",
        "..... x. is a (tf.••f,)-construction.",
        "(iv) there are no constructions except those defined in (i)-(iii).",
        "Let us characterize some important objects of TIL.",
        "For every type we have object.",
        "s1, 7() of the type (0(02 )), such that (i) and (ii) hold: (i) El/ XI = if X is empty clam then F else T",
        "(ii) (7T/ X1 =^'11 Ay.",
        "^-(X For every type ' we have the t-mingularizer l'of the type (2 (o2)), which is defined on single-element 2-classes only and returns the single element of the respective class.",
        "Propositions are objects of the type (ow).",
        "The following notation will be used throughout the paper.",
        "The outermost parentheses and brackets will be sometimes omitted.",
        "Furthermore, a dot will represent a left bracket whose corresponding right bracket is to be imagined as far to the right as is compatible with other pairs of brackets.",
        "The notation with an apostrophe will be used in the following meaning: X' =-EX v) if X is of type (2e)) for any t X otherwise where X is a construction and w is a particular CO -variable.",
        "We write a x.Y in place of 5_1 Ax Y and fx.Y in place of TO Ax Y, / x.Y in place of (It Ax Y).",
        "Logical connectives and identity will be Written in the standard way, e.g. a & b, a = b in place of IL a IA, (=2 a bl, respectively."
      ]
    },
    {
      "heading": "2. The topic/focus articulation",
      "text": [
        "The procedure is divided into two parts!",
        "into the Basic algorithm ha dli g such phenomena as th mcope pf quantifiers, sev ral kinds of reform si on, and the TFA algori a I ndling the)topic focuM artiour lation (TFA).",
        "Th Bimic algorithm applied to all subtries of the depend nay rei and returns the construction(s) corresponds g to the subtree.",
        "The TFA algorithm divides the d ndenily tree into tvo parts corresponding to the topic and to the focus, respectively; either part is translated by the Basic algorithm, and then the resulting construction is put together.",
        "The topic/focus articulation (TFA) play, a crucial role in analysis of the presupposition, of the scope of negation and also of the so called exhaustive_ listing (see Sgall, Hajicova, Panevova, 1986, Hajicova 1974,'1984).",
        "First, its importance will be shown on an extremely simple 'toy' example; we will then discuss some problems in detail in connection with other examples.",
        "Informally, the topic of • sentence is what the sentence talks about, and the focus is what the sentence says about the topic.",
        "A formal definition of topic and focus am two parts of the tectogrammatical",
        "WOE th;A ititL givon oonteat) the only one individual that Churloa ma.t, did not meet.",
        "The focus is an amhaustiva listing of ouch individuals, whenever the vhTh belonso to topic (Haterna, 5gs11,1980, st al.",
        "19('S6).",
        ")-,A us try to .find the construction corresponding ha oelv (2n)0 Aft.aw the division of the TR into topic",
        "fopiel hvo >.y lWat\" Charles y3 (oc)co-construction 6 construction ntuitively, thin lo not what wc need.",
        "The focus is to nuoert rot-thing a.,out the topic, but here the focus is only u counterport of an individual, Intuitively, tilL, topic of ('ta) ire that Individual that Charles wet and Ono &cue declares about this individual that it ioy The constructions duct be further modified.",
        "fopiel2 ly.Het\" Charles y (that individun that Churls met) ■'ocus2 (the property si being Wary) b. Eunantruotion uorenoponding to (2o) io obtained by ppplioution di Vnana2 to O)pic2.",
        "(2') (0) >.e Wodus2\" Topic2'1 Na.",
        "CXx.k,Waryl r 1 y. Het' Charles yl Nw.",
        "qy Wet' Charleo yl dory Lau gical for (2b)'e/e g (2')(b) a2°1 Nw.",
        "qy C aux yl r Wary as -1C-'e (2e,) Topiel 44th' Charlas yl Vocual Topic2 . \"",
        "(Het' Charles y3 rocus2 Nw.",
        "ha s.Hary (2')(c) Air Woe, Top:412'1 NW.",
        "LAnaui.,' 1 Ely. \"",
        "[Wet\" Churl, Nv.",
        "ly I ,We ° Charles ylo Flory no throe constructions reflect presupposition, negation and ..lhatistivo listing rah observed in (2a-ell Abe\" iota-operator (singulurier) is not defined on the eupty class, i.e. the propositions (2°u,b) are uncle-fined in those possible worlds where Charles met no-hody, and (2\"c) is undefined in those possible worlds where Charles uet everybody.",
        "Also the two scopes of negation corresponding to the contextually bound and nun-hound operator of negation are distinguished by 12°h) and (2'0).",
        "In (2'a) nod (24a) the equality uaya that Hary was the only une individual with the given property, Le.",
        "the constructions reflect the oghuuo-tive Uevertheless, *t least two objectiona to these a:AA tructions ono K2 ruised2 l, in (20 Wary is not the u:iaglt individual in the world that Charles wet, hut the single one in the given conteEt, the single one from all currently preoent in the oposkor's cind.",
        "The construction",
        "(OL)-VOAUbi• tha io to oonnLA.Juvo:vy itnotion (oon,A5 with o witAvuted in tle took oi haotAu.do Lihoy-o0; by Lind howmi0, h. pwny '01coblun condentiug the udd the utovh oilavod kuouledile oot y(A Q0 willn,dod.cot Ai in thAr4 Tito in'ouuovooition oy.",
        "OU'o-c) u,wtobIAL..hed kav ,o-ocyd'A'aten.' :1_.",
        "thA",
        "Tho Pao inotton Wcyanud o on •noh-L,-,..50ty ii :ho 'Voon0.2° ooryd, nf: f6.0U7A :),dnrisT' !dok,s'eopo4d to ti;.,",
        "UN thclk.",
        "4uh(04.0)1•• (A-60:4306:),, No(-10\",:.",
        "omroolv6o i.,1 Th.",
        "(1.11,10 ,00[.l'' to nt.",
        ":4ntonood K: H' iqa110, di) n oor ) Tou 06fl0 ji6 o go.,",
        "The following functions ere used in the description:",
        "The meanings of the functions are ae follow CH(dt) returns true iff the root of dt is conteu-tually bound.",
        "HD(dt) returns true iff eeturne false (NB(dt) \"CB(dt)).",
        "NBNeg(dt) returns true iff the contextually non-bound operator of negation in connected with the root of dt (contextually bound operator of negation is handled by the Buoic algorithm).",
        "Tree(e) returns the dependency tree suspended on edge e. Fun(e) returns the functor of edge e. H(f) returns the object of TIL realizing relationship f ('Cause','Aim').",
        "R-Edge(e) returns true iff e ie an El-Edge.",
        "A-Edge(e) returns true iff e in an A-Edge.",
        "DivEdge(dt) returns the dividing edge between the topic and the focus of dt.",
        "Functions DelEdge and PutVar realize dividing of the dependency tree.",
        "DelEdge(dt,e) returns dependency tree dt' without edge e (edge e ireremoved from dt).",
        "PutVar(dt,e) replaces the tree suspended on edge a in tr by a variable and returns the resulting dependency tree.",
        "Tranalate(dt) returns the construction of TIL corresponding to dt to which dt is translated by the Basic algorithm.",
        "GetTyp(c) returns the type of construction c. How we can describe the following procedures: FA a DepTree Gonntrul' n PA (dt) let e = DivEdge (A),",
        "• .",
        "Translate EPutVer (6t,o:0, .",
        "Translate (Treu(g))",
        "in ix NIIMeg(dt) then r Au.\"",
        "fV\" T''J A else E Au rv' T\")) if the dividing edge is en A--edge end , to the topic the tree ic.J handled by function TA.",
        "The tree in divided in the 08W vJuklc:r sees to VA.",
        "The, resulting construction in sore couplicatud than in TA becauee it has to reflect procuppooitions and enhaue five liet n",
        "If the dividing edge in an a-edge and the vein b(Aoig6 to the focus the true in translated by function Ph.",
        "neve the dividing edge in renoved iron the tree end the functor of the dividing edge detereinen a rule-tionnhip betusen the topic and locus, The proposition in the focus in prenupposed, the prooapponition ensured by function Tr.",
        "The relationship ) tosen tie-topic and the Icons is not uithin the scope of Ti4p-Unit.",
        "TFA FA TA FR TR the main procedure verb in the focus, verb in the topic, verb in the focus, verb in the topic, (function) dividing A-edge dividing A-edge dividing R-edge dividing R-edge",
        "If the dividing edge is an A-edge and the verb belonge to the focus the tree is handled by function FA.",
        "The tree suspended on the dividing edge in replaced by a variable, the topic and focus are translated separately and the resulting construction is put together.",
        "V is the construction corresponding to the focus and T in the construction corresponding to the topic.",
        "if OnNog(dt) then L Ae C Oh A FA) nine E Au EP° E'a'r' Tl VA) ;",
        "Although cony problems ere open, it is omen that the topic/focus articulation has an effect on the semantic content of the sentence and, therefore, it can he anclyzed by means of formal semantics."
      ]
    },
    {
      "heading": "Acknowleduement.",
      "text": [
        "The author vishes to thank Prof. Petr Sgall for him support of this work and valuable discussions.",
        "He rttnot"
      ]
    }
  ]
}
