{
  "info": {
    "authors": [
      "Ruzhan Lu"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2207",
    "title": "Dynamic Logic With Possible World",
    "url": "https://aclweb.org/anthology/C94-2207",
    "year": 1994
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper introduces a semantic theory DI,PW, Dynamic Logic with Possible World, which extends Groenendijk's DPI, and Cresswell's Indices Semantics.",
        "The semantics can interpret the temporal and modal sense and anaphora."
      ]
    },
    {
      "heading": "§1 Introduction",
      "text": [
        "At present there are three main aspects in semantical field:",
        "1.",
        "Transformation of sentences or discourses into formulas in high order logic.",
        "2.",
        "Semantic interpretation of the logical formulas.",
        "3.",
        "Semantic ambiguity.",
        "This paper presents the semantics, dynamic logic with possible world, which combines DP1,131 with Indices semantics\"' and extends the theories, the theory can be used to interpret the temporal and modal sense and anaphoric connection.",
        "For the limitation of space we only give the definitions and examples concerned rather than present a formalization which should include the axioms and rules concerned like in DP1.\"1.",
        "Following Montague semantics, the discussion on meaning of a sentence started with predicate formula, high order logical formual with lambda terms, which is translated from a sentence S by means of a set of rules and reduced to a first order predicate formula A finally.",
        "Problem: given an expression A, meaning CA1------?",
        "Assume that a model M is an ordered pair (D, I?)",
        "where 1) is a domain, a non – empty set and 14' an interpretation function assigning a semantic value to each non – logical constant of the language.",
        "A value assignment g is a function assigning a member of D to each variable of the language.",
        "W is a possible world.",
        "The intension of the expression A is int IA1=--- 1Hkr'g. The extension of the expression A is Ext[A, Some semantic evaluations ,are as follows:",
        "1.",
        "Montague Semantics, given M, W, evaluates extension MA 2.",
        "Possible World Semantics (M. J. Cresswell), given M, W, finds the set of possible worlds which satisfy the extension of A. i.e., {WI MA mwgTrue} .",
        "3.",
        "Dynamic Predicate Logic (J. Groenendijk), given M, W, finds dynamic changes between the value assignments: 4.",
        "Dynamic Logic with Possible World, given M, finds dynamic changes between the ordered pairs of value assignment and",
        "The evaluations 1, 2 above are in static sense and for use of interpretation of sentences without anaphora, while evalu",
        "ations 3, 4 above in dynamic sense and for use of interpretation of anaphoric connection.",
        "§ 2 DLPW, Anaphoric Connection In this section we hope that DLPW can offer a successful application to anaphoric connection like the intepretation of the famous donkey sentence in Groenendijk's .",
        "The sentence",
        "(1) There was a key, it is lost.",
        "can be formalized as (2) PAAey(x) & NOW lost(x) (in the hope that) having the same semantic interpretation as the formula (3) I'D (key(x) & NOW lost(x)).",
        "The idea will come true by means of dynamic logic DLPW.",
        "A state, denoted by n (--=(cr, g>), may be a pair of a sequence of time cr(a=-{o-(0), o-(1)}) and a value assignment g. There are revisions of semantic de-finitons of operators concerned.",
        "Where F(9) is a set of individuals, F is the function in a model M. cp is an atomic formula.",
        "Here obviously, conjunction is treated like composition ( i.e., compound statement {S,; So}).",
        "Intuitively, the conjunction is treated in the sequential sense.",
        "The meanings of the formulas o-i[1/0], o'l[term t/0], gi[x] follow the statements in the preceding section.",
        "Assume that initially for all i, j, vi(j)=to and a, g; in it, denoted components concerned.",
        "Hence",
        "(9) (ni, n2)0(2)11 iff, by (6), for some no, no', go(-go'), (10) (ni, n3)E11Pkey(x)11 and (11) (no', n2)0NOW lost(x)II.",
        "(10) holds iff, by (5), for some t(<a1(0)),",
        "=a-IC-term t/0], g3=--gi[x]), and gi[x](x)eF(key), where gi[x](x)=---h(x).",
        "(11) holds, iff, by (4), (15) ((0-3'[1/0], go'), n2)Ellost(x)1[, iff by (8), n2---a3'Cl/01, go') (i.e., o-2----o-o'D/01 and g2=go'=--go, (by (6))------gi[x] (by (14)), and g3(x)EF(lost).",
        "It means that g3(x)( = dual ko, say) is a key at t(<to) and g3(x) ko) is lost at to.",
        "On the other hand, for the formula (3), (16) (ni, n3)E11(3)11 iff, by (5), for some t(<a1(0)),",
        "(19) holds iff n3.---(cri[term t/0], gi[x]), and g,[x](x)cF(key), i.e., o-3---=o-i[term t/0] and g3.----g,[x], (20) holds iff, by (4), (21) ((a3'[1/0], g3'), n2)0lost(x)11 iff,",
        "by (8), 72==.",
        "(a3q1/01, g3'), and g,i(x)E F(lost), i.e., 0r2-----o-3' [1/O] and It shows formulas (2) and (3) have identical meaning.",
        "This is just what we require."
      ]
    },
    {
      "heading": "Acknowledgement",
      "text": [
        "The research work is supported in part by the National Natural Science Foundation and The National Key Lab.",
        "of Computer Software New Technology in Nanking University."
      ]
    },
    {
      "heading": "Reference",
      "text": []
    }
  ]
}
