{
  "info": {
    "authors": [
      "Jia-Yan Jian",
      "Yu-Chia Chang",
      "Jason S. Chang"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics – Interactive Poster and Demonstration Sessions",
    "id": "acl-P04-3019",
    "title": "TANGO: Bilingual Collocational Concordancer",
    "url": "https://aclweb.org/anthology/P04-3019",
    "year": 2004
  },
  "references": [
    "acl-J90-1003",
    "acl-J93-1003",
    "acl-J93-1007",
    "acl-P97-1063"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we describe TANGO as a collocational concordancer for looking up collocations.",
        "The system was designed to answer user’s query of bilingual collocational usage for nouns, verbs and adjectives.",
        "We first obtained collocations from the large monolingual British National Corpus (BNC).",
        "Subsequently, we identified collocation instances and translation counterparts in the bilingual corpus such as Sinorama Parallel Corpus (SPC) by exploiting the word-alignment technique.",
        "The main goal of the concordancer is to provide the user with a reference tools for correct collocation use so as to assist second language learners to acquire the most eminent characteristic of native-like writing."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Collocations are a phenomenon of word combination occurring together relatively often.",
        "Collocations also reflect the speaker’s fluency of a language, and serve as a hallmark of near native-like language capability.",
        "Collocation extraction is critical to a range of studies and applications, including natural language generation, computer assisted language learning, machine translation, lexicography, word sense disambiguation, cross language information retrieval, and so on.",
        "Hanks and Church (1990) proposed using point-wise mutual information to identify collocations in lexicography; however, the method may result in unacceptable collocations for low-count pairs.",
        "The best methods for extracting collocations usually take into consideration both linguistic and statistical constraints.",
        "Smadja (1993) also detailed techniques for collocation extraction and developed a program called XTRACT, which is capable of computing flexible collocations based on elaborated statistical calculation.",
        "Moreover, log likelihood ratios are regarded as a more effective method to identify collocations especially when the occurrence count is very low (Dunning, 1993).",
        "Smadja’s XTRACT is the pioneering work on extracting collocation types.",
        "XTRACT employed three different statistical measures related to how associated a pair to be collocation type.",
        "It is complicated to set different thresholds for each statistical measure.",
        "We decided to research and develop a new and simple method to extract monolingual collocations.",
        "We also provide a web-based user interface capable of searching those collocations and its usage.",
        "The concordancer supports language learners to acquire the usage of collocation.",
        "In the following section, we give a brief overview of the TANGO concordancer."
      ]
    },
    {
      "heading": "2 TANGO",
      "text": [
        "TANGO is a concordancer capable of answering users’ queries on collocation use.",
        "Currently, TANGO supports two text collections: a monolingual corpus (BNC) and a bilingual corpus (SPC).",
        "The system consists of four main parts:"
      ]
    },
    {
      "heading": "2.1 Chunk and Clause Information Integrated",
      "text": [
        "For CoNLL-2000 shared task, chunking is considered as a process that divides a sentence into syntactically correlated parts of words.",
        "With the benefits of CoNLL training data, we built a chunker that turn sentences into smaller syntactic structure of non-recursive basic phrases to facilitate precise collocation extraction.",
        "It becomes easier to identify the argument-predicate relationship by looking at adjacent chunks.",
        "By doing so, we save time as opposed to n-gram statistics or full parsing.",
        "Take a text in CoNLL2000 for example: The words correlated with the same chunk tag can be further grouped together (see Table 1).",
        "For instance, with chunk information, we can extract",
        "(Note: Every chunk type is associated with two different chunk tags: B-CHUNK for the first word of the chunk and I-CHUNK for the other words in the same chunk) the target VN collocation “take dive” from the example by considering the last word of two adjacent VP and NP chunks.",
        "We build a robust and efficient chunking model from training data of the CoNLL shared task, with up to 93.7% precision and recall.",
        "In some cases, only considering the chunk information is not enough.",
        "For example, the sentence “...the attitude he had towards the country is positive...” may cause problem.",
        "With the chunk information, the system extracts out the type “have towards the country” as a VPN collocation, yet that obviously cuts across two clauses and is not a valid collocation.",
        "To avoid that kind of errors, we further take the clause information into account.",
        "With the training and test data from CoNLL2001, we built an efficient HMM model to identify clause relation between words.",
        "The language model provides sufficient information to avoid extracting wrong collocations.",
        "Examples show as follows (additional clause tags will be attached):",
        "(1) ....the attitude (S* he has *S) toward the country (2) (S* I think (S* that the people are most concerned with the question of (S* when conditions may become ripe.",
        "*S)S)S)",
        "As a result, we can avoid combining a verb with an irrelevant noun as its collocate as “have toward country” in (1) or “think ... people” in (2).",
        "When the sentences in the corpus are annotated with the chunk and clause information, we can consequently extract collocations more precisely."
      ]
    },
    {
      "heading": "2.2 Collocation Type Extraction",
      "text": [
        "A large set of collocation candidates can be obtained from BNC, via the process of integrating chunk and clause information.",
        "We here consider three prevalent Verb-Noun collocation structures in corpus: VP+NP, VP+PP+NP, and VP+NP+PP.",
        "Exploiting Logarithmic Likelihood Ratio (LLR) statistics, we can calculate the strength of association between two collocates.",
        "The collocational type with threshold higher than 7.88 (confidence level 99.5%) will be kept as one entry in our collocation type list."
      ]
    },
    {
      "heading": "2.3 Collocation Instance Identification",
      "text": [
        "We subsequently identify collocation instances in the bilingual corpus (SPC) with the collocation types extracted from BNC in the previous step.",
        "Making use of the sequence of chunk types, we again single out the adjacent structures of VN, VPN, and VNP.",
        "With the help of chunk and clause information, we thus find the valid instances where the expected collocation types are located, so as to build a collocational concordance.",
        "Moreover, the quantity and quality of BNC also facilitate the collocation identification in another smaller bilingual corpus with better statistic measure.",
        "English sentence Chinese sentence If in this time no one ❑ ❑ ❑ ❑ ❑ ❑ ❑ shows concern for them, 0000000 and directs them to ❑ ❑ ❑ ❑ ❑ ❑ ❑ correct thinking, and ❑ ❑ ❑ ❑ ❑ ❑ ❑ teaches them how to E-1000000 express and release ❑ ❑ emotions, this could very ❑ ❑ ❑ ❑ ❑ easily leave them with a ❑ ❑ ❑ ❑ ❑ ❑ ❑ terrible personality ❑❑ complex they can never resolve.",
        "Occasionally some ❑ ❑ ❑ ❑ ❑ ❑ kungfu movies may ❑ ❑ ❑ ❑ ❑ ❑ ❑ appeal to foreign ❑ ❑ ❑ ❑ ❑ ❑ ❑ audiences, but these too ❑❑❑ ❑❑❑ are exceptions to the rule.",
        "SPC"
      ]
    },
    {
      "heading": "2.4 Extracting Collocational Translation Equivalents in Bilingual Corpus",
      "text": [
        "When accurate instances are obtained from bilingual corpus, we continue to integrate the statistical word-alignment techniques (Melamed, 1997) and dictionaries to find the translation candidates for each of the two collocates.",
        "We first locate the translation of the noun.",
        "Subsequently, we locate the verb nearest to the noun translation to find the translation for the verb.",
        "We can think of collocation with corresponding translations as a kind of translation memory (shows in Table 2).The implementation result of BNC and SPC shows in the Table 3, 4, and 5."
      ]
    },
    {
      "heading": "3 Collocation Concordance",
      "text": [
        "With the collocation types and instances extracted from the corpus, we built an online collocational concordancer called TANGO for looking up translation memory.",
        "A user can type in any English query and select the intended part of speech of query and collocate.",
        "For example in Figure 1, after query for the verb collocates of the noun “influence” is submitted, the results are displayed on the return page.",
        "The user can then browse through different collocates types and also click to get to see all the instances of a certain collocation type.",
        "VN type Example Exert That means they would influence already be exerting their influence by the time the microwave background was born.",
        "Exercise The Davies brothers, Adrian influence (who scored 14 points) and Graham (four), exercised an important creative influence on Cambridge fortunes while their flankers Holmes and Pool-Jones were full of fire and tenacity in the loose.",
        "Wield Fortunately, George V had influence worked well with his father and knew the nature of the current political trends, but he did not wield the same influence internationally as his esteemed father.",
        "Moreover, using the technique of bilingual collocation alignment and sentence alignment, the system will display the target collocation with highlight to show translation equivalents in context.",
        "Translators or learners, through this web-based interface, can easily acquire the usage of each collocation with relevant instances.",
        "This collocational concordancer is a very useful tool for self-inductive learning tailored to intermediate or advanced English learners.",
        "Users can obtain the result of the VN or AN collocations related to their query.",
        "TANGO shows the collocation types and instances with collocations and translation counterparts highlighted.",
        "The evaluation (shows in Table 6) indicates an average precision of 89.3 % with regard to satisfactory."
      ]
    },
    {
      "heading": "4 Conclusion and Future Work",
      "text": [
        "In this paper, we describe an algorithm that employs linguistic and statistical analyses to extract instance of VN collocations from a very large corpus; we also identify the corresponding translations in a parallel corpus.",
        "The algorithm is applicable to other types of collocations without being limited by collocation’s span.",
        "The main difference between our algorithm and previous work lies in that we extract valid instances instead of types, based on linguistic information of chunks and clauses.",
        "Moreover, in our research we observe",
        "other types related to VN such as VPN (ie.",
        "verb + preposition + noun) and VNP (ie.",
        "verb + noun + preposition), which will also be crucial for machine translation and computer assisted language learning.",
        "In the future, we will apply our method to more types of collocations, to pave the way for more comprehensive applications."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This work is carried out under the project “CANDLE” funded by National Science Council in Taiwan (NSC92-2524-S007-002).",
        "Further information about CANDLE is available at http://candle.cs.nthu.edu.tw/."
      ]
    }
  ]
}
