{
  "info": {
    "authors": [
      "Michael Mastroianni",
      "Bob Carpenter"
    ],
    "book": "Workshop on Computational Phonology",
    "id": "acl-W94-0202",
    "title": "Constraint-Based Morpho-Phonology",
    "url": "https://aclweb.org/anthology/W94-0202",
    "year": 1994
  },
  "references": [
    "acl-C92-1015",
    "acl-E89-1014",
    "acl-E91-1016"
  ],
  "sections": [
    {
      "heading": "Introduction",
      "text": [
        "In this paper, we develop a new generative paradigm with which to capture phonological generalizations.",
        "Our framework differs from standard generative frameworks inasmuch as we eschew all derivational analyses.",
        "Thus, we dispense with procedural transformations of underlying and intermediate representations into surface forms by means of the cyclic application of relatively unconstrained context-sensitive rewriting rules.",
        "Instead, we adopt a strictly monostratal approach, wherein a single level of articulatory representation is subject to linguistic constraints expressed declaratively using well-understood logical tools.",
        "In order for our enterprise to succeed, we will require a rich representational system.",
        "To this end, we follow the lead of autosegmental and metrical phonology, taking our representations to be organized around natural groupings of articulators.",
        "A further similarity to antosegmental analyses and some traditional generative analyses is that we allow underspecification in our lexical representations.",
        "But in contrast to these other theories, we adopt a single, concrete, surface-based representational system, rather than abstract underlying and intermediate representations of uncertain status.",
        "hi particular, our approach is strictly monotonic, disallowing stages of analysis in which ill-formed representations are constructed and repaired.",
        "Instead, the linguistic constraints we impose, both universal and parochial, combined with possibly underspecified lexical representations, conspire to fully determine surface representations.",
        "The result is a fully declarative system, albeit one which can be provided with a procedural interpretation in which lexical (syntactic and semantic) representations are incrementally refined into surface representations, or vice-versa, by the application of constraints, either sequentially or in parallel.",
        "We have chosen to employ feature structures for our phonological representations, a natural candidate for constraint-based linguistic theories.",
        "Feature structures provide two mechanisms for constructing linguistic representations.",
        "The first is a multiple inheritance hierarchy of types, which allows the multidimensional classification of structures.",
        "The second mechanism is that of features, whose values are themselves modeled by feature structures.",
        "Universal and parochial constraints, including lexical representations, are expressed using attribute-value logic.",
        "Expressions in our attribute-value logics are interpreted as restrictions on admissible linguistic structures.",
        "Being comprised of a representational system of feature structures subject to a collection of attribute-value constraints, our grammars are interpreted in a co-inductive, constraint-based fashion.",
        "More specifically, the admissible linguistic structures are modeled by those feature structures satisfying all of the constraints.",
        "This contrasts with traditional, inductive or rule-based generative accounts, in which well-formed representations are constructed from a primitive set of well-formed base cases by applying derivational rules.",
        "Unlike many approaches to phonology, ours includes a careful consideration of the morphology-phonology interface.",
        "It should be clear how our phonological theory can be integrated with a constraint-based theory of morphology, and thus to constraint-based theories of syntax and semantics.",
        "The result is a seamless theory of language relating phonology and semantics, mediated by morphology and syntax.",
        "One benefit of constructing such a unified theory is that constraint resolution algorithms can integrate constraints from diverse linguistic sources on-line during processing, as the speech signal is being received.",
        "An architecture supporting integrated processing is clearly desirable given the overwhelming psycholinguistic evidence concerning human processing.",
        "It is important to point out that our theory, being based on logical constraints over monostratal representations, can easily integrate diverse sources of constraints simply by means of conjunction.",
        "The constraints themselves can be highly modular, both across components such as syntax and semantics, and within components such as phonology.",
        "By the same token, it, is straightforward to integrate universal and parochial constraints, and any level of constraints in between, such as those found in particular language families.",
        "Furthermore, subregu-larities within a language, which often stem from separate, possibly historically unrelated sources, can also be captured, without the resource to default mecha",
        "nisms.",
        "A further desirable feature of our monostratal constraint-based approach is its declarative, relational nature, which allows the same linguistic constraints to be applied symmetrically to both generation and understanding.",
        "In what follows, we provide specifications of the most important universal constraints involved in syllable and metrical structure, with particular constraints for English syllabification, Malak-Malak and Yup'ik stress assignment, and Icelandic umlauting.",
        "For reasons of space, we are not able to include the full signatures (declarations of types) for these grammars, nor will we give all of the constraints necessary to define such a grammar.",
        "Readers interested in complete, implemented grammars, including all of the signature entries and constraints, should consult (Mastroianni 1993).",
        "Feature Structures and Constraints For linguistic representations, we adopt the feature structure formalism of (Carpenter 1992), which was modeled on the notion of feature structure employed in HPSG (Pollard and Sag 1994).",
        "Feature structures are built out of two components, types and features.",
        "A specification of the behavior of types and their corresponding features is known as a signature.",
        "A signature is built out of a finite set Type of types.",
        "We interpret types as sets of objects.",
        "To use a non-linguistic example, Nat might be the type of natural numbers, which is interpreted as the set {0, 1, n, ...}.",
        "The types form a multiple inheritance hierarchy under a subtyping partial ordering C. If the type a is a subtype of a type T, then every Object of type a is of type r. We write a C 7 if the type r is a subtype of cr, and also say that a is a supertype of r. For instance, consonants, represented by the type cons are subtypes of segments, represented by the type seg, so we write seg C cons.",
        "Furthermore the type glide of glides is a subtype of cons, so cons C glide.",
        "Thus by the transitivity of partial orderings, glide is a subtype of type seg, so seg C glide.",
        "As an alternative example, we have a type boot of boolean values, with the truth values + and - as subtypes, so boot C + and boot C If a C r, we also say that r is more specific than a, or that a is more general than r. More specific types provide more information about an object.",
        "Using a type hierarchy allows us to both factor constraints on different classes of representations and to state them at the appropriate level of generalization.",
        "A type p is known as a unifier of the types a and r if it is a subtype of both of them, so that a C p and r C p, in which case a and 7 are said to be unifiable.",
        "For instance, the types for approximants and consonants, approx and cons, are unifiable, as they have a common subtype glide.",
        "A pair of types is unifiable if the information they contain is consistent.",
        "Thus the types + and - are not unifiable, as it is impossible for an object to be of both types.",
        "Similarly, the types nasal and obstruent have no unifiers, as there are no segments which can be assigned to both types.",
        "One way to view unification is as a type-theoretic analogue of conjunction.",
        "For instance, glide has all of the information contained in the conjunction of approx and cons, plus perhaps some more.",
        "A pair a and r of unifiable types must have a most general unifier, a U r, such that, C U r, 7CaUr and for every unifier p of a and r, U r C p. For instance, cons-approx, the type of consonant approximants, is the most general unifier of cons and approx.",
        "As another example, we use non-low as the type of non-low heights, and non-high for the type of non-high heights, and so we have the medium height, med = non-high U non-low, as their unification.",
        "We further define a most general or universal type, 1, with the property that, for any type r in our ordering, 1 C T. To construct feature structures, we also need a finite set Feat of features.",
        "The remaining component of a signature relates the features to the types by means of appropriateness conditions.",
        "These determine the features which can and must occur on each type, as well as constraining the types of their values.",
        "This is the sense in which we are dealing with a typed system, rather than simply a sorted one.",
        "An appropriateness assignment is a partial function Approp: Feat x Type – Type.",
        "A structure of type a is required to have a value for the feature f if and only if Approp(f, , a) is defined, and in addition, the value must be at least as specific as Approp(f, , o-).",
        "For instance, we have Approp(LABIAL, place) = boot, which states that the feature LABIAL, representing whether there is closure of the vocal tract at the lips, must receive a boolean value in a feature structure representing the place of articulation.",
        "To take another example, we have Approp(Nucuus, syllable) = vowel,' which states that the value of a syllable's nucleus feature must be a vowel.",
        "In addition, Approp(muoDY, vowel) is undefined, which indicates that vowels do not receive melody values.",
        "We require the appropriateness assignment to respect the inheritance hierarchy according to standard object-oriented principles.",
        "In particular, subtypes inherit the features and value restrictions of all of their supertypes, which can be arranged in a multiple inheritance hierarchy.",
        "In such a system, we require that if C r and Approp(f, , cr) is defined, then Approp(f, , r) is defined and Approp(f, a) C Approp(f, r).",
        "For instance, sonorants inherit the melody feature from consonants, and heavy-open-syllables inherit the nucleus feature from syllables, but further constrain it to be a 'For simplicity, we ignore the case of languages which allow non-vowels to be the nuclei of syllables.",
        "We could generalize, for instance, by assuming Approp(NucLEus, syllable) = approximant-nasal to account for the more general case, or we could refine our hierarchy to include a new supertype of vowels whose subtypes include liquids and nasals, say vocalic-nasaL",
        "heavy nucleus.2 Feature structures are defined relative to a signature.",
        "A feature structure is taken to be a finite, rooted and directed graph, in which nodes are labeled with types and arcs with features.",
        "Feature structures are typically displayed as attribute-value matrices, where the bracketing indicates the nodes, and features indicate the arcs.",
        "Feature structures must satisfy the appropriateness conditions, so that a node of type a such that A ppmp( f , a) is defined must be connected by an arc labeled f to a node of type r such that Approp( f , a) C r. A 1,al.iire structure meeting this condition is said to be totally well-typed.",
        "The most general feature structure of type vowel respecting the appropriateness conditions is given in Figure 1.",
        "This structure represents the feature geometry common to all vowels.",
        "In addition to conditions of well-typedness, we require every feature structure representing a grammatical linguistic structure to be fully resolved in the following way.",
        "Every type must be a maximally specific one, in the sense of not having any further subtypes.",
        "For instance, occurrences of the type bool must be resolved to either + or -, and occurrences of type cons to either an obstruent, glotta.1-pharyngeal, nasal, liquid or glide.",
        "This amounts to a closed world interpretation of our type hierarchies, wherein every type can be equated logically with the disjunction of its subtypes (see (Carpenter 1992)).",
        "For instance, this equates sonorant with the disjunction or the types glottal-pharyngeal, nasal amm l approx, so that every sonorant must be either glottal, nasal or approximant.",
        "Another example involves height, where the subtypes of height, high, med and 2 In addition, our hierarchies respect Carpenter's (1992) introduction condition, which requires the set of features for which a feature f is appropriate to have a most general type.",
        "This constraint is motivated computationally, in that it forces the type inference algorithm to produce a unique most general result.",
        "But this constraint can be easily relaxed (King and Cots 1993) or reconstructed from a hierarchy which does not meet it (Carpenter and Pollard 1992).",
        "low, exhaust the possibilities.",
        "The closed world ;Assumption is implicit in every approach to generative grammar with which we are familiar.",
        "Simply stated, it says that the only possibilities are the ones specified as such by the grammar.",
        "In syntax fi,r instance, a list of phrase structure schemes is typically taken to be exhaustive; if a string can not be analyzed according to the rule schemes given, the theory classifies it as ungrammatical Constraints will be of the following form.",
        "Here, is an arbitrary description, which is taken to constrain the possibilities for objects of type a.",
        "We take constraints on a type to be inherited by all of their subtypes.",
        "In general, we allow descriptions to specify types of objects, to specify the values of features by further descriptions, to impose equality and inequality constraints on objects.",
        "In addition, descriptions are taken to be closed under the logical operations of conjunction and disjunction, and the string operations of concatenation and Kleene-star.",
        "Finally, we allow relational and functional constraints by means of definite clauses.",
        "'1'he string operations generalize the notion of constraint found in (Carpenter 1992) along lines suggested by Reape (1991); such operations were coded by functional and relational constraints by Bird and Klein (1993) and by Mastroianni (1993).",
        "We will follow (Mastroianni 1993) in our treatment of syllable structure and the arrangement of features in segments.",
        "This work is closely related io that presented in (Scobbie 1992), (Bird 1992), (Bird and Klein 1993), and (Russell 1993).",
        "One major difference between our work and that of both Bird and Scobbie is that we have given analyses of vowel harmony.",
        "Scobbie, because of his adjacency meta-constraint, is unable to do this, and Bird gives no account of such processes, either.",
        "In addition, we give an account of syllabification and stress, neither of which were attempted by Bird or Scobbie.",
        "Our work shares with Russell's a concern for the role of morphology both in triggering phonological operations and in interfacing with other components of grammar.",
        "Most of the analyses in these frameworks are compatible with our approach; we believe they are best viewed as instances of the same paradigm of monostratal, constraint-based morpho-phonology.",
        "We will assume that the type root has subtypes which are arranged as in Figure 2.",
        "We follow (Carpenter 1992) in our treatment of types and inheritance.",
        "Thus, all or the subtypes of root have a PLACE feature, and all consonant subtypes have a MELODY feature.",
        "The representation of a generic consonant is similar to the vowel illustrated in Figure 1, but without stress or tone features, and with an additional manner feature, with all of its appropriate features.",
        "We shall assume that we have syllables, which have rhymes, and optionally have onsets.",
        "Rhymes contain nuclei, and sometimes codas, as well.",
        "The signature for syllables is as follows.",
        "The rhyme subtypes mentioned",
        "above are defined as in Figure 4.",
        "We define the signature entries for nucleus,onset, and coda in Figure 5.",
        "In addition, we constrain onsets, nuclei and codas to be sequences of segments.",
        "In our characterization of the maximal onset principle, we make crucial use of a sonority hierarchy.",
        "This is defined in terms of our type definitions as follows.",
        "(2) a. consonant vowel b. obstruent sonorani c. glot_phar -< nasal d. nasal -< sonor_approx e. liquid -< glide",
        "We reacl these constraints as stating, for instance, that consonants are less sonorous than vowels, liquids are less sonorous than glides, and so on.",
        "This interpretation provides a linear ordering of the maximally specific segmental subtypes of consonants according to their relative sonority: (3) obstruent glottal_pharyngeal nasal liquid -< glide -< vowel We employ this ordering of segmental types by sonority in our approach to syllabification, enabling us to cap-hire the rising and falling sonority of onsets and codas.",
        "Syllabification The PHON value of a word will have two features, dealing with syllabification/stress, and morphology, respectively.",
        "We will be concerned in this section only with the phonological feature, which will be filled by a phon-word.",
        "We show the feature structure for the phon-word for the English word kisses below in Figure 6.",
        "Note that a simple-phon has the features ROOTS, VOWELS, and SYLLS , which must be of types root+ , vowel+ , and syllable+ , respectively.",
        "The type phon-word will be divided into subtypes .simple-phon and complex-phon.",
        "A complex phon-word will have an appendix.",
        "This appendix will appear appended to a sequence of syllables.",
        "Thus, the slims value of a. complex-phon will be of type syllable+ •appendix.1 appendix will allow the presence of smile consonant 3 ror any type (7, o• is the type of sequences of objects of type a, and a+ is the type of non-emtpy sequences of objects of type cr, and c is the type of the empty sequence.",
        "We also allow these operations on descriptions, giving us the full expressive power of regular expressions, similar to the feature structure and automata-based approaches developed in (Bird 1992) and (Bird and Ellison 1992).",
        "We use • as a concateneation operator.",
        "Thus, 41) • describes a string consisting of the concatenation of strings described by 4) and lb.",
        "cluster which would otherwise violate the sonority constraint.",
        "The sonority constraint is captured as follows.",
        "An onset is allowable just in case the segments it contains are arranged in increasing sonority, and no phonotactic constraints are violated.",
        "Phonotactic constraints are defined separately for each language.",
        "Some languages allow exceptional onsets.",
        "We handle this by defining exceptional onset types for each language.",
        "In English, we have exceptional onsets formed from, e.g., s, k, r. The sonority condition on codas is the reverse; i.e., the sonority must.",
        "decrease (in general, sonority decreases with distance from the nucleus).",
        "An appendix can be formed, as in eats, when we have a consonant cluster containing two equally sonorous segments at the end of a word.",
        "For a formalization of the constraints on codas and onsets, see (Mastroianni 1993).",
        "We will use the sonority hierarchy again in the combination of syllables.",
        "It is a well-attested generalization that languages tend to put as much material as possible into the onsets of syllables, rather than codas (the maximal onset principle).",
        "This principle can be expressed in our system by constraining the SYLLS values of words.",
        "We allow two syllables to combine only if the last segment(s) of the first could not be combined into a legal onset in the second syllable.",
        "This is used in our constraint on simple-phon, given below.",
        "We define the definite clause consistent(, 0) as follows.",
        "(5) consistent(synab/e, e) consistent(g(syllab/c A ROOTS : (root* • Drool)), El (syllable A",
        "According to this definition, a single syllable is consistent.",
        "Recursively, a syllable followed by a sequence of syllables is consistent if the last root in the ROOTS value of the first syllable cannot be combined into a valid onset with the first root in the ROOTS value of the following syllable, and the second syllable is consistent with whatever follows.",
        "A given pair of roots may not be combined into an onset if the second is less sonorous than the first.",
        "These definitions merely express the maximal onset principle, modulo phonotactic constraints arid certain allowable exceptions.",
        "We handle phonotactic constraints with the gap/2 predicate, where gap(x , y) expresses that x is not allowed before y in an onset.",
        "For instance, the sequence LI is an allowable onset with respect to sonority, but English disallows it.",
        "This can be seen in the word atlas, which syllabifies as atlas rather than atlas.",
        "To capture this English-specific, phonotactic constraint, we take gap(t, I) to be a clause of gap/2 in English.",
        "Exceptional, yet allowable onsets can be handled by adding exceptional subtypes.",
        "For instance, borrowings that allow 11 in an onset niust be protected from being subject to the English gap constraint.",
        "The definite clause map(0, 0, x) provides the linking relation between our autosegmental tiers, where 0 rep-r( `set Its the vowel tier, 0 the roots tier and x the static-titre which combines them.",
        "The mapping constraint On phonology values ensures that the end of the ROOTS and",
        "VOWELS values of the simple-phon correspond to those of the syllables which constitute the SYLLS value.",
        "The recursive clauses for map/3 are as follows follows.",
        "We now turn to our constraint defining complex-ph on.",
        "It is a well-known empirical fact that many languages allow consonant clusters at the end of words which could not appear tautosyllabically anywhere else (typically because this would violate the sonority condition on codas, i.e., that the sonority must fall as distance from the nucleus increases).",
        "In English, this phenoinenon is exemplified by many words ending in the regular plural and past-tense, such as cats, dogs, and washed, which are realized as IccEts, dawgz, and wagt, repectively.",
        "In each of these examples, the alveolar stop or sibilant which ends the word is of the same sonority as the preceding consonant.",
        "The standard treatment of such words in autosegmental phonology is to allow some kind of appendix to appear at the end of words.",
        "In our analysis, a phon-word bearing an appendix would be of the type complex-phon.",
        "By definition, such a word has a SYLLS value which consists of some (non-empty) sequence of syllables followed by an appendix.",
        "Such a structure will be allowable modulo certain constraints.",
        "These can be defined as follows.",
        "The consistency and mapping checks are as before.",
        "The compatible(X,Y) clause ensures that the voicing assimilation mentioned above occurs (two segments are compatible just in case their VOICE values unify).",
        "Two objects satisfy the epenth(X,Y) clause just in case they are both alveolar stops or both sibilants (at least, for English)."
      ]
    },
    {
      "heading": "Metrical Phonology Malak-Malak",
      "text": [
        "Itecall that the type vowel is defined as having a feature STRESS.",
        "Following (Mastroianni 1993), we will occuirences of each segment.",
        "on a single tier.",
        "But for computational purposes, it is easiest to construct all the relevant structures on-line rather than computing them within particular constrai us.",
        "suppose that each syllable has a nucleus containing a vowel.",
        "The basic stress pattern of Malak-Malak is built from left-headed binary feet, with primary stress falling on the first stressed syllable ((oldsmith 1990: p.174).",
        "Words are, in general, \"right-to-left\", meaning that degenerate feet normally appear at the beginning of the word.",
        "There is one exception to this pattern, which is that three-syllable words typically have stress on the first and third syllables.8We provide exaiiiples of Malak-Malak stress patterns in Figure ?",
        "?, adapted from (Goldsmith 1990: pp.",
        "174-175).",
        "For ease of reading, 2 0_i 0 1 0",
        "we have inserted hyphens between syllables.",
        "In keeping with our stress features, we have marked vowels bearing primary stress with a \"2\", those bearing secondary stress with a \"1\", and those which are unstressed with a \"0\".",
        "In Goldsmith's system, the first syllable of a word 7A nucleus could also have a pair of vowels or a vowel-diphthong pair.",
        "A vowel-diphthong pair will still only have one STRESS value.",
        "We can ensure by constraint that any two vowels which appears in a nucleus in a language with long vowels have token-identical STRESS values.",
        "8 As our system is purely declarative, In our system, procedural notions such as \"right-to-left.\" and \"left-to-right\" are exppressed declaratively, being characterized as degenerate-first and degenerate-last respectively.",
        "with an mid number (II syllables is \"extra-metrical\".",
        "In other words, such syllables are assigned to feet, but these feet are deleted afterwards, as a result of a \"stress clash\" repair mechanism.",
        "However, there is no reason why we should assume that initial degenerate feet always assign stress.",
        "If we make this assumption, we have gained \"uniformity,\" in some vague sense, at the expense of procedural complication.",
        "We eschew procedural analyses of the data.",
        "The empirical fact is that there are two cases in Malak-Malak.",
        "The exceptional case occurs only in the non-emphatic form of words with exactly three syllables.",
        "If we were really dealing with a \"stress clash\" phenomenon here, we would expect this exceptional case to be the case for all words with odd.",
        "numbers of syllables.",
        "Since this does not happen, we are perfectly justified in allowing a general word, and an exceptional word, with no reference to \"universal\" plwnomena.",
        "We thus define two types of phon-word for Malak-Malak, normal-word, for the general case, and cxcep-word, for the exceptional case.",
        "In order to make our constraints as general as possible, we will define several subtypes of foot.",
        "At the top level, there will be degenerate-foot and complex-foot.",
        "We will define two subtypes of degenerate-foot, and several subtypes of complex-foot.",
        "The type degenerate-foot will have subtypes degen-stressed and degen-unstressed.",
        "The type complex-foot will have subtypes lh-foot and rh-fool.",
        "The type 1h-fool will itself have two subtypes, lh-primary and lh-secondary.",
        "These types must be constrained with respect to their STRESS in order to be useful.",
        "A degen-unstressed foot must contain exactly one syllable bearing a nucleus consisting of a vowel with a STRESS value of 0, and a degcn-stressed foot must have a NUCLEUS with a STRESS value of 2.",
        "A rh-foot must contain two syllables, the second of which bears full stress.",
        "A 1h-foot must contain two syllables, the li rst of which is stressed.",
        "A lh-primary foot bears primary stress, while a lh-secondary foot bears secondary stress.",
        "Our constraints on the types normal-word and excep-word are as follows.",
        "b. excep-word FEET: degen-stressed • rh-foot The constraint (kilning normal-word states that the Pall' value of such a word must be either",
        "1.",
        "A degenerate foot containing an unstressed syllable, followed by a sequence of left-headed feet, the first of which has a stressed syllable with STRESS value 2, and all the rest of which have stressed syllables with STRESS value 1.",
        "2.",
        "A sequence of left-headed feet as above, with no degenerate foot at the beginning.",
        "With these constraints in place, a word must either be of type normal-word or excep-word.",
        "In the first case, a normal-word can consist of a left-headed loot bearing primary stress followed by a sequence of (me or more left-headed feet bearing secondary stress, with, optionally, an unstressed degenerate foot at the very beginning.",
        "In the second case, a word may consist of a single unstressed syllable followed by a right-headed foot.",
        "This gives us exactly the attested patterns."
      ]
    },
    {
      "heading": "Central Siberian Yup'ik",
      "text": [
        "((oldsmith 1990) gives us some data from Central Siberian Yup'ik, which is taken from (Krauss 1985).",
        "We reproduce this data below.",
        "Stressed vowels are marked with a \"1\", and unstressed vowels are marked with",
        "In Yup'ik, final syllables bear no stress.",
        "Heavy syllables are stressed, except when they appear word-finally.",
        "The standard foot is right headed; a word with no heavy syllables has all right-headed feet, and a word with a heavy syllable has right-headed feet to the left of that syllable, with alternating stress after that.",
        "Note that \"heavy-syllable\" must be defined here as a syllable containing a long vowel.",
        "11 We define a",
        "subtype heavy-syllable of syllable, which must have a heavy-rhyme as its RHYME value.",
        "A heavy-rhyme will be a rhyme which has a long vowel as its nucleus.",
        "The heaviness of a rhyme will be independent of the presence of a coda.",
        "Thus, we will have open-heavy-rhyme and closed-heavy-rhyme as further subtypes, with and without codas, respectively (for present purposes, we will abstract away from a definition of the type coda).",
        "In the standard metrical treatment presented in (Goldsmith 1990), the final syllable is marked as being \"extrametrical\" before foot construction proceeds.",
        "We will directly mimic this, without, however, using ordered procedures.",
        "Instead, we require that the final syllable be unstressed and contained in a degenerate loot.",
        "This gives us the same results as the standard analysis, but allows us to keep our FEET values of type foott In order to do this elegantly, we will split our type degenerate-foot into two subtypes, final-fool and non-final-degen.",
        "The only other type of foot in Yup'ik is the iambic foot, rh.-foot.",
        "We give the signature entry for the Yup'ik foot in Figure 9.1213 We now turn to stress assignment in Yup'ik.",
        "The basic pattern is that all complex feet are iambic, and all non-final heavy syllables are stressed.",
        "Thus, any heavy syllables which would not form the second element of an iamb are put into stressed degenerate feet.",
        "Degenerate feet consisting of light syllables only appear at the the signatures for some languages, we will want to define closed syllables as being heavy, while in others we will want those syllables with long nuclei, whether open or closed, to be considered heavy.",
        "12 Note that, for any type a, we take a\" to be the type of a sequence of n objects of type cr.",
        "13We have chosen to define all complex feet in Yup'ik to be binary by defining an appropriateness constraint in the signature that the SYLLS value be of type syllable2 .",
        "Alternatively, we could have created a universal type signature, allowing arbitrarily long feet., and hit posed a constraint.",
        "restricting Ytip'ik feet lo be binary.",
        "Either way, we allow the Itinary/tion•binary distinction to be simply parameterized.",
        "penultimate syllables of words.",
        "This can be formalized as follows.",
        "Now we need to define constraints on the construction of words from feet.",
        "This is done with one constraint, as follows.",
        "This constraint says that we must have an unstressed degenerate foot as the final foot.",
        "The penultimate foot may be either a rh-foot or a non-final degenerate foot.",
        "Finally, any preceding feet roust consist exclusively of rh-foot and non-fin-heavy feet.",
        "These definitions combine to give us a grammar in which well-formed words must end in an unstressed syllable (by the definition of final-foot).",
        "All syllables not contained in the final-foot of a word must be contained in an iambic foot, or be a stressed syllable contained in its own degenerate foot (by the definition of allowable, the constraint on phon-word, and the definitions of rh-foot and non-fin-heavy).",
        "This gives us exactly the data presented above."
      ]
    },
    {
      "heading": "Morphology: Icelandic Umlauting",
      "text": [
        "We now briefly turn our attention to morphology.",
        "As we mentioned above, the phon value of a word will have two features, one for syllabification and stress, P HONO LOO V, and another, monPnoLociv, for morphological information.",
        "So far, we have only discussed the PitoNoLocv values.",
        "We will define a type morph, which will include affixes, infixes, stems, and words.",
        "All objects of type morph will have, minimally, the features ROOTS, and SYNSEM , filled by objects of types root+ and syns em, respectively.",
        "We will divide the type word into simple and complex subtypes.",
        "As an example of a MORPHOLOGY value, we give the feature structure for the word .fishes in Figure 10.\" For Icelandic, which exhibits vowel-harmony (umlauting), we will add a feature VOWELS, a feature HARM, and a feature WORD.",
        "These features will take values of types vowel, harm, and bool, respectively.",
        "The addition of these features conforms fairly well to standard practice in autosegmental phonology, with the VOWELS feature corresponding to the vowel tier.",
        "The feature HARM indicates whether vowel harmony is present, and the feature WORD indicates whether the object in question is a full-fledged word (rather than, say, a partially-inflected word).",
        "With these preliminaries, we can continue with our analysis of Icelandic umlauting, which we treat as a case of vowel harmony.",
        "Vowel harmony is generally taken to be a process in which the vowels of (typically) a stem assimilate to some feature of sonic vowel(s) of (typically) an affix.",
        "In general, all of the vowels assimilate, or all of the vowels which do not precede some blocking element (if the harmony is with the vowels in a suffix).",
        "In the literature, umlauting and vowel reduction in Icelandic are not typically referred to as vowel harmony.",
        "However it is clear that, in fact, these processes do match the standard definition of vowel harmony.",
        "The process works as follows.",
        "Suppose we have a noun whose final syllable has a as its nucleus in the nominative singular.",
        "One such word is fatnadh (suit).",
        "When realized with the dative-plural suffix, urn , there is a vowel harmony effect.",
        "The final a, and any other as in the word which an not separated from that a by some syllable nucleus which is not an a, is realized as u, if it is not stressed, and 6 if it is stressed (in general, the first syllable is stressed).",
        "Under .a derivational analysis, we have a vowel harmony effect in which an underlying a assimilates to a surface u when appropriately situated in a string of surface as, unless it is the first vowel in the stem, in which case, it partially assimilates, to 6.",
        "Thus the combination of underlying fatnadh with -urn, the results in the surface form fanudhum.",
        "There exists a class of nouns (mostly borrowings) which systematically differ from this paradigm.",
        "In this class of exceptions, the harmony process stops at some point, even though it would continue further under the standard paradigm (typically, only the final a assimilates).",
        "In such cases, the frontmost a which assimilates is realized as 6.",
        "One example of such a word is akarn, which is realized as akOrnum in the dative-plural.",
        "'5 Icelandic exhibits the further property that this harmony process can sometimes occur without a u being present.",
        "This can be exemplified by the declension 15 In the following, all Of the examples of such exceptions will be of this sort, for the simple reason that we are unaware of any cases in which the assimilation stops further forward in the word.",
        "Our analysis will be able to accommodate either case with no alterations, so this is not a problem.",
        "from Table 1, there are cases when the harmonic form of a stem is used as an inflected form of the word.",
        "We can handle this neatly in our formalism, as we shall show below.",
        "We will need to divide the type harm into subtypes bool, nil, trigger, plus-nil, and minus-nil.",
        "Plus-nil subsumes + and nil, while minus-nil subsumes - and nil.",
        "We will define several new subtypes of agr, in order to account for the nominative and accusative cases shown in Table 1 above.",
        "The type agr must have a new feature CASE, with values of type case.",
        "The type case has subtypes nom-acc-case and gen-dat-case.",
        "Noin-ace-ease has subtypes nominative and accusative, while gen-dal-case has subtypes genitive and dative.",
        "We will define two new immediate subtypes of agr, gen-dat, and nom-acc.",
        "As the names imply, objects of type gen-dat must have CASE values of type gen-dat-case, while objects of type norn-acc must have CASE values of type nom-acc-case.",
        "Nom-acc and gen-dat each have plural and singular subtypes.",
        "In order to illustrate how we use these new features and types, the lexical constraint for the word fatnadh is given in Figure 11.",
        "The",
        "definite clause definitions for the goals harmonize(, 0) and allowable(, V') are given below.",
        "As in HPSG, we treat the lexicon as a disjunction of the descriptions of its members.",
        "As shown by Pollard and Sag (1987), this allows a great deal of redundancy in lexical descriptions to be factored into constraints at suitable levels of generality using multiple inheritance.",
        "For instance, the harmony constraints given above will not need to be expressed on a word-by-word basis.",
        "The goals allowab1e(0, 0,x) and harmonize(0,o, x) in the lexical constraint ensure the following:",
        "(12) allowable(, , x) 1. nominative-singular words must have either - or nil as their HARM values.",
        "2. nominative-plural words must have either + or nil as their HARM values.",
        "3. all nominative words have + as their WORD value.",
        "4. all genitive and dative stems have - as their WORD value, and may have any HARM value.",
        "haritionize(0, x) I. if a word has a HARM value of nil or -, its VOWELS value harmonizes with itself.",
        "2. if a word has a HARM value of +, and its VOWELS value is a singleton list containing a, then it harmonizes with a singleton list containing 0.",
        "3. recursively, if a word has a HARM value of +, and its VOWELS value is a list headed by a, then it harmonizes with a list headed by u only if the two list's tails harmonize.",
        "4. a list of vowels headed by some other vowel than a or u harmonizes with itself.",
        "It should be noted that n-a-vowel subsumes all of the vowels except a and u.",
        "Thus, the line referring to it.",
        "causes the harmony process to terminate whenever some other vowel than a or u occurs.",
        "'rhe lexical constraint states that we can have morph which is a nominative singular third person noun with semantics suit ill we have ROOTS: (f,ai, t, n, a2, dh), and VOWELS (ai , a2).",
        "Furthermore, the value of the HARMONY feature, (a, a), and (al, a2) must harmonize.",
        "As we can see from Figure 14, if the HARMONY value is either - or nil, then (at, a2) must actually be (a,a).",
        "If the HARMONY value is +, then (Cl L, a2) must.",
        "be (on).",
        "All members of the sequence of vowels except the first, must be u, while the first must be 0.",
        "The WORD feature exists primarily to prevent, e.g., fanudh by itself from being recognized as a word.",
        "We could change our signature again, so that objects of type word had + as their WORD value.",
        "However, this is not really necessary.",
        "The WORD feature will come up again in the constraints on suffix and complex-word.",
        "As the reader can check, the constraint above gives us fainadh, with WORD value +, HARMONY value -, and AGR value nom-acc-sing, and fanudh, with WORD value -, HARMONY value + and AGR value nom-acc-sing.",
        "As the reader may have noticed, we handled the general harmony case by specifying that.",
        "the entire value of the VOWELS feature harmonize with some sequence of as.",
        "To handle the special cases, such as akarn, we merely need to specify that the last element of the VOWELS feature harmonize with a singleton list, containing an a.",
        "To handle cases where some other as harmonize further forward in the word, we would only need to force some final segment of the VOWELS value to harmonize with some list of as.",
        "As an example, we give the lexical constraint for the word akarn in Figure 12.",
        "It should be noted that, in this scheme, words which do VOWELS: [1(evowel, ['vowel) A ROOTS: (El, k, 13 r, n) A WORD: 4 boo!",
        "A",
        "not have an a as their final vowel (i.e., as the head of their VOWELS value) must have nil as their HARMONY value.",
        "The constraints defining suffixes will be very similar to those defining words.",
        "Here, all suffixes with a. first vowel u must have trigger as their HARMONY values (the rest have nil).",
        "The constraint defining the dative-plural affix urn is given in Figure 13.",
        "The way in which the FIRST, SYNCAT, SUBCAT, etc., are passed to a complex-word are exactly as in the English case (Mastroianni 1993).",
        "Here, the only differences are with respect to the WORD and HARMONY values.16 We now turn our attention to the task of defining constraints on complex-word.",
        "For this, we add two new \"All affixes are defined in the signature to have - as their WORD value; strictly speaking, this makes the reference to WORD:- in Figure 13 redundant.",
        "However, it does make the constraint to follow more readable.",
        "features, STEM and MOD, with values of type word and affix, respectively.",
        "The constraint on combining stems and suffixes is given in Figure 14.",
        "The definite clause clniipatible(0, 0) is defined as follows.",
        "(13) compatible( trigger, +) coiiipatible( trigger, nil) compatible( nil, minus) coinpatible(nil, The constraint in Figure 14 allows the dative affix to combine with fanudh, and akOrn, but not fainadh or alarn, which is the desired result.",
        "Furthermore, the dative affix can combine with any word which has a HARMONY value of nil.",
        "Thus, it can combine with any word which has a final vowel other than a.",
        "These definitions allow us to deal with vowel harmony without resorting to some undefined non-local process.",
        "In this way, we have improved significantly on the presentation in (Scobbie 1991).",
        "We have also done this in a purely n R fl lost ratal theory, without recourse to rule orderings, extrinsic or otherwise."
      ]
    },
    {
      "heading": "Conclusion",
      "text": [
        "The phonological theory which we have outlined has several advantages, both theoretical and practical, over the standard autosegMental theories.",
        "(a) employ the same grammars for both generation and analysis; and (b) naturally interleave the processing of phonological, morphological, syntactic, semantic and pragmatic information.",
        "It might be claimed that our approach is in some way too unconstrained.",
        "But the generality of the constraint-based representational system should not be confused with the restrictions on the linguistic theory.",
        "Our approach to phonology is quite restrictive in that all of the techniques we have used merely represent the empirical generalizations in an intuitive manner.",
        "This should he contrasted, for example, with derivational theories in which simple constraints such as the sonority contour and the maximal onset principle are indirectly captured through ordered context-sensitive rewriting schemata.",
        "But, as with most work on linguistics, we have not spelled out the precise boundaries between the universal and the language specific."
      ]
    }
  ]
}
