{
  "info": {
    "authors": [
      "Kiyotaka Uchimoto",
      "Yujie Zhang",
      "Kiyoshi Sudo",
      "Masaki Murata",
      "Satoshi Sekine",
      "Hitoshi Isahara"
    ],
    "book": "Workshop on Multilingual Linguistic Resources",
    "id": "acl-W04-2208",
    "title": "Multilingual Aligned Parallel Treebank Corpus Reflecting Contextual Information and Its Applications",
    "url": "https://aclweb.org/anthology/W04-2208",
    "year": 2004
  },
  "references": [
    "acl-C00-1007",
    "acl-C02-1064",
    "acl-J93-2004",
    "acl-P00-1056",
    "acl-P01-1030",
    "acl-P01-1067"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes Japanese-English-Chinese aligned parallel treebank corpora of newspaper articles.",
        "They have been constructed by translating each sentence in the Penn Treebank and the Kyoto University text corpus into a corresponding natural sentence in a target language.",
        "Each sentence is translated so as to reflect its contextual information and is annotated with morphological and syntactic structures and phrasal alignment.",
        "This paper also describes the possible applications of the parallel corpus and proposes a new framework to aid in translation.",
        "In this framework, parallel translations whose source language sentence is similar to a given sentence can be semi-automatically generated.",
        "In this paper we show that the framework can be achieved by using our aligned parallel treebank corpus."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Recently, accurate machine translation systems can be constructed by using parallel corpora (Och and Ney, 2000; Germann et al., 2001).",
        "However, almost all existing machine translation systems do not consider the problem of translating a given sentence into a natural sentence reflecting its contextual information in the target language.",
        "One of the main reasons for this is that we had many problems that had to be solved by one-sentence to one-sentence machine translation before we could solve the contextual problem.",
        "Another reason is that it was difficult to simply investigate the influence of the context on the translation because sentence correspondences of the existing bilingual documents are rarely one-to-one, and are usually one-to-many or many-to-many.",
        "On the other hand, high-quality treebanks such as the Penn Treebank (Marcus et al., 1993) and the Kyoto University text corpus (Kuro-hashi and Nagao, 1997) have contributed to improving the accuracies of fundamental techniques for natural language processing such as morphological analysis and syntactic structure analysis.",
        "However, almost all of these high-quality treebanks are based on monolingual corpora and do not have bilingual or multilingual information.",
        "There are few high-quality bilingual or multilingual treebank corpora because parallel corpora have mainly been actively used for machine translation between related languages such as English and French, therefore their syntactic structures are not required so much for aligning words or phrases.",
        "However, syntactic structures are necessary for machine translation between languages whose syntactic structures are different from each other, such as in Japanese-English, Japanese-Chinese, and Chinese-English machine translations, because it is more difficult to automatically align words or phrases between two unrelated languages than between two related languages.",
        "Actually, it has been reported that syntactic structures contribute to improving the accuracy of word alignment between Japanese and English (Yamada and Knight, 2001).",
        "Therefore, if we had a high-quality parallel treebank corpus, the accuracies of machine translation between languages whose syntactic structures are different from each other would improve.",
        "Furthermore, if the parallel treebank corpus had word or phrase alignment, the accuracy of automatic word or phrase alignment would increase by using the parallel treebank corpus as training data.",
        "However, so far, there is no aligned parallel treebank corpus whose domain is not restricted.",
        "For example, the Japanese Electronics Industry Development Association’s (JEIDA’s) bilingual corpus (Isahara and Haruno, 2000) has sentence, phrase, and proper noun alignment.",
        "However, it does not have morphological and syntactic information, the alignment is partial, and the target is restricted to a white paper.",
        "The Advance Telecommunications Research dialogue database (ATR, 1992) is a parallel treebank corpus between Japanese and English.",
        "However, it does not have word or phrase alignment, and the target domain is restricted to travel conversation.",
        "Therefore, we have been constructing aligned parallel treebank corpora of newspaper articles between languages whose syntactic structures are different from each other since 2001; they meet the following conditions.",
        "1.",
        "It is easy to investigate the influence of the context on the translation, which means the sentences that come before and after a particular sentence, and that help us to understand the meaning of a particular word such as a pronoun.",
        "2.",
        "The annotated information in the existing monolingual high-quality treebanks can be utilized.",
        "3.",
        "They are open to the public.",
        "To construct parallel corpora that satisfy these conditions, each sentence in the Penn Treebank (Release 2) and the Kyoto University text corpus (Version 3.0) has been translated into a corresponding natural sentence reflecting its contextual information in a target language by skilled translators, revised by native speakers, and each parallel translation has been annotated with morphological and syntactic structures, and phrasal alignment.",
        "Henceforth, we call the parallel corpus that is constructed by pursuing the above policy an aligned parallel treebank corpus reflecting contextual information.",
        "In this paper, we describe an aligned parallel treebank corpus of newspaper articles between Japanese, English, and Chinese, and its applications."
      ]
    },
    {
      "heading": "2 Construction of Aligned Parallel Treebank Corpus Reflecting Contextual Information",
      "text": []
    },
    {
      "heading": "2.1 Human Translation of Existing Monolingual Treebank",
      "text": [
        "The Penn Treebank is a tagged corpus of Wall Street Journal material, and it is divided into 24 sections.",
        "The Kyoto University text corpus is a tagged corpus of the Mainichi newspaper, which is divided into 16 sections according to the categories of articles such as the sports section and the economy section.",
        "To maintain the consistency of expressions in translation, a few particular translators were assigned to translate articles in a particular section, and the same translator was assigned to the same section.",
        "The instructions to translators for Japanese-English translation is basically as follows.",
        "1.",
        "One-sentence to one-sentence translation as a rule",
        "Except in the case that the translated sentence becomes unnatural by pursuing policy 1, translate a source sentence into a target sentence naturally.",
        "By deletion, replacement, or supplementation, let the translated sentence be natural in the context.",
        "In an entire article, the translated sentences must maintain the same meaning and information as those of the original sentences.",
        "3.",
        "Translations of proper nouns Find out the translations of proper nouns by looking up the nouns in a dictionary or by using a web search.",
        "In case a translation cannot be found, use a temporary name and report it.",
        "We started the construction of Japanese-Chinese parallel corpus in 2002.",
        "The Japanese sentences of the Kyoto University text corpus were also translated into Chinese by human translators.",
        "Then each translated Chinese sentence was revised by a second Chinese native.",
        "The instruction to the translators is the same as that given in the Japanese-English human translations.",
        "The breakdown of the parallel corpora is shown in Table 1.",
        "We are planning to translate the remaining 18,714 sentences of the Kyoto University text corpus and the remaining 30,890 sentences of the Penn Treebank.",
        "As for the naturalness of the translated sentences, there are 207 (1%) unnatural English sentences of the Kyoto University text corpus, and 462 (2.5%) unnatural Japanese sentences of the Penn Treebank generated by pursuing policy 1."
      ]
    },
    {
      "heading": "2.2 Morphological and Syntactic Annotation",
      "text": [
        "In the following sections, we describe the annotated information of the parallel treebank corpus based on the Kyoto University text corpus."
      ]
    },
    {
      "heading": "2.2.1 Morphological and Syntactic Information of Japanese-English corpus",
      "text": [
        "Translated English sentences were analyzed by using the Charniak Parser (Charniak, 1999).",
        "Then, the parsed sentences were manually revised.",
        "The definitions of part-of-speech (POS) categories and syntactic labels follow those of the Treebank I style (Marcus et al., 1993).",
        "We have finished revising the 10,328 parsed sentences that appeared from January 1st to 11th.",
        "An example of morphological and syntactic structures is shown in Figure 1.",
        "In this figure, “S-ID” means the sentence ID in the Kyoto University text corpus.",
        "EOJ means the boundary between a Japanese parsed sentence and an English parsed sentence.",
        "The definition of Japanese morphological and syntactic information follows that of the Kyoto University text corpus (Version 3.0).",
        "The syntactic structure is represented by dependencies between Japanese phrasal units called bunsetsus.",
        "The phrasal",
        "effectively absorb those expressions and to align as many parts as possible, we found that a bigger unit than a word or a morpheme is suitable as the minimum alignment unit.",
        "We call the minimum alignment based on bunsetsu alignment units the bunsetsu unit translation pair.",
        "Bigger pairs than the bunsetsu unit translation pairs can be automatically extracted based on the bunsetsu unit translation pairs.",
        "We call all of the pairs, including bunsetsu unit translation pairs, translation pairs.",
        "The bunsetsu unit translation pairs for idiomatic expressions often become unnatural.",
        "In this case, two or more bunsetsu units are combined and handled as a minimum alignment unit.",
        "The breakdown of the bunsetsu unit translation pairs is shown in",
        "the line after the SID to the EOJ.",
        "Each line indicates a bunsetsu.",
        "Each rectangular line indicates a dependency between bunsetsus.",
        "The leftmost number in each line indicates the bunsetsu ID.",
        "The corresponding English sentence is shown in the next line after that of the EOJ (End of Japanese) until the EOE (End of English).",
        "The English expressions corresponding to each bunsetsu are tagged with the corresponding bunsetsu ID such as <P id=” bunsetsu ID”></P>.",
        "When there are two or more figures in the tag id such as id=” 1,2”, it means two or more bunsetsus are combined and handled as a minimum alignment unit.",
        "For example, we can extract the following translation pairs from Figure 3.",
        "• (J)",
        "has such meanings as \"beautiful\" and \"splendid.\"",
        "EOE sentence, was 9.",
        "The number of similar translations, which mean that the translated sentence is ungrammatical, or different or wrong meanings of words, tenses, and prepositions are used in the translated sentence, was 83.",
        "The number of other translations, which mean that some words are missing, or the meaning of the translated sentence is completely different from that of the original sentence, was 10.",
        "For example, the original parallel translation is as follows:"
      ]
    }
  ]
}
