{
  "info": {
    "authors": [
      "Aaron Li-Feng Han",
      "Yi Lu",
      "Derek F. Wong",
      "Lidia S. Chao",
      "Liangye He",
      "Junwen Xing"
    ],
    "book": "Workshop on Statistical Machine Translation",
    "id": "acl-W13-2245",
    "title": "Quality Estimation for Machine Translation Using the Joint Method of Evaluation Criteria and Statistical Modeling",
    "url": "https://aclweb.org/anthology/W13-2245",
    "year": 2013
  },
  "references": [
    "acl-C92-2067",
    "acl-D12-1097",
    "acl-E06-1031",
    "acl-N03-1020",
    "acl-P02-1040",
    "acl-P06-1055",
    "acl-P06-2070",
    "acl-P07-1038",
    "acl-P08-1007",
    "acl-P09-1089",
    "acl-P10-1012",
    "acl-P12-1098",
    "acl-W07-0714",
    "acl-W07-0734",
    "acl-W10-1754",
    "acl-W11-2105",
    "acl-W11-2106",
    "acl-W11-2109",
    "acl-W12-3102",
    "acl-W12-3103",
    "acl-W12-3107",
    "acl-W12-3110",
    "acl-W12-3122"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper is to introduce our participation in the WMT13 shared tasks on Quality Estimation for machine translation without using reference translations.",
        "We submitted the results for Task 1.1 (sentence-level quality estimation), Task 1.2 (system selection) and Task 2 (word-level quality estimation).",
        "In Task 1.1, we used an enhanced version of BLEU metric without using reference translations to evaluate the translation quality.",
        "In Task 1.2, we utilized a probability model Na?ve Bayes (NB) as a classification algorithm with the features borrowed from the traditional evaluation metrics.",
        "In Task 2, to take the contextual information into account, we employed a discriminative undirected probabilistic graphical model Conditional random field (CRF), in addition to the NB algorithm.",
        "The training experiments on the past WMT corpora showed that the designed methods of this paper yielded promising results especially the statistical models of CRF and NB.",
        "The official results show that our CRF model achieved the highest F-score 0.8297 in binary classification of Task 2."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Due to the fast development of Machine translation, different automatic evaluation methods for the translation quality have been proposed in recent years.",
        "One of the categories is the lexical similarity based metric.",
        "This kind of metrics includes the edit distance based method, such as WER (Su et al., 1992), Multi-reference WER (Nie?en et al., 2000), PER (Tillmann et al., 1997), the works of (Akiba, et al., 2001), (Leusch et al., 2006) and (Wang and Manning, 2012); the precision based method, such as BLEU (Papineni et al., 2002), NIST (Doddington, 2002), and SIA (Liu and Gildea, 2006); recall based method, such as ROUGE (Lin and Hovy 2003); and the combination of precision and recall, such as GTM (Turian et al., 2003), METEOR (Lavie and Agarwal, 2007), BLANC (Lita et al., 2005), AMBER (Chen and Kuhn, 2011), PORT (Chen et al., 2012b), and LEPOR (Han et al., 2012).",
        "Another category is the using of linguistic features.",
        "This kind of metrics includes the syntactic similarity, such as the POS information used by TESLA (Dahlmeier et al., 2011), (Liu et al., 2010) and (Han et al., 2013), phrase information used by (Povlsen, et al., 1998) and (Echizen-ya and Araki, 2010), sentence structure used by (Owczarzak et al., 2007); the semantic similarity, such as textual entailment used by (Mirkin et al., 2009) and (Castillo and Estrella, 2012), Synonyms used by METEOR (Lavie and Agarwal, 2007), (Wong and Kit, 2012), (Chan and Ng, 2008); paraphrase used by (Snover et al., 2009).",
        "The traditional evaluation metrics tend to evaluate the hypothesis translation as compared to the reference translations that are usually offered by human efforts.",
        "However, in the practice, there is usually no golden reference for the translated documents, especially on the internet works.",
        "How to evaluate the quality of automatically translated documents or sentences without using the reference translations becomes a new challenge in front of the NLP researchers."
      ]
    },
    {
      "heading": "2 Related Works",
      "text": [
        "Gamon et al. (2005) perform a research about reference-free SMT evaluation method on sentence level.",
        "This work uses both linear and non-linear combinations of language model and SVM classifier to find the badly translated sentences.",
        "Albrecht and Hwa (2007) conduct the sentence-level MT evaluation utilizing the regression learning and based on a set of weaker indicators of fluency and adequacy as pseudo references.",
        "Specia and Gimenez (2010) use the Confidence Estimation features and a learning mechanism trained on human annotations.",
        "They show that the developed models are highly biased by difficulty level of the input segment, therefore they are not appropriate for comparing multiple systems that translate the same input segments.",
        "Specia et al. (2010) discussed the issues between the traditional machine translation evaluation and the quality estimation tasks recently proposed.",
        "The traditional MT evaluation metrics require reference translations in order to measure a score reflecting some aspects of its quality, e.g. the BLEU and NIST.",
        "The quality estimation addresses this problem by evaluating the quality of translations as a prediction task and the features are usually extracted from the source sentences and target (translated) sentences.",
        "They also show that the developed methods correlate better with human judgments at segment level as compared to traditional metrics.",
        "Popovi?",
        "et al (2011) perform the MT evaluation using the IBM model one with the information of morphemes, 4-gram POS and lexicon probabilities.",
        "Mehdad et al. (2012) use the cross-lingual textual entailment to push semantics into the MT evaluation without using reference translations.",
        "This evaluation work mainly focuses on the adequacy estimation.",
        "Avramidis (2012) performs an automatic sentence-level ranking of multiple machine translations using the features of verbs, nouns, sentences, subordinate clauses and punctuation occurrences to derive the adequacy information.",
        "Other descriptions of the MT Quality Estimation tasks can be gained in the works of (Callison-Burch et al., 2012) and (Felice and Specia, 2012)."
      ]
    },
    {
      "heading": "3 Tasks Information",
      "text": [
        "This section introduces the different subtasks we participated in the Quality Estimation task of WMT 13 and the methods we used."
      ]
    },
    {
      "heading": "3.1 Task 1-1 Sentence-level QE",
      "text": [
        "Task 1.1 is to score and rank the post-editing effort of the automatically translated English-Spanish sentences without offering the reference translation.",
        "Firstly, we develop the English and Spanish POS tagset mapping as shown in Table 1.",
        "The 75 Spanish POS tags yielded by the Treetagger (Schmid, 1994) are mapped to the 12 universal tags developed in (Petrov et al., 2012).",
        "The English POS tags are extracted from the parsed sentences using the Berkeley parser (Petrov et al., 2006).",
        "Secondly, the enhanced version of BLEU (EBLEU) formula is designed with the factors of modified length penalty ( ), precision, and recall, the and representing the lengths of hypothesis (target) sentence and source sentence respectively.",
        "We use the harmonic mean of precision and recall, i.e. ( ).",
        "We assign the weight values and , i.e. higher weight value is assigned to precision, which is different with METEOR (the inverse values).",
        "Lastly, the scoring for the post-editing effort of the automatically translated sentences is performed on the extracted POS sequences of the source and target languages.",
        "The evaluated performance of EBLEU on WMT 12 corpus is shown in Table 2 using the Mean-Average-Error",
        "The official evaluation scores of the testing results on WMT 13 corpus are shown in Table 3.",
        "The testing results show similar scores as compared to the training scores (the MAE score is around 0.16 and the RMSE score is around 0.22), which shows a stable performance of the developed model EBLEU.",
        "However, the performance of EBLEU is not satisfactory currently as shown in the Table 2 and Table 3.",
        "This is due to the fact that we only used the POS information as linguistic feature.",
        "This could be further improved by the combination of lexical information and other linguistic features such as the sentence structure, phrase similarity, and text entailment."
      ]
    },
    {
      "heading": "3.2 Task 1-2 System Selection",
      "text": [
        "Task 1.2 is the system selection task on EN-ES and DE-EN language pairs.",
        "Participants are required to rank up to five alternative translations for the same source sentence produced by multiple translation systems.",
        "Firstly, we describe the two variants of EBLEU method for this task.",
        "We score the five alternative translation sentences as compared to the source sentence according to the closeness of their POS sequences.",
        "The German POS is also extracted using Berkeley parser (Petrov et al., 2006).",
        "The mapping of German POS to universal POS tagset is using the developed one in the work of (Petrov et al., 2012).",
        "When we convert the absolute scores into the corresponding rank values, the variant EBLEU-I means that we use five fixed intervals (with the span from 0 to 1) to achieve the alignment as shown in Table 4.",
        "[1,0.4) [0.4, 0.3) [0.3, 0.25) [0.25, 0.2) [0.2, 0]",
        "The alignment work from absolute scores to rank values shown in Table 4 is empirically determined.",
        "We have made a statistical work on the absolute scores yielded by our metrics, and each of the intervals shown in Table 4 covers the similar number of sentence scores.",
        "On the other hand, in the metric EBLEU-A, ?A?",
        "means average.",
        "The absolute sentence edit scores are converted into the five rank values with the same number (average number).",
        "For instance, if there are 1000 sentence scores in total then each rank level (from 1 to 5) will gain 200 scores from the best to the worst.",
        "Secondly, we introduce the NB-LPR model used in this task.",
        "NB-LPR means the Na?ve Bayes classification algorithm using the features of Length penalty (introduced in previous section), Precision, Recall and Rank values.",
        "NB-LPR considers each of its features independently.",
        "Let's see the conditional probability that is also known as Bayes?",
        "rule.",
        "If the ( |) is given, then the ( |) can be calculated as follows:",
        "Given a data point identified as ( ) and the classifications ( ), Bayes?",
        "rule can be applied to this statement:",
        "As in many practical applications, parameter estimation for NB-LPR model uses the method of maximum likelihood.",
        "For details of Na?ve Bayes algorithm, see the works of (Zhang, 2004) and (Harrington, 2012).",
        "Thirdly, the SVM-LPR model means the support vector machine classification algorithm using the features of Length penalty, Precision, Recall and Rank values, i.e. the same features as in NB-LPR.",
        "SVM solves the nonlinear classification problem by mapping the data from a low dimensional space to a high dimensional space using the Kernel methods.",
        "In the projected high dimensional space, the problem usually becomes a linear one, which is easier to solve.",
        "SVM is also called maximum interval classifier because it tries to find the optimized hyper plane that",
        "separates different classes with the largest margin, which is usually a quadratic optimization problem.",
        "Let's see the formula below, we should find the points with the smallest margin to the hyper plane and then maximize this margin.",
        "where is normal to the hyper plane, |is the Euclidean norm of , and is the perpendicular distance from the hyper plane to the origin.",
        "For details of SVM, see the works of",
        "In the training stage, we used all the officially released data of WMT 09, 10, 11 and 12 for the EN-ES and DE-EN language pairs.",
        "We used the WEKA (Hall et al., 2009) data mining software to implement the NB and SVM algorithms.",
        "The training scores are shown in Table 5.",
        "The NB-LPR performs lower scores than the SVM-LPR but faster than SVM-LPR.",
        "The official testing scores are shown in Table 6.",
        "Each task is allowed to submit up to two systems and we submitted the results using the methods of EBLEU and NB-LPR.",
        "The performance of NB-LPR on EN-ES language pair shows higher Tau score (0.07) than the baseline system score (0.03) when the ties are ignored.",
        "Because of the number limitation of submitted systems for each task, we did not submit the SVM-LPR results.",
        "However, the training experiments prove that the SVM-LPR model performs better than the NB-LPR model though SVM-LPR takes more time to run."
      ]
    },
    {
      "heading": "3.3 Task 2 Word-level QE",
      "text": [
        "Task 2 is the word-level quality estimation of automatically translated news sentences from English to Spanish without given reference translations.",
        "Participants are required to judge each translated word by assigning a two-or multi-class labels.",
        "In the binary classification, a good or a bad label should be judged, where ?bad?",
        "indicates the need for editing the token.",
        "In the multi-class classification, the labels include ?keep?, ?delete?",
        "and ?substitute?.",
        "In addition to the NB method, in this task, we utilized a discriminative undirected probabilistic graphical model, i.e.",
        "Conditional Random Field (CRF).",
        "CRF is early employed by Lefferty (Lefferty et al., 2001) to deal with the labeling problems of sequence data, and is widely used later by other researchers.",
        "As the preparation for CRF definition, we assume that is a variable representing the input sequence, and is another variable representing the corresponding labels to be attached to .",
        "The two variables interact as conditional probability ( |) mathematically.",
        "Then the definition of CRF: Let a graph model ( ) comprise a set of vertices or nodes together with a set of edges or lines and | , such that is indexed by the vertices of , then ( ) shapes a CRF model.",
        "This set meets the following form:",
        "where and represent the data sequence and label sequence respectively; and are the features to be defined; and are the parameters trained from the datasets.",
        "We used the tool CRF++1 to implement the CRF algorithm.",
        "The features we used for the NB and CRF are shown in Table 7.",
        "We firstly trained the CRF and NB models on the officially released training corpus (produced by Moses and annotated by computing TER with some tweaks).",
        "Then we removed the truth labels in the training corpus (we call it pseudo test corpus) and labeled each word using the derived training models.",
        "The test results on the pseudo test corpus are shown in Table 8,",
        "The official testing scores of Task 2 are shown in Table 9.",
        "We include also the results of other participants (CNGL and LIG) and their approaches.",
        "The results show that our method CRF yields a higher recall score than other systems in binary judgments task, and this leads to the highest F1 score (harmonic mean of precision and recall).",
        "The recall value reflects the loyalty to the truth data.",
        "The augmented feature set designed in this paper allows the CRF to take the contextual information into account, and this contributes much to the recall score.",
        "On the other hand, the accuracy score of CRF in multiclass evaluation is lower than LIG-FS method."
      ]
    },
    {
      "heading": "4 Conclusions",
      "text": [
        "This paper describes the algorithms and features we used in the WMT 13 Quality Estimation tasks.",
        "In the sentence-level QE task (Task 1.1), we develop an enhanced version of BLEU metric, and this shows a potential usage for the traditional evaluation criteria.",
        "In the newly proposed system selection task (Task 1.2) and word-level QE task (Task 2), we explore the performances of several statistical models including NB, SVM, and CRF, of which the CRF performs best, the NB performs lower than SVM but much faster than SVM.",
        "The official results show that the CRF model yields the highest F-score 0.8297 in binary classification judgment of word-level QE task."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors are grateful to the Science and Technology Development Fund of Macau and the Research Committee of the University of Macau for the funding support for our research, under the reference No.",
        "017/2009/A and RG060/09-10S/CS/FST.",
        "The authors also wish to thank the anonymous reviewers for many helpful comments."
      ]
    }
  ]
}
