{
  "info": {
    "authors": [
      "Yasuo Koyama",
      "Masako Yasutake",
      "Kenji Yoshimura",
      "Kosho Shudo"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-1114",
    "title": "Large Scale Collocation Data and Their Application to Japanese Word Processor Technology",
    "url": "https://aclweb.org/anthology/P98-1114",
    "year": 1998
  },
  "references": [
    "acl-C80-1001",
    "acl-C96-1097",
    "acl-J90-1003"
  ],
  "sections": [
    {
      "heading": "abstract",
      "text": [
        "Word processors or computers used in Japan employ Japanese input method through keyboard stroke combined with Kana (phonetic) character to Kanji (ideographic, Chinese) character conversion technology.",
        "The key factor of Kana-to-Kanji conversion technology is how to raise the accuracy of the conversion through the homophone processing, since we have so many homophonic Kanjis.",
        "In this paper, we report the results of our Kana-to-Kanji conversion experiments which embody the homophone processing based on large scale collocation data.",
        "It is shown that approximately 135,000 collocations yield 9.1 % raise of the conversion accuracy compared with the prototype system which has no collocation data."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Word processors or computers used in Japan ordinarily employ Japanese input method through keyboard stroke combined with Kana (phonetic) to Kanji (ideographic, Chinese) character conversion technology.",
        "The Kana-to-Kanji conversion is performed by the morphological analysis on the input Kana string with no space between words.",
        "Word or phrase-segmentation is carried out by the analysis to identify the substring of the input which has to be converted from Kana to Kanji.",
        "Kana-Kanji mixed string, which is the ordinary form of Japanese written text, is obtained as the final result.",
        "The major issue of this technology lies in raising the accuracy of the segmentation and the homophone processing to select the correct Kanji among many homophonic candidates.",
        "The conventional methodology for processing homophones have used the function that gives the priority to the word which was used lastly or to the high frequency word.",
        "In fact, however, this method sometimes tends to cause inadequate conversion due to the lack of consideration of the semantic consistency of the word concurrence.",
        "While it is difficult to employ the syntactic or semantic processing in earnest for the word processor from the cost vs. performance viewpoints, for example, the following trials to improve the conversion accuracy have been reported: Employing the case-frame to check the semantic consistency of combination of words [Oshima, Y. et al.,1986].",
        "Employing the neural network to describe the consistency of the concurrence of words [Kobayashi,T.",
        "et al.,1992], Making a concurrence dictionary for the specific topic or field, and giving the priority to the word which is in the dictionary when the topic is identified [Yamamoto, K. et al., 1992].",
        "In any of these studies, however, many problems are left unsolved in realizing its practical system.",
        "Besides these semantic or quasi-semantic gadgets, we think it much more practical and effective to use surface level resources, namely, to use extensively the collocation.",
        "But how many collocations contribute to the accuracy of Kana-to-Kanji conversion is not known yet.",
        "In this paper, we present some results of our experiments of Kana-to-Kanji conversion, focusing on the usage of large scale collocation data.",
        "In chapter 2, descriptions of the collocations used in our system and their classification are given.",
        "In chapter 3, the technological framework of our Kana-to-Kanji conversion systems is outlined.",
        "In chapter 4, the method and the results of the experiments are given along with some discussions.",
        "In chapter 5, concluding remarks are given."
      ]
    },
    {
      "heading": "2. Collocation Data",
      "text": [
        "Unlike the recent works on the automatic extraction of collocations from corpus [Church, K. W, et al., 1990, lkehara, S. et al., 1996, etc.",
        "], our data have been collected manually through the intensive investigation of various texts, spending years on it.",
        "This is because no stochastic framework assures the",
        "accuracy of the extraction, namely the necessity and sufficiency of the data set.",
        "The collocations which are used in our Kana-to-Kanji conversion system consist of two kinds: (1) idiomatic expressions, whose meanings seem to be difficult to compose from the typical meaning of the individual component words [Shudo, K. et al., 1988].",
        "(2) stereotypical expressions in which the concurrence of component words is seen in the texts with high frequency.",
        "The collocations are also classified into two classes by a grammatical criterion: one is a class of functional collocations, which work as functional words such as particles (postpositionals) or auxiliary verbs, the other is a class of conceptual collocations which work as nouns, verbs, adjectives, adverbs, etc.",
        "The latter is further classified into two kinds: uninter-ruptible collocations, whose concurrence relationship of words are so strong that they can be dealt with as single words, and interruptible collocations, which are occasionally used separately.",
        "In the following, the parenthesized number is the number of expressions adopted in the system."
      ]
    },
    {
      "heading": "2.1 Functional Collocations (2,174)",
      "text": [
        "We call expressions which work like a particle relational collocation and expressions which work like an auxiliary verb at the end of the predicate auxiliary predicative collocation [Shudo, K. et al.",
        ",1980].",
        "relational collocations (760) ex.",
        "IZ/\"DIXC ni/tuite (about) auxiliary predicative collocations (1,414) ex.4.1fttitt:T. nakereba/naranai (must)"
      ]
    },
    {
      "heading": "2.2 Uninterruptible Conceptual Collocations (54,290)",
      "text": [
        "four-Kanji-compound (2,231) ex.",
        "fe1313 3.1* .",
        "gaaerunsut (every miller draws water to his own mill) adverb + particle type (3,089)",
        "ctusZut (toil and moil) noun type (21,128) ex.",
        "*0)/1pl akana tanin (perfect stranger) verb type (13,225)"
      ]
    },
    {
      "heading": "3. Kana-to-Kanji Conversion Systems",
      "text": [
        "We developed four different Kana-to-Kanji conversion systems, phasing in the collocation data described in 2.",
        "The technological framework of the system is based on extended bunsetsu (e-bunsetsu) model [Shudo, K. et al., 1980] for the unit of the segmentation of the input Kana string, and on minimum cost method [Yoshimura,K.",
        "et al., 1987] combined with Viterbi's algorithm [Viterbi, A„ J., 1967] for the reduction of the ambiguity of the segmentation.",
        "A bunsetsu is the basic postpositional or predicative",
        "phrase which composes Japanese sentences, and an e-bunsetsu, which is a natural extension of the bunsetsu, is defmed roughly as follows: <e-bunsetsu>::= <prefix>* <conceptual word I =interruptible conceptual collocation> <suffix>* <functional word I functional collocation>* The e-bunsetsu which includes no collocation is the bunsetsu.",
        "More refined rules are used in the actual segmentation process.",
        "The interruptible conceptual collocation is not treated as a single unit but as a string of bunsetsus in the segmentation process.",
        "Each collocation in the dictionary which is composed of multiple number of bunsetsus is marked with the boundary between bunsetsus.",
        "The system first tries to segment the input Kana string into e-bunsetsus.",
        "Every possible segmentation is evaluated by its cost.",
        "A segmentation which is assigned the least cost is chosen as the solution.",
        "The boundary between e-bunsetsus in examples in this paper is denoted by \"I\".",
        "ex.",
        "two results of e-bunsetsu-segmentation:",
        "In the above examples, /I, 7V/ < Idgaliku: is uninterruptible conceptual collocation and 1:-VM it/iFft/*9 naositalcotoha/arimasen: is a functional collocation.",
        "In the first example, these collocations are dealt with a single words.",
        "The second example shows the conventional bunsetsu-segmentation.",
        "The cost for the segmentation candidate is the sum of three partial costs: b-cost, c-cost and d-cost shown below.",
        "(1)a segment cost is assigned to each segment.",
        "Sum of segment costs of all segments is the basic cost (b-cost) of a segmentation candidate.",
        "By this, the collocation tends to have priority over the ordinary word.",
        "The standard and initial value of each segment cost is 2, and it is increased by 1 for each occurrence of the prefix, suffix, etc.",
        "in the segment.",
        "(2)a concatenation cost (c-cost) is assigned to specific e-bunsetsu boundaries to revise the b-cost.",
        "The concatenation, such as adnominal-noun, adverb-verb, noun-noun, etc.",
        "is paid a bonus namely a negative cost, -1.",
        "(3)a dependency cost (d-cost), which has a negative value, is assigned to the strong dependency relationship between conceptual words in the candidate, representing the consistency of concurrence of conceptual words.",
        "By this, the segmentation containing the interrupted conceptual collocation tends to have priority.",
        "The value of ad-cost varies from – 3 to – 1, depending on the strength of the concurrence.",
        "The interruptible conceptual collocation is given the biggest bonus i.e.-3.",
        "The reduction of the homophonic ambiguity, which limits Kanji candidates, is carried out in the course of the segmentation and its evaluation by the cost."
      ]
    },
    {
      "heading": "3.1 Prototype System A",
      "text": [
        "We first developed a prototype Kana-to-Kanji conversion system which we call System A, revising Kana-to-Kanji conversion software on the market, WXG Ver2.05 for PC.",
        "System A has no collocation data but conventional lexical resources, namely functional words (1,010) and conceptual words (131,661)."
      ]
    },
    {
      "heading": "3.2 System B, C and D",
      "text": [
        "We reinforced System A to obtain System B, C and D by phasing in the following collocational resources.",
        "System B is System A equipped additionally with functional collocations (2,174) and =interruptible conceptual collocations except for four-Kanji-compound and proverb type collocations (49,461).",
        "System C is System B equipped additionally with four-Kanji-compound (2,231) and proverb type collocations (2,598).",
        "Further, System D is System C equipped additionally with interruptible conceptual collocations (78,251)."
      ]
    },
    {
      "heading": "4. Experiments",
      "text": []
    },
    {
      "heading": "4.1 Text Data for Evaluation",
      "text": [
        "Prior to the experiments of Kana-to-Kanji conversion, we prepared a large volume of text data by hand which is formally a set of triples whose first component a is a Kana string (a sentence) with no space, The second component b is the correct segmentation result of a, indicating each boundary between btmsetsus with \"I\" or \".\".",
        "\"I\" and \".\" means obligatory and optional boundary, respectively.",
        "The third component c is the correct conversion result of a, which is a Kana-Kanji mixed string.",
        "The introduction of the optional boundary assures the flexible evaluation.",
        "For example, each of PAL' saite/iru (be in bloom) and PALIT saiteiru is accepted as a correct result.",
        "The data file is divided into two sub-files, fl and f2, depending on the number of bunsetsus in the Kana string a. fl has 10,733 triples, whose a has less than five bunsetsus and f2 has 12,192 triples, whose a has more than four bunsetsus."
      ]
    },
    {
      "heading": "4.2 Method of Evaluation",
      "text": [
        "Each a in the text data is fed to the conversion system.",
        "The system outputs two forms of the least cost result: b', Kana string segmented to bunsetsus by \"I\", and c', Kana-Kanji mixed string, corresponding to b and c of the correct data, respectively.",
        "Each of the following three cases is counted for the evaluation.",
        "SS (Segmentation Success): b'= b CS (Complete Success): b'= b and c'= c TS (Tolerative Success): b'= b and c' – c There are many kinds of notational fluctuation in Japanese.",
        "For example, the conjugational suffix of some kind of Japanese verb is not always necessitated, therefore,V)±(iM±I-f and are all acceptable results for input 59.Z uriage (sales).",
        "Besides, a single word has sometimes more than one Kanji notations, e.g. 5 hama (beach) and 31 hama (beach) are both acceptable, and so on.",
        "c' – c in the case of TS means that c' coincides with c completely or excepting the part which is hetero-morphic in the above sense.",
        "For this, each of our conversion system has a dictionary which contains approximately 35,000 fluctuated notations of conceptual words."
      ]
    },
    {
      "heading": "4.3 Results of Experiments",
      "text": [
        "Results of the experiments are given in Table 1 and Table 2 for input file fl and f2, respectively.",
        "Comparing the statistics of system A with D, we can conclude that the introduction of approximately 135,000 collocation data causes 8.1 % and 10.5 % raise of CS and TS rate, respectively, in case of relatively short input strings (fl).",
        "The raise of SS rate for fl is 2.7%.",
        "In case of the longer input strings (f2) whose average number of bunsetsus is approximately 12.6, the raise of CS, TS and SS rate is 2.4 %, 5.2 % and 5.7 %, respectively.",
        "As a consequence, the raise of CS, TS and SS rate is 6.2 %, 9.1 % and 3.8 % on the average, respectively."
      ]
    },
    {
      "heading": "4.4 Comparison with a Software on the Market",
      "text": [
        "We compared System D with a Kana-to-Kanji conversion software for PC on the market, WXG Ver2.05 wider the same condition except for the amount of installed collocation data For this system D was reinforced and renamed D', by equipping with WXG's 10,000 items of word dependency description Both systems were disabled for the learning function.",
        "WXG has approximately 60,000 collocations (3,000 uninterruptible and 57,000 interruptible collocations), whereas System D' has approximately 135,000 collocations.",
        "The statistical results are given in Table 3 and Table 4 for the corpus fl and f2, respectively.",
        "The tables show that the raise of CS, TS and SS rate, which was obtained by System D' is 2.5 %, 4.5 % and 3.9 % on the average, respectively.",
        "No further comparison with the commercial products has been done, since we judge the performance of WXG Ver.2.05 to be average among them."
      ]
    },
    {
      "heading": "4.5 Discussions",
      "text": [
        "Table 1 ^-• 4 show that the longer input the system is given, the more difficult for the system to make the correct solution and the difference between accuracy rate of WXG and system D' is less for f2 than for fl.",
        "Further investigation clarified that the error of System D is mainly caused by missing words or expressions in the machine dictionary.",
        "Specifically, it was clarified that the dictionary does not have the sufficient number of Kata-Kana words and people's names.",
        "In addition, the number of fluctuational variants installed in the dictionary mentioned in 42 turned out to be insufficient These problems should be remedied in future."
      ]
    },
    {
      "heading": "5. Concluding Remarks",
      "text": [
        "In this paper, the effectiveness of the large scale collocation data for the improvement of the conversion accuracy of Kana-to-Kanj conversion process used in Japanese word processors was clarified, by relatively large scale experiment.",
        "The extensive collection of the collocations has been carried out manually these ten years by the authors in order to realize not only high precision word processor but also more general Japanese language processing in future.",
        "A lot of resources, school textbooks newspapers novels journals dictionaries, etc.",
        "have been investigated by workers for the collection The candidates for the collocation have been judged one after another by them.",
        "Among collocations described in this paper, the idiomatic expressions are quite burdensome in the development of NLP, since they do not follow the principle of composi-tionality of the meaning Generally speaking, the more extensive collocational data it deals with, the less the \"rule system\" of the rule based NLP system is burdened This means the great importance of the enrichment of collocational data Whereas it is inevitable that the arbitrariness lies in the human judgment and selection of collocations, we believe that our collocation data is far more refined than the automatically extracted one from corpora which has been recently reported [Church, K W. eta], 1990, Ikehara, S. et al., 1996, etc.].",
        "We believe that the approach described here is important for the evolution ofNLP product in general as well"
      ]
    }
  ]
}
