{
  "info": {
    "authors": [
      "András Kornai"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E85-1001",
    "title": "Natural Languages and the Chomsky Hierarchy",
    "url": "https://aclweb.org/anthology/E85-1001",
    "year": 1985
  },
  "references": [
    "acl-J82-3001",
    "acl-P80-1028"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "The central claim of the paper is that NL stringeets are regular.",
        "Three independent arguments are offered in favor of this position: one based on parsimony considerations, one employing the McCullogh-Pitts (1943) model of neuruns, and a purely linguistic one.",
        "It Is possible to derive explicit upper bounds for the number of (live) states in XI acceptors: the results show that finite state NL parsers can be implemented on present-day computers.",
        "The position of NI stringsets within the regular family is also investigated: it is proved that NIB are counter-free, tut not locally testable.",
        "Q. jOroductioe The question whether the grammatical sentences of natural languages' form regular (Type 31• context tree (Type 2), context sensitive (Type I).",
        "or recursively enumerable (Type 0) mete has been subject to much discussion ever since it was posed by Chossky In his seminal 1956 paper.",
        "However, there seems to be little agreement among the linguists concerned with the 'geographic' position of natural languages (NLe): for instance Reich (1868) claims tits to be finite state (Type 2), white Matthews (1919) argues that they are not even recursively enumerable.",
        "Pullum and Getzdar ( 1982) have demonstrated that the standard llnauisIls arguments against the context freeness of natural languages are fallacious they did not consider, the aeIelleguistic argument offered by Matthews.",
        "In Section 1 of this paper I will briefly outline and challenge this argument, and in Section 2 I wilt argue In favor of Reich's position.",
        "The claim that N144 are Type 3 hiss several implications for linguistic (meta )theory: these will be discussed in Section 3.",
        "The paper presupposes some familiarity with the basic notions and notations of format language theory: when no specific reference is given, the reader will find a proof both in Salome.",
        "(1973) and Harrison (1978)"
      ]
    },
    {
      "heading": "1. EASJACek IIMMU1222 2A 22/2/1 112221A222",
      "text": [
        "Ihe-extangLueel vies of natural languages, i.e. the identification of ?Us with the set of thel r grammatical strings (sentences) is sometimes regarded an idea characteristic of generative linguistics.",
        "Since it was Chomaky (19E1:1E) who first made this view explicit, this is oat vitally unjust: yet it is quite clear that the same idea.",
        "was /implicit in much of the work of the structuralist period.• In fact.",
        "the 'discovery procedures' developed by the structuralists in order to arrive at • coincise description (g ) cf a NI.",
        "from a set of utterances (corpus) were without exception based on the assumption that native speakers of the language are capable of judging the g ticality of utterances presented to them.",
        "Although these procedures are, by and large, practical (empirical) and mechanical (algorithmic).",
        "their presentation already involved a certain t of idealization.",
        "For instance.",
        "it is obvious that native speakers themselves utter ungrammatical sentences from time to time, and it is also clear that they can understand (parse) sentences that are not strictly 'gramsatical'.",
        "Nevertheless, these methods work quite well in the actual practice of NI description, and the structuralist methodology has often teen compared to that of chemistry, physics, and other natural sciences.2 Matthews (1979) has canted doubts an the fundamental assumption of these procedures: be claims that native speakers are in tact amnia to judge the grammaticality of material presented to them.",
        "The relevant part of his argumentation is reproduced below: ------- 11 See e.g. Def 4 in Sloomfield 1926, or Sarnia 1 946 eh 1.0",
        "2) See e.g.--Carroll 1953, Levi-Strauss 1958 ch.",
        "2 \"Consider (1) and (2).",
        "If native speakers instantiate (1) the canoe floated down the river sank (2) the editor authors the newspaper hired liked laughed an effective procedure in their classification of sentences, then presumably the clavesifIcaton of (1) and (2) should not depend on their position in a list of test 'sentences that also includes sentences similar to (3) and (4).",
        "(3) the man (that was) thrown down the stairs died (4) the editor (whoa) the authors the newspaper hired liked laughed but in fact it does.",
        "(1) and (2) will typically be classified as ungrammatical if they precede sentences similar to (2) and (4), but grammatical if they follow them.",
        "Such cases are quite common.\" (p 212)",
        "Moreover, \"there is considerable empirical evidence to suggest that native speakers employ a battery of heuristic strategies when parsing and classifying sentences.",
        "Their reliance on such strategies does not preclude their having available to them an effective procedure for deciding membership in their language; however, in the &become* of empirical evidence for such a procedure, we are certainly not required to postulate its existence.\" (p 213) From this, Matthews concludes that Putnam (1961) was not justified in appealing to Church's thesis in order to show that NLs are recursive: for if native speakers have no effective procedure for deciding membership in the set of grammatical sentences, then there is no guarantee that such procedure exists.",
        "But is it really the case that the \"battery of heuristic procedures\" employed by native speakers falls outside the scope of Church's thesis?",
        "Nell confirmed natural laws3 are usually taken to be universally valid -- it is unclear why should Church's thesis be an exception to this, and Matthews offers no evidence to corroborate his views on this point.",
        "Putnam's original argument derives its strength from Church's thesis.",
        "If NIA are asa Type 0, then the heuristic strategies of native speakers wilt be instances of precisely that sort of procedures that Church's thesis predicts Alai to exist: on the one hand, they are 'intuitively effective', and on the otter hand, they are not Turing computable.",
        "The phenonenon observed by Matthews, nameLy that native speakers can be coaxed into accepting (or rejecting) sentences has little to do watt the recursiveness of the battery of heuristics they eeplcy: rather, it calls the extensional view of language in question.",
        "The problem le a sethodological one: if NLa are defined to be sets of grammatical sentences, how can one test potential elesecta for membership?",
        "This problem becomes particularly acute in borderline cases (such se (1-4) above), and for the linguist who wants to check the predictions oA his grammar it matters but little that such dubious sentences are (statistically) infrequent.",
        "The easiest way to solve this problem is to give up the assumption that srassaticality is a yes/no question: 'degrees of g ticalness• can he introduced (see e.g. Chossky 1961) and NLs can be treated as graded (or even fuzzy) sets.",
        "This approach, tewever, can col) be applied in the study cf idiolects (languages of individual speakers), because there is no way to arrive at a graded set that will reflect the sue cf Individual opinions in a reasonatly faithful manner.",
        "Suppose, for instance, that we have three speakers, 1, and Zip and each of thane classifies the sentences a, b, and c consistently (that is, if he prefers a to b and b to c, then he prefers a to c, etc.).",
        "Now, it for speaker X a>t>c, for Y t>c>a, and for Z c>e>t, then the majority prefers a to la, b to c, and c to a; in ether words, the 'general opinion' is inconsistent (non- transitive).",
        "The \"possibility theorem\" of Arrow (1950) sakes it clear that the example is typical: under very general cenditiens, there is simply no way to aggregate graded sets in much a manner that the (partial) orderings imposed by the individual gradations are pre d. Therefore, the 'degrees of &rennet/cal:less' approach must be relegated to the study of Idiolecte in any sass a. most linguists, however, reject it entirely (see Newmeyer 1980 ch.",
        "E.5.2, 5.7.1).",
        "Yes/no grassaticelity judgments, en the other hand, ahcw kably little variation from speaker to speaker in any given speech cossunity, and It is this IztrammthismAlyst IsigIalllitv (cf. Itkcnen 1E81) that justifies the empirical study of \"dialects* and-even 'languages'.",
        "But if Matthews is right, and native speakers are unable to \"classify any sentence over the vocabulary of their language consistently as either grammatical or ung t ical\" (p 211), then in-trasubjective testability 31 For independent sotivaton of Church's thesis, see e.g. ;oilers 1967: ch.",
        "1.7",
        "will be impossible to achieve.",
        "The question is: what makes the native speaker inconsistent?",
        "In Matthews' example, there can be little doubt that the cause of the inconsistency is the tent, sliactlas : the speaker's linguistic intuition is not the sane before and after reading sentences ( 3-4 ).",
        "This source of inconsistency can be eliminated fairly easily: if the sentences are presented in a random manner (preferably, with \"filler\" sentences among them), then no \"cues provided by the context of classification\" (p 213) will be present.",
        "Naturally, linguistically relevant experiments will have to control many other factors (see e.g. Greenbaum and Quirk 1970), but as we shalt see, there is no need to discuss these individually.",
        "Fro, the point of intrasubjective testability, it can be safely said that welt-designed experiments usually provide highly consistent date (even in the case of borderline sentences)♦ and the extensional view of Nis can be maintained on an empirical basis as well.",
        "The actual sets designated as NIe will, at least to a certain extent, depend on the choice of experimental technique, but any lisad experimental method can be thought of es an algorithm for deciding questions of membership with Its aid .2 s basso sasals.!",
        "Since the existing experimentel methods can be replaced by (interactive) computer programs, the question boils down to this: is a Turing machine with a human oracle more powerful than one with a Turing machine oracle?",
        "Ey Church's thesie• the answer is negative, and as Turing machines with recursive oracles are se more powerful than Turing machines without oracle (see e.g. Rogers 1967 ch.",
        "9.4), kis must be recursive.",
        "Notice, that this tine of reasoning is independent of the particular choice of experimental technique, or what is the same, of the precise definition of Itts.",
        "This is a consequence of the fact that the experimental methods used in empirical sciences (including linguistics) hardly merit this name unless they are welt-defined and 'mechanical' to such an extent that their alsorithsization poses no real problems.",
        "(For instance, the procedure outlined above does not make crucial reference to random sequences: the Irsndomizationl of test sentences can be carried out with the aid of pseudorandom sequences generated by Turing machine.)",
        "This is not to say that introspective evidence or intuition plays no role in linguistics (or in general, in the development of science) -- but questions 4) For the definition of oracles, see e.g. Rogers 1967 ch.",
        "9 concerning the position of natural languages in the Chossky hierarchy can hardly be meaningful unless we have some definition of NLs (i.e. some experimental method to teat membership) tc work with."
      ]
    },
    {
      "heading": "2. Ihs casulscita a/ Retnrei",
      "text": [
        "Finite state NI models were first developed by Rockett (MS).",
        "Although CimandLY- (1957 .ch 3.1) attempted to demonstrate the inadequacy of such models, several linguists= advocated their use, and the stretificational school of linguistics (Lamb 1966) persists in employing a. formalism which is, in essence, equivalent to finite automata (cf. Table 1 of Eorgida 1983).",
        "As Reich (1965) has pointed out, Chosaky's demonstration is based co the assumption that Nla are self-embedding Is le neklerary gegran.",
        "This means, that the sentences (1-2) and.",
        "(5-6) suet be equally grammatical: the boss editor authors the newspaper hired liked hates laughed the consitte boss editor authors the newspaper hired liked hates chairs agreed The experiments (Miller and Isard 1964, Marks 1968).",
        "h , do not support this conclusion: native speakers of .",
        "English react to (5-6) and (7-8) the same ways the boss editor authors the • newspaper hired liked hates Anughed cursed the secretary cossitie boss editor authors the newspaper hired liked hates chairsagreed Since (7-8) are ungrammatical in any 'Tammy of English.",
        "Chossky's original demonstration is tar iron convincing, and the question whether Nis are Type 2 is still open.",
        "In tact.",
        "the only way to show that Eta are not finite Is to exhibit some infinite sequence of grammatical",
        "sentences: fortunately, the pattern exespiilied in (1-6) is not necessary for this.",
        "Coordinated constructions as in 5) Especially the ones working with computers.",
        "See e.g. Marcus 1964, Church 1980 6 Chonsky (1S62) regards (5-6) grammatical.",
        "(•but unacceptable) and (7-8) ungrammatical: for the wethodalogical inclinations of this position see Greene (19/2).",
        "I have seen Tom T have seen Tom and Dick I have seen Tom, Dick and Barry can be as long as we wish: the grammaticality of such sentences is independent of the number of conjuncts.",
        "Similar (right- and left-recursive) patterns can be found in any NL, but all of these can be described by regular expressions.",
        "Therefore♦ if grammars do not have to account for iterated self-eabeddings, the principle of scientific parsimony will point to the Bilumal language family accomodating every possible finite NL corpus and their regular extensions.",
        "Prom this cerspective♦ the Type-3 family is more than sufficient: since it contains every finite language end is closed under-regular operations, it provides a gaaaaa us upper bound for the family of NI.e.",
        "A more direct argument can be based an the biological sake-up of the human brain: as individual neurons can be modelled by finite automata (McCulloch -Pitts 1943), and • finite three-dimensinnsl array of such automata can be substituted by one finite automaton (see risen.",
        "1956), NIA suet be regular.",
        "Although finite state models of NIs usually do not claim \"neurological reality^ (see ch 3.2 of Sullivan 1980), the above reasoning gives us an ussis pound on the complexity of finite autosata necessary to describe NLe: since the relevant part of the brain contains no more then 100 cells, and one cell has cca.",
        "102-103 states, non-deterministic automata with 10105 states will be sufficient.",
        "Since the neurological organization of the human brain is unlikely to parallel the actual organization of the (internalized) grammar of native speakers, it is not surprising that the application of linguistic methods gives a much sharper upper hound: as we shalt see, finite deterministic NL acceptors need not have more than 1016 states.",
        "This estimation can be derived from the investigation of the syntactic monoide defined by Nis.",
        "(For the definition of syntactic monoids, see McNaughton--Papert 1968, and for a systematic exposition, see ch 3.10 of Eilenberg 1974.)",
        "Elements of the syntactic sonoid correspond to the distributInsel clause of structuralist linguistics: two strings will belong An the same class if and only if they have the same distribution, i.e. 1ff they can be substituted for each other in any sentence of the language in question.",
        "The distributional classes formed by strings of length one will be the elements of the terminal alphabet; but It should be kept in mind that these function as preterminals inasmuch as each of them stands for a (not necessarily finite) class of elements.",
        "In a morpheme-based approach, terminals are called Dori:Inane clamant:A: these can be set up by the procedure outlined in eh 19 cf Ferris ( 1951).",
        "In a word-based approach, that is, if we take words to be tie ultimate syntactic consti tuents, the terminals will he called lexical (•sp)rateaorles: in either ease,' the number of terminals is clearly /init..",
        "There are nc sore than 20 lexical categories: and in any given NL there are less than 300 morpheme classes.",
        "Forever, fully formed words with different inflexional affixes sill belong to different distributional classes, and if we want to maintain the regularity ci laziest insertion.",
        "lexical entries (e.g. verbs or verb stems) with different sutcategorization frames will fall in different subclasses.",
        "Traditional accounts of lexical (sub)categorization also allow for overlapping classes (in cases of tosonimy).",
        "For the sake of simplicity, I will take the Boolean atoms of such systems as basic: this way, elemente like 'run' or 'divorce' sill be neither nouns nor verbs but will be listed under a separate category for 'noun-verbs'.",
        "But even if we take alt these factors into account, it can be safely meld that the number of morpheme classes does not exceed 103 and the muster of lexical subcategories does not exceed 1C• in any given NI..",
        "In other words, it is possible to setect• for any given NL a 'cord vocabulary' (or ■orpteme list) of 104 (103) elements in such a manner that every word (morpheme) not appearing in the list will be disteitutionally equivalent ic one already on It.",
        "This means that the rveber of states that can to reached in ens step from a given state of a finite state NI.",
        "acceptor cannot exceed 10• and conversely, any given state can to reached from at most 10• states in one step.",
        "The states •of finite automata are in one-to-ono correspondence with the classes of right-distribution: two strings cver the terminal vocabulary will take the (einimal.)",
        "automaton to the same state iff they can be substituted for each other in every right-side environment.",
        "As a special case, it should be mentioned that these strings that do not appear as Initial parts of grammatical sentences will give duly one state in the autosaton: these, therefore, can be disregarded.",
        "The remaining strings (i.e. the ones that can be finished grammatically) have a property",
        "peculiar to NLs: they can always be finished with AI most, lour words (or twelve morphemes).6 This means that the final state.",
        "of NI.",
        "acceptors can be reached from every live state in at most tour (twelve) steps.",
        "Therefore, the number of live states is at most 1016 (1036)."
      ]
    },
    {
      "heading": "2. Consequences",
      "text": [
        "It should be emphasized that the above estimation in still very generous: a systematic study of sentence endings is highly unlikely to reveal sore than 103 different patterns in any given NL, and the proper order of magnitude seems to be 104.",
        "If the automaton has to account for the morphology of the language as well, 106-107 states will be necessary -- this is, perhaps, outside the capabilities of present-day computers.",
        "In as, case, finite automata can be implemented on 2.22 theoretical (or actual) model of serial computation like Turing machines, random access machines, etc.",
        "to accept languages in linear time.",
        "Although native speakers understand grammatical sentences la real time, their performance as NL acceptor is somewhat hindered by the fact that the heuristuc algorithm they use is not adopted to ungrammatical strings: novelty they spend some (limited) time with deliberation, and sometimes they want to hear the input string a second .time.",
        "But even in this (worst) case recognition happens in linear time, and in this respect at least, finite automats constitute realistic models of native speakers.",
        "The importance of thin fact for linguistic metatheory should not be underestimated: those frameworks (like transformatonaL greaser, see Rounds 1915) that generate languages with exponential (polynomial) recognition complexity sake the prediction that there are problems which can be solved both by humans and Turing machines in a measured time, with humans showing en exponential (polynomial) gain over machines in the long run.",
        "For instance, Lexical Functional G (see Bresnan 1983) makes the claim that hums can solve certain NF-herd probles■ in linear time (cf. Berwick 1882), and this is not very Likely.",
        "On the other hand, those frameworks (like Generalised Phrase-Structure C , see Gazdar 1992) that generate only Languages of polynomial time complexity might have nose psychological",
        "8) This property is ea linear version of the Depth Hypothesis (Yngve 1961).",
        "9) For the sake of simplicity I have supposed that sentences in embedded position are freely interchangeable, i.e. that there is only one accepting state.",
        "reality; at\" leait there is nothing in present-day complexity theory that precludes the possibility of one implementation (e.g. multi-tape luring sachines, or, for that matter, the brain) gaining a small polynomial factor over another one (e.g. single-tape Turing such/nem).",
        "Another advantage of Type 3 NI models is that •they sake the problem cf language acquisition solvable, at least theoretics/1y.",
        "It Ls sell known that no algorithm can cecide whether a context-tree grammar generates a given context-free language: therefore, if every (infinite) context-free language is a possible XL, Church's thesis will make it impossible for the child to acquire one, tot even in case they have access to an oracle (may, the parents) that tells them whether a string belongs to the language cr not.",
        "Therefore, it is sometimes supposed that the primary linguistic data accessible during language acquisition contains not only strings, but the associated tree-structures as well.",
        "But if AlLs are regular, the problem is solvable without recourse tc thio rather strange assumption: given so upper bound on the number of-states in the canonical automaton generating the language, it le passible to reconstruct the automaton in a finite number of queries (Moore 1996).",
        "Since the number of queries is at least 1012 oven it the child has access to a 'representative sample' of 10• sentences that reaches every live state in the automaton lsee Angluin 1981)• and it is impossible to make sore that 106 queries is a Lllitlme.",
        "/Ms must form a proper subset of regular languages.",
        "In fact, there is reason to suppose that every NL will be flan – counting.",
        "Specifically, a string xy4z sill belong to scree NL-if and only if mysz is also in it.",
        "Ibis L obvious if y is a coordinate conjunct as certain languages differentiate hetweer singular, dual, trial, and plural, the number 4 cannot be reduced.",
        "If y is the repeated part of some left or right recursive construction (e.g. a shal -.clause), five copies will he just as grammatical as four copies were: the converse also seems to hold.",
        "If this characterisation al NLa is true, the traditional mode of /animas, description in 'tactical' terms is fully justified, because every non-counting language can be built up from the elements of the alphabet using only catenation and Boolean operations (licNaustton- Papert 1E11).",
        "Conversely, as the traditional ghoaotactic.",
        "•morphotactic, and syntactic descriptions of /Ms used only catenation, union, intersection, and sometimes coaplamentstion -(in the form of 'negative conditions'), the generative power of the rtes and Arregement sodet (see Hockett 1994) does not exceed that of counter-free",
        "automata.",
        "It is also possible to develop a lower bound for the family of NIs: the phenomenon of syntactic concord over unbounded domains (which I suppose to be present in every NL) sill guarantee that NLs cannot be locally testable.",
        "The following demonstration is based on a regular expression used by Pullum- Gazdar (1982): coordination (the outermost neon.",
        "*) has been added in order to create non-Initial and non final elements that have to agree with each other.",
        "(12) ((Which problem did your professor say ((she + you) thought)* was unsolvable) + (Which problems did your professor say ((she + you) thought)* were unsolvable))* Suppose, indirectly, that English is k-testable for some fixed k, and consider the following strings: (13) ((Which problem did your professor say (she thought you thought)k was unsolvable) (Which problems did your professor say (she thoght you thought)k were unsolvable))2 (14) ((Which problem did your professor say (she thought you themilbt)W were unsolvable) (Which problem did your professor say (she thoght you thought)k was unsolvable) (Which problems did your professor say (she thought you thought)k was unsolvable) (Which problems did your prof say (she thoght you thought)k were unsolvable)) Apart from the order of the conjuncts, the only difference between (13) and ( 14) is that in the tatter subject predicate number agreement is violated in the first and the third conjuncts.",
        "Therefore, (14) Is ungrammatical, but it has the setae aubwords of length k (and with the sane multiplicity) as the grammatical (1Z).",
        "This contradicts our hypothesis that English was k-testable.",
        "Hopefully, this special.",
        "position of NLs in the Chomsky hierarchy can be utilised in• streamlining the (oracle) algorithms modelling language acquisition, because such algorithms (if actually Implemented) would greatly simplify the descriptive work of the linguist, and, at least to a certain extent, would finally fulfill the structuralists' promise of discovery procedure."
      ]
    },
    {
      "heading": "ACTNOWLEDGEMENT",
      "text": [
        "I am grateful to Gerald Gazdar for his valuable criticisms of an earlier version of this article.",
        "The usual disclaimers"
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
