{
  "info": {
    "authors": [
      "Wade Shen",
      "Jennifer Williams",
      "Tamas Marius",
      "Elizabeth Salesky"
    ],
    "book": "Workshop on Predicting and Improving Text Readability for target reader populations",
    "id": "acl-W13-2904",
    "title": "A Language-Independent Approach to Automatic Text Difficulty Assessment for Second-Language Learners",
    "url": "https://aclweb.org/anthology/W13-2904",
    "year": 2013
  },
  "references": [
    "acl-C10-2032",
    "acl-J10-2002",
    "acl-P05-1065"
  ],
  "sections": [
    {
      "text": [
        "means that the margins for Pashto and Dari were set to be larger respective to English and Arabic.",
        "One reason why these margins were larger is because the features that we used had more discriminative power for English and Arabic.",
        "In fact, both MIRA and SVM performed worse on Pashto and Dari.",
        "Since the method described here makes use of",
        "for each language.",
        "linear classifiers that weigh word-usage and length features, it is possible to examine the weights that a classifier learns during training to see which features the algorithm deems most useful in discriminating between ILR levels.",
        "One way to do this is to use a multiclass classifier on our data for the categorical levels (e.g. 1, 1+, 2, etc.)",
        "and examine the weights that were generated for each class.",
        "MIRA is formulated to be a multiclass classifier so we examined its weights for the features.",
        "We chose MIRA instead of SVM, even though LIB-SVM supports multiclass classification, because we wanted to capture differences between levels which we could not do with one vs. all.",
        "We examined classifier weights of greatest magnitude to see which features were the most indicative and most contraindicative for that level.",
        "We report these two types of features for Level 3 and Level 4 in Tables 4 and 5, respectively.",
        "Level 3 documents can have some complex topics, such as politics and art, however it can be noted that some of the more abstract topics like love and hate are contraindicative of Level 3.",
        "On the other hand, we see that abstract topics are highly indicative Level 4 documents where topics such as philosophy, reli-gion, virtue, hypothesis, and theory are discussed.",
        "We also note that moral is highly contraindicative of Level 3 but is highly indicative of Level 4.7 Discussion and Future Work We have presented an approach to score documents based on their ILR level automatically using language-independent features.",
        "Measures of structural complexity like the length-based fea",
        "to investigate further measures that could improve this baseline, including features from automatic parsers or unsupervised morphology to measure syntactic complexity.",
        "Here we have shown that higher reading levels in English correspond more with abstract topics.",
        "In future work, we also want to capture some of the stylistic features of text, such as the complexity of dialogue exchanges.",
        "For both SVM and MIRA, the combination of length and word-usage features had the best impact on performance across languages.",
        "We found better performance on this task overall for SVM and we believe that MIRA was overfitting during training.",
        "For MIRA, this is likely due to an interaction between a small number of features and the stopping criterion (mean squared error = 0) that we used in training, which tends to overfit.",
        "We intend to investigate the stopping criterion in future work.",
        "Still, we have shown that MIRA can be useful in this task because it is an online algorithm, and it allows for incremental training and active learning.",
        "Our current approach can be quickly adapted for a new subset of languages because the features that we used here were language-independent.",
        "We plan to build a flexible architecture that enables language-specific feature extraction to be com",
        "bined with our method so that these techniques can be easily used for new languages.",
        "We will continuously improve this baseline using the approaches described in this paper.",
        "We found that these two algorithms along with these types of features performed pretty well on 4 different languages.",
        "It is surprising that these features would correlate across languages even though there are individual differences between each language.",
        "In future work, we are interested to look deeper into the nature of language-independence for this task.",
        "With respect to content, we are interested to find out if more word features are needed for some languages but not others.",
        "There could be diversity of vocabulary at higher ILR levels, which we could measure with entropy.",
        "Additionally, since the MIRA classifier that we are using is an on-line classifier with weight vector representation for each feature, we could examine the weights and measure the mutual information by ILR level above a certain threshold to find which features are the most predictive of an ILR level, for each language.",
        "Lastly, we have assumed that the ILR rating metric is approximately linear, and although we have used linear classifiers in this task, we are interested to learn if other transformations would give us a better sense of ILR level discrimination."
      ]
    }
  ]
}
