{
  "info": {
    "authors": [
      "Kevin Gimpel",
      "Noah A. Smith"
    ],
    "book": "EMNLP",
    "id": "acl-D09-1023",
    "title": "Feature-Rich Translation by Quasi-Synchronous Lattice Parsing",
    "url": "https://aclweb.org/anthology/D09-1023",
    "year": 2009
  },
  "references": [
    "acl-D07-1003",
    "acl-D08-1023",
    "acl-D08-1024",
    "acl-D09-1086",
    "acl-H05-1036",
    "acl-H05-1064",
    "acl-J00-1004",
    "acl-J03-1002",
    "acl-J93-2003",
    "acl-N03-1017",
    "acl-N07-1008",
    "acl-P01-1067",
    "acl-P02-1038",
    "acl-P03-1021",
    "acl-P04-1061",
    "acl-P05-1033",
    "acl-P05-1034",
    "acl-P05-1067",
    "acl-P06-1121",
    "acl-P07-2045",
    "acl-P08-1023",
    "acl-P08-1024",
    "acl-P08-1066",
    "acl-P92-1017",
    "acl-W05-0909",
    "acl-W06-1606",
    "acl-W08-0302"
  ],
  "sections": [
    {
      "text": [
        "Kevin Gimpel and Noah A. Smith",
        "Language Technologies Institute School of Computer Science Carnegie Mellon University Pittsburgh, PA 15213, USA",
        "We present a machine translation framework that can incorporate arbitrary features of both input and output sentences.",
        "The core of the approach is a novel decoder based on lattice parsing with quasi-synchronous grammar (Smith and Eisner, 2006), a syntactic formalism that does not require source and target trees to be isomorphic.",
        "Using generic approximate dynamic programming techniques, this decoder can handle \"non-local\" features.",
        "Similar approximate inference techniques support efficient parameter estimation with hidden variables.",
        "We use the decoder to conduct controlled experiments on a German-to-English translation task, to compare lexical phrase, syntax, and combined models, and to measure effects of various restrictions on non-isomorphism."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "We have seen rapid recent progress in machine translation through the use of rich features and the development of improved decoding algorithms, often based on grammatical formalisms.",
        "If we view MT as a machine learning problem, features and formalisms imply structural independence assumptions, which are in turn exploited by efficient inference algorithms, including decoders (Koehn et al., 2003; Yamada and Knight, 2001).",
        "Hence a tension is visible in the many recent research efforts aiming to decode with \"non-local\" features (Chiang, 2007; Huang and Chiang, 2007).",
        "Lopez (2009) recently argued for a separation between features/formalisms (and the independence assumptions they imply) from inference algorithms in MT; this separation is widely appreciated in machine learning.",
        "Here we take first steps toward such a \"universal\" decoder, making the following contributions:",
        "Arbitrary feature model (§2): We define a single, direct log-linear translation model (Papineni et al., 1997; Och and Ney, 2002) that encodes most popular MT features and can be used to encode any features on source and target sentences, dependency trees, and alignments.",
        "The trees are optional and can be easily removed, allowing simulation of \"string-to-tree,\" \"tree-to-string,\" \"tree-to-tree,\" and \"phrase-based\" models, among many others.",
        "We follow the widespread use of log-linear modeling for direct translation modeling; the novelty is in the use of richer feature sets than have been previously used in a single model.",
        "Decoding as QG parsing (§3-4): We present a novel decoder based on lattice parsing with quasi-synchronous grammar (QG; Smith and Eisner, 2006).",
        "Further, we exploit generic approximate inference techniques to incorporate arbitrary \"nonlocal\" features in the dynamic programming algorithm (Chiang, 2007; Gimpel and Smith, 2009).",
        "Parameter estimation (§5): We exploit similar approximate inference methods in regularized pseudolikelihood estimation (Besag, 1975) with hidden variables to discriminatively and efficiently train our model.",
        "Because we start with inference (the key subroutine in training), many other learning algorithms are possible.",
        "Experimental platform (§6): The flexibility of our model/decoder permits carefully controlled experiments.",
        "We compare lexical phrase and dependency syntax features, as well as a novel com-",
        "Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing, pages 219-228, Singapore, 6-7 August 2009.",
        "©2009 ACL and AFNLP",
        "Table 1 : Key notation.",
        "Feature factorings are elaborated in Tab.",
        "2.",
        "bination of the two.",
        "We quantify the effects of our approximate inference.",
        "We explore the effects of various ways of restricting syntactic non-isomorphism between source and target trees through the QG.",
        "We do not report state-of-the-art performance, but these experiments reveal interesting trends that will inform continued research."
      ]
    },
    {
      "heading": "2. Model",
      "text": [
        "(Table 1 explains notation.)",
        "Given a sentence s and its parse tree rs, we formulate the translation problem as finding the target sentence t* (along with its parse tree rt* and alignment a* to the source tree) such that",
        "In order to include overlapping features and permit hidden variables during training, we use a single globally-normalized conditional log-linear model.",
        "That is, p(t,Tt, a \\ s,ts) = where the g are arbitrary feature functions and the 6 are feature weights.",
        "If one or both parse trees or the word alignments are unavailable, they can be ignored or marginalized out as hidden variables.",
        "In a log-linear model over structured objects, the choice of feature functions g has a huge effect on the feasibility of inference, including decoding.",
        "Typically these feature functions are chosen to factor into local parts of the overall structure.",
        "We next define some key features used in current MT systems, explaining how they factor.",
        "We will use subscripts on g to denote different groups of features, which may depend on subsets of the structures t, Tt, a, s, and rs.",
        "When these features factor into parts, we will use / to denote the factored vectors, so that if x is an object that breaks into parts {xi}i, then g{x) = ^ f(xi).",
        "Classical lexical translation features depend on s and t and the alignment a between them.",
        "The simplest are word-to-word features, estimated as the conditional probabilities p(t \\ s) and p(s \\ t) for s G S and t G T. Phrase-to-phrase features generalize these, estimated as p(t' \\ s') and p{s' \\ t') where s (respectively, t) is a substring of s (t).",
        "A major difference between the phrase features used in this work and those used elsewhere is that we do not assume that phrases segment into disjoint parts of the source and target sentences (Koehn et al., 2003); they can overlap.",
        "Additionally, since phrase features can be any function of words and alignments, we permit features that consider phrase pairs in which a target word outside the target phrase aligns to a source word inside the source phrase, as well as phrase pairs with gaps (Chiang, 2005; Ittycheriah and Roukos, 2007).",
        "E,T",
        "source and target language vocabularies, respectively",
        "Trans : E u {null} 2T",
        "function mapping each source word to target words to which it may translate",
        "s = (s0)... ,s„) e En",
        "source language sentence (s0 is the null word)",
        "t = {t1,...,tm)eTm",
        "target language sentence, translation of s",
        "ts : {l,...,n} {0,...,n}",
        "dependency tree of s, where ts (i) is the index of the parent of s; (0 is the root, $)",
        "Tt : {1,... , rn} – > {0,... , m}",
        "dependency tree of t, where rt (i) is the index of the parent of U (0 is the root, $)",
        "a : {1,... ,m} 2{1'\"'n}",
        "alignments from words in t to words in s; 0 denotes alignment to null",
        "e",
        "parameters of the model",
        "lexical translation features (§2.1):",
        "word-to-word translation features for translating s as t",
        "f phr(Si)*fc)",
        "phrase-to-phrase translation features for translating s\\ as tek",
        "0(m(*)",
        "language model features (§2.2):",
        "/ Jv(*j'-jv+l)",
        "iV-gram probabilities",
        "target syntactic features (§2.3):",
        "fatt(t,3,t',k)",
        "syntactic features for attaching target word t' at position k to target word t at position j",
        "syntactic valence features with word t at position j having children I Ç {1,..., rn}",
        "greor(s,Ts,a,t,Tt)",
        "reordering features (§2.4):",
        "distortion features for a source word at position i aligned to a target word at position j",
        "gtree^(Ts,a,Tt)",
        "tree-to-tree syntactic features (§3):",
        "configuration features for source pair SiAv being aligned to target pair tj/tk",
        "9cov(a)",
        "coverage features (§4.2)",
        "fScov(a)> /zth(a).",
        "fSunc(a)",
        "counters for \"covering\" each s word each time, the zth time, and leaving it \"uncovered\"",
        "Lexical translation features factor as in Eq.",
        "3 (Tab.",
        "2).",
        "We score all phrase pairs in a sentence pair that pair a target phrase with the smallest source phrase that contains all of the alignments in the target phrase; if Ufc i<fc<j a(^) = no phrase feature fires for t\\.",
        "A-gram language models have become standard in machine translation systems.",
        "For bigrams and trigrams (used in this paper), the factoring is in Eq.",
        "4 (Tab.",
        "2).",
        "There have been many features proposed that consider source-and target-language syntax during translation.",
        "Syntax-based MT systems often use features on grammar rules, frequently maximum likelihood estimates of conditional probabilities in a probabilistic grammar, but other syntactic features are possible.",
        "For example, Quirk et al.",
        "(2005) use features involving phrases and source-side dependency trees and Mi et al.",
        "(2008) use features from a forest of parses of the source sentence.",
        "There is also substantial work in the use of target-side syntax (Galley et al., 2006; Marcu et al., 2006; Shen et al., 2008).",
        "In addition, researchers have recently added syntactic features to phrase-based and hierarchical phrase-based models (Gimpel and Smith, 2008; Haque et al., 2009; Chiang et al., 2008).",
        "In this work, we focus on syntactic features of target-side dependency trees, rt, along with the words t. These include attachment features that relate a word to its syntactic parent, and valence features.",
        "They factor as in Eq.",
        "5 (Tab.",
        "2).",
        "Features that consider only target-side syntax and words without considering s can be seen as \"syntactic language model\" features (Shen et al., 2008).",
        "Segmentation might be modeled as a hidden variable in future work.",
        "Table 2: Factoring of global feature collections g into /.",
        "x\\ denotes (xi,...Xj) in sequence x = {xi,...}.",
        "first = mirifc:i<fc<j (min(a(fc))) and last(i,j) = maxfcKKj (max(a(fc))).",
        "Reordering features take many forms in MT.",
        "In phrase-based systems, reordering is accomplished both within phrase pairs (local reordering) as well as through distance-based distortion models (Koehn et al., 2003) and lexicalized reordering models (Koehn et al., 2007).",
        "In syntax-based systems, reordering is typically parameterized by grammar rules.",
        "For generality we permit these features to \"see\" all structures and denote them greor(s, Ts,a,t,Tt).",
        "Eq.",
        "6 (Tab.",
        "2) shows a factoring of reordering features based on absolute positions of aligned words.",
        "We turn next to the \"backbone\" model for our decoder; the formalism and the properties of its decoding algorithm will inspire two additional sets of features."
      ]
    },
    {
      "heading": "3. Quasi-Synchronous Grammars",
      "text": [
        "A quasi-synchronous dependency grammar (QDG; Smith and Eisner, 2006) specifies a conditional model p(t,Tt,a | s,rs).",
        "Given a source sentence s and its parse rs, a QDG induces a probabilistic monolingual dependency grammar over sentences \"inspired\" by the source sentence and tree.",
        "We denote this grammar by GS)Ts ; its (weighted) language is the set of translations of s. Each word generated by GS)Ts is annotated with a \"sense,\" which consists of zero or more words from s. The senses imply an alignment (a) between words in t and words in s, or equivalently, between nodes in rt and nodes in rs.",
        "In principle, any portion of rt may align to any portion of rs, but in practice we often make restrictions on the alignments to simplify computation.",
        "Smith and Eisner, for example, restricted \\a(j) \\ for all words",
        "tj to be at most one, so that each target word aligned to at most one source word, which we also do here.",
        "Which translations are possible depends heavily on the configurations that the QDG permits.",
        "Formally, for a parent-child pair (tTt(j),tj) in rt, we consider the relationship between a(rt(j)) and a(j), the source-side words to which tTt^ and tj align.",
        "If, for example, we require that, for all j, o(rt(i)) = Ts(aU)) or a(j) = 0, and that the root of rt must align to the root of rsor to NULL, then strict isomorphism must hold between rs and rt, and we have implemented a synchronous CF dependency grammar (Alshawi et al., 2000; Ding and Palmer, 2005).",
        "Smith and Eisner (2006) grouped all possible configurations into eight classes and explored the effects of permitting different sets of classes in word alignment.",
        "(\"a(rt(j)) = rs(a(j))\" corresponds to their \"parent-child\" configuration; see Fig. 3 in Smith and Eisner (2006) for illustrations of the rest.)",
        "More generally, we can define features on tree pairs that factor into these local configurations, as shown in Eq.",
        "7 (Tab.",
        "2).",
        "Note that the QDG instantiates the model in Eq.",
        "2.",
        "Of the features discussed in §2, flex, fatt, fval, and fdist can be easily incorporated into the QDG as described while respecting the independence assumptions implied by the configuration features.",
        "The others {fphr> f2> and fs) are nonlocal, or involve parts of the structure that, from the QDG's perspective, are conditionally independent given intervening material.",
        "Note that \"non-locality\" is relative to a choice of formalism; in §2 we did not commit to any formalism, so it is only now that we can describe phrase and A-gram features as non-local.",
        "Non-local features will present a challenge for decoding and training (§4.3)."
      ]
    },
    {
      "heading": "4. Decoding",
      "text": [
        "Given a sentence s and its parse rs, at decoding time we seek the target sentence t*, the target tree rt*, and the alignments a* that are most probable, as defined in Eq.",
        "I.",
        "(In §5 we will consider k-best and all-translations variations on this problern.)",
        "As usual, the normalization constant is not required for decoding; it suffices to solve:",
        "For a QDG model, the decoding problem has not been addressed before.",
        "It equates to finding the most probable derivation under the s/rs-specific grammar G8>Ts.",
        "We solve this by lattice parsing, assuming that an upper bound on m (the length of t) is known.",
        "The advantage offered by this approach (like most other grammar-based translation approaches) is that decoding becomes dynamic programming (DP), a technique that is both widely understood in NLP and for which practical, efficient, generic techniques exist.",
        "A major advantage of DP is that, with small modifications, summing over structures is also possible with \"inside\" DP algorithms.",
        "We will exploit this in training (§5).",
        "Efficient summing opens up many possibilities for training 6, such as likelihood and pseudo-likelihood, and provides principled ways to handle hidden variables during learning.",
        "We decode by performing lattice parsing on a lattice encoding the set of possible translations.",
        "The lattice is a weighted \"sausage\" lattice that permits sentences up to some maximum length I; I is derived from the source sentence length.",
        "Let the states be numbered 0 to t, states from [p£\\ to I are final states (for some p G (0,1)).",
        "For every position between consecutive states j – 1 and j (0 < j < £), and for every word Si in s, and for every word t G Trans(sj), we instantiate an arc annotated with t and i.",
        "The weight of such an arc is exp{öT/}, where / is the sum of feature functions that fire when Si translates as t in target position j (e.g., flex{si,t) and fdist(i,j)).",
        "Given the lattice and G8>Ts, lattice parsing is a straightforward generalization of standard context-free dependency parsing DP algorithms (Eisner, 1997).",
        "This decoder accounts for flex,",
        "faw fvau fdist' and fq9 as local features.",
        "Figure 1 gives an example, showing a German sentence and dependency tree from an automatic parser, an English reference, and a lattice representing possible translations.",
        "In each bundle, the arcs are listed in decreasing order according to weight and for clarity only the first five are shown.",
        "The output of the decoder consists of lattice arcs Source: $ konnten sie es übersetzen ?",
        "Reference: could you translate it ?",
        "Figure 1 : Decoding as lattice parsing, with the highest-scoring translation denoted by black lattice arcs (others are grayed out) and thicker blue arcs forming a dependency tree over them.",
        "selected at each position and a dependency tree over them.",
        "Most MT decoders enforce a notion of \"coverage\" of the source sentence during translation: all parts of s should be aligned to some part of t (alignment to null incurs an explicit cost).",
        "Phrase-based systems such as Moses (Koehn et al., 2007) explicitly search for the highest-scoring string in which all source words are translated.",
        "Systems based on synchronous grammars proceed by parsing the source sentence with the synchronous grammar, ensuring that every phrase and word has an analogue in Tt (or a deliberate choice is made by the decoder to translate it to null).",
        "In such systems, we do not need to use features to implement source-side coverage, as it is assumed as a hard constraint always respected by the decoder.",
        "Our QDG decoder has no way to enforce coverage; it does not track any kind of state in rsapart from a single recently aligned word.",
        "This is a problem with other direct translation models, such as IBM model 1 used as a direct model rather than a channel model (Brown et al., 1993).",
        "This sacrifice is the result of our choice to use a conditional model (§2).",
        "The solution is to introduce a set of coverage features gcov(a).",
        "Here, these include:",
        "• A counter for the number of times each source word is covered: fscov(a) = YZ=i",
        "• Features that fire once when a source word is",
        "covered the zth time (z e {2,3,4}) and fire again all subsequent times it is covered; these are denoted /2nd, /3rd, and /4th.",
        "• A counter of uncovered source words: /s„„c(a) = E?=i^(|a-WI,0).",
        "Of these, only fscov is local.",
        "The lattice QDG parsing decoder incorporates many of the features we have discussed, but not all of them.",
        "Phrase lexicon features f vhT, language model features fN for N > 1, and most coverage features are non-local with respect to our QDG.",
        "Recently Chiang (2007) introduced \"cube pruning\" as an approximate decoding method that extends a DP decoder with the ability to incorporate features that break the Markovian independence assumptions DP exploits.",
        "Techniques like cube pruning can be used to include the non-local features in our decoder."
      ]
    },
    {
      "heading": "5. Training",
      "text": [
        "Training requires us to learn values for the parameters 6 in Eq.",
        "2.",
        "Given T training examples of the form (t^T^sW,^), for % = 1,...,T, maximum likelihood estimation for this model consists of solving Eq.",
        "9 (Tab.",
        "3).",
        "Note that the",
        "Table 3: Eq.",
        "9: Log-likelihood.",
        "Eq.",
        "10: Pseudolikelihood.",
        "In both cases we maximize w.r.t.",
        "9.",
        "Eqs.",
        "11-13: Recursive DP equations for summing over t and a.",
        "alignments are treated as a hidden variable to be marginalized out.",
        "Optimization problems of this form are by now widely known in NLP (Koo and Collins, 2005), and have recently been used for machine translation as well (Blunsom et al., 2008).",
        "Such problems are typically solved using variations of gradient ascent; in our experiments, we will use an online method called stochastic gradient ascent (SGA).",
        "This requires us to calculate the function's gradient (vector of first derivatives) with respect to 6.n",
        "Computing the numerator in Eq.",
        "9 involves summing over all possible alignments; with QDG and a hard bound of 1 on \\a(j)\\ for all j, a fast \"inside\" DP solution is known (Smith and Eisner, 2006; Wang et al., 2007).",
        "It runs in 0(mn) time and 0{mn) space.",
        "Computing the denominator in Eq.",
        "9 requires summing over all word sequences and dependency trees for the target language sentence and all word alignments between the sentences.",
        "With a maximum length imposed, this is tractable using the \"inside\" version of the maximizing DP algorithm of Sec. 4, but it is prohibitively expensive.",
        "We therefore optimize pseudo-likelihood instead, making the following approximation (Be-",
        "Alignments could be supplied by automatic word alignment algorithms.",
        "We chose to leave them hidden so that we could make the best use of our parsed training data when configuration constraints are imposed, since it is not always possible to reconcile automatic word alignments with automatic parses.",
        "nWhen the function's value is computed by \"inside\" DP, the corresponding \"outside\" algorithm can be used to obtain the gradient.",
        "Because outside algorithms can be automatically derived from inside ones, we discuss only inside algorithms in this paper; see Eisner et al.",
        "(2005).",
        "Plugging this into Eq.",
        "9, we arrive at Eq.",
        "10 (Tab.",
        "3).",
        "The two parenthesized terms in Eq.",
        "10 each have their own numerators and denominators (not shown).",
        "The numerators are identical to each other and to that in Eq.",
        "9.",
        "The denominators are much more manageable than in Eq.",
        "9, never requiring summation over more than two structures at a time.",
        "We must sum over target word sequences and word alignments (with fixed rt), and separately over target trees and word alignments (with fixed t).",
        "The summation over target word sequences and alignments given fixed rt bears a resemblance to the inside algorithm, except that the tree structure is fixed (Pereira and Schabes, 1992).",
        "Let S(j, i, t) denote the sum of all translations rooted at position j in Tt such that a(j) = i and tj = t.",
        "Tab.",
        "3 gives the equations for this DP: Eq.",
        "11 is the quantity of interest, Eq.",
        "12 is the recursion, and Eq.",
        "13 shows the base cases for leaves of rt.",
        "Letting q = maxo<i<„ |Trans(sj)|, this algorithm runs in 0(mnq) time and 0{mnq) space.",
        "For efficiency we place a hard upper bound on q during training (details in §6).",
        "For the summation over dependency trees and alignments given fixed t, required for p(rt | t,s,Ts), we perform \"inside\" lattice parsing with Gs,ts- The technique is the summing variant of the decoding method in §4, except for each state j, the sausage lattice only includes arcs from j – 1 to j that are labeled with the known target word tj.",
        "If a is the number of arcs in the lattice, which is 0{mn), this algorithm runs in (9(a) time and requires (9(a) space.",
        "Because we use a hard upper bound on |Trans(s) | for all seE, this summation is much faster in practice than the one over words and alignments.",
        "So far, all of our algorithms have exploited DP, disallowing any non-local features (e.g., f vhT, f ^ for N > 1, fzth, fsunc).",
        "We recently proposed \"cube summing,\" an approximate technique that permits the use of non-local features for inside DP algorithms (Gimpel and Smith, 2009).",
        "Cube summing is based on a slightly less greedy variation of cube pruning (Chiang, 2007) that maintains fc-best lists of derivations for each DP chart item.",
        "Cube summing augments the fc-best list with a residual term that sums over remaining structures not in the fc-best list, albeit without their non-local features.",
        "Using the machinery of cube summing, it is straightforward to include the desired non-local features in the summations required for pseudo-likelihood, as well as to compute their approximate gradients.",
        "Our approach permits an alternative to minimum error-rate training (MERT; Och, 2003); it is discriminative but handles latent structure and regularization in more principled ways.",
        "The pseudo-likelihood calculations for a sentence pair, taken together, are faster than (A;-best) decoding, making SGA's inner loop faster than MERT's inner loop."
      ]
    },
    {
      "heading": "6. Experiments",
      "text": [
        "Our decoding framework allows us to perform many experiments with the same feature representation and inference algorithms, including combining and comparing phrase-based and syntax-based features and examining how isomorphism constraints of synchronous formalisms affect translation output.",
        "We use the German-English portion of the Basic Travel Expression Corpus (BTEC).",
        "The corpus has approximately 100K sentence pairs.",
        "We filter sentences of length more than 15 words, which only removes 6% of the data.",
        "We end up with a training set of 82,299 sentences, a development set of 934 sentences, and a test set of 500 sentences.",
        "We evaluate translation output using case-insensitive BLEU (Papineni et al., 2001), as provided by NIST, and METEOR (Banerjee and Lavie, 2005), version 0.6, with Porter stemming and WordNet synonym matching.",
        "Our base system uses features as discussed in §2.",
        "To obtain lexical translation features 9tmns(s> a> *)> we use the Moses pipeline (Koehn et al., 2007).",
        "We perform word alignment using GIZA++ (Och and Ney, 2003), symmetrize the alignments using the \"grow-diag-final-and\" heuristic, and extract phrases up to length 3.",
        "We define flex by the lexical probabilities p{t \\ s) and p{s I t) estimated from the symmetrized alignments.",
        "After discarding phrase pairs with only one target-side word (since we only allow a target word to align to at most one source word), we define fphr by 8 features: {2,3} target words x phrase conditional and \"lexical smoothing\" probabilities x two conditional directions.",
        "Bigram and trigam language model features, f2and /3, are estimated using the SRI toolkit (Stol-cke, 2002) with modified Kneser-Ney smoothing (Chen and Goodman, 1998).",
        "For our target-language syntactic features gsyn, we use features similar to lexicalized CFG events (Collins, 1999), specifically following the dependency model of Klein and Manning (2004).",
        "These include probabilities associated with individual attachments (fatt) and child-generation valence probabilities (fvai).",
        "These probabilities are estimated on the training corpus parsed using the Stanford factored parser (Klein and Manning, 2003).",
        "The same probabilities are also included using 50 hard word classes derived from the parallel corpus using the GIZA++ mkcls utility (Och and Ney, 2003).",
        "In total, there are 7 lexical and 7 word-class syntax features.",
        "For reordering, we use a single absolute distor-tionfeature fdistihj) that returns \\i – j\\ whenever a(j) = i and i, j > 0.",
        "(Unlike the other feature functions, which returned probabilities, this feature function returns a nonnegative integer.)",
        "The tree-to-tree syntactic features gtree2 in our model are binary features f qg that fire for particular QG configurations.",
        "We use one feature for each of the configurations in (Smith and Eisner, 2006), adding 7 additional features that score configurations involving root words and NULL-alignments more finely.",
        "There are 14 features in this category.",
        "Coverage features gcov are as described in §4.2.",
        "In all, 46 feature weights are learned.",
        "Our model permits training the system on the full set of parallel data, but we instead use the parallel data to estimate feature functions and learn 6 on the development set.",
        "We trained using three iterations of SGA over the development data with a batch size of 1 and a fixed step size of 0.01.",
        "We used £2 regularization with a fixed, untuned coefficient of 0.1.",
        "Cube summing used a 10-best list for training and a 7-best list for decoding unless otherwise specified.",
        "To obtain the translation lexicon (Trans) we first included the top three target words t for each s using p(s I t) x p(t I s) to score target words.",
        "For any training sentence (s,t) and tj for which tj £ UiLi Trans(si), we added tj to Trans(sj) for i = argmaxi/e/p(si/|tj) x p(tj\\si>), where I = {i : 0 < i < tîA |Trans(s;)| < We used qo = 10 and g>o = 5, restricting |Trans(NULL)| < 10 and |Trans(s)| < 5 for any s G S. This made 191 of the development sentences unreachable by the model, leaving 743 sentences for learning 6.",
        "During decoding, we generated lattices with all t G Trans(si) for 0 < i < n, for every position.",
        "We used p = 0.9, causing states within 90% of the source sentence length to be final states.",
        "Between each pair of consecutive states, we pruned edges that fell outside a beam of 70% of the sum of edge weights (see §4.1; edge weights use flex, fdist, and fscov) of all edges between those two states.",
        "Our first set of experiments compares feature sets commonly used in phrase-and syntax-based translation.",
        "In particular, we compare the effects of combining phrase features and syntactic features.",
        "The base model contains fiex, g\\m, <7reor, and",
        "gcov.",
        "The results are shown in Table 4.",
        "The second row contains scores when adding in the eight fphr features.",
        "The second column shows scores when adding the 14 target syntax features ( fattand fvai), and the third column adds to them the 14 additional tree-to-tree features (fqg).",
        "We find large gains in BLEU by adding more features, and find that gains obtained through phrase features and syntactic features are partially additive, suggesting that these feature sets are making complementary contributions to translation quality.",
        "For models without syntactic features, we constrained the decoder to produce dependency trees in which every word's parent is immediately to its right and ignored syntactic features while scoring structures.",
        "This causes decoding to proceed left-to-right in the lattice, the way phrase-based decoders operate.",
        "Since these models do not search over trees, they are substantially faster during decoding than those that use syntactic features and do not require any pruning of the lattice.",
        "Therefore, we explored varying the value of k used during A;-best cube decoding; results are shown in Fig. 2.",
        "Scores improve when we increase k up to 10, but not much beyond, and there is still a substantial gap (2.5 BLEU) between using phrase features with k = 20 and using all features with k = 5.",
        "Models without syntax perform poorly when using a very small k, due to their reliance on non-local language model and phrase features.",
        "By contrast, models with syntactic features, which are local in our decoder, perform relatively well even with k = 1.",
        "We next compare different constraints on isomorphism between the source and target dependency"
      ]
    },
    {
      "heading": "4. Phrase + Syntactic",
      "text": [
        " – ■ Neither Value of k for Decoding",
        "Phrase",
        "Syntactic Features:",
        "features:",
        "~tf att U f val",
        "+ f",
        "l J qg",
        "(base) (target)",
        "(tree-to-tree)",
        "(base)",
        "0.3727 0.4458",
        "0.4424",
        "f phr",
        "0.4682 0.4971",
        "0.5142",
        "Table 5: QG configuration comparison.",
        "The name of each configuration, following Smith and Eisner (2006), refers to the relationship between a(rt(j)) and a(j) in ts.",
        "trees.",
        "To do this, we impose harsh penalties on some QDG configurations (§3) by fixing their feature weights to – 1000.",
        "Hence they are permitted only when absolutely necessary in training and rarely in decoding.",
        "Each model uses all phrase and syntactic features; they differ only in the sets of configurations which have fixed negative weights.",
        "Tab.",
        "5 shows experimental results.",
        "The base \"synchronous\" model permits parent-child (a(rt(j)) = rs(a(j))), any configuration where a(j) = 0, including both words being linked to NULL, and requires the root word in rt to be linked to the root word in rs or to NULL(5 of our 14 configurations).",
        "The second row allows any configuration involving NULL, including those where tj aligns to a non-NULL word in s and its parent aligns to NULL, and allows the root in rt to be linked to any word in rs.",
        "Each subsequent row adds additional configurations (i.e., trains its 6 rather than fixing it to – 1000).",
        "In general, we see large improvements as we permit more configurations, and the largest jump occurs when we add the \"sibling\" configuration (Ts(a(rt(j))) = rs(a(j))).",
        "The BLEU score does not increase, however, when we permit all configurations in the final row of the table, and the METEOR score increases only slightly.",
        "While allowing certain categories of non-isomorphism clearly seems helpful, permitting arbitrary violations does not appear to be necessary for this dataset.",
        "We note that these results are not state-of-the-art on this dataset (on this task, Moses/MERT achieves 0.6838 BLEU and 0.8523 METEOR with maximum phrase length 3).",
        "Our aim has been to illustrate how a single model can provide a controlled experimental framework for comparisons of features, of inference methods, and of constraints.",
        "Our findings show that phrase features and dependency syntax produce complementary improvements to translation quality, that tree-to-tree configurations (a new feature in MT) are helpful for translation, and that substantial gains can be obtained by permitting certain types of non-isomorphism.",
        "We have validated cube summing and decoding as practical methods for approximate inference.",
        "Our framework permits exploration of alternative objectives, alternative approximate inference techniques, additional hidden variables (e.g., Moses' phrase segmentation variable), and, of course, additional feature representations.",
        "The system is publicly available at www.ark.es.",
        "emu.",
        "edu/Quipu."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "We presented feature-rich MT using a principled probabilistic framework that separates features from inference.",
        "Our novel decoder is based on efficient DP-based QG lattice parsing extended to handle \"non-local\" features using generic techniques that also support efficient parameter estimation.",
        "Controlled experiments permitted with this system show interesting trends in the use of syntactic features and constraints."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We thank three anonymous EMNLP reviewers, David Smith, and Stephan Vogel for helpful comments and feedback that improved this paper.",
        "This research was supported by NSF IIS-0836431 and IIS-0844507, a grant from Google, and computational resources provided by Yahoo.",
        "QDG Configurations",
        "BLEU",
        "METEOR",
        "synchronous",
        "0.4008",
        "0.6949",
        "+ nulls, root-any",
        "0.4108",
        "0.6931",
        "+ child-parent, same node",
        "0.4337",
        "0.6815",
        "+ sibling",
        "0.4881",
        "0.7216",
        "+ grandparent/child",
        "0.5015",
        "0.7365",
        "+ c-command",
        "0.5156",
        "0.7441",
        "+ other",
        "0.5142",
        "0.7472"
      ]
    }
  ]
}
