{
  "info": {
    "authors": [
      "Tim Van de Cruys"
    ],
    "book": "Proceedings of the Workshop on Geometrical Models of Natural Language Semantics",
    "id": "acl-W09-0211",
    "title": "A Non-negative Tensor Factorization Model for Selectional Preference Induction",
    "url": "https://aclweb.org/anthology/W09-0211",
    "year": 2009
  },
  "references": [
    "acl-D07-1017",
    "acl-J90-1003",
    "acl-P07-1028",
    "acl-P93-1024",
    "acl-P99-1014"
  ],
  "sections": [
    {
      "text": [
        "Distributional similarity methods have proven to be a valuable tool for the induction of semantic similarity.",
        "Up till now, most algorithms use two-way cooccurrence data to compute the meaning of words.",
        "Co-occurrence frequencies, however, need not be pairwise.",
        "One can easily imagine situations where it is desirable to investigate co-occurrence frequencies of three modes and beyond.",
        "This paper will investigate a tensor factorization method called non-negative tensor factorization to build a model of three-way cooccurrences.",
        "The approach is applied to the problem of selectional preference induction, and automatically evaluated in a pseudo-disambiguation task.",
        "The results show that non-negative tensor factorization is a promising tool for NLP."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Distributional similarity methods have proven to be a valuable tool for the induction of semantic similarity.",
        "The aggregate of a word's contexts generally provides enough information to compute its meaning, viz. its semantic similarity or relatedness to other words.",
        "Up till now, most algorithms use two-way cooccurrence data to compute the meaning of words.",
        "A word's meaning might for example be computed by looking at:",
        "The extracted data - representing the cooccurrence frequencies of two different entities - is encoded in a matrix.",
        "Co-occurrence frequencies, however, need not be pairwise.",
        "One can easily imagine situations where it is desirable to investigate co-occurrence frequencies of three modes and beyond.",
        "In an information retrieval context, one such situation might be the investigation of words x documents x authors.",
        "In an NLP context, one might want to investigate words x dependency relations x bag of word context words, or verbs x subjects x direct objects.",
        "Note that it is not possible to investigate the three-way co-occurrences in a matrix representation form.",
        "It is possible to capture the cooccurrence frequencies of a verb with its subjects and its direct objects, but one cannot capture the co-occurrence frequencies of the verb appearing with the subject and the direct object at the same time.",
        "When the actual three-way cooccurrence data is 'matricized', valuable information is thrown-away.",
        "To be able to capture the mutual dependencies among the three modes, we will make use of a generalized tensor representation.",
        "Two-way co-occurrence models (such as latent semantic analysis) have often been augmented with some form of dimensionality reduction in order to counter noise and overcome data sparseness.",
        "We will also make use of a dimensionality reduction algorithm appropriate for tensor representations."
      ]
    },
    {
      "heading": "2. Previous Work",
      "text": [
        "• the various documents that the word appears in (words x documents);",
        "• a bag of words context window around the word (words x context words);",
        "• the dependency relations that the word appears with (words x dependency relations).",
        "Selectional preferences have been a popular research subject in the NLP community.",
        "One of the first to automatically induce selectional preferences from corpora was Resnik (1996).",
        "Resnik generalizes among nouns by using WordNet noun synsets as clusters.",
        "He then calculates the selectional preference strength of a specific verb in a particular relation by computing the Kullback-Leibler divergence between the cluster distribution of the verb and the aggregate cluster distribution.",
        "The selectional association is then the contribution of the cluster to the verb's preference strength.",
        "The model's generalization relies entirely on WordNet; there is no generalization among the verbs.",
        "The research in this paper is related to previous work on clustering.",
        "Pereira et al.",
        "(1993) use an information-theoretic based clustering approach, clustering nouns according to their distribution as direct objects among verbs.",
        "Their model is a onesided clustering model: only the direct objects are clustered, there is no clustering among the verbs.",
        "Rooth et al.",
        "(1999) use an em-based clustering technique to induce a clustering based on the co-occurrence frequencies of verbs with their subjects and direct objects.",
        "As opposed to the method of Pereira et al.",
        "(1993), their model is two-sided: the verbs as well as the subjects/direct objects are clustered.",
        "We will use a similar model for evaluation purposes.",
        "Recent approaches using distributional similarity methods for the induction of selectional preferences are the ones by Erk (2007), Bhagat et al.",
        "(2007) and Basili et al.",
        "(2007).",
        "This research differs from the approaches mentioned above by its use of multi-way data: where the approaches above limit themselves to two-way co-occurrences, this research will focus on cooccurrences for multi-way data.",
        "One of the best known factorization algorithms is principal component analysis (pca, Pearson (1901)).",
        "pca transforms the data into a new coordinate system, yielding the best possible fit in a least square sense given a limited number of dimensions.",
        "Singular value decomposition (svd) is the generalization of the eigenvalue decomposition used in pca (Wall et al., 2003).",
        "In information retrieval, singular value decomposition has been applied in latent semantic analysis (lsa, Landauer and Dumais (1997), Landauer et al.",
        "(1998)).",
        "In lsa, a term-document matrix is created, containing the frequency of each word in a specific document.",
        "This matrix is then decomposed into three other matrices with svd.",
        "The most important dimensions that come out of the svd allegedly represent 'latent semantic dimensions', according to which nouns and documents can be represented more efficiently.",
        "lsa has been criticized for a number of reasons, one of them being the fact that the factorization contains negative numbers.",
        "It is not clear what negativity on a semantic scale should designate.",
        "Subsequent methods such as probabilistic latent semantic analysis (plsa, Hofmann (1999)) and non-negative matrix factorization (nmf, Lee and Seung (2000)) remedy these problems, and indeed get much more clear-cut semantic dimensions.",
        "To be able to cope with three-way data, several algorithms have been developed as multilinear generalizations of the svd.",
        "In statistics, three-way component analysis has been extensively investigated (for an overview, see Kiers and van Mechelen (2001)).",
        "The two most popular methods are parallel factor analysis (parafac, Harshman (1970), Carroll and Chang (1970)) and three-mode principal component analysis (3mpca, Tucker (1966)), also called higher order singular value decomposition (hosvd, De Lathauwer et al.",
        "(2000)).",
        "Three-way factorizations have been applied in various domains, such as psychometry and image recognition (Vasilescu and Terzopou-los, 2002).",
        "In information retrieval, three-way factorizations have been applied to the problem of link analysis (Kolda and Bader, 2006).",
        "One last important method dealing with multi-way data is non-negative tensor factorization (ntf, Shashua and Hazan (2005)).",
        "ntf is a generalization of non-negative matrix factorization, and can be considered an extension of the parafac model with the constraint of non-negativity (cfr.",
        "infra).",
        "One of the few papers that has investigated the application of tensor factorization for nlp is Tur-ney (2007), in which a three-mode tensor is used to compute the semantic similarity of words.",
        "The method achieves 83.75% accuracy on the toefl synonym questions."
      ]
    },
    {
      "heading": "3. Methodology",
      "text": [
        "Distributional similarity methods usually represent co-occurrence data in the form of a matrix.",
        "This form is perfectly suited to represent two-way co-occurrence data, but for co-occurrence data beyond two modes, we need a more general representation.",
        "The generalization of a matrix is called a tensor.",
        "A tensor is able to encode co-occurrence data of any n modes.",
        "Figure 1 shows a graphical comparison of a matrix and a tensor with three modes - although a tensor can easily be generalized to more than three modes.",
        "In order to create a succinct and generalized model of the extracted data, a statistical dimensionality reduction technique called non-negative tensor factorization (NTF) is applied to the data.",
        "The NTF model is similar to the PARAFAC analysis - popular in areas such as psychology and biochemistry - with the constraint that all data needs to be nonnegative (i.e. > 0).",
        "Parallel factor analysis (PARAFAC) is a multilinear analogue of the singular value decomposition (SVD) used in latent semantic analysis.",
        "The key idea is to minimize the sum of squares between the original tensor and the factorized model of the tensor.",
        "For the three mode case of a tensor T G RD1xD2xD3 this gives equation 1, where k is the number of dimensions in the factorized model and o denotes the outer product.",
        "xieWP,yieRD2,zie«D3",
        "With non-negative tensor factorization, the non-negativity constraint is enforced, yielding a model like the one in equation 2:",
        "xiE.",
        "The algorithm results in three matrices, indicating the loadings of each mode on the factorized dimensions.",
        "The model is represented graphically in figure 2, visualizing the fact that the PARAFAC decomposition consists of the summation over the outer products of n (in this case three) vectors.",
        "Computationally, the non-negative tensor factorization model is fitted by applying an alternating least-squares algorithm.",
        "In each iteration, two of the modes are fixed and the third one is fitted in a least squares sense.",
        "This process is repeated until convergence.",
        "The model can straightforwardly be applied to language data.",
        "In this part, we describe the factorization of verbs x subjects x direct objects co-occurrences, but the example can easily be substituted with other co-occurrence information.",
        "Moreover, the model need not be restricted to 3 modes; it is very well possible to go to 4 modes and beyond – as long as the computations remain feasible.",
        "The NTF decomposition for the verbs x subjects x direct objects co-occurrences into the three loadings matrices is represented graphically in figure 3.",
        "By applying the NTF model to three-way (s, v, o) co-occurrences, we want to extract a generalized selectional preference model, and eventually even induce some kind of frame semantics (in the broad sense of the word).",
        "In the resulting factorization, each verb, subject and direct object gets a loading value for each factor dimension in the corresponding loadings matrix.",
        "The original value for a particular (s, v, o) triple xsvo can then be reconstructed with equation 3.",
        "f",
        "subjects",
        "/",
        "/",
        "To reconstruct the selectional preference value for the triple (man, bite, dog), for example, we look up the subject vector for man, the verb vector for bite and the direct object vector for dog.",
        "Then, for each dimension i in the model, we multiply the ith value of the three vectors.",
        "The sum of these values is the final preference value."
      ]
    },
    {
      "heading": "4. Results",
      "text": [
        "The approach described in the previous section has been applied to Dutch, using the Twente Nieuws Corpus (Ordelman, 2002), a 500M words corpus of Dutch newspaper texts.",
        "The corpus has been parsed with the Dutch dependency parser Alpino (van Noord, 2006), and three-way co-occurrences of verbs with their respective subject and direct object relations have been extracted.",
        "As dimension sizes, the 1 K most frequent verbs were used, together with the 1 0K most frequent subjects and 10K most frequent direct objects, yielding a tensor of 1K x 10K x 10K.",
        "The resulting tensor is very sparse, with only 0.0002% of the values being non-zero.",
        "The tensor has been adapted with a straightforward extension of pointwise mutual information (Church and Hanks, 1990) for three-way cooccurrences, following equation 4.",
        "Negative values are set to zero.",
        "The resulting matrix has been factorized into k dimensions (varying between 50 and 300) withthe NTF algorithm described in section 3.2.",
        "Table 1, 2 and 3 show example dimensions that have been found by the algorithm with k = 100.",
        "Each example gives the top 10 subjects, verbs and direct objects for a particular dimension, together with the score for that particular dimension.",
        "Table 1 shows the induction of a 'police action' frame, with police authorities as subjects, police actions as verbs and patients of the police actions as direct objects.",
        "In table 2, a legislation dimension is induced, with legislative bodies as subjects, legislative actions as verbs, and mostly law (proposals) as direct objects.",
        "Note that some direct objects (e.g. 'minister') also designate persons that can be the object of a legislative act.",
        "Table 3, finally, is clearly an exhibition dimension, with verbs describing actions of display and trade that art institutions (subjects) can do with works of art (objects).",
        "These are not the only sensible dimensions that have been found by the algorithm.",
        "A quick qualitative evaluation indicates that about 44 dimensions contain similar, framelike semantics.",
        "In another 43 dimensions, the semantics are less clear-cut (single verbs account for one dimension, or different senses of a verb get mixed up).",
        "13 dimensions are not so much based on semantic characteristics, but rather on syntax (e.g. fixed expressions and pronomina).",
        "The results of the NTF model have been quantitatively evaluated in a pseudo-disambiguation task, similar to the one used by Rooth et al.",
        "(1999).",
        "It is used to evaluate the generalization capabilities of the algorithm.",
        "The task is to judge which subject (s or s') and direct object (o or o') is more likely for a particular verb v, where (s, v, o) is a combination drawn from the corpus, and s' and o' are a subject and direct object randomly drawn from the corpus.",
        "A triple is considered correct if the algorithm prefers both s and o over their counterparts s' and o' (so the (s, v, o) triple - that appears in the test corpus - is preferred over the triples (s', v, o'), (s', v, o) and (s, v, o')).",
        "Table 4 shows three examples from the pseudo-disambiguation task.",
        "subjects",
        "/",
        "/",
        "disambiguation evaluation task's test set",
        "Four different models have been evaluated.",
        "The first two models are tensor factorization models.",
        "The first model is the ntf model, as described in section 3.2.",
        "The second model is the original PARAFAC model, without the non-negativity constraints.",
        "The other two models are matrix factorization models.",
        "The third model is the non-negative matrix factorization (NMF) model, and the fourth model is the singular value decomposition (SVD).",
        "For these models, a matrix has been constructed that contains the pairwise co-occurrence frequencies of verbs by subjects as well as direct objects.",
        "This gives a matrix of 1 K verbs by 10K subjects + 10k direct objects (1k x 20k).",
        "The matrix has been adapted with pointwise mutual information.",
        "The models have been evaluated with 10-fold cross-validation.",
        "The corpus contains 298,540 different (s, v, o) co-occurrences.",
        "Those have been randomly divided into 10 equal parts.",
        "So in each fold, 268,686 co-occurrences have been used for training, and 29,854 have been used for testing.",
        "The accuracy results of the evaluation are given in table 5.",
        "The results clearly indicate that the NTF model outperforms all the other models.",
        "The model achieves the best result with 300 dimensions, but the differences between the different NTF models are not very large - all attaining scores around 90%.",
        "subjects",
        "sus",
        "verbs",
        "vs",
        "objects",
        "objs",
        "politie police'",
        ".99",
        "houd-aan ' arrest'",
        ".64",
        "verdachte ' suspect'",
        ".16",
        "agent policeman'",
        ".07",
        "arresteer arrest'",
        ".63",
        "man ' man'",
        ".16",
        "autoriteit authority'",
        ".05",
        "pakjop ' run in'",
        ".41",
        "betoger' demonstrator'",
        ".14",
        "Justitie 'Justice'",
        ".05",
        "schietAood' shoot'",
        ".08",
        "relschopper' rioter'",
        ".13",
        "recherche detective force'",
        ".04",
        "verdenk suspect'",
        ".07",
        "raddraaiers ' instigator'",
        ".13",
        "marechaussee military police'",
        ".04",
        "tref-oan ' find'",
        ".06",
        "overvaller' raider'",
        ".13",
        "justitie justice'",
        ".04",
        "achterhaal overtake'",
        ".05",
        "Roemeen ' Romanian'",
        ".13",
        "arrestatieteam special squad'",
        ".03",
        "verwijder remove'",
        ".05",
        "actievoerder campaigner'",
        ".13",
        "leger army'",
        ".03",
        "zoek search'",
        ".04",
        "hooligan hooligan'",
        ".13",
        "douane customs'",
        ".02",
        "spoor jop ' track'",
        ".03",
        "Algerijn 'Algerian'",
        ".13",
        "subjects",
        "sus",
        "verbs",
        "vs",
        "objects",
        "objs",
        "meerderheid' majority'",
        ".33",
        "steun support'",
        ".83",
        "motie ' motion'",
        ".63",
        ".28",
        "dienJn ' submit'",
        ".44",
        "voorstel ' proposal'",
        ".53",
        ".25",
        "neemjaan ' pass'",
        ".23",
        "plan plan'",
        ".28",
        "Kamermeerderheid' Chamber majority'",
        ".25",
        "wijsjaf' reject'",
        ".17",
        "wetsvoorstel ' bill'",
        ".19",
        "fractie ' party'",
        ".24",
        "verwerp reject'",
        ".14",
        "hem ' him'",
        ".18",
        "PvdA",
        ".23",
        "vind think'",
        ".08",
        "kabinet ' cabinet'",
        ".16",
        "CDA",
        ".23",
        "aanvaard accepts'",
        ".05",
        "minister minister'",
        ".16",
        "Tweede Kamer ' Second Chamber'",
        ".21",
        "behandel' treat'",
        ".05",
        "beleid ' policy'",
        ".13",
        "partij party'",
        ".20",
        "doe do'",
        ".04",
        "kandidatuur ' candidature'",
        ".11",
        "Kamer' Chamber'",
        ".20",
        "keur_goed' pass'",
        ".03",
        "amendement amendment'",
        ".09",
        "s",
        "v",
        "o",
        "s'",
        "o'",
        "jongere",
        "drink",
        "bier",
        "coalitie",
        "aandeel",
        "youngster'",
        "drink'",
        "beer'",
        "coalition'",
        "share'",
        "werkgever",
        "riskeer",
        "boete",
        "doel",
        "kopzorg",
        "employer'",
        "risk'",
        "' fine'",
        "goal'",
        "worry'",
        "directeur",
        "zwaai",
        "scepter",
        "informateur",
        "vodka",
        "manager'",
        "sway'",
        "sceptre'",
        "informer'",
        "wodka'",
        "Table 4:",
        "Three",
        "examples",
        "from the",
        "pseudo-",
        "dimensions",
        "Table 5: Results of the 10-fold cross-validation for the ntf, parafac, nmf and svd model for 50, 100 and 300 dimensions (averages and standard deviation)",
        "The parafac results indicate the fitness of tensor factorization for the induction of three-way selectional preferences.",
        "Even without the constraint of non-negativity, the model outperforms the matrix factorization models, reaching a score of about 85%.",
        "The model deteriorates when more dimensions are used.",
        "Both matrix factorization models perform worse than their tensor factorization counterparts.",
        "The nmf still scores reasonably well, indicating the positive effect of the non-negativity constraint.",
        "The simple svd model performs worst, reaching a score of about 70% with 50 dimensions."
      ]
    },
    {
      "heading": "5. Conclusion and Future Work",
      "text": [
        "This paper has presented a novel method that is able to investigate three-way co-occurrences.",
        "Other distributional methods deal almost exclusively with pairwise co-occurrences.",
        "The ability to keep track of multi-way co-occurrences opens up new possibilities and brings about interesting results.",
        "The method uses a factorization model -non-negative tensor factorization - that is suitable for three way data.",
        "The model is able to generalize among the data and overcome data sparseness.",
        "The method has been applied to the problem of selectional preference induction.",
        "The results indicate that the algorithm is able to induce selectional preferences, leading to a broad kind of frame semantics.",
        "The quantitative evaluation shows that use of three-way data is clearly beneficial for the induction of three-way selectional preferences.",
        "The tensor models outperform the simple matrix models in the pseudo-disambiguation task.",
        "The results also indicate the positive effect of the non-negativity constraint: both models with non-negative constraints outperform their non-constrained counterparts.",
        "The results as well as the evaluation indicate that the method presented here is a promising tool for the investigation of nlp topics, although more research and thorough evaluation are desirable.",
        "There is quite some room for future work.",
        "First of all, we want to further investigate the usefulness of the method for selectional preference induction.",
        "This includes a deeper quantitative evaluation and a comparison to other methods for selectional preference induction.",
        "We also want to include other dependency relations in our model, apart from subjects and direct objects.",
        "Secondly, there is room for improvement and further research with regard to the tensor factorization model.",
        "The model presented here minimizes the sum of squared distance.",
        "This is, however, not the only objective function possible.",
        "Another possibility is the minimization of the Kullback-Leibler divergence.",
        "Minimizing the sum of squared distance assumes normally distributed data, and language phenomena are rarely normally distributed.",
        "Other objective functions - such as the minimization of the Kullback-Leibler divergence - might be able to capture the language structures much more adequately.",
        "We specifically want to stress this second line of future research as one of the most promising and exciting ones.",
        "subjects",
        "sus",
        "verbs",
        "vs",
        "objects",
        "objs",
        "tentoonstelling 'exhibition'",
        ".50",
        "toon 'display'",
        ".72",
        "schilderij 'painting'",
        ".47",
        "expositie 'exposition'",
        ".49",
        "omvat 'cover'",
        ".63",
        "werk 'work'",
        ".46",
        "galerie 'gallery'",
        ".36",
        "bevat 'contain'",
        ".18",
        "tekening 'drawing'",
        ".36",
        "collectie 'collection'",
        ".29",
        "presenteer 'present'",
        ".17",
        "foto 'picture'",
        ".33",
        "museum 'museum'",
        ".27",
        "laat 'let'",
        ".07",
        "sculptuur 'sculpture'",
        ".25",
        "oeuvre 'oeuvre'",
        ".22",
        "koop 'buy'",
        ".07",
        "aquarel 'aquarelle'",
        ".20",
        "Kunsthal",
        ".19",
        "bezit 'own'",
        ".06",
        "object 'object'",
        ".19",
        "kunstenaar 'artist'",
        ".15",
        "zie 'see'",
        ".05",
        "beeld 'statue'",
        ".12",
        "dat 'that'",
        ".12",
        "koop Man 'acquire'",
        ".05",
        "overzicht 'overview'",
        ".12",
        "hij 'he'",
        ".10",
        "in huis heb 'own'",
        ".04",
        "portret 'portrait'",
        ".11",
        "Finally, the model presented here is not only suitable for selectional preference induction.",
        "There are many problems in nlp that involve three-way co-occurrences.",
        "In future work, we want to apply the ntf model presented here to other problems in nlp, the most important one being word sense discrimination."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "Brett Bader kindly provided his implementation of non-negative tensor factorization for sparse matrices, from which this research has substantially benefited.",
        "The three anonymous reviewers provided fruitful comments and remarks, which considerably improved the quality of this paper."
      ]
    }
  ]
}
