{
  "info": {
    "authors": [
      "Marsden S. Blois",
      "David D. Sherertz",
      "Mark S. Tuttle"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P80-1040",
    "title": "Word and Object in Disease Descriptions",
    "url": "https://aclweb.org/anthology/P80-1040",
    "year": 1980
  },
  "references": [],
  "sections": [
    {
      "text": [
        "M.S.",
        "Blois, D.D.",
        "Sherertz, M.S.",
        "Tuttle Section on Medical Information Science University of Califc.rnia, San Francisco Experiments were conducted on a book, Current Medical Information and Terminology, (AMA, Chicago, 1971, edited by Burgess Gordon, M.D.",
        "), which is a compendium of 3262 diseases, each of which is defined by a collection of attributes.",
        "The original purpose of the book was to introduce a standard nomenclature of disease names, and the attributes are organized in conventional medical form: a definition consists of a brief description of the relevant symptoms, signs, laboratory findings, and the like.",
        "Each disease is, in addition, assigned to one (or at most two) of eleven disease categories which enumerate physiological systems (skin, respiratory, cardiovascular, etc.).",
        "While the editorial style of the book is highly telegraphic, with many attributes being expressed as single words, it is nevertheless easily readable (see Figure 1).",
        "The vocabulary employed consists of about 19,000 distinct \"words\" (determined by a lexical definition), roughly divided equally between common English words and medical terms.",
        "We measured word frequency by \"disease occur-rence\", (the number of disease definitions in which a given word occurs one or more times).",
        "By this measure, only seven words occurred in more than half the disease definitions, and about 40% of the vocabulary occurred in only a single disease definition.",
        "(Table 1 lists the words at the top of the frequency list together with the number of occurrences.)",
        "Assisted by the facilities of the 17MUNIX operating system, we created a series of inverted files (from a magnetic tape of the CMIT text), and developed a set of interactive programs to form a word-and-context query system.",
        "This system has enabled us to study the problem of inferring term reference in this large sample of text (some 333,000 word occurrences), within the context of diseases.",
        "An interesting early result was the ease with which many medical terms could be algorithmically separated from common English words.",
        "After adjusting for the fact that some disease categories are larger than others, we defined an entropy-like measure of the distribution of word occurrences over the eleven physiological categories as a measure of category specificity.",
        "We reasoned that some medical terms such as 'murmur', while not specific to any particular heart disease, are specific to heart disease generally.",
        "This term would not, for example, be used in describing endocrine disorders.",
        "Such a word would be expected to occur in category 04 (Cardiovascular disease) frequently, and not in the other categories.",
        "Such a term would, by our measure, have a low 'entropy'.",
        "A common English word like 'of', would be used in the descriptions of all kinds of disease, and would accordingly have a high 'entropy'.",
        "Tables 2 and 3 show the top and bottom of the list of all words occurring in two or more diseases sorted by this entropy measure.",
        "In these lists, as our hypothesis seems to imply, low 'entropy' corresponds to high 'specificity', and high 'entropy' to low 'specificity'.",
        "This separation of medical terms from common English words, by algorithmic means, is facilitated by the context supplied by the notion of 'disease category', and the fact that this was represented in the CMIT text.",
        "This work was supported in part by grants from The Commonwealth Fund, and from the National Library of Medicine (1 K10 LM00014).",
        "TMuNIX is a trademark of Bell Laboratories.",
        "Our second experiment investigated the co-occurrence properties of some medical terms.",
        "Aware that many medical diagnostic programs have assumed attribute independence, we sought to shed light on the appropriateness of the assumption by evaluating it in terms of word co-occurrence in disease definitions.",
        "Since the previously described procedure had given us a means of selecting medical terms from common English words, it was possible to produce lists of 'pure' medical terms.",
        "We then wrote a program which formed all pairs of such terms (ignoring order).",
        "We defined an 'association measure' (A) which measured the difference between the observed co-occurrences of term-pairs (they could co-occur in any location in the definition and in either order), and the co-occurrences expected from chance alone.",
        "Tables 4 and 5 show the top and bottom of a list of all pairs formed from the low entropy terms in the previous experiment.",
        "The first 1120 terms were chosen, that is, those having an entropy of 2.0 napiers ct less.",
        "The pair list was then sorted by this association measure, A.",
        "Word pairs which are found to be highly associated, appear to do so for two reasons.",
        "The test, which is trivial, is that some word pairs are semantically one word despite their being lexically, two.",
        "Common examples would be 'white House' and 'Hong Kong'; medical examples are 'vital capacity', 'axis deviation', and 'slit lamp'.",
        "These could have been avoided algorithmically by not taking adjacent words in forming the term-pairs, without any significant overall effect.",
        "The second reasons for high frequency word co-occurrence is that both words are causally related through underlying physiological mechanisms.",
        "It is these which had the greatest interest for us, and the measure A. may be viewed as a measure of the non-independence of the symptoms or signs themselves.",
        "The term pairs which are negatively associated, have this property for the same reason.",
        "If the two terms are used typically in the descriptions of different diseases, they are less likely to co-occur than by chance.",
        "(In a baseball story on the sports page, we would not find 'Pass', 'punt', or 'tackle').",
        "These negatively associated pairs may have value in diagnostic programs for the recognition of two or more diseases in a given patient, a problem not satisfactorily dealt with by even the most sophisticated of current programs.",
        "Finally, an extension of the entropy concept permits one to generate (algorithmically) the vocabularies used by the medical specialties (which correspond to the disease categories represented in CMIT.",
        "This is done by assigning terms which occur predominantly in one category to a single vocabulary and then sorting by entropy.",
        "Tables 6 and 7 show the vocabularies used in dermatology and gas-troenterology (as derived from CmIT).",
        "These vocabularies, it will be noted, can be used as 'hit lists' for the purpose of recognizing the content of medical texts.",
        "In summary, we see the ability to differentiate medical terms from common words by context, and the ability to relate the medical words by meaning, as two of the first steps toward text processing algorithms that preserve and can manipulate the semantic content of words in medical texts."
      ]
    },
    {
      "heading": "SG SEASONAL, MARCH TO JULY, IN WESTERN UNITED STATES; INCUBATION PERIOD 4-6 DAYS; ONSET ABRUPT; POSSIBLY SLIGHT ERYTHEMA; SUSTAINED FEVER, 102-104 F OR HIGHER, SIGNIFICANT: PULSE RATE INCREASED. COURSE: IN PREVENTION, REMOVAL OF TICK FROM SKIN; APPLICATIONS TO SKIN OF TURPENTINE, IODINE, ACETONE; REMOVAL OF TICK BY INSERTION OF NEEDLE BETWEEN MOUTH PARTS; ASPIRIN FOR PAIN; ANTIBIOTIC TREATMENT INEFFECTIVE. CM ENCEPHALITIS, MENINGITIS ESPECIALLY IN CHILDREN. LB WBC DECREASED; MONOCYTOSIS; COMPLEMENT-FIXATION TEST POSITIVE: INJECT - TION OF SERUM OR CSF KILLING SUCKLING MICE; NEUTRALIZATION OF VIRUS WITH DOME SERUM RESULTING IN SURVIVAL.",
      "text": [
        "in CMIT, in order of increasing 'entropy' The entropy is given in the first column: the entries in the next 11 columns are the percent of occurrences in the 11 disease categories (body as a whole, skin, musculo-skeletal, respiratory, cardiovascular, hemic and lymphatic, GI, GU, endocrine, nervous, organs of special sense).",
        "mically which constitutes a dermatological vocabulary.",
        "The disease category 'skin' is represented by the third column.",
        "Table 7.",
        "A word list generated algorithmically which constitutes a vocabulary of gastroenterology.",
        "The eighth column represents the disease category 'digestive system'."
      ]
    }
  ]
}
