{
  "info": {
    "authors": [
      "Naoyuki Nomura",
      "Douglas A. Jones",
      "Robert C. Berwick"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1038",
    "title": "An Architecture for a Universal Lexicon a Case Study on Shared Syntactic Information in Japanese, Hindi, Bengali, Greek, And English",
    "url": "https://aclweb.org/anthology/C94-1038",
    "year": 1994
  },
  "references": [
    "acl-J91-4003"
  ],
  "sections": [
    {
      "heading": "Introduction. Hindi",
      "text": [
        "Given the prominence of the lexicon in most current (3) a. shyam lathi-ko kagaz-se lape-ta inguistic theories (LPG, HPSG, GB), the inventory of Shyani stick-ACC paper-with wrap.PRE anguage particular information left in the lexicon 'Shyain wrapped the stick with paper.' :leserves special attention.",
        "Constructing large ..omputerized lexicons remains a difficult problem, b. shyam lathi-par kagaz lape-ta luilding a large array of apparently arbitrary information.",
        "Shyam stick-on paper rap.PRF l'his papers shows that this arbitrariness can be 'Sliyam wrapped paper around the stick' onstrained more than might have been previously hought.",
        "In particular, arbitrariness of argument structure, Bengali .vord sense, and paraphrasability will be shown not only (4) o be constrained, but also to be integrally related.",
        "Our 'radical) view is that variation of lexical behavior across anguages is exactly like lexical variation within anguages, specifically, the difference lies in the presence )• absence of certain morphemes.",
        "For example, the fact hat Japanese has richer possibilities in certain verbal )atterns is derived solely from its morphological Greek nventory.' Put another way, language parameters (5) a. o yuxyvilc OpTo)(TE acxvo (550 flayovt imply are the presence or absence of lexical material in 0 janis fortwse sano sto bagoni he morphological component.",
        "Observed language Janis DET load.PST hay on.the wagon iariation patterns reflect morphological systematicity.",
        "'Janis loaded the hay on the wagon' Hie generative machinery for producing argument b. o zo (layout ge now° ;tructure positions is fixed across languages.",
        "0 janis fortwse to bagoni me sano Janis DET load.PST the wagon with hay 'Janis loaded the wagon with hay' All of these languages have exactly the same alternation type.",
        "Why?",
        "Let us focus on the role of figure and ,i;roud3 in these examples.",
        "'By \"alternation\", we mean that in each language the figure, as expressed as a direct object in the (a) cases, alternates with the figure as expressed in an equivalent PP in the (b) eases.",
        "Despite the differences in word order and case marking, all share the property that the direct object is subject to a so-called Holistic Effect:'' Crucially, the (a) sentences differ from the (b) sentences in exactly the same way in each of these languages.",
        "In (lb), where John loads the wagon with hay, the wagon is understood to have a whole load of hay, likewise if John smears the wall with paint, the",
        "A striking example underscoring universality of trgument structure is the familiar Spray/Load tIternation2, shown in example (1).",
        "Despite the many urface differences in these data across languages, they .hare several essential properties.",
        "wall is understood to have more paint than if John merely smears paint on the wall.",
        "Thus we may assume throughout that the word sense of the verbs as used in the (a) and (b) cases are essentially identical.' The goal of the remainder of this paper is to analyze and implement this insight in a particular representation given by both linguistic and computational theory, and apply it to MT."
      ]
    },
    {
      "heading": "Basic Building Blocks: The Syntax of Word Formation",
      "text": [
        "We propose to replace idiosyncratic language particular information with a new generative component that links universal abstract lexical structures with the surface forms of words for each language.",
        "This generative machinery is based on work by Hale and Keyser (1993) and Pustejovsky (1991a).",
        "The basic architecture is shown in Figure 1.",
        "Crucially, only a restricted number of argument structures can be generated.",
        "The basic idea is that lexical X-bar structures are composed from the lexical categories N, A, V, and P (see fig. 2), into trees whose Spec(ifier) and Comp(lement) positions after movement yield the range of possible argument structures.",
        "The lexical entries are subject to a series of filters, as follows."
      ]
    },
    {
      "heading": "Basic Building Blocks Rules of Composition",
      "text": [
        "Lexical Categories • X-bar Projection"
      ]
    },
    {
      "heading": "Filters (in Hale and Keyser (1993))",
      "text": [
        "HMC: Head Movement Constraint (Baker, 1988) ECP: Empty Category Principle (Chomsky, 1981) FI: Full Interpretation (Chomsky, 1986) UP: Unambiguous Projection (Kayne, 1984) PL: Predication Locality (Williams, 1980)",
        "To give a concrete example of the system, we derive the thematic properties of the denominal verb shelve from compositional machinery operative in the lexicon by composing the noun form shelf with an empty preposition and an empty verb to yield the form shelve.",
        "The structures are as shown in Fig. 2.",
        "In short, argument structure is produced by syntax operative in the lexicon",
        "that derives words from a small set of primitives.' These structures are assumed to be identical across languages.",
        "Fig.",
        "3 shows the detailed schema for producing lexical entries for verbs.",
        "We only note briefly here a few important properties of the system in Fig. 3.",
        "First of all, the main verb V is formed by Head Movement of X, and Y if it exists, to V. The categorial value of X and Y arc selected from the set N,A,V,P).",
        "For example, the denominal verb shelve is built as shown above in One can view the work by Dorr (1993) and, previously, other attempts at lexical decomposition ranging back through Schank essentially the same in spirit, but without the detailed constraint provided by Figure 2.",
        "We regard similar proposals regarding \"promotion\" and \"demotion\" of arguments as essentially a reflectior of Move-alpha.",
        "The novelty of our proposal is that it is not ad hoc that is, the same constraints independently justified in syntax also appear in lexical construction.",
        "The need for a non-arbitrary, i.e., at explanatory, account of lexical argument structure should br apparent.",
        "If lexical entries varied arbitrarily, we would logically expect at least the following space of lexical possibilities, requirim upwards of a quarter-million diacritics.",
        "Let m be the number o semantic/thematic roles, such as Agent, Patient, Theme, Range Duration, and so on, and let n he the number of grammatical functions Then, when n=4 and n1=50 (a typical number for traditional NL1 systems) we have 251,176 different/yes of lexical entries (Ei=0 n nil/i4m–i)!",
        ").",
        "While some theories might propose this man: distinctions, it seems clear that this imposes a very considerabl learning and engineering burden.",
        "Many researchers, includin, Makino (1991) and others, have noticed the drawbacks of encodin thematic roles, but in the absence of a clear alternative, still requir them for representing lexical information.",
        "Furthermore, it is comma knowledge that verbs pattern into certain equivalence classes withi languages (e.g., Levin, 1993), but arbitrary verb classes wool imply arbitrary variation across languages.",
        "Figure 2, by selecting P as X and N as Y.",
        "The deadjectival verb redden is built by selecting A as X and selecting nothing as Y.",
        "The ditransitive verb give selects V for Both X and Y, following Larson (1988).",
        "NP1, if it exists, is the agent of the action, and NP2, if it exists, is he affected object of the verb, following Hale and Keyser ;1993).",
        "From the point of view of lexical representation and V1T, the key constraint is that the entry for shelve has .lements that correspond directly to the verb put and the )reposition on in its representation.",
        "These elements then lecome available for interpretation and for translation.",
        "We show below that this is also part of the difference Aetween English, Japanese, Hindi, and Greek verbs.",
        "Analysis and Applications for the Universal Lexicon Computational Motivation.",
        "There have been some controversies about the merits And demerits of transfer-based MT and interlingua-based VIT.",
        "Typical transfer-based MTs prepare completely Afferent sets of word senses for component languages So that mapping among the word senses is completely Arbitrary, i.e., the complexity may he calculated as Aipartite graph matching.",
        "We will assume an interlingua-Aased MT, which supposedly makes all the component anguages share common word senses or so-called concepts and thus is constrained regarding word senses.",
        "Itowever, interlingua-based MT still has substantial Aroblems in making up word senses.",
        "The number of Nord senses, their well-definedness, and the problem About linking surface words depend on excellent .exicographers.",
        "To give just one example here, the Bilingual dictionary Sanseedoo (1990) lists all the Following English translations for a Japanese verb kazaru 'decorate)",
        "an inflated style; mince; not being plain or flat 21ustering these into well-defined word senses is not an asy task; thus, it is hard to answer the word sense luestion.",
        "Suppose we have a symbol to represent the :ore meaning of kazaru, which is shared by the English counterpart decorate.",
        "Since kazaru has the syntactic nature of a Spray/Load type alternation, the lexicon of a typical interlingua-based MT essentially provides the information described below.",
        "AGENT, THEME, GOAL and MATERIAL are thematic roles that are the key elements in the interlingua.",
        "NOM, ACC, and DAT/ON/OVER arc case-marking functions mapped to the surface case markers zA-`, -\"E\" and 1r_ `.",
        "Assuming a self-contained thematic role system and case-marking system, these markings are to be evaluated on the corresponding example sentences and be decided independent of each other.",
        "However, the two argument structures in the above diagram are actually incompatible with each other because the same thematic role THEME is assigned to different referents: ground, the patient to be decorated, and figure, the decoration to be attached to the patient.",
        "In effect, the MT system makes serious errors due to its confusion of thematic roles derived from the lexicon.",
        "Example Input: Jalibqk41-11(ii-Dk.. Taro-ga hana-o kazatta.",
        "(6) Taro-NOM flower-ACC decorate-PRF Output: Taro decorated the flower.",
        "In most contexts, the default reading of the input sentence above should be interpreted as 'Taro decorated something with flowers.' This error was caused by the semantic clash in the lexicon.",
        "In order to avoid such errors, lexicographers could overwrite some thematic roles disregarding semantic criteria, but thus would spoil the interlingua) foundation.",
        "The remaining possible solution for this problem is to artificial divided the word sense (WS) into two symbols: WS with and WSon, two completely artifical word senses.",
        "Those two artificial word senses arc essentially very similar to each other, if not identical, and will pose difficulties for lexicographers because they will have to put arbitrary links among word senses for similar words in two languages or within the same language.",
        "The two word senses put the two different argument structures in complete isolation once the analysis is completed and the interlingua is fixed; the only thing the generation module of MT can do is accept the given word sense (WSwith or Mon)and generate only one argument structure.",
        "This rigidity has a potential to generate sentences that",
        "are unacceptably unnatural.",
        "The result for MT and lexicon construction is that the computational machinery will stay fixed across languages and thus uniformly constrain the complexity of argument structures eliminating most of the related arbitrariness.",
        "It is well known that word-for-word translations are not the paradigmatic case.",
        "The architecture we propose entails a significant improvement in isomorphic mappings between languages.",
        "However, the isomorphism is not at the level of words, but rather, at the level of morphological elements that enter into the lexical syntactic formation of words.",
        "Thus it is no accident that 'put the book on the shelf' is a near paraphrase of 'shelve the book', and it is no accident that 'put the book on the shelf' is a closer isomorphic map for the Japanese translations of `John shelved the book' shown in (1).",
        "The entailment is that 'shelve the book' has the same morphological material as 'put the book on the shelf', but the former has an empty preposition and an empty verb that incorporates a noun.",
        "In particular, we show how to replace thematic roles with the lexical syntax proposed in Hale and Keyser (1993) and augmented by work in Pustejovsky (1991a).7 This technique yields several potential benefits: (i) robustness of the lexicon, (ii) greater flexibility in selecting more natural renditions of target language structures in translation, as in (7) below.",
        "Let us consider each of these in turn with specific examples.",
        "(7) a.John-wa hon-o Lana-no ue-ni oi-ta.",
        "John-TOP book-ACC shelf-GEN upper place-AT put-PRE John put the book on the shelf.",
        "b.John-wa hon-o tana-ni simatta.",
        "(more accurate) John-TOP book-ACC shelf-DAT put.away-PRF John put away / stored the book on the shelf.",
        "If paraphrasability and translation must conform to the lexical syntactic structures in Figures 2 through 4, we have a natural method for producing a constrained space of possible translations, namely, the only structures that are allowed are those produced by the mechanism outlined in Fig. 4.",
        "To highlight the relationship between paraphrasability and translatability, consider the alternation behavior of several verbs within English, shown in (2).",
        "Notice in particular that different verbs participate in one or both halves of the alternations, or in neither half.",
        "As we will see, the same facts hold across distinct languages.",
        "Nonalternation: Not all verbs that participate in one half of the Spray/Load alternation participate in the other half, as",
        "(8) and (9) and (10) from English, Japanese, and Hindi illustrate.",
        "Interestingly, in these cases verbs across",
        "'Along with Emonds (1992), we propose shifting a significant portion of the machinery out of the semantics and into syntax, in the form of syntactically enriched lexical entries.",
        "languages also pattern alike in terms of nonalternation'.",
        "This gives additional support for our representation proposal.",
        "The nonalternations arc critical clues to discoverin 'See Levin (1993) for an extensive survey of such phenomena.",
        "he correct lexical representation for the verbs and hence he structures that translate a more direct mapping across anguages.",
        "We propose that the key to the solution is hat in the non-alternating cases, prepositions arc acorporated into the verb in lexical syntax just as shelve n Fig. 3.",
        "For example, the lexical entries for pour, and •over contain prepositions as shown in (10).",
        "We assume hat the lexical representation for the prepositions encodes pecifications for figure and ground, represented as F .nd G in (10).",
        "In essence, what X on Y means is that X s a figure on the ground Y.",
        "In fact, this is the essence if what prepositions \"mean\", at an abstract level.",
        "Thus he prepositions are the primitives in our system, and oncepts such as figure and ground are derivative.",
        "This :ntailment is illustrated by the linking lines in Fig. 5.",
        "Fig.",
        "5 An Explanatit n For The Spray-Load Alternation The lexical entry for load does not contain a preposition nd hence is free to alternate.",
        "Thus the reason why a erb does not participate in part of an alternation is that incorporates lexical material which clashes with otential complements.",
        "The reason that 'cover the blanket n the baby' is bad is that cover already encodes the igure and ground relationship by incorporating with into :s representatoin – that is, the preposition with is frozen Ito the verb's representation.",
        "Adding an overt PP with n creates a clash in figure and ground relations.",
        "Adding compatible PP to a verbal structure with an incorporated ' introduces redundancy, but is the structure is still well-armed.",
        "Types A, F, and K verbs behave identically in a language pair.",
        "For example, the introductory sentences (1)-(5) illustrated Type A correspondences, where L,=English and 1-2c.",
        "{Japanese,Hindi,Bengali,Greek } We have found (B,C,G,E,I,14) – the unshaded cells in the Figure 5 – to be the richest source of cross-linguistic information, namely, the verbs that do not correspond directly are the most informative regarding the nature of word formation, given the model that we have adopted.",
        "Not accidentally, they are precisely the ones that are not only of particular interest for our framework, they are potentially very difficult for machine translation, simply because, for some of them, there is no way to take advantage of the surface similarity of argument structures.",
        "Recall that we assume that the word sense for these verbs is fixed across languages.",
        "Consider, then, the Type C alternation correspondence below, where 1-,,English and Le {.Iapanese,llindi,Bengali}: 'Clearly, type P verbs should constitute most of the verbal vocabulary, since most verbs do not participate in the Spray/Load Alternation, or in any given alternation, for that 'natter.",
        "Types (D,11,1„M,N,O) do not correspond at all actually, we expect that these verbs do not exist, given the considerations regarding likely candidates across languages."
      ]
    },
    {
      "heading": "Liternation Mismatches Across Languages.",
      "text": [
        "So far, then, we have seen only that verbs across ifferent languages pattern alike.",
        "Surely there must be 'ifferences or else MT efforts would have succeeded )ng ago .",
        "Fig.",
        "6 displays all the logically possible :‘,1ationship between verbs across two languages.",
        "representation, though it is not visible at the surface level.",
        "Let us consider another case for MT: Japanese to English:",
        "kono heya-wa kabe-ni hana-o kazar-oo this room-TOP wall-DAT flower-ACC decorate-LET'S (coarsely) translated into: \"As for this room, let's decorate the wall with flowers,' but with UL techniques might be more fluently translates as, \"Let's decorate this room by putting flowers on th( wall.\" Even more broadly, we would like to suggest promising direction for the development of our system Consider the well-known difficulty of translating Japanese -wa phrases into English.",
        "Given the uhiquit) of -wa phrases as compared with the relative rarity o English as for phrases, we can conclude that renderint -wa as as-for is not the best translation.",
        "Let us now consider cases in Japanese and Hindi ii which the preposition type element is visible, and whicl overtly affects the alternation type."
      ]
    },
    {
      "heading": "Alternation Type Change:",
      "text": [
        "There are additional crosslinguistic differences, whicl may be observed in the surface form of the verbal structure In Japanese, one can add the verbal morpheme kake oou .",
        "This change, from alternation type F to type H, shown below.",
        "raam ghar-me phul sajaya (a) i-)Ica Ram room-WITH flowers decorate taroo-wa akanboo-o moolu-de oot-ta 'Ram decorated the room with flowers' As in the case of cover discussed above, the explanation is quite simple within our framework.",
        "For the English verb decorate, there is an incorporated preposition, namely with, in its lexical representation.",
        "There is a type clash because the direct object cannot be both figure and ground, in the case of \"*John decorated posters on the wall\"; see Fig. 7.",
        "Taroo-TOP baby-ACC blanket-WITH cover-PRF 'Taro covered the baby with the blanket.'"
      ]
    },
    {
      "heading": "(b)*VIT: ;Jiv, :VAL",
      "text": [
        "taroo-wa moofu-o akanboo-ni oot-ta Taro-TOP blanket-ACC baby-DAT cover-PRF Taro covered the blanket over the baby.' (a)' A:1.$G:0171.1-Ef:;111-erql/ \\'/P Vjito taroo-wa akanhoo-o moo fu de 00 i - ka ke-ta Taro-TOP blanket-ACC baby-DAT cover-OVER-PRF Tam covered the blanket over the baby.' (b)'c.1\"tlildf;34; tlroo-wa moof akanboo-ni ooi-kake-ta the wall Tam-TOP blanket-ACC baby-DAT cover-OVER-PRI 'Taro covered the blanket over the baby.' John decorate(f,()-Fwith(p,r) posters on(F,G) Fig. 7.",
        "Type clash with \"decorate posters on the In Japanese, kake adds an aspect of 'trajectory' ti wall\".",
        "the verb sense.",
        "More precisely, as the gloss 'over To address one of our main points, cases like the one suggests, kake rescues oou from its type clash just a in Fig. 7 pose special problems for machine translation the preposition with does in English.",
        "However, 'cover because the translation of the word sense of English cannot be so rescued in English simply because there i decorate into its Japanese counterpart kazeru does not no morphological life raft.",
        "Note further that the exampl have a similar type clash.",
        "Thus the problem is that the in (a) just above also behaves as expected with respec English verb has a preposition frozen ,into its lexical to the Holistic effect.",
        "In (a) ahmboo-o 'baby' is th",
        "direct object, and the baby is understood to be wholly covered.",
        "Sentence b' has no such effect regarding the baby.1° In Hindi, one can replace dhaknaa ('cover') with dakh-denaa ('give cover').",
        "This morphological change turns a type F alternation contrast into a type B, as described in Fig. 6.",
        "Put briefly, our view is that variation of lexical behavior across languages is exactly like lexical variationwithin languages, specifically, the difference lies in the presence or absence of certain morphemes.",
        "Ontologically speaking, then, what language parameters are is the presence or absence of lexical material in the morphological component.",
        "The observed patterns in language variation is then reflected in morphological systematicity.",
        "For example, the fact that Japanese has richer possibilities in certain verbal patterns is derived from its morphological inventory.",
        "In specific, the reason that it is impossible for English verbs to behave like certain corresponding Japanese verbs is that English lacks an equivalent of the Japanese aspectual morphemes tsukusu 'exhaust', kakeru 'trajectory verb', etc.\" But recall, we find that load, for example does behave precisely like its corresponding verbs in Japanese, Hindi, Bengali, and Greek.",
        "In cases where verbs do not appear to behave alike, apparent differences arc resolved by a process of language particular morphological behavior: for example, the verbal suffixes (and prefixes) of Japanese such as --tsukusu 'exhaust' alter verb argument structure enough to bring them into correspondence with their former English non-counterparts."
      ]
    },
    {
      "heading": "Conclusion",
      "text": [
        "We believe that our approach is applicable universally.",
        "Future work to be done is to complete our survey of the approximately 150 types of verbal alternations of Levin \"'It might be understood pragmatically to entail that perhaps the parents were worried about covering the baby too much, and wanted to allow the baby to breathe easily by allowing its head, for example, to remain uncovered.",
        "In brief, here it is the compositional behavior of morphemes that yields different alternation paradigms.",
        "(1993), and augment our analysis with further ideas from Hale and Keyser (1993), Pustejovsky (1990, 1991 h), and others, and to extend the coverage to Japanese and other languages.",
        "Our highly constrained system should also provide highly desirable circumscription of computational lexicons.",
        "Given the universal aspects of our lexical representations, we also expect manageable applications to machine translation, along the lines that we have suggested."
      ]
    }
  ]
}
